{"id": "t5_2tand_t3_88a01v", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "*Caring is our greatest trait, but modern life exploits it with news, gossip, problems, and clever product placement. This article teaches you how to care more about less, by reviewing and evaluating the important parts of your life where you want to spend your Care tokens.*\n\nHumans are caring animals. Most of you will stop and take care of a person who has fallen, or a bird that is trapped, or a puppy that is lost. Care has turned humans from groups of animals into societies. It has given us the power to unite (and separate), to achieve great things (and suffer huge failures). The modern life exploits this trait of ours, to force us into brand-loyalty, consumerism. This also causes more stress in our lives and generally makes us unhappy.\n\nThe answer, however, is not only to care less, it is to care more … about less. Review the things in your life you care about and rank and evaluate them. Imagine that you only have 6 care tokens a day. Do you want to spend them on Prince X and Princess M’s wedding news? On the turmoil in Country Z? Or on your family and kids?\n\n**Introduction**\n\nLong ago I was guilty of caring too much. About my friends, about the world, about my relationships, about sports events, about my job. I cared about my image in the society, I cared about my position in the society, I cared about the opinion of others. And I was not happy.\n\nThen, I started caring less. It was a long and exhausting period. I did not care what I was wearing, I did not care what I did, I did not care about what I was doing in life. But also, I did not care about my friends, or my family. In result, I lost of friends and a lot of self-confidence. And again, I was not happy.\n\nThe purpose of this article it to show my philosophy of caring more … about less. This was the cornerstone of my self-improvement. Being a “love of learning” and “curious” person, I had to try both options, read a lot of books, and do a lot of thinking to find the middle ground.\n\n**How to care less about people**\n\nThere are people everywhere around you. You travel with them in the subway, or on the highway. They look at you, your appearance and they judge you … constantly. Do they care about you? Then, why do you care about them?\n\n**Stop comparing**\n\n> Comparison is the thief of joy.\n>\n> Theodore Roosevelt\n\nI have never understood the need to gossip. To probe everybody for their life, relationships, friends, and job. Maybe, because I was never good at keeping secrets, nobody trusted me with any. And I find this great.\n\nWhen you gossip and when you learn things about others, you inevitably start caring about them (in a good or bad way). Then, you start comparing yourself to them. Maybe you are not so smart, or attractive, or successful. Then, you feel bad and start imitating them. And finally, you lose your identity, you live by their values.\n\nDon’t get me wrong. Make it a habit to learn about other people, to learn what makes them who they are, to find out the principles that drive them. Think about what habits you can adopt that will make you better, an improved version of yourself. But do not compare yourself to them.\n\n**Stop watching news**\n\n> If everyone demanded peace instead of another television set, then there’d be peace.\n> \n> John Lennon\n\nTelevision is a perfect advertisement machine. Certain shows, certain movies, certain news, put your mind in a certain state. So, certain advertisements, certain products can capture your attention. This is, in short, my opinion about TV and news.\n\nTry avoiding bad news for a week and and see the effect on your life. Try avoiding news at all and see how much free time you gain and how positive your mood becomes. After all, why should you care about the price of raw rubber in Brazil, if you live in South Korea and you are not in the rubber industry.\n\nBut keep yourself informed about the things and news that are important to you. All I am saying, is review and evaluate the TV shows that you are watching. And make sure they set you on a path going up and forward.\n\n**How to care less at work**\n\nI remember a story about life.\n\n> Life is like juggling 5 balls: health, family, spirit, friends, and work. The first four are crystal balls. If you drop them once, that break into thousands of pieces, and are very hard to recover. The fifth ball – work – is rubber. If you drop it, it just bounces back.\n\nThen, why do you care so much about work? Why do you identify yourself with your job, or your career?\n\n**Learn to say no**\n\nThe importance of saying “no” cannot be overstated. Are you that person who always says “yes”? Stop! Learn how to say no to additional work, or random requests. Learn to have and show backbone, without being a jerk.\n\nBut also, learn how to set boundaries and manage expectations. If you slip once and do something out of your position, it becames part of your job. Do not let this happen, at least not for unimportant stuff.\n\nHowever, do not shy away from challenges, they are the way forward. Just make sure you think about and accept the challenge and don’t just take any task thrown at you only to look good into the eyes of the others.\n\n**Seek and benefit from failure**\n\nThere are so many people out there who are afraid of failure, afraid of trying. They end up in analysis paralysis and never do anything to improve or try to improve their lives. Do not be one of them!\n\nThe problem with failure is that, again, you believe that by failing you lose something: your reputation, your dignity, your pride. You are, again, comparing yourself against others, who seem to never fail. This makes you care about not failing or waiting until the perfect time before trying.\n\nThe positive strategy is to seek failure and learn from it. The more you fail, the closer you get to your goal.\n\n> Every strike brings me closer to the next home run.\n>\n> Babe Ruth\n\nI added this advice here, in the work/job paragraph, because failing in the workspace is actually a lot “cheaper” than failing in the other spheres. What if you fail with your health? Or with your family? Of course, you can repair the damage, but how long will it take?\n\n**How to care less about problems**\n\nThere are so many people that fear and try to avoid problems. If you are one of them, you have to rethink your position. Problems are usually opportunities for improvement.\nLook back from the distant future\n\nDo you remember when you were in high school and the object of your romantic desires did not know about your existence? Do you remember how much you’ve suffered on St. Valentine’s because of that. How about now? Look back and think about that problem. Does it look pathetic? Can you openly laugh at that “dire situation”?\n\nTry the same technique with your current problems. What will your future self think about them?\n\n> You can’t connect the dots looking forward; you can only connect them looking backwards.\n> \n> Steve Jobs\n\nAccept your current problems just as what they are – tasks that need solving and learn to care less about them.\n\n**Establish boundaries of control**\n\nCan you change the weather when it is raining? Can you make the sun go down at noon in the summer if you feel hot? If you can – you can stop reading and start writing. Teach us! 🙂\n\nWhen you care less about the things that you cannot change (weather, environment, the opinion of others), then you can concentrate on the things that you can change.\n\n> If you think the problem is out there, that very thought is the problem.\n>\n> Stephen R. Covey\n\nI find myself quoting the above way too often, but I find it relevant here. Care less about what you cannot control and care more about what you can control (which is a lot leas than what you cannot control).\n\n**How to care more about yourself**\n\nTwo of the five balls of life are spirit and health. This is where you can care more. How often do you stop and review your life? How often do you rethink and reevaluate your goals and values?\nHold true to (but re-evaluate) your values\n\nEvery time when you face a problem, or conflict, or in general something that you care about, you can trace it down to your values. There is a simple technique called the 5 why-s that prompts you to ask 5 times why to get to the root of any situation. The root is one or more of your values.\n\nYou will feel the happiest if you hold true to your values, act by them, and make sure your actions are always in harmony with them. When you use your values and your strengths based on them, you go into a flow state and you accomplish the most.\n\nBut values can also be the greatest obstacles on your way. I personally set aside some time each month to reflect on my values and my actions in the past month. Sometimes, you will choose to change your values, or adjust them, or tweak them. This is very hard, but the results are enormous.\n\nCare about yourself and your values. Make sure they are productive and when you are sure they are, bring your whole life in unison with them.\n\n**Seek suffering, thrive in suffering**\n\nHow many of the rich people, especially those that become rich “too soon” are happy? Research suggests, not too many. This is mostly because they have no suffering in their lives, they do not strive for anything. They have achieved all their goals and now then drift along.\n\nSuffering and pain are two powerful weapons that nature has given us. It is when you suffer, that you elevate, learn and become better versions of yourselves. Pain is there to teach us something, to show us the way.\n\nCare more about suffering, do not avoid it and learn from it. Care more about pain, accept it, and also learn from it.\n\n**How to care more about the important people in your life**\n\nThe other two crystal balls are friends and family. Most people live their lives being absolutely convinced that their family is just an asset that you can always rely on in times of need. This is mostly true, but only when you also care about them. You know that you parents may be boring and keep telling you to eat and rest more, or stress less. But you know what? They are most probably right!\nSchedule time for family activities\n\nI know it is tempting to go back home and check your email. Or start preparing for that super-important presentation tomorrow. I know that you think you will have more time for the family once you get your promotion. But you will never get to relive the moments that you miss.\n\nI am a 9-to-5 worker in a top and successful company and it requires a lot of effort to keep performing. But I always set aside a few hours in the morning and the evening for my wife and son. I actually schedule these times in the calendar. And on the weekends, I am fully devoted – when they are still sleeping I get my personal time, but when not – I am 100% present.\n\nWhen you have a child your whole life changes. Before that you used to have so much time between you and your significant other. But after the kid the time is so little. Once again, schedule and guard that time with your partner. There is nothing that can restore the gap once it cracks open.\n\nCare more about your family, spend time with them, get rid of the distractions. You will feel a lot better.\n\n**There is always place for a beer with friends**\n\nThis is another old saying. This is me paraphrasing it as closely as I can remember:\n\n> A teacher brought an empty jar in front of their students and asked them if it is full. “No”, they said and he put as many big stones as possible to fill it up. “What about now?”, he asked. And when the students said yes, he put some small pebbles inside as well. “What about now?”, he asked again. And when the students said yes again, he poured some sand in it.\n>\n> “The big stones are the important things in your life (the four crystal balls) – they always get in first or else there is not place for them. The pebbles are the smaller things. You can fill the jar with lots of them, but then, there will be no place for the important things. The sandstones are the pleasures, that come and go. They slip through your palms and don’t bring you anything.\n>\n> “Is the jar full now?”, asked the teach.\n>\n> “Yeees!”, they all replied.\n>\n> The teacher opened a beer and poured it inside. “No matter how busy your life is, there is always place for beer with friends”.\n\n**Summary**\n\nThe modern life and environment forces you to care more about stuff and things: the economy, the political situation on the Balkans, the raise of the Yen, the world cup or super bowl. You care about series, fictional characters, movies, songs, artists. You care about the romantic life of celebrities, princes, and millionaires. This whole thing was invented because if you care so much, you are more likely to buy products to alleviate that.\n\nMy philosophy is also to care more … but about less. By caring less about a lot stuff, I free time for myself, for the important things in my life, for my family, and friends. And I even have a lot of caring left to care more about these things.\n\nI choose to ignore news, to ignore gossip, to spend time reading, writing and thinking. I look at problems, suffering, and pain as learning opportunities. Also, I do not think high of myself, I admit that I am wrong most of the time. And I am happy.\n\nGil Mayer\nAuthor at \"from Gnome to Goliath\"", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/88a01v/care_more_about_less/", "title": "Care More About Less", "social_network": "reddit", "user": "gilmmayer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1522413284, "permalink": "/r/DecidingToBeBetter/comments/88a01v/care_more_about_less/", "nsfw": false, "first_save": 1635437142.0166361, "replies_charged": false}