{"id": "t5_2tand_t3_mrd12a", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Hi fellows! I'd like to share with you a lesson from a stoic philosopher Epictetus that helped me to become way more productive and make better decisions. I've framed it from his perspective, so he is a teacher here. Wish you a good read!\n\n# Dichotomy of Control Exercise\n\nHi, I am **Epictetus**. I was born a slave in the Roman Empire and was crippled later on in life. This was terrible fortune and not of my own doing.\n\nBut neither the shackles of my enslavement nor the limitations of my body made me feel limited. This might seem very strange to you, but let me explain.\n\nSome things are within our complete control, while others are not. Within our control are judgment, desire, aversion, and whatever is of our own doing.\n\nNot within our complete control are our body, our property, reputation, and whatever is not of our own doing.\n\nThat's because there are many external factors involved: illness, misinformation, and the impact of other people on us.\n\nHowever, judgments and desires are internal to us, as we learned in the previous lessons.\n\nBut how should we deal with things like our health or our reputation? We can't really stop caring about them, but we can't guarantee that these things will turn out the way we want either.\n\nWe Stoics believe that we can't really fail in those things, as long as we are doing everything possible within our control. If they still go wrong, like due to you having an unexpected disease, it was not of your doing, so it's not a failure.\n\n**Now, think of the last time you were afraid of failing, for example, public speech. How did you feel? How did it play out? Did you feel that you have complete control over the situation?**\n\nWe control far less than we might intially think, and we likely have mistaken ideas about what we control.\n\nThe problem is that by pursuing things that are not under control, we can't really control our happiness.\n\nLet me give you an example.\n\nIt is like planning a sea voyage. What can you do? You can choose the captain, the sailors, the day, the right moment. Then a storm comes upon us. At this point, what are your concerns? Your part is done.\n\nSo choosing the captain was under your control, and weather conditions were not. So why would you even be bothered by the failure if it was not under your complete control?\n\nWhat can you do in situations like that? Shift your goals from the external to the internal: repeat yourself that your objective is not to have a safe voyage but to do the best that is within your power to make it safe.\n\nIf you redirect your attention and desires in this fashion, you can't get disappointed that easily.\n\nSo let's do a quick exercise.\n\n**Think of an important event you have soon. It might be a date or a public performance. What is under your control within this event? What is not?**\n\n**Great. How can you focus more on things you control and pay less attention to something you can't?**\n\nWe should focus our energy and resources on affecting what we can control and turn away as much as possible from what we can't.\n\nThis boils down to the notion that we are in charge only and exclusively of our deliberate judgments, our endorsed opinions and values, and our decisions to act or not to act.\n\nNothing else.\n\nI highly recommend doing this exercise daily, looking at specific events in your life. As you continue practicing, you'll internalize what is really under your complete control and what isn't.\n\n&#x200B;\n\n\\-------\n\nP.S. If you liked this exercise, I have written more lessons like that. Just in case you **are curious to explore more**, let me know and I will share the link to **other lessons** in DM.\n\nThe themes I cover are: getting disciplined, reducing anxiety, learning about your life values, decision-making, the art of happiness, and being present in the moment.\n\nThe lessons are based on the primary sources of wisdom from more than 2500 years of history of philosophy: Plato, Aristotle, Lao Tzu, Carl Jung, Stoics, and many others.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mrd12a/lesson_from_a_former_slave_how_to_make_good/", "title": "Lesson from a former slave. How to make good decisions and don't waste your time on crap", "social_network": "reddit", "user": "Sviat-Hni", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 33, "down_vote": 0, "creation": 1618487547, "permalink": "/r/DecidingToBeBetter/comments/mrd12a/lesson_from_a_former_slave_how_to_make_good/", "nsfw": false, "first_save": 1635436623.4353776, "replies_charged": false}