{"id": "t5_2tand_t3_30cqo5", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707", "67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "Storytime: A while back, after i first bought a copy of Minecraft, I joined a public survival server. It did not take long for someone to randomly kill me as I walked down a road, and then another time as I worked on building a large nice structure in the middle of nowhere. It seemed to me that randomly killing new or unarmed players was not very sporting, and did not contribute to the fun of the game for me at all. So I decided I would start a cult of kindness on the server that seemed to be filled with murder. The cult never really got off the ground, but I did compile its first holy text, which was \"Short Quotations on Kindness\", and published it using the in-game books you can craft (space limitations caused me to label it \"Kindness Quotes\"). Later I gifted a copy to one of the more dominant clans at the time (The Gentlemen Bastards), and they stowed it in their weapons locker, reasoning that kindness can be one of the most powerful weapons.\n\n/storytime\n\nAnyway, I figured that as kindness has been something that I have been striving to integrate more fully into my behavior, that I define it as something that I can better myself through, that my little compilation might be of value to that end for myself and possibly for others seeking to better themselves. So here's the text, formatted to be pasted into a written book in minecraft if you so desire. (I've replaced the page breaks with horizontal lines here)\n\n>Short Quotations on  \n>Kindness  \n>By Mumberthrax  \n>License: CC-BY-SA  \n>  \n> -----  \n>\n>No act of kindness, no matter how small, is ever wasted.  \n>- Aesop  \n>Don't wait for people to be friendly, show them how.  \n>- Author Unknown  \n>Wherever there is a human being, there is an opportunity for a kindness.  \n>- Seneca   \n>\n> -----\n>  \n>Sometimes when we are generous in small, barely detectable ways it can change someone else's life forever.  \n>- Margaret Cho  \n>You cannot do a kindness too soon, for you never know how soon it will be too late.  \n>- Ralph Waldo Emerson  \n>\n> -----\n>  \n>When you are kind to someone in trouble, you hope they'll remember and be kind to someone else. And it'll become like a wildfire.  \n>- Whoopi Goldberg  \n>  \n>There is no duty more obligatory than the repayment of kindness.  \n>- Cicero  \n>\n> -----\n>  \n>There is one word which may serve as a rule of practice for all one's life - reciprocity.  \n>- Confucius  \n>The everyday kindness of the back roads more than makes up for the acts of greed in the headlines.  \n>- Charles Kuralt  \n>\n> -----\n>  \n>You can't live a perfect day without doing something for someone who will never be able to repay you.  \n>- John Wooden  \n>  \n>When helping others, do not look for a reward; If you are looking for rewards, don't help others.  \n>- Author Unknown  \n>\n> -----\n>  \n>One man cannot hold another man down in the ditch without remaining down in the ditch with him.  \n>- Booker T. Washington  \n>  \n>Even when you do not feel big hearted, you can give yourself permission to act that way.  \n>- Lama Willa Miller  \n>\n> -----\n>  \n>Be kind to unkind people - they need it the most  \n>- Ashleigh Brilliant  \n>Kindness is in our power, even when fondness is not.  \n>- Samuel Johnson  \n>Life is short but there is always time for courtesy.  \n>- Ralph Waldo Emerson  \n>\n> -----\n>  \n>Thousands of candles can be lighted from a single candle, and the life of the candle will not be shortened. Happiness never decreases by being shared.  \n>- Buddha  \n>If we cannot be clever, we can always be kind.  \n>- Alfred Fripp  \n>\n> -----\n>  \n>That best portion of a good man's life, His little, nameless, unremembered acts of kindness and of love.  \n>- William Wordsworth  \n>Treat everyone with politeness, even those who are rude to you - not because they are nice, but because you are.  \n>- Author Unknown  \n>\n> -----\n>  \n>Make it a practice to judge persons and things in the most favorable light at all times and under all circumstances.  \n>- Saint Vincent de Paul  \n>  \n>I always prefer to believe the best of everybody, it saves so much trouble.  \n>- Rudyard Kipling  \n>\n> -----\n>  \n>If we should deal out justice only, in this world, who would escape?  No, it is better to be generous, and in the end more profitable, for it gains gratitude for us, and love.  \n>- Mark Twain  \n>\n> -----\n>  \n>A good character is the best tombstone.  Those who loved you and were helped by you will remember you when forget-me-nots have withered.  Carve your name on hearts, not on marble.  \n>- Charles H. Spurgeon  \n>\n> -----\n>  \n>Guard well within yourself that treasure, kindness. Know how to give without hesitation, how to lose without regret, how to acquire without meanness.  \n>- George Sand  \n>\n> -----\n>  \n>Too often we underestimate the power of a touch, a smile, a kind word, a listening ear, an honest compliment, or the smallest act of caring, all of which have the potential to turn a life around.  \n>- Leo Buscaglia  \n>\n> -----\n>  \n>Sometimes someone says something really small, and it just fits right into this empty place in your heart.  \n>- From the television show My So-Called Life  \n>  \n>It's nice to be important, but it's more important to be nice.  \n>- Author Unknown  \n>\n> -----\n>  \n>Have you had a kindness shown? Pass it on; 'Twas not given for thee alone, Pass it on; Let it travel down the years, Let it wipe another's tears, 'Til in Heaven the deed appears - Pass it on.  \n>- Henry Burton  \n>\n> -----\n>  \n>Believe nothing merely because you have been told it. Do not believe what your teacher tells you merely out of respect for the teacher. But whatsoever, after due examination and analysis, you find to be kind, conducive to the good, the benefit, the   \n>\n> -----\n>  \n>welfare of all beings -- that doctrine believe and cling to, and take it as your guide.  \n>- Buddha  \n>\n> -----\n>  \n>We are here to add to the sum of human goodness. To prove the thing exists. And however futile each individual act of courage or generosity, self-sacrifice or grace-it still proves the thing exists. Each act adds to the fund.  \n>\n> -----\n>  \n>It needs replenishment. Not only because evil flourishes, and is, most indefensibly, defended. But because goodness is no longer a respectable aim in life.  \n>- Josephine Hart  \n>\n> -----\n>  \n>Never forget that you are one of a kind. Never forget that if there weren't any need for you in all your uniqueness to be on this earth, you wouldn't be here in the first place. And never forget, no matter how overwhelming life's challenges and problems  \n>\n> -----\n>  \n>seem to be, that one person can make a difference in the world. In fact, it is always because of one person that all the changes that matter in the world come about. So be that one person.  \n>- R Buckminster Fuller  \n>\n> -----\n>  \n>What this world needs is a new kind of army - the army of the kind.  \n>- Cleveland Amory  \n>  \n>My religion is very simple. My religion is kindness.  \n>- The Dalai Lama\n\nI'm no legal scholar, but if compilation of quotes can be licensed, then I'm using Creative Commons Attribution-ShareAlike 4.0 International License for this work to maximize it's usability.\n\nThanks for reading.\n\n(edit: formatting)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/30cqo5/a_while_back_i_compiled_a_bunch_of_quotes_on_the/", "title": "A while back I compiled a bunch of quotes on the concept of kindness into a little book on a pvp-enabled Minecraft server. I am not certain, but it may be of interest here.", "social_network": "reddit", "user": "Mumberthrax", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1427358878, "permalink": "/r/DecidingToBeBetter/comments/30cqo5/a_while_back_i_compiled_a_bunch_of_quotes_on_the/", "nsfw": false, "first_save": 1635436562.2730105, "replies_charged": false}