{"id": "t5_2tand_t3_lyex6k", "request": ["828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "Background info: was clinically diagnosed with depression and took medicine for about an year. 18/F. No longer takes medicine because I'm sick of depending on it. I struggle with unnecessary feelings of guilt and shame all the time. I get annoyed easily at the slightest useless things and snap at whoever is closest to me. I tend to overthink and cry about the silliest things alone.i feel pathetic most of the time and feel the need to get sympathy of others to feel better.\n\nAs said I get annoyed and frustrated easily and throughout the day today I snapped at my mom and spoke harshly to her. Scolded her for the silliest things . At the same time after each anger episode I come to my room and cry alone feeling extremely guilty unable to u understand why I'm acting like this. At the end of the day I apologised and cried in front of her because I was so disappointed in myself. I'm sick of blaming my depression for my actions. I want to make control of my emotions . I want to be the once joyful girl I was. I want to know how I can stop acting like this. Since my mother is the closest to me I snap at her a lot and I know she hurts a lot.  I love and care for her a lot and right now I'm crying writing this. My father is a hot tempered  individual and even he tends to snap and loose his temper and ofoxurse she is the one affected. I feel so sad for how much she has to put up with. I want to stand up with and for her and support her. I feel like I'm letting her down . I want to be a better daughter.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lyex6k/i_hurt_my_mother_and_now_im_burning_inside/", "title": "I hurt my mother and now I'm burning inside", "social_network": "reddit", "user": "downtoearth_7", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1614959884, "permalink": "/r/DecidingToBeBetter/comments/lyex6k/i_hurt_my_mother_and_now_im_burning_inside/", "nsfw": false, "first_save": 1635437345.552915, "replies_charged": false}