{"id": "t5_2tand_t3_pxvmn2", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "25 year old woman. This is pretty long so if you stick around, you're fucking awesome.\n\nAt first I was trying to forgive others. It was a tough ride; took about two months (well...about over 10 years haha. I decided to work on getting over that shit that last two months). The process was going okay at first. I wrote in my manifestation journal: everything I'm grateful for, wrote down my future two months saying I have peace with the past. Realized I was super fucking angry and the negative thoughts about the past were on max. I prayed, started exercising, learned to trust the process. I noticed my anxiety worsened as well. I would wake up breathing hard with negative thoughts and pissed off; go to the gym (I didn't need a pre-workout drink. My anger would get me super hype.); even while I was driving, I could feel the panic arising. I almost had to pull over to calm down a few times. At least I was keeping the damn faith. I immediately researched CBD products to help me find some chill. Cannabis with high THC gives me scary panic attacks. The last one I had was about how I had no problems in my life. So why am I being so difficult?....it's funny now, but while it's happening, super scary.\n\nThe CBD helped a lot. Even though I will be using a lot of it, I would rather use this than turn into an alcoholic. In the end, I understood that I cannot keep playing victim. I understood that none of these people matter at all. I started thinking that maybe I should try to forgive myself?....the only person I hurt the most throughout my life was me. I was amazed at the process I made. I didn't even write in the journal everyday. Sometimes I skipped a week or two.\n\nI gave myself a deadline of two months. I believe I got this. The problem, though, is as soon as I started this journey, I've been going back to some unhealthy habits. I've stopped eating. Only eating one to two meals a day. Sometimes just snacking on chips and candy and no meals at all. This fucking bad for anyone, I know; but, it's super terrifying because I'm still hitting the gym daily (weight training). I've only been going to the gym one to two times a week. I'm losing the motivation and it's scaring me a little because I lost five pounds and I'm proud of myself no matter how small the number is. I'm enjoying working out, I don't want to fuck this up. I'm realizing I have a sugar addiction. I'm eating bananas to try to calm down the cravings. This past week, the negative thoughts about the past came around. This time, I'm blaming myself to the fullest. CBD products are working, the negative thoughts aren't going away as much as I want them to. I haven't written in my journal at all; not even about what I'm grateful for.  And, it's only been a couple of weeks.\n\nIt's not all bad though. I want a keep my home cleaner, I want to keep up with my appearance. I'm noticing I don't really take care of myself like I should. I saying just because I've been surrounded by assholes my whole life doesn't mean I should turn into one. Also, I'm seeing how I lack discipline.\n\nHas anyone went through the same shit when they considered self forgiveness? What was the process you experienced? Maybe there is no experience at all. I'm just overexaggerating? Is there something I should try to do? Talk to me.\n\nThank you for sticking around to read all of this shit.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pxvmn2/advice_on_self_forgiveness/", "title": "Advice on self forgiveness?", "social_network": "reddit", "user": "natqueenhole", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1632922873, "permalink": "/r/DecidingToBeBetter/comments/pxvmn2/advice_on_self_forgiveness/", "nsfw": false, "first_save": 1635435773.096225, "replies_charged": false}