{"id": "t5_2tand_t3_psimrt", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "&#x200B;\n\n*I always notice what is not working. I always focus on things that didn’t work.*\n\nMaybe you are that type of a person. Negative. Most of the time.\n\nMaybe you are depressed. And if you are, go see a specialist.\n\nToday I am talking about another type of person. You know, those people who want things to go perfect all the time.\n\nThose who don’t want to face any failures and hurdles.\n\nBut the question is – who enjoys failing? \n\nThese perfectionists want things to go perfect all the time. Even though they know deep inside themselves that this is not possible, they still hang on to that. **Nothing was ever perfect**. But why is this happening, you may ask? Why do you do things even though you know perfectly clear that you shouldn’t be doing them?\n\nA short answer to this is that we are not very rational.\n\nWe have a rational mind, of course, but we also have an emotional mind. When the emotional mind takes over… you know what can happen.\n\nAnother thing that I want to mention is that we are **way** **more** susceptible to negative things rather than the positive things in our lives. It is ingrained in us. \n\nThis is one way to put it why you are focusing more on the negatives rather than the positives. \n\nWhen we were back in the caves, we needed to focus more on the negative stimuli from the environment in order not to get killed by something.\n\nIsn’t it ironic that in this wealthy era, where we have everything we still focus on the negative? How do you live in a constant bliss?\n\nFor a perfectionist, focusing on the negatives is a natural trait. You cannot think about a perfectionist without mentioning this. \n\nIf a perfectionist manages to do something, he will focus on the things that he didn’t achieve.\n\nIf a perfectionist doesn’t achieve a certain goal, he will notice only the failure, not the small progress he **actually** made to get closer to the goal.\n\nIs there a solution?\n\nI really do believe that hard things in life are worth it. It’s almost like a law: the more you struggle, the greater the satisfaction. \n\nYou are more inclined to the negative – how do you leverage that?\n\nCan you imagine that there is a technique for that and it’s very simple?\n\nChange perspective and be thankful for what you actually have.\n\nWhen you look at the goal you haven’t achieved, try to think about the actual progress you made ‘cause 1 is still better than 0.\n\nWhen you don’t have a new phone, think a bit that maybe someone doesn’t have a leg.\n\n (what I wrote here it’s backed by neuroscience – *I am not gonna tell you more*)\n\nDo not over complicate things. You build a house starting with one brick. \n\nWhy would your personal transformation be any different?\n\nBe wise!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/psimrt/i_always_notice_what_is_not_working/", "title": "I always notice what is not working.", "social_network": "reddit", "user": "zeroperfectionism", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1632230560, "permalink": "/r/DecidingToBeBetter/comments/psimrt/i_always_notice_what_is_not_working/", "nsfw": false, "first_save": 1635435618.9913752, "replies_charged": false}