{"id": "t5_2tand_t3_qc8h0n", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "f48bf32c-05af-4e9d-b00f-8b45a75af78f", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "*THANKS IN ADVANCE IF YOU READ ALL OF THIS. MOSTLY JUST VENTING.* I just need some encouragement to keep trying and not just give up, because I really want to today. \n\nI’ve been trying to fix some issues in my life and just trying to get my mental health, my finances, and just my general well being on track.\n\nI’ve been doing okay with some things, but I’m still struggling, mostly financially. I’ve been working towards getting back to work and have had a few interviews for a job that looks promising, just currently waiting for an email.\n\nI just feel stuck. Nothing HUGE has happened, but I’ve had a couple unexpected more hits with money the last couple days and having some problems with my car insurance.\n\nI hopefully will be getting my car insurance issue resolved today because I was planning to Uber for some extra cash until I hear back about this job.\n\nUber can hold me over until I get back to work, but this insurance thing just pushed me over the edge today. I also checked my bank account today and apparently I accidentally paid for something out of my checking account that I was gonna put on my credit card. \n\nI had to take pretty much the rest of my money out of my savings to fix it. I still don’t have enough money to pay my car and rent this month. I just wanna give up. \n\nI just could used some good vibes, prayers, whatever your thing is and some encouragement and hope that I hear from this job. I really just wanna give up today.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qc8h0n/i_need_some_encouragement_today/", "title": "I need some encouragement today.", "social_network": "reddit", "user": "Its_Haleeyy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1634757127, "permalink": "/r/DecidingToBeBetter/comments/qc8h0n/i_need_some_encouragement_today/", "nsfw": false, "first_save": 1635435069.8282764, "replies_charged": false}