{"id": "t5_2tand_t3_ofd5sp", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1"], "text": "TL;DR - Today marks a year (roughly) of me quitting smoking and I am really happy. In the post, I go into a little bit of detail on how I quit.\n\nIt gives me immense pride to announce that I have not smoked a cigarette since one year now, and I couldn't have been happier :)\n\nI'm 27M and had been smoking regularly since the last 9 years, and at my peak, I was easily doing a couple of packs a day. So yeah, a pretty heavy smoker I was. Had been quitting multiple times only to pick the habit up again. The max I had pushed was 20 days, but then in June last year, I decided to make another attempt, though I was not very hopeful, to be honest. 15 days in, while having a beer, I gave up again. Now usually, I would have gone - \"well, I have smoked once, now what difference does it make\", and then begin smoking again. But somehow, this time, I was determined and on 4th of July last year I had my last cigarette and I decided that I'm gonna try as seriously as I can. And, I did!\n\nNeedless, to say, it was extremely tough, and I had to take the help of nicotine gums (2mg a piece) to assist me. So, I started with 8-10 gums a day. Basically, everytime I had an urge, I'd start chewing a gum. I also started to keep a pencil between my fingers every now and then, because, I missed that feeling. I was also drinking a lot of water. I even started to avoid meeting my smoker friends, which I agree is not a great move, but I really needed this for myself and once I was certain that I'm making progress, I explained this to them too.\n\nA month later, cigarette cravings had significantly reduced, but now I was addicted to nicotine gums. I was chewing at least 6 gums a day, which means I was still addicted to nicotine. So, I started chewing sugar free mint gums every now and then. I was also running every morning, so I could see the difference in my breathing and that really motivated me to keep going.\n\nAfter 2 and a half months, I finally decided to make the switch to sugar free mint gums and stop chewing nicotine gums completely. At this point, I was doing 2-3 nicotine gums a day. Now, this was still hard and honestly, I hadn't thought that it would be this hard. But whenever I'd hit an urge, I'd drink a bottle of water and then pop a mint gum in my mouth, or I'd sometimes just do 15 pushups or one minute plank if I had an urge. A week later, it became much easier and I was just chewing mint gums. I also was running 3 km in a go without stopping, which was amazing because when I had started, I could hardly run 500 metres without stopping, and I would be panting really hard.\n\nAfter 4 months, I stopped chewing gums and I was finally confident that I'd be able to quit smoking permanently now. I decided that I'll call myself a non smoker only if I successfully do a year without cigarettes. So, on 4th of July, i.e. 3 days ago, I became a non smoker, and I just can't stop being happy. I was busy with something due to which I could not post it then, hence I'm posting it today. My self esteem has definitely gone up, because I have managed to do something I never thought I would be able to. Oh man, thank you so much for reading this. I'm smiling like a baboon while writing this.. haha!!\n\nIf you are trying to quit smoking, please hang on, it really gets better, and when you're on the other side, it feels amazing. I'd be happy to answer any question if someone is trying to quit and has some questions. Thank you! Have a great day :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ofd5sp/i_can_finally_call_myself_a_non_smoker/", "title": "I can finally call myself a non smoker :)", "social_network": "reddit", "user": "thatawkwardsapient", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 113, "down_vote": 0, "creation": 1625638423, "permalink": "/r/DecidingToBeBetter/comments/ofd5sp/i_can_finally_call_myself_a_non_smoker/", "nsfw": false, "first_save": 1635436129.950149, "replies_charged": false}