{"id": "t5_2tand_t3_lgkkzv", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": " This is sadly *kind of* a rant but I need to find help.\n\nI hope you can see I constantly work on myself through the title. I got sober, started self-learning, went back to school, exercise, learned to cook more, etc etc.\n\nProblem: I spend hours every day on **Twitch**, and the people I like to watch aren't exhibiting qualities I want to surround myself with, just like in real life.\n\nSolution: I want to find a positive source of entertainment.\n\nWhat do you guys do for entertainment like this?\n\n**Spotify**/**YouTube** are great, but I have to choose videos and sometimes I get bored/run out of content. I can't just turn on a streamer and let them play music and videos and games like I do.\n\n**Sports** are great but sometimes aren't on/I get bored, too.\n\nHonestly, I judge watching **Netflix** as a waste of time so I don't use it. Idk; I just turn my head during movies, thinking it would be crazy to sit through unrealistic interactions (star wars drones missing shots, romantically involved characters not finding the words to say).\n\nSame thing for a **podcast**; I think it's crazy to sit through people talking. *Maybe I can find a good podcast.*\n\nI study for 5+ hours a day of engineering/stem stuff so reading **books** would be like going for a jog for a break from lifting weights.\n\nGoing to the gym/taking a walk/yoga aren't really the type of thing I'm looking, obviously. Similarly, I tried drawing the other day and it's not the type of thing I'm looking for.\n\nSo what do you guys do? What do you recommend? What psychological assessment can you offer?\n\n*Extra details about why I don't want to watch these Twitch streamers: Like I think they're funny but they rage, they act dumb, they spend hours playing games and they're not like athletes or anything I look up to so like I don't want what they expose me to to rub off on me.*\n\ntl;dr I'm trying to find habits replacing watching Twitch.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lgkkzv/so_it_took_a_long_time_but_i_found_a_great_group/", "title": "So it took a long time but I found a great group of new friends, stopped using social media except for IG; I only follow my close friends, the best athletes in the world, inspirational/motivational pages, science pages, artists. I even remodeled my YouTube subscriptions and Spotify playlists. BUT.", "social_network": "reddit", "user": "superrenzo64", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1612926667, "permalink": "/r/DecidingToBeBetter/comments/lgkkzv/so_it_took_a_long_time_but_i_found_a_great_group/", "nsfw": false, "first_save": 1635436436.3941736, "replies_charged": false}