{"id": "t5_2tand_t3_oiu0oq", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "TLDR: When you catch yourself being sad about not having something that you want, instead of merely accepting that you don't have it, you have the option to think of how proud you are to be the kind of person who wants more out of life. This allows you to focus on a positive side of that desire which can energize and motivate you instead of the negative side that makes you feel bad.\n\nLong version: For years, I have struggled with how to deal with materialistic, professional, social, and romantic desires. I have been a big believer in mindfulness and acceptance since I was a teenager and that has helped to a certain extent. When I catch myself comparing what I have or what I lack to the lives of others, I am able to take a breath and to notice the emotional reactions that cascade from those thoughts. I am then able to consciously accept that I am on my own path and there is no use reacting negatively to things that I cannot immediately change. I have damned near become a Zen master when it comes to the art of accepting the present moment and letting go of negative emotions.\n\nThere has always been a dark side to this way of dealing with things though. It seems there is a fine line between acceptance and complacency. In the process of accepting things that I cannot change, I often find myself ignoring things that I could change. I procrastinate and leave projects unfinished. I stay quiet when I could be talking to that beautiful woman standing right next to me. I fail to look for and pursue professional opportunities that could bring me to a higher standard of living. I notice that I haven't spoken to a particular friend in a long time but then I fail to do the simple task of picking up the phone and reaching out.\n\nRight now, I am going through a particularly difficult time in my life. I am about to turn 40 next month, my wife and I filed for divorce earlier this year, and I have been struggling to complete my PhD program with an ever-growing mountain of student loan debt looming on the horizon. There are a lot of really good things happening in my life too and I have a lot of reasons to feel profound gratitude right now but the last few days have brought a huge wave of depression.\n\nFeeling how my normal practice of mindful acceptance was failing to move me through this wave of sadness, I started to think about the way that I have been dealing with frustration. I asked myself if my habit of mindful acceptance was really acceptance or if it had just become a way for me to avoid dealing with things in my life that I potentially could be changing. As soon as I had that thought, it struck a nerve and resonated in a way that let me know I was onto something. What I have been doing for the past 25 years of my life has not been acceptance at all. I have been using the idea of acceptance to avoid and neglect very important aspects of my life.\n\nOnce that occurred to me, the solution followed in an epiphany. Instead of ignoring frustration and desire, I have the option of reframing how I think about frustration and desire. Instead of just running away from it and distracting myself with other things, I can think about how proud I am to be the kind of person who wants more out of life. The people who I respect the most and have inspired me throughout my life have been those who have been continually motivated by the desire to grow and to improve their lives along with the lives of those around them. I love and respect those who are motivated in this way and so I can love and respect myself for wanting more out of life than I currently have.\n\nWhen I think about it this way, I don't feel sad for not having certain things now because I am truly in a state of gratitude and acceptance. I don't feel the need to distract myself or to run away from what I have been thinking about. I feel motivated and empowered to take steps now that can start to move me towards the life I want. This is what real acceptance feels like. It is a palpable difference from the coping technique that I have used in the past. I don't know if any of y'all can relate but I wanted to share in case anyone else could use this going forward.\n\nAloha.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oiu0oq/a_great_reframing_technique_for_negative_thoughts/", "title": "A Great Reframing Technique For Negative Thoughts", "social_network": "reddit", "user": "Sunsh1neMelting", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1626105026, "permalink": "/r/DecidingToBeBetter/comments/oiu0oq/a_great_reframing_technique_for_negative_thoughts/", "nsfw": false, "first_save": 1635435407.016386, "replies_charged": false}