{"id": "t5_2tand_t3_idpykr", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "How have you all coped with cutting dopamine out of your lives?  \n\nIn the past few years, I have tried to turn myself into someone who deserves all the privileges and love I have had in my life.  The biggest struggle was giving up a serious addiction and starting to address the impact it had on my family life.  I have also given up meat on the advice of my doctor, stopped drinking almost completely, given up smoking and chewing tobacco, lost around 60 lbs, and worked on giving up all sorts of small habits and developing new virtuous ones.\n\nI was using replacement coping mechanisms before, but the pandemic has mostly taken those away.  I realize that replacing one dopamine hit with another is probably not productive anyway.  So now I am forced, after all this struggle and all these years, to really confront myself and I'm not sure how.  \n\nI know that Buddhism takes as a central tenet that desire is the source of suffering, so I try to remind myself of that and that eventually I will not need stimulation to be happy.  I have tried meditation and it works a bit, although I prefer to go to the sauna to do that, but those are all closed now and I find it harder to meditate at home.\n\nIn some ways, I feel like I am willing myself into depression by not having any vice.  But I know that good people live this way, so it must be possible.  \n\nHow have you all managed to create lives that don't involve dopamine rushes?  Any tips are greatly appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/idpykr/living_without_dopamine/", "title": "Living Without Dopamine", "social_network": "reddit", "user": "procionlotor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1597983644, "permalink": "/r/DecidingToBeBetter/comments/idpykr/living_without_dopamine/", "nsfw": false, "first_save": 1635437776.5159585, "replies_charged": false}