{"id": "t5_2tand_t3_q5qz4t", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "[Original post ](https://www.reddit.com/r/DecidingToBeBetter/comments/oum9qj/starting_a_6_month_journey_decided_to_be_a_better/?utm_medium=android_app&utm_source=share)\n\nHello, it's been a while since I (19M) last wrote here. Def read the original post if you're interested in this one :) \n\nA bit more than 2 months have passed from the 6 month period so I decided to write a little update and elaborate my original goals and how am I doing at the moment. As you read in the first post, I set my goals right before I moved thousands of miles away from my home country. Due to this fact and the new and unknown environment I needed to adjust some of my original goals because I just simply couldn't follow the plan.\n\n•Training: this is probably the most important goal (alongside with studying) and aspect of my life since I have always been the skinny boy without a gramm of muscle. The original goal was to fix my diet and start hitting the gym right after I moved. Well, turned out I could only gain access to the gym after a month of moving (for stupid reasons) so I needed to adjust. I fixed my diet in the first month and started hitting the gym on the first day of September. Since then I've been working out and getting stronger day by day and ive also been eating sufficient amount and quality of calories. Plus I almost completely stopped eating fast food (only had it like twice or three times since I moved).\nI actually feel stronger as of now and I went from 69kg/152lbs to 74kg/163lbs in a bit more than two months. Most of the mass being muscle.\n\n•Studying: I have just started my first semester in Uni in another country. My only goal was to ace my first semester and surprisingly it is going well. I totally enjoy the field I'm studying and I force myself to study as much as possibly and put real effort into it. As a result I have aced all my assignments and exams I've had so far. Planning on continuing the same. I have also re-started learning the language of the country I moved to (I've lived here before, pretty complicated situation). \n\n•Hygiene: it has not been an issue before, the only thing I meant with this goal is to shave my beard regularly but I \"failed\" since my girlfriend begs me not to shave it. And I honestly don't really care if I have one or not.\n\nScreen time: I wanted the reduce my daily screen time to under 4 hours but damn it is nearly impossible. This is something I am working on but I just simply can't find a way. I am really unhappy about it and I really should do something about it. Going through all my social media 20 times a day really takes up a long time in my day. \n\nSleeping: the goal was to sleep 8 hours a day (it's good for training and also for studying). I am okay with it, never been a big sleeper so I'm fine with going to bed at 11 and waking up at 7. Of course it's sometimes impossible (like today when I was woken up at 5 by the construction workers in our street) but besides that it's going well. \n\nReading: haven't read a single book since I'm here. I must read instead of social media but damn it's difficult. I am completely failing this so far :/\n\nFinances: the original goal was to find a job in the new place by the end of the semester, which will not happen for several reasons. Basically the authorisation of my new country is brutally slow and I won't have my papers until the end of November so I can't start working legally before that. But I will travel back home for the holidays, so I'll start working only after that, around mid January. The local McDonald's hire foreign students for a relatively good salary. BUT I started teaching kids online from my home country (i teach maths). I'm not gonna pay my rent with that money so I still rely on my parents but it's a good side hustle and I earn a couple grands in a month. A lot better than nothing imo. All other goals in this finances category were about my earned money but since I cant start working normally until January these are irrelevant. \n\n\nThese were the goals, congrats if you made it this far :) \n\nDo I feel like completely changing my life? Absolutely no.\nDo I enjoy the process and did I enjoy the past 2 months? Absolutely yes.\n\nIt is fascinating that after 2 months I can still stick to my goals because most of them became my daily habit. Its even more fascinating that I accidentally created a perfect daily routine with these goals.\n\nThanks for reading. Have a nice day :)\n\nEdit: English is not my native, sorry for grammar and poor vocab", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5qz4t/update_i_have_decided_to_change_my_life_in_6/", "title": "UPDATE: I have decided to change my life in 6 months", "social_network": "reddit", "user": "brown_epres", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1633939033, "permalink": "/r/DecidingToBeBetter/comments/q5qz4t/update_i_have_decided_to_change_my_life_in_6/", "nsfw": false, "first_save": 1635437500.438736, "replies_charged": false}