{"id": "t5_2tand_t3_bj06yz", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "Hey everyone, \n\nSo I know this isn't the typical format but I want to tell you all my life story. I know most people won't care. I haven't live the craziest life, but it's my life and in my short 28 years of living I have learned more than most people will learn in their entire life span. I'm telling you right now, this is going to be a long, long read. But it will all come together and it will make sense as to why it's in the sub. Here we go I guess....\n\nMy parents were young when they got married and had me and my older brother. My Mom was pregnant with my brother right after she got out of high school so her and my Dad got married, it was the thing to do in the late 80's. My Mom is an absolute angel of a woman, she has put up with so much crap in her life and it makes me happy to see her living a fulfilling life now. Anyway, she married my Dad, who was/is littered with undiagnosed mental issues. Sadly these issues didn't really come to light until after they had gotten married. He was extremely abusive towards my mother, both physically and verbally. About 3 years after my brother was born my Mom was pregnant with me and I was born on Christmas of 1990. A little less than a year after I was born my Mom had enough of my Dad's abuse and divorced him. They shared custody, my brother and I would spend Monday, Tuesday, and Wednesday morning with my Dad, and after school Wednesday we would take the bus home to Mom's house and weekend's were alternated. Being at my Mom's house was great, she always had fun things for me and my brother to do. Every weekend was some type of trip or something fun to do around the house, she is an awesome Mom. However, spending time at our Dad's house was very different, my brother and I were beaten badly and mentally/emotionally abused every single day. My brother was always a little different, and sadly he was diagnosed with asperger's and some other stuff later in life but as kids he was just...different. One day we were cleaning our room and our Dad came in to \"inspect\" how well we were doing. My brother has always been a big reader, so when my Dad came in the room my brother had a bunch of books on his bed and Dad didn't like that very much. He asked my brother \"Why aren't these books on the shelf?\" and my brother wanted to answer the question but my Dad has always confused responding with talking back or making excuses. So my brother very nervously responded with \"Well I was waiting to put those on the bookshelf because the bookshelf was dusty\". My Dad stared at him for a second, and out of nowhere he picks up this big thick book, one of those Encyclopedia type books, probably \"The History of the Automobile\" or something and threw it at hard as he could across the room and it hit my brother in the side of the head. He started crying and my Dad simply got up and left. The one good thing about being at Dad's house on the weekend though was Friday night, it was Chinese food and movie night. I was always so excited to go to the movie rental store, pick up our Chinese food and sit down in the living room, the one night where everything was perfect. I was about 9 or 10 years old one Friday night, my Dad had made me a plate of Chinese food and I ran up the stairs to pop the VHS in the player but when I get to the top step I tripped and spilled my plate on the carpet. I knew how mad he would be so I scrambled to get the food on the plate and pretend like nothing happened, but my Dad heard me trip from the kitchen. I had gotten my crab rangoon and wonton's back on the plate before my Dad came up the stairs. I tried apologizing, I told him I would clean up the mess but he didn't care. He kicked me in the stomach, I started to cry, he kicked me in the head, I cried more. He kicked me in the stomach over and over until I couldn't breath and physically couldn't cry anymore because I couldn't catch a single breathe. But that's my Dad. I could go on for days telling you stories of abuse, telling you how me and my mentally handicapped brother were constantly berated my Dad, being told how useless we are and being beaten for the smallest things. \n\nThis went on for years. Things finally came to a head when I was around 11 or 12. My Mom and my Step-Dad had taken us on a camping trip. I loved my Step-Dad, he was stern but always a nice guy. He was much nicer to me and my brother than my Dad ever was. Now please remember, at this point I'm a little kid so my decision making wasn't exactly the best at this point in life. I was in the backseat of my step-dad's truck, it was a Ford F-150 with the suicide style doors, the drivers door had to open in order for the back doors to open. Well my step-dad had been doing something with the track of the driver's seat. Being a somewhat annoying 11 year old I was flicking the driver's seat belt with my foot. My step-dad asked me to stop, but I didn't. I thought I was being funny and I kept doing it, well he got upset with me and punched me in the knee and yelled \"STOP!\". Now my heart just shattered. This guy that I really liked, more than my real Dad had just hit me. Something I never ever thought that he would do. My Mom talked to me about it and explained that my step-dad was having a bad day and that he felt terrible about it. Thinking back on it he did feel terrible, I remember seeing him walk around the camp site all day looking ashamed. I was just too young at the time to really understand. We came home from vacation and for whatever reason, I told my Dad what happened. My Dad freaked out, \"HE HIT YOU!? HE HIT MY SON!?\". My Dad immediately got on the phone with a lawyer and brought my mom and step-dad to court. He wanted full custody. I had no idea that that could happen. I didn't know that was a thing. After a few months, my dad won custody of me and my brother. We didn't even know what was happening. It was just like any other day. We woke up at our dad's house, we went to school, we came home and our dad told us not to take the bus to our mom's house on Wednesday and then told us that he'd won in court. Our mom would call us to talk but my dad would rarely give us the phone to talk to her. My mom was poor, she spent all of her money making sure me and my brother were happy, and now she's pregnant with a daughter, she's just in a bad financial situation. My dad however is doing decent so he was able to hire some solid attorney. My mom fought every single day, saving every single penny so she can hire a lawyer to get custody back of me and my brother. About 6 months later she did, we lived with her full time.  No more beatings, no more abuse. My mom did her absolute best to make sure my brother and I were happy. I was a messed up kid though, around 6th and 7th grade I started to get out of control. I had so many emotions that I didn't know how to deal with. I was so angry. I was  irrational. I would talk to my dad a couple times a week and he would trick me into thinking my mom was the bad guy. It was a constant mind game with my dad. I was confused, I was pissed, and I was getting into trouble. Going to school was torture, I was bullied constantly. Every single day I had anxiety going to school. I was getting beaten up, bullies were stealing my stuff, breaking my things. Coming home from school was no better. My mom would be mad at me for something stupid I did at school. My dad would call me and make me think my mom was a terrible person, rinse and repeat. \n\nHigh school came, what I thought was going to be the best days of my life was an empty dream. Problems at home kept up. Most of them rooted in my own issues that I wasn't recognizing. By time I hit my freshman year I was filled to the brim with anger. My dad had been telling me how he's changed, how he wants me and my brother to come live with him again. He would tell me daily how he's sorry for everything in the past, how he knows he was an asshole and how he's so sorry about every little thing. The constant mind games finally took over and I told my mom one night \"I want to go live with dad again, I want you to split custody\". She broke out in tears. I never understood why. What's the big deal? She sat in the kitchen balling her eyes out all night. I remember laying in bed that night hearing her cry all night. I don't think she ever went to bed that evening. My brother and I started living at my dad's house part time again. He was actually really cool for about a month. He was nice to me and my brother. He treated us really really well and it was great. Everything changed one day when I brought home my report card. I had been failing pretty much every class and even though he had been cool lately I knew that he had a mean side to him and I was scared to show it to him. I had the brilliant idea of hiding my report card in the woods as I knew he would go through my backpack looking for it. That night he said \"Hey report cards came out today right?\" and I told him \"Yeah they did, but they didn't give me mine\". What I didn't know, is that my neighbor had watched me hide my report card and told my dad. So he had known I was lying to him before I even finished my sentence. He gave me a weird, half confused, half angry look and asked \"Are you sure?\". I thought about it for a second, come clean, or lie? Come clean, or lie? I said \"Yeah dad I'm sure\". I don't remember much after that. The only thing I remember is waking up in my bed with a splitting headache. Apparently he'd punched me in the side of the head so hard it knocked me out. By no means was it the first time, but it felt worse this time, he seemed to be doing so much better. I cried myself to sleep that night. After that dad was back to being abusive as always. More often than not I would go to bed bloody and bruised. This went on all through high school. By some miracle I graduated on time in 2008 and this was really the beginning for me. I'm an adult now. I make my own rules. Life is going to be better. \n\nFresh out of high school I got a job at a local grocery store. Produce clerk. And a damn good one. I could unpack and organize AND rotate a full case and display worth of apples in about 30 seconds. Oh yeah, bow to the king. I befriended some of my co-workers. I had my first real friends. I was invited to parties, I was invited to smoke weed for the first time, I had a social life. Oh and I had moved back in with my mom. Life was sweet. I was making money, I had my own car, I was an 18 year old bachelor living the dream. I would work all day, and with my friends, we'd go to a party. Because these were the first friends I'd ever really had, I did everything with them. Even things I wasn't sure about. Smoking pot for the first time, driving our cars really fast on public roads, taking mushrooms for the first time, losing my virginity, the good old days.  Even though I was enjoying my life I still had this little seed of pent up aggression flowing through me. Even though I was happy, I was still angry. I was angry that I was 18 years old and I had JUST started making friends. I was angry that while my friends were telling stories about fishing with their dad's, I was making up stories about playing sports with mine because it was easier than telling them the truth. I'd been introduced to some slightly shadier people and I found myself experimenting with a lot of drugs. They made the anger and anxiety go away. Then one day I found the cure to all of my pain. \n\nA friend of mine gave me a percocet one day. I crushed that little blue pill into a pile of powder and sucked it up my nose. All of that anger, all of that hatred, all of the anxiety....it just vanished. I felt happy. I felt free. I just flat out felt good. For the first time in 18 years I physically and mentally felt good. 2009 was a rough year. I had started messing around with opiates really heavy. I had tried mushrooms, acid, cocaine, crack, weed, alcohol, but opiates were the ones that really fixed everything. It started off with 15mg of percocet, that 15mg would make me feel amazing. Within a week I needed the full 30mg pill to feel good. In a very very short amount of time I need 60mg, and then 90mg, and now I found OxyContin. One of those 80mg pills sent me in a warm, thoughless, painless haze. No worries, no problem. Nothing bothered me. The anger towards my dad vanished, my hatred towards the world dissapeared. All I wanted to do was chase that high. It was that fateful night that my dealer told me he had no more pills that sent my life into a downward spiral. I remember sitting in my room, scrolling through the contacts on my phone and my Facebook asking everyone I could if they knew where I could pick up. The feeling of withdrawals slowly creeping in. I remember texting a friend of mine \"Hey man, do you know where to get some 80's?\" and getting the mysterious text back saying \"No, but I can get something better\". I didn't even ask questions, I hopped in the car and picked him up. Now this friend was't a good friend, he was more of an acquaintance. I had hung out with him a few times with a larger group of friends, and he was always known as the \"drug guy\". This kid could find anything. I picked him up at his house and drove into the heroin capitol of Connecticut, Waterbury. I didn't ask much, I gave him $100 I had in my wallet, he hopped into a random car and came back 30 seconds later. He said \"open your hand\" and I did, he dumped about 15 wax baggies into my hand. I was so confused, I had no idea what it was, I honestly thought we were getting some type of pill I'd never heard of. I asked him \"what the hell is this?\" and he chuckled a little bit before saying \"heroin dude\". Heroin?? I don't do heroin! Heroin is for drug addicts and criminals! I do pills, I'm not a drug addict! I stared at the baggies for a second before I asked \"can I snort it?\". Once again he laughed and said \"yeah man for sure, I mean shooting it works way better but yeah, snort one of the bags and see what happens\". To this day it still scares me how little thought I put into it. I was feeling the withdrawals of the Oxy's and I just wanted to feel better. I pulled my debit card out of my wallet and a dollar bill. I poured the powder out of the baggy onto the debit card, rolled up the bill and inhaled that pile of powder. Fuck me if that wasn't the best feeling of my life. Even the taste in the back of my throat was absolutely fantastic. That is the exact moment I lost everything I was as a person. I went home and snorted bag after bag, late into the night. Sitting in my computer chair half naked, nodding in and out of consciousness. I was hooked, bad. I kept telling myself \"as long as you don't inject this stuff you're not an addict, you're fine\". This went on for quite a few months. My tolerance was building up quick though. At one point I could snort one bag and feel great, one turned into two, two turned into three, three turned into four, four turned into five, so on and so forth. \n\nThe night came where I only had enough money for 5 bags worth of dope. I called up my buddy so we could go pick some up. On the drive I told him how I could only buy a few bags and that was only going to get me one line worth of powder. He turned his head and looked at me with the most pure evil, devilish look I have ever seen on a man and he pulled 2 needles out of his jacket and smirked. I told him \"I don't inject it man, I hate needles\". I swear he must have thought I was such a square, he said \"look man, it's easy, I'll bet you could shoot one bag and be good, it works so much better if you shoot it\". The scary thing is is that's all it took to convince me. I didn't even second guess him. We met up with the dealer and we picked up our stuff. We sat in my car in the parking lot of a Dunkin Donuts and he gave me the full run down. He taught me how to mix up the dope with water, how to suck it up through a cotton ball, how to find a vein, how to shoot. I've never been so scared to do something in my life. I was so scared of that needle, he held it in his hand, I had my belt wrapped around my arm, trying not to look at the needle, and then he said it \"let's rock and roll\". I felt the needle pierce my skin, I looked down and I saw my blood pulling back into the needle, and then he pushed the plunger. That golden brown solution pushing into my vein and it was heaven. It was as warm as a hug from your grandmother. Every little problem I had melted away as that rush of heroin coursed through my veins. It was perfect. \n\nI was a bit naive back then. I didn't really understand how heroin addiction worked. I had heard of heroin addicts, but I didn't really know what it meant to be one. That's a lesson I learned first hand. It took a disturbingly short amount of time before I was shooting up every single day, multiple times a day. Every dollar I earned went straight into my arms. Even on those nights where I shot up and blacked out, pulling out of it with a huge gasp of air, it all seemed worth it. I kept trying to push my limits. I wanted to see how high I could get. I don't even know how many times I should have died, or how many times I did die and somehow came back. My poor mom, the day she found one of my needles, she was absolutely heart broken. The look on her face, I've never felt so guilty or ashamed in my entire life. The women who did her absolute best raising me had to look at me and know I was a junkie. The women who broke her back to make sure I had a good life, the women who worked so hard to get me away from my father was absolutely ashamed of who I had become. I was shortly after kicked out of her house and was living out of my car. I had lost my job, the roof over my head, my friends who weren't junkies stopped hanging out with me, my car was on it's way out. Over the course of about a year I had turned into a person I had never imagined I would possibly be. The next year was pretty much just a mess, I had gotten arrested, stayed homeless, kept doing drugs, I was an absolute wreck. My mom saw me sleeping in my car in a parking lot one night in the middle of winter. For those of you who don't know, Connecticut winter's can be pretty intense at night. I'll never forget some of those nights where it was -10 degrees outside. The heat in my car didn't work so I was stuck in an ice box. My skin was so cold my needle wouldn't even pierce my frozen skin. She called me the next morning and begged me to check into rehab. I knew I needed to clean up, but I honestly didn't want to. I loved doing heroin more than anything else. No matter how badly it ruined my life I loved it. But I wanted to make my mom proud of me again so I checked into a clinic. That was the worst thing I could have done. The place I checked into was an absolute dump. The house I was staying in had roaches, the house manager was there for about an hour a day, no one was drug tested, and there was a heroin dealer across the street from us. Our parents would send us money for \"cigarettes\" and \"food\" and \"toiletries\" but we were just using that money to get loaded. I came out of rehab telling my mom I was \"90 days clean\". I guess technically at that point I was a couple hours clean but that was about it. The first thing I did after I got home was take some of the cash I had saved up that my mom had been sending me, and I bought dope. I got another job shortly after and I just kept on using. I learned how to hide it really well. I lived under my mom's roof, freshly rehabilitated, and she was proud of me for sobering up. I've never felt like such a piece of shit in my entire life. I had to keep using to get rid of the immense amount of shame I carried around with me every single day. \n\nI came home from work one night, freshly doped up and my mom wanted to have a \"talk\". She had just wanted to check up on me, see how I was doing. She was telling me how she was worried about me, how I was growing more and more distant, avoiding her and my family. As hard as I tried, I couldn't stop nodding off in front of her. She knew pretty quick that I was high. She reached across the table and pulled up my sleeves, my arms littered with track marks. It had now been about a year since I had been to rehab, but she knew she didn't want me to go back there. And now I really wanted to clean up. I was sick of being the person that I had been for the last 5 or 6 years. We decided together that an outpatient suboxone program was my best bet. We found a local doctor, and I agreed to update her on everything that was happening. \n\nI worked so hard, and my mom helped me at every single step along the way. That was the hardest thing I ever had to do. My dad had known about everything that was going on as my mom was updating him. But the last time I had talked to him he told that I was dead to him. He told me that he would never call me his son again. He told me he hated me. But my mom was there, she never ever gave up on me. Before you enter a suboxone clinic you have to be at least 48 hours into withdrawals. While I laid on the couch sweating, and shaking, vomiting and shitting in my pants, my mom was right there to remind me that better days were ahead. Thank you for everything mom, I love you more than you could ever know. God dammit I'm welling up over here. \n\nSo let's fast forward to today. I've been clean for about 4 years now. I still live at home with my mom at 28 years old. It's embarrassing but my dumbass lost so many years to drugs I'm about 6 years behind on life. I know this story is a bit depressing and I'm sorry about that. But here's the thing, life is tough. It throws you curveballs. Life is never a straight road, there will always be bumps and u-turns along the way. How we handle those obstacles is what makes us who we are. We all make mistakes in life, we all go through trials and tribulations. But those times of hardship are what make us who we are, they are what help us become stronger people. You know the old saying \"It's always darkest before the dawn\"? It's true. There is always a light at the end of the tunnel. As bad as things seem like they may be, there will always be a bright side. No matter what you're going through, no matter how terrible things can be, if you push on, if you put in the hard work, if you never give up and never let yourself stray too far away from who you truly are, you'll always be okay in the end. If you're struggling with mental health issues, if you're struggling with addiction, if you're struggling with an abusive spouse or parent, please, please reach out to someone. We all deserve to live our best lives. We weren't put on this planet to struggle day in and day out. As I'm writing this my abusive father is laying in his bed dying of cancer.  And I honestly am not that concerned about it. I know that's a terrible thing to say but forgiveness is still something I'm working on. It's okay to be a \"work in progress\". It's okay to not be the \"perfect\" version of you. Don't ever give up on yourself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bj06yz/forgiveness_forgetting_finding_peace/", "title": "Forgiveness, Forgetting, Finding Peace", "social_network": "reddit", "user": "TheOddSenses", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1556606573, "permalink": "/r/DecidingToBeBetter/comments/bj06yz/forgiveness_forgetting_finding_peace/", "nsfw": false, "first_save": 1635437179.452876, "replies_charged": false}