{"id": "t5_2tand_t3_edj7z6", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": " \n\nYou would give 0 fucks about anything at all, improvement, self-betterment, family, friends, evolution, desires, wants, trying to imagine different things, using your mind to think all the time if you only had one thing - LOVE  \nIf you had a loving presence in your life that would be pampering you 24/7, being so gentle with you, letting you do whatever you want and letting you be whatever you are, no judgements, no hate, pure love, peace and joy radiating completely from this presence and it is all yours.  \nWe do not need anything else other than this. We can say throughout our whole lives that we want X and we want Y but these are all complete lies in order to come for the fact we do not have true, blissful love in our lives.  \nBecause of this we let our egos do whatever they want, chasing money, chasing girls, chasing whatever the fuck he wants because the ego already gave up on true love. Ego gave up on true bliss. Ego gave up on peace. Ego does not know these things, so whenever there is even a slight desire for this truth in your heart, it will say anything but words of encouragement to follow this hearts desire. Ego literally despises this true bliss, joy, love and peace. He gives 0 fucks about it.\n\nAnd when you are asked \"if you could just be your self without having to do anything, would you accept?\" you say:  \n\"No, I want to improve. This is our purpose. We have to get better. We have to improve ourselves. It is all about the journey, not the destination\"  \nWho the fuck are you kidding? Absolutely fucking LOL dude, LOVE is ALL there is, and LOVE is all the fulfillment, contentment and all you will ever fucking want to ever experience in this life. Everything else is BULLSHIT and you know it.  \nCome on guys, its time to wake up. It is time to abandon this fearful ego that denies him self love and stop following him and we should start following our hearts. Our hearts know what best. LOVE.  \nLove is the one thing that if you feel, you literally do not want anything else. It is pure bliss, pure contentment, pure fulfillment, purer than purity it self.  \nBe honest with your self, if you had your beloved right beside you in this moment, would you go after superficial things, chasing highs, chasing money, chasing fame, chasing acceptance from other people who you give no flying fucks about?  \nYou would sit still, sit silent, completely at the feet of your beloved, humbled forever and you would give up your fucking life for this presence to be with you at all times till the moment this body dies.  \nFollow your heart as it IS all you are ever seeking for. You **are** this. You **are** your own beloved.  \nNext time someone tells you \"you are doing nothing? you are not trying to improve the world? you lazy fuck!\" it is fucking obvious this person has no knowledge of the love in his heart.\n\nIf people knew of love, true love, not this fake romance bullshit that was created by the ego in order to satisfy its lowly desires, I am talking about REAL LOVE OF THE HEART, nobody would fucking do ANYTHING AT ALL instead of simply live in bliss, exist in their own heart asking for absolutely nothing from anybody at all.  \nGo sit with your self. Get to know your self. For FUCKS SAKE wake up to your own love.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/edj7z6/you_only_want_to_improve_and_be_better_because/", "title": "You only want to improve and be better because you miss this one thing in life", "social_network": "reddit", "user": "redditKeyy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1576891379, "permalink": "/r/DecidingToBeBetter/comments/edj7z6/you_only_want_to_improve_and_be_better_because/", "nsfw": false, "first_save": 1635435638.2443256, "replies_charged": false}