{"id": "t5_2tand_t3_pwmamx", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "5d0f6d96-af53-4a9d-aba2-c5967c631e40", "c67213dc-0eed-4cac-a781-9bc082742908", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "883794f3-030f-4844-8950-6e28281dfa3f", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "What behaviour or tendency, that served us in the past, ceases to serve us in the modern world?\n\nThe environment today is fundamentally different from our hunter-gatherer times, yet our brains run the same software, now filled with **“bugs” - tendencies that are suboptimal or counterproductive in the modern world.**\n\nTo live with these bugs is “natural”, while trying to override them is the “unnatural” way (which I argue is more optimal in our modern circumstances).\n\nThis post introduces some of those bugs and gives a few ideas on how to start debugging. \n\n## Bug: Trying to solve it in the external world instead of internally\n\nIn the past, the biggest problems were external. Food. Shelter. Warmth.\n\nToday, our personal problems are almost never external.\n\nWe believe we’d be happy if only our physical environment was perfect (that is, if we owned a mansion with 2 lazy rivers). In reality, happiness is a problem solved internally. No matter the circumstances, we can’t escape our thoughts.\n\nHere’s where we get tricked: our internal problems manifest in the external world all the time, so we falsely believe the problem is external. \n\nWe spend our entire lives trying to get rich to fulfil our consumerist desires. Instead, we should look inwards for the causes of that desire - attention-seeking, insecurity, lack of meaning - and work on those. Not looking a certain way is a symptom you could work on for decades, which is enough time to address the real problem, social comparison. More relationships won’t fix the relationship you have with yourself.\n\nFew problems today are external, but we act like all problems are. A shift inwards is needed.\n\n#### How to debug: \n\n* Understand the real problem, not the symptom. Why is this a problem? When does it manifest in the external world? Where does the problem come from? (A problem we’ve inherited from the past or something unique to you?)\n* While you work on the problem, it’s also important to understand its symptoms so you don’t get distracted. What would happen if you simply ignored the symptoms (knowing they are in your head, not actual, physical problems)? Sure, you’re not sipping cocktails on a beach - but how could you be happy right now?\n\n## Bug: Linear thinking\n\nLinear relationships are common in the natural world, not so much in the social world.\n\nIn linear environments, if you run for a minute, you can expect to be a few hundred meters away. You pick berries for an hour, you can expect to eat off of it for a day. You wait a month, your hair has grown 1cm. Things have a fairly constant, linear relationship.\n\nIn nonlinear environments, things can behave exponentially and there is high variance between outcomes for seemingly similar inputs. If I invest $1000 and wait 10 years, I could end up with a million or $0, depending on whether I bought the next meme stock or a company that goes bankrupt. If I spend 5000 hours writing and publishing a book, it could become a worldwide hit or simply decorate my mom’s bookshelf. \n\nThe bug in our software is thinking linearly when we should think in exponents. \n\nIf you think linearly, you believe getting rich is tied to how many hours you work. Linear thinking has you believing the world 5 years from now will look similar to the world 5 years ago, even though many things grow exponentially, not linearly.\n\nThose who can think exponentially outgrow those who think linearly. Why someone achieves 10,000x more than another cannot be because they work 10,000x harder, but because they take advantage of exponents, often through leverage of some sort - money, employees, the internet.\n\nIn the modern world, whenever you’re thinking linearly, you’re making an assumption that growth is limited by something, usually physical factors. You won’t see exponential curves in muscle growth or endurance, rather, growth diminishes over time, as we get closer to physical limits. If it’s got to do with people, money, the internet… there’s probably no “ceiling” and exponential thinking is closer to reality.\n\n#### How to debug:\n\n* Determine: are we dealing with something that has physical restrictions or is practically restrictionless? Is non-linearity possible?\n* Practice guessing in nonlinear environments. Getting your mind blown enough times, you’ll update your thinking from linear to exponential.\n* If you have things that can compound, stay patient and trust the process. It’s hard to appreciate exponential growth until you experience it first-hand. The growth looks linear, until it doesn’t.\n\n## Bug: Scarcity mindset\n\nThe problem in the past: not enough food, resources, info.\n\nThat scarcity led to conflict and competition.\n\nToday, the problem is rarely scarcity. Rather, we limit ourselves out of a false assumption that something is scarce.\n\nA person who thinks ideas are scarce keeps them hidden. A person who knows ideas are abundant shares them, gets feedback and widens their perspective.\n\nIf you think success is scarce, you’re more self-centered and less helpful - the stereotypical shark in the workplace. Helping others, being generous and acting like success is abundant will open more opportunities, hence leading to success.\n\nA scarcity mindset leads to competition, an abundance mindset leads to cooperation. If you think win-lose instead of win-win, you restrict yourself to playing with others who compete rather than cooperate. What a problematic life, created because our brains never got the memo that there’s plenty for everybody.\n\nAn abundance mindset will help you form long-term relationships, but it’ll help in single-player games as well. If you think opportunities are scarce and you miss one, that’ll sting real bad and you’ll dwell on it. Same with losing money. But if you think in abundance, you’ll bounce back.\n\n#### How to debug:\n\n* Practically nothing is scarce anymore. Information is abundant. Ideas are abundant. Money is abundant. Human connection is abundant. Success is abundant. What do you think is scarce but really isn’t?\n* Because things are abundant, the default strategy shouldn’t be competition, but cooperation. Try being much more generous than you need to be and see what happens. If you give, you shall get.\n* Reflect on a goal you’re aiming for. Who could you collaborate with to make this goal’s achievement easier? Is a false assumption of scarcity preventing you from cooperation?\n\n## Bug: Short-term focus\n\nIn the past:\n\n* Tough to store stuff\n* Things didn’t compound\n* Survival not guaranteed, better use it / eat it now\n\nLike a child living in poverty is more likely to “fail” the marshmallow test \\- they aren’t sure about the future and prefer to eat the marshmallow now - our genes are cautious of what the future may hold and prioritize the present over the future.\n\nOvercome this natural tendency and much of self-improvement becomes easy. Most issues emerge when you choose ‘now me’ over ‘future me’. \n\n#### How to debug:\n\n* **Establish personal rules to force long-term focus**. “If being fit is important to you, have a rule not to buy junk. If stress-free investing is important to you, have a rule to never buy individual stocks. Discipline is easier when it’s ‘outsourced’ to a rule you cannot break.”‍\n* **Use tools to your advantage**. If you work too much, book relaxation time into your calendar and respect it. Auto-block social media sites until lunch time to get a productive morning, and so on.‍\n* **Break bad habits and form good ones**, for example, by designing your environment with the long-term in mind. Get smaller plates to eat less, leave fruit on the table to eat more of them, fit a pull-up bar to your doorway and crank a few every time you walk past.\n\n## Bug: Overconfidence\n\nYou’ve probably heard something like “93% of people think they are better-than-average drivers” or “101% say they are better than most at identifying false stats”.\n\nThis illusory superiority, or overconfidence effect, may be explained by social status: if someone’s confident about it, we tend to believe them and take their advice, and if we take their advice, they are more important in a group. Or, maybe more importantly, overconfident people tend to have better mating success than overly shy people.\n\nToday, overconfidence may bite you in the buttocks. Thinking you’re an above-average investor is an easy way to lose money, or believing your startup is the next Google may leave you on food stamps once it fails.\n\nOf course, we need some level of confidence or we wouldn’t be starting companies or taking risks. **But there’s an important line between understanding your limits (and taking informed risks) and thinking you have no limits (and being blind to risks).**\n\nToday, we can outsource practically anything, or at the very least, we can learn how something should be done, with no friction, on YouTube or Google. There are few reasons, other than preserving your ego, to be overconfident. \n\n#### How to debug:\n\n* **Believe the base rate**, the average outcome for an action. The base rate for headline-worthy startup success is probably less than 5%, and the average time to learn basic Finnish is 1100 hours, not that you were asking. Unless you have special considerations as to why the base rate doesn’t apply to you (and everyone thinks they have special considerations), you should probably believe it to reduce your overconfidence. So one part’s believing the base rate, the other part is understanding your strengths and weaknesses (as objectively as possible).\n\n## Bug: Seeking social validation\n\nCaring about others’ opinions was beneficial in a tribe of 150, not so much in a tribe of 7 billion. If Ben from work doesn't like you, your life expectancy won't go down.\n\nBeyond a smartphone addiction, seeking validation may trap you into a life you’d rather not live. We’re capable of quitting our jobs and moving to a hut in Western India - or just getting an experimental haircut - but don’t because “what will they think?”. If you don’t care about social validation, you can make radical, rather than incremental, changes to your life. Getting where you want to be quickly rather than slowly.\n\n#### I’m currently trying these debugging methods:\n\n* Restrict access to social media. Obviously.\n* Understand the game you play. Others play a different game. \n* Do things for yourself, not for social validation. If you do it for validation and don’t get it, that hurts. If you do it for yourself, you’re invincible: whether they like it or not is irrelevant. What’s something you’d do even if no one complimented you on it?\n* Surround yourself with open-minded people (and remove the judgmental folks). \n\n## Bug: Fear\n\nFear in the past: “Was that a lion roaring 2 meters from me? Or just my hunting mate’s hungry stomach?”\n\nFear today: “If I screw up my presentation, Ben from work will think I’m no good with Google Sheets.”\n\nI’m exaggerating, but point being, fear used to save our lives, but if you’re reading this, you don’t get your life threatened very often (I hope?).\n\nSo is there a point to feel fear anymore? (I’m mostly referring to fear of failure and uncertainty. Fear of darkness / snakes etc is still helpful and all.)\n\nWe don’t die very easily in the modern world. Failure and uncertainty are never as big of a deal as our primitive brain would like us to believe. Much of our fear is a relic of the past, something we can remove in our safe environment.\n\nToday, all of us have access to the same information and tools, and you can be the craft of your own opportunities. Someone who’s where you want to be probably didn’t get there because of outstanding intellect or ability, but because they didn’t let fear stop them, over and over. \n\nDebugging fear from your software is like removing all self-imposed restrictions. Our biggest constraints are not physical, but internal. \n\n#### How to debug:\n\nFear is one of the most deep-rooted bugs, because it used to serve a central role in our survival. So we can’t just rationalize “okay, all fear’s not that useful anymore” and expect it to work. Like in exposure therapy for treating phobias, we need to go step by step.\n\n* You may start by texting an old friend or someone you kinda know, asking how they are\n* Maybe ask for a small discount the next time you buy coffee\n* Post something you wouldn’t normally post (like an unflattering photo)\n* Try something you’ve been too afraid to try (something small like a weird dish in a restaurant or bigger like skydiving)\n* ...\n\nLike building muscle, your ability to override fear will improve through consistent and progressively increasing weight.\n\n## Bug: Tribalism / identity \n\nIn the past, defending your tribe and feeling strongly connected meant good for the survival of the tribe.\n\nThese days, the negatives of tribalism can outweigh the benefits.\n\n* Stereotyping, demonizing and disregarding other groups\n* Unwillingness to change our beliefs or actions because of the group we identify with\n* Dealing with bad treatment from an employer or family members for far too long than we should\n\nSure, there are benefits too, some important ones that bring meaning to our lives. I get excited when my tiny Finnish nation gets mentioned on the interwebs, I’m not denying that. But we should distinguish when a sense of identity serves us well and when it doesn’t. \n\nSayings like “Nothing is more important than family” and “Blood is thicker than water” are a testament to how meaningful a sense of identity can be to us humans, but that same sense of identity can cause you to go back to or tolerate a group that mistreats or abuses you. We shouldn’t need to endure suffering today just because identity used to be important for human survival.\n\n#### How to debug:\n\n* Read widely, process ideas from contradictory groups, pin down your core values, establish what you care about and want to achieve. No tribe matches your thoughts and values like a tribe of one does, and if it feels like it, they weren’t your thoughts and values to begin with. Become an individual before you become a member of a group.\n* Resist fear and the need for social validation. See above.\n* Consciously debunk stereotypes in your head. Process negative comments about your group instead of rejecting them. The impulse comes naturally. What happens after that is up to you.\n\n## Conclusion\n\nWe tend to follow our natural inclinations, many of which are suboptimal or counterproductive in the modern world. Whatever we think or do naturally may not serve us anymore. \n\nTherefore, debugging allows us to be more in control of our lives, and since it’s hard, few do it, so it can lead to above-average results in whatever you try to do.\n\nGet in the habit of identifying these bugs, then systematically remove them.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pwmamx/how_to_fix_the_bugs_in_your_brain_software/", "title": "How to fix the bugs in your brain software", "social_network": "reddit", "user": "JaakkoJarviniemi", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1632764538, "permalink": "/r/DecidingToBeBetter/comments/pwmamx/how_to_fix_the_bugs_in_your_brain_software/", "nsfw": false, "first_save": 1635435128.2866669, "replies_charged": false}