{"id": "t5_2tand_t3_kh4dq4", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I’m 26, currently in bed with covid (woot), alone in my studio apartment staring at the ceiling.\n\nI have to say, i’m thankful for this virus... it’s forced me to slow down and reflect on areas on my life.... my brokenness... my past and how it’s led me here.\n\nGrowing up I didn’t feel loved by my family. My dad and mom moved to America and I stayed in China with my grandparents for a few years. I felt abandoned. In the states, I moved a lot for my dad’s job so there were many times when I didn’t have many great friends. Doing life and fitting in always felt like an uphill battle. I wasn’t really good at too many things.. I had so many insecurities and inner pains I tried to bury.\n\nBy high school and college, I was able to channel a lot of my insecurities and traumas into people pleasing. I was GOOD at making people like me because I had figured out the algorithm. I became addicted to approval and affirmation from others because I lacked that in my childhood. I filled those voids with social media likes and maximizing my social circles. I used alcohol and partying to escape reality multiple times a week.\n\nNow that i’m 26... I realize that i’ve wasted so much time chasing empty things in order to “heal” and overcompensate for my childhood pains. I passed and pushed aside potential deep and meaningful relationships because the idea of committing to one person scared me. I didn’t develop any hobbies because the only thing I wanted to focus on was finding ways to get other people to like me. I’m still not close to my family... and I don’t feel like many of my friends genuinely understand me either.\n\nI know that by writing this out, I can begin change and the healing process. I can and I will find purpose in this life. The beauty of life is that you can continue to transform and recreate yourself whenever you realize your present self no longer serves you.\n\nI wanted to get this off my chest and close this chapter in my life.\nI’m sick of living for others, and i’m sick of letting my past define me.\n\nIt’s time to wake up. It’s time to find purpose. It’s time to fall in love. It’s time to stop being a cynical child.\n\nEdit: Wow did not expect this to blow up. Thank you guys for all the love during these dark covid times. I will respond more individually when i feel better. Happy holidays! \nAlso I see some “bro” and “girl” comments so just wanted clarify that I am\nmale. 😂", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kh4dq4/ive_wasted_the_last_10_years_of_my_life_chasing/", "title": "I’ve wasted the last 10 years of my life chasing empty things and I’m ready to start over.", "social_network": "reddit", "user": "PayrollPrince", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2006, "down_vote": 0, "creation": 1608504999, "permalink": "/r/DecidingToBeBetter/comments/kh4dq4/ive_wasted_the_last_10_years_of_my_life_chasing/", "nsfw": false, "first_save": 1635435402.8219597, "replies_charged": false}