{"id": "t5_2tand_t3_jevhsu", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Past year has been a roller coaster of emotions for me, let me explain..\n\nWhen I was in college, I had lots of friends, girlfriends, was the happiest I’ve ever been ( so I think ) .. but then life hit me hard. I’m not going to go into all my issues but basically life had me on my knees crying out to God for the past year.\n\nI’m 25, I just finished college ( looking for a career job now ) , I’m training for a marathon and triathlon, I love yoga, and I want to get into Jiu Jitsu. But during these hard times last year I cut off all my friends who I felt were holding me back from being who I wanted to be. These friends didn’t go to college, talked down on others, and had very high egos. \n\nThe past year has been rough because my older brother who still lives at home is battling with a pill addiction for 10 years now, my family vibe isn’t as great as it use to be, but I’m still holding on and trying to pursue my goals in life. I know some people have it much worse, and come out stronger in the end. Why is it that some people can overcome very very hard things ? But my issues are well more less than there’s and I’m struggling with it so much ? What am I doing wrong?\n\nBasically my question is this, I’ve been feeling super lonely while chasing my goals. I don’t want to go out to parties, I feel like I just don’t want to hangout with people who aren’t pursuing to better themselves in life.  What do I do ?? Any advice to get me out of this lonely feeling ? Am I being too soft ?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jevhsu/overcoming_loneliness/", "title": "Overcoming loneliness?", "social_network": "reddit", "user": "_justbreathe__", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1603218549, "permalink": "/r/DecidingToBeBetter/comments/jevhsu/overcoming_loneliness/", "nsfw": false, "first_save": 1635438268.4148226, "replies_charged": false}