{"id": "t5_2tand_t3_ohjl4c", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "For the past few months, I've (28m) been coming to terms with my past use of porn, and that it's reached levels of addiction. While it might not of been something I did every day, I began overtly normalizing its use and the escalation in the content of in which I consumed (never looked at or went looking for CP or used dark web sites, etc). I noticed that over the past few years, I began sprinkling in 4chan \"shouldn't share\"/revenge porn threads every now and then. It never was an everyday, go-to thing (or even every week), but something once in awhile I'd decide to look at. I was attracted to the taboo-ness of it; the amateurism; knowing it wasn't necessarily faked. While I never posted any pictures of women or comment vile things, I would every now and then comment on a picture if there was \"more\" and/or if there were women from my state. I usually didn't save images, but have on occasion (only to be deleted pretty quickly after). God, looking back on that, makes me sick. I feel mortified just writing that, knowing how much it goes against my morals. But because 4chan is heavily moderated to very quickly remove illegal content even on /b/ (i.e. CP, r*pe, murder, etc), I didn't think much of it. \n\nFlash forward to the present. Due to my OCD, it's actually been a somewhat blessing in disguise. I was having obsessions about if I accidently viewed illegal content online and the paranoia surrounding it, but it opened my eyes to normalization of porn in my life. It all clicked. I haven't visited 4chan since towards the beginning of the year, and have actually cut out porn/MO for the past few months in general (currently about a week and a half out from my 60 days clean mark!). After talking to my fiancee about my struggles and my openness to get help to be a better partner for her and our future family, it became the easiest decision I've ever made to do so. More importantly, I'm ready to be an ally towards fighting the content I viewed. I'm not sure just yet what the best place to start with that is, whether it be financially in donations to organization or just spreading awareness to problems surrounding this content, but the first step was stopping to visual support that content by just viewing it.\n\nEdit: to clarify, I'm not completely against porn or erotic content. With platforms like OnlyFans and others that provide women the ability to express and celebrate their sexual nature and bodies who want to, I'm totally for that and female empowerment. It's the questionable and consent-less content that is pretty disgusting.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ohjl4c/decided_to_quit_consuming_porn_and_start_becoming/", "title": "Decided to quit consuming porn and start becoming an ally", "social_network": "reddit", "user": "KeyboardWarrior_2019", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 85, "down_vote": 0, "creation": 1625926918, "permalink": "/r/DecidingToBeBetter/comments/ohjl4c/decided_to_quit_consuming_porn_and_start_becoming/", "nsfw": false, "first_save": 1635435547.3093374, "replies_charged": false}