{"id": "t5_2tand_t3_m0yhhe", "request": ["828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "Hello everyone, i'm 18, sometimes i feel a bit hopeless, i want to be better, but i don't know what to do, i've been working on myself recently and tried to connect with people after some time (i got one friend that leaved the country for a better quality of life). I'm not very social and tend to be awkward, always wondering what people thinks about me, overthinking every move on myself. I feel so lonely that i think i will be like this forever, i want to feel loved, not exactly by my parents, but for someone special. \n\nNevertheless, i try constantly to improve myself, doing some hobbies (although not on a really constant basis), developing my curiosity and trying to have a better perspective on things, eventually i got a bit out of my comfort zone, and i tried to meet new people, so a girl from the class where i am needed some help and sometimes we helped each other, we eventually tend to talk on a regular basis, i'm oblivious to relationships and social interaction since people just wanted me for homework and understanding topics, and to this day, i get too attached to people and also am concerned / suspicious about if they want me as a friend or if they just want me for their work and then leave.\n\nTo continue on the story, very surprisingly we had a lot of things in common, and shared good laughs and quality time, then she makes what i think it was a move and said \"Hey, what if we meet each other? I would like to know ourselves better\" I was at that point scared but agreed, then at the other day, it was amazing, even while i was almost trembling of the anxiety and scared of create a bad experience, it was an interesting, joyful woman that had a lot of my nerdy interests ( i'm somewhat into science, philosophy and art) and she gives me a hug. Then i tried to invite her this time and I said i had a great time, she related to it, and i think she was excited of going out for a coffee then. In time, we talk and make a study group with another girl, which is also funny and we have a good time. But i was very attached to the first girl, i like her and then i knew she had a boyfriend (I saw in Facebook, so i sent a message asking and she said \"yes\"). I think she knew all the way along and didn't want to hurt me, but she also said \"hey the girl from the study group find you funny!\" which confirmed it for me.\n\nI was completely devastated, this happened 3 days ago, and sometimes it scares me that i don't feel like anything at all, today i got so broken that i cried for a long time with my mother and explained everything, she said that i have to go out more and try to have new, better experiences, i know this is true but to some extent i feel somewhat hopeless and i really have fear of eventually become insane because of isolation / rejection or become suicidal ( sometimes i get thoughts but i definitely don't want to do any of that). This has evolved into a constant anxiety and i feel a bit sick\n\nI also think i have some kind of Pure-OCD, although seeking for reassurance isn't healthy, i couldn't relate more to articles about it, i've had for some time a lot of the typical obsessions as becoming schizo, delusional, psycho, being narcissist, being sociopath, psycopath, recently homosexual, and a lot of fear of becoming more and more depressed eventually. \n\nThe worst part i think it is getting desensitized after the constant anxiety, feeling numb , but at the same time, knowing that one feels very bad on a deeper level, and talking to my mom alleviates it, and i will start tomorrow on doing more excercise and working at least on my appereance.\n\nNow, i feel even more down because of the study group can go separated because i inscribed myself on the other semester and they will wait until tomorrow, and there's the possibility of losing them because the courses will be full for that class (the different teachers sometimes give other contents) and i won't have any group to talk, or to at least socialize again.\n\nI feel a bit hopeless and that's what scares me, i want to live, i want to be better. Also, i'm not sure if i can afford therapy or medication, but if there's that possibility and things go worse i want to try it.\n\nSorry for the too long post and the bad wording / structure, it's late and i didn't have a good sleep at this point.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m0yhhe/problems_with_selfworth_and_selfsteem_want_to/", "title": "Problems with self-worth and self-steem, want to feel loved and less lonely and live my life instead of being obsessed with fears, but i don't know what to do", "social_network": "reddit", "user": "Weavereaver", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1615263254, "permalink": "/r/DecidingToBeBetter/comments/m0yhhe/problems_with_selfworth_and_selfsteem_want_to/", "nsfw": false, "first_save": 1635437344.703936, "replies_charged": false}