{"id": "t5_2tand_t3_p71vph", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I am observing how many young people, many in their 20s here on this site are dealing with anxiety, large questions about life, relationships, career and your future.\n\nI am reminded how stressful of a time that age was in my life too. In my 20s I was just released into the world having to fend for myself with no track record that I could do it. The optimistic assumptions I made at 16 are not as simple as you once thought. An end to a relationship or a job or an argument with someone appeared to be the end of the world... I did not trust myself and did not trust the world. This time came with many anxieties, pains and concerns... Sometimes paralizing.\n\nBeing many years older and having lived it, let me assure you, it was not the end of the world. Part of the lessons to learn during this time is that when you have a roof over your head and you have some healthy food for the day, you have all you need to thrive.\n\nThe most important relationship to work on during your youth is your relationship with yourself. Learn to do things to be proud of yourself. Create little routines that help you thrive. Start by making your bed in the morning. I do it every day when I wake up even now. When I look at that thing and am proud, that is win number 1!!!  \n\nNext routine: Forgive myself! I forgive myself for all the mistakes I made in my entire life and the day before, for being a bit lazy, for not knowing any better, not exercising as hard as I should have or could have, etc. Once I forgive myself, I forgive myself again. There is so much wrong making in ALL of us automatically: ourselves, our parents, friends, significant other, God, the universe, politicians, etc...  All of that chokes out life. All of that is avoiding dealing with what there is to deal with and our minds make it so much more complicated than it is. Forgiveness is the access to live in a much less smelly quarters.\n\nNext, exercise and healthy food. You need some exercise so your body tells your stomach to turn food into energy rather than store it as fat.  Then eat healthy food.  Food is fuel, nothing else. If you dream of being a lean, mean racehorse, food is only fuel.  It is not a means to cope, a little reward, a way to get over a relationship. The sooner you learn that the easier it is to cultivate healthy habits. The way to a healthy body and mind is 80% food / 20% exercise so pay 4 times more attention to what you eat rather than your exercise routine. It does not just impact your body but also your brain!!!\n\nNext: Get connected with your values, your commitments and you passions.  Write them down. Change them until you are proud of them and one with them. That is who you are... Don't write down things, write down ways of being such as: I am proud, respectful, tenacious, loving...  Whatever you connect with. That is what you are sculpting yourself into. And when you notice where you are not aligned with your body and automatic mind, try to act from your values and commitments rather than the impulse. This is a day to day battle: you against you and you will not always win. In the beginning you will loose out a lot. When you loose, go back to step number 2.\n\nFeelings and emotions: You have them and they are a hot mess. They are all over the place and I am not even including hormones. Learn to get over them when needed. OBSERVE them rather than BE them. Get connected to your values, your commitments, your passions and observe whether or not they are aligned.  A lot of times they are not. Learn that you are not your feelings. You have them and they do not have to run the show.\n\nA friend once gave me this beautiful saying: \"A caterpillar, when it turns into a cocoon, before it re-emerges into the world as a butterfly, must think that it is dying.\" This is what you are going through a lot in this phase of your life. You are working yourself out, you are learning lessons, you are getting connected to yourself, you are discovering your own power, etc, etc, etc...  And you are about to be reborn as a butterfly each time when you learn the lessons.  Your mission is to learn and you will learn. Life will poke you in the ribs until you do...\n\nI may have confused and even offended a few people off here. If so, I apologize. Only take what empowers you and serves you. I Love you all. And I so get what really a tough time of your life this can be during this cocoon phase.\n\n(And by the way, I still get those even in my 60s, but I learned to welcome them)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p71vph/my_20s_were_challenging_also_you_will_work/", "title": "My 20s were challenging also. You will work through it.", "social_network": "reddit", "user": "epozzo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 124, "down_vote": 0, "creation": 1629325881, "permalink": "/r/DecidingToBeBetter/comments/p71vph/my_20s_were_challenging_also_you_will_work/", "nsfw": false, "first_save": 1635435348.775098, "replies_charged": false}