{"id": "t5_2tand_t3_pft33v", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "c6df14ee-195b-4e9d-8032-7cca73d46fe8"], "text": "I've been feeling really caught up in the whole \"am I a good person\" scenerio recently. I've been reflecting on my past, who I was as a person the things I have done and the way others have treated me. And I can 100% say that I wasn't a great person. And even though at the time I was going through a lot personally, it doesn't make the things I have done or said excusable.\n\nThat being said, there have been people in my life who have taken advantage of me, friends have had ulterior motives, people used me when they knew I was vulnerable and I honestly was angry about it. I still kinda am. But I can now recognise that it was because I was a people pleaser and didn't have it in me to set firm boundaries with these people. Or I didn't want to admit that people who meant a lot to me at the time could be so deceiving. \n\nI have come to realise through this that there is no such thing as a good person or a bad person. We're all just people who make decisions based on our life experiences, there is no right or wrong. Only you can determine what your version of right and wrong is. And you can either continue to do the same shit on loop or learn for the future.\n\nI want to be \"better\" than what I was but I am done with beating myself up about the person I used to be. She did what she could, to the best of her abilities, at that time. All I can do is hope that I can become an evovled version of her. Hopefully by having this mindset, I can prove to not just everyone else but myself that I am no longer the person I used to be. Here's to growth and healing 🌱🩹", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pft33v/no_such_thing_as_good_nor_bad/", "title": "No such thing as good nor bad", "social_network": "reddit", "user": "ghhhptj", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1630500106, "permalink": "/r/DecidingToBeBetter/comments/pft33v/no_such_thing_as_good_nor_bad/", "nsfw": false, "first_save": 1635435131.2624745, "replies_charged": false}