{"id": "t5_2tand_t3_a00aa1", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "(Re-reading this I realize I ended up telling my life story.)  \n\n\nHere it goes:\n\n&#x200B;\n\nI work for a 10+ people email marketing agency. I'm kind of a \"coordinator/assistant\" for campaigns. I put the copy and the design into the software (klaviyo). I do the utm tagging of the links. I select the products that go into the product block. I handle the segmentation and scheduling. I fix whatever errors QA found. I write subject lines (I get 5 options but I keep track of the top performing ones so sometimes I come up with a better one). I create the discount codes in Shopify. I do some other miscellaneous things like putting copy and design into apps like recart, uploading lists into klaviyo, small edits for landing pages. I set the resends. I put all the right links in. And probably some other things I can't remember right now.\n\nI've been working there for one year. Previous to that I used to play online poker for a living. I wasn't doing great (around $50/month) but I was making more than 90% of the population in my country so I wasn't complaining that much. I also fell in love with data analysis because of it. I did that for like 4 years on and off while also doing online currency exchange on the side. I learned a lot about negotiating and dealing with customers from that. \n\nA friend told me about upwork so I signed up and started getting gigs writing self-development headlines and small stuff like that. When I stopped getting gigs I decided to focus on learning a demanded skill. I requested financial aid for a coursera Tableau specialization and completed it. While doing that I had a small business selling hardware in the main online marketplace of my country. I learned a lot about marketplace positioning and again dealing with customers from that. \n\nEventually, I got a job in a so-called marketing agency. It was a horrible 4-month experience (mean yelling-type boss) but the paid was $200/month which was a big improvement for me. I learned a lot. I handled facebook ads, social media marketing, client communication and I managed a 5+ team. I couldn't stand the boss experience though so I decided to learn another skill that could land me a better job. Again I requested financial aid, for an SEO course this time [https://www.clickminded.com/](https://www.clickminded.com/), I got it and I completed the course. I started searching for jobs in UPWORK and I got an answer. I quit the bad boss job and started working with this new client which was paying me $4/hour all the hours I could get. \n\nMy life changed at this point. I moved out of my parent's house to an apartment with my girlfriend in the best part of town. I bought a car. I was upper middle class suddenly because of my country's economic crisis. \n\n(Of course, this wasn't easy. I changed drastically from a highly-depressed individual to a better person because of the healthy habits I started following. I was meditating every day, I was exercising regularly, I was reading one self-development book a month, I was keeping a daily gratitude journal, I was keeping track of all my income/expenses and just focusing in whatever tools/habits I could use to improve myself. I still do most of this to this day).\n\nI learned a lot, I worked with infusion soft, marketing automation, more Facebook ads, Google sheets, landing pages creation in thrive, WordPress, google analytics... \n\nI worked with this client for around 4 months too and he introduced me to my current boss, which has become an incredibly good influence in my life and a good friend. She increased my rate to $5/h around 1.5 months after we started. Around 4 months I tried the online currency exchange business again on the side. It got me around $600/month. But it only worked for 4 months, because of some country restrictions I couldn't keep doing it. I had 3 employees already when I had to stop. I also did a bunch of HubSpot online courses during this time.\n\nI got a raise to $8/h yesterday. \n\nThis led me to think how I could eventually be in a higher position inside of the company. Even to the point of managing the whole agency. I know this is something she would like but I think I'm lacking skills to reach that point. Like copywriting for example.\n\nAfter the exchange business got close I kept on thinking about ways I could increase my income. Starting an e-commerce business was one that was always lingering because I had so much experience with it (the agency has almost exclusively e-commerce Shopify clients). I started a side project with my girlfriend but I haven't been able to make a sale for it [www.allcandice.com](https://www.allcandice.com) so It's basically stuck at the moment. I also thought a lot about how I like to analyze data so learning about data science seemed like an option. I started harvard's edx CS50 course which is an introduction to computer science and it's so much fun but I started working with allcandice in the middle of it and I just stopped having time to do it.\n\nSo, I'm not sure what I should focus on next. I'm actually in the middle of traveling to Medellin for a few weeks because I heard it's a hub for digital nomads and entrepreneurs. I'm hoping I can make some connections that can give me more clarity into how I could increase my income and of course make some like-minded friends along the way. Which I couldn't do in Venezuela at all.\n\nShould I put all of my efforts into allcandice? \n\nShould I try to find a good course I can do to get the skills I need to advance within the company? \n\nShould I focus on learning data science to get a higher-paying job?\n\nWhich one could lead me to a higher increase in income in the least amount of time?\n\n&#x200B;\n\nI appreciate If you got to this point. \n\n&#x200B;\n\n/David", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/a00aa1/how_to_keep_advancing_and_increase_my_income/", "title": "How to keep advancing and increase my income?", "social_network": "reddit", "user": "davidbzr", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1543080322, "permalink": "/r/DecidingToBeBetter/comments/a00aa1/how_to_keep_advancing_and_increase_my_income/", "nsfw": false, "first_save": 1635435102.4608681, "replies_charged": false}