{"id": "t5_2tand_t3_qfxmk8", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "I’m in desperate need of advice, or other perspectives. I’m 22 years old and just graduated college, and my life is just meaningless and empty. I’ve applied to 400+ jobs in my major and have heard nothing back but rejection. I have been trying to move to a different state but have held back because i want to secure a job before I move. I currently live at my parents house and don’t have any friends that I enjoy being around. I try to be positive and work on manifesting my dream life and practicing gratitude but I’m never consistent in these efforts. My days are wasted away and the only places I really go are the gym and grocery stores. Ever since the pandemic I have been very antisocial and cut a lot of people out of my life because I felt no connection to them. Going to the gym was a fulfilling hobby for a while, but I have now grown tired of it and am starting to resent my hometown environment which I feel I can not grow in. I have no other hobbies and most of my time is wasted away on social media and occasionally picking up a book and reading. My love life is nonexistent because I feel no drive to meet people and start relationships in this environment. I also have a pretty serious porn addiction. I had a traumatic childhood and did not develop any serious interests or dreams. My days are just pointless and I feel like I’m wasting my youth away. There are more specifics but this is just a more general rant. I would love to hear suggestions and advice.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qfxmk8/lost_empty_pointless/", "title": "Lost. Empty. Pointless.", "social_network": "reddit", "user": "wiccan866", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1635218949, "permalink": "/r/DecidingToBeBetter/comments/qfxmk8/lost_empty_pointless/", "nsfw": false, "first_save": 1635436696.4822347, "replies_charged": false}