{"id": "t5_2tand_t3_8w49s1", "request": ["cbd1933a-caaa-464d-8e4c-373318982c62"], "text": "In general I am mostly an optimistic person, and with some ups and downs I am working on accomplishing my goals for the last few years. Before that I used to drink too much and be irresponsible in general and my performance on all field suffered. But now that I actually care about my life I am often experiencing another problem: A blocking worry/fear of things that can affect me but are out of my control. \n\nFor example I struggled with a crippling fear of heart problems that made me unable to exercise (which is very important to me, and some of my goals depend on it). Thankfully I got over that, but now for example when I hear of a possibility of something happening that can affect me in a negative way, but that I can do nothing about, I get very anxious and very demotivated for some time. \n\nFor example, I heard of some kind of some suggested tax changes that would, if adopted, affect my income/savings in a very bad way. Or of some harsh car inspections that would basically make me have to get a new car since mine wouln't pass... Or I have a discussion with a collegue about an uncertain future of the project we are working on... you get the point. My body reacts to that with intense feeling of anger and powerlessness, which sometime lasts for a whole day or two until I am back to my normal self. Often, after that, I am demotivated to work on my things, thinking it is all in vain. Also I tend to revert to a horrible diet of junk food in these cases.\n\nOn the contrary, I experience the other kind of fear, in situation where I can have some control (skydiving, hard sparring, driving motorcycle fast, etc) as a positive kind of adrenaline rush that leaves me euphoric afterwards.\n\nI would like to hear from you, if somebody experienced similar thoughts/behavior, and how did you deal with it? I feel like this is happening more often lately and would like to do something about it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8w49s1/i_would_like_to_worry_less_about_things_out_of_my/", "title": "I would like to worry less about things out of my control.", "social_network": "reddit", "user": "Geronimoooooooooo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1530732321, "permalink": "/r/DecidingToBeBetter/comments/8w49s1/i_would_like_to_worry_less_about_things_out_of_my/", "nsfw": false, "first_save": 1635436408.1039567, "replies_charged": false}