{"id": "t5_2tand_t3_mq9imt", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I'm writing this with a teeny tiny nugget of more clarity, as I know (and it's a scary thing when we really think about it) that there is a whole lot more that I, who's not even the smartest human, know than don't. And the implications of this are not negligible. In fact, this obliviousness has influenced my life from the very beginning, and the effects are really coming to a head. I won't detail how, but I'll say that this world is not, imo, for those that don't see both the big picture and the details at the various seasons/stages of development in life, or at least have someone nearby who does and offers necessary guidance. \n\nThe importance of wisely taking care of oneself and cultivating healthy states cannot be understated, as the reality of impact is felt over a long period of time. There are just so many 'landmines' and 'pitfalls' laying in wait 'every single day and night' in this world, that I sincerely pray for every individual. One thing can happen in a moment that can affect a very long period, or a small thing can be done habitually/indulged in obliviously/tolerated over a long period, whose effects become a cross to be in an already challenging life. If there is anything you can do better, DO IT, for there are many odds stacked in the favor of natural processes, that you have to claim whatever agency you can get, and apply it wisely.\n\nOn my part, my cross (or at least a major one) is the increasing realization of how oblivious and careless my childhood experience was, which has directly resulted in the reality of the present, which the part of me that is hardworking and optimistic, does not identify with. One thing really does lead to another, and the substance of life lies in the sequence of choices we make, and the fact that, like in chess, one influences the next (if only there was an undo or rewind button!). \n\nThere's so much I don't know that's obvious to others, and I then feel like I'm drowning/have drowned  & don't even realize it,yet it's scarily evident to others. That's what makes it feel so unreal. I never understand some statements made about me when I was younger until I gained more understanding of reality and could then place myself in its context. My patterns, though instinctual and unintentionally misguided, were based on a faulty compass from early childhood, which I thought was a personality trait, but was really something untreated/rectified being reinforced with more and more 'neurotic' patterns. I have no therapist who can be patient enough to walk through all the layers and understanding enough to see the connections and wise enough to offer the necessary guidance/help needed, so I write here.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mq9imt/the_calluses_of_life/", "title": "The calluses of life", "social_network": "reddit", "user": "_hope_ful", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1618341794, "permalink": "/r/DecidingToBeBetter/comments/mq9imt/the_calluses_of_life/", "nsfw": false, "first_save": 1635436510.002585, "replies_charged": false}