{"id": "t5_2tand_t3_azd84u", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "First time poster here.\n\nBefore I get to the advice question, here’s some background. \n\nI’m a 29F, 30 next month, and I have nothing to show for 30 years of being alive. I’m very kind, I’m very compassionate, I’m very good at helping people through their most difficult times, but I’ve never done anything with MY life.\n\nI’ve been working to change that lately. Last year was spent working on my “insides.” I started therapy, I learned how to love myself the way that I love other people, I learned how to be happy, and I’m very proud of the progress I made in that area.\n\nThis year, this MONTH, actually (well, February) I began working on my “outsides.” I’m still a waitress at 29; I’m certified in Phlebotomy, but there’s an overabundance of medical workers in my city, so I’m still trying to really break into that field. I did finally leave the horrible job I’ve had for 5 years, though, and got a job at a busy bar/grill downtown, and so far I love it. I’ve started trying to spend my very limited funds more wisely, plan ahead for bills rather than see what happens the week they’re due. I’ve changed my sleep schedule and am now getting plenty of consistent sleep. I’ve stopped getting on Facebook and talking about all of the plans I have (because I am very much one of those people who get satisfaction just from the recognition of what I “plan” to do) and have started just...doing. When obstacles come up, I’ve started facing them and getting them done. I’ve stopped trying to find ultimate fulfillment in my relationships alone. I’ve stopped pining after the guy that doesn’t love me back, and I’ve stopped believing that he’s the only way for me to be happy. Every day, I actively try to make the SMART decisions, the decisions that will bring me success and happiness someday.\n\nI’m building myself up. I’m working on NOT being a lazy, irresponsible hermit. I’m just getting started, but I’m actually doing it for once. I’m trying SO hard this time.\n\nAnd it’s so. SO. lonely.\n\nEveryone in my life that I love and who loves me has found their “person”. So while I know that I have so many people who care about and support me, and while I am abundantly grateful and recognize how lucky I am and how good I’ve already got it, it just doesn’t fill that one thing that’s missing. I haven’t found my “me and you against the world” partner yet. That’s something that I CAN’T have until I get my crap together and become someone that somebody could depend on to build a life together with. So I’ve stopped looking for it, that’ll come someday when I’m ready.\n\nBut, I guess I would just like some advice on how to push through the absolute loneliness of reinventing oneself. Nobody can do it for me, and I have to do it alone, and it’s hard. It’s very hard to feel this alone. And I would really appreciate any tips anyone has on how to maybe just calm that feeling down a bit. I know it’s a given, and that it’ll eventually feel more like strength than it does “alone-ness”, but for now, I just need to be able to bare it without being crippled by it.\n\nI’d just really be grateful for advice on ANY of this, I guess. Thanks.\n\nTl;dr — What are some healthy ways to cope with the loneliness that comes with building yourself and your life up from scratch?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/azd84u/its_a_lonely_road/", "title": "It’s A Lonely Road", "social_network": "reddit", "user": "Megan1tRain", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 377, "down_vote": 0, "creation": 1552201168, "permalink": "/r/DecidingToBeBetter/comments/azd84u/its_a_lonely_road/", "nsfw": false, "first_save": 1635438139.658165, "replies_charged": false}