{"id": "t5_2tand_t3_ocvm0y", "request": ["eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "In April of this year I realised I had a day trading addiction. It was incredibly shocking to find out. Realising that I had lost myself made me realise perhaps I had never fully accepted myself.    \n\nI went from thinking I was gonna be able to quit my corporate job from trading and earning an annual salary in 3 months to losing all of that in April.\n\nRealising that I had an addiction forced me to really take a look at myself. The person who always answered 'Everything's fine' when asked if I was okay. The ironic thing was I thought I had myself sorted out with positive thinking and all sorts of self help content.   \n\nFor the first time in my life, I confronted all my inner demons. I looked at my deepest, darkest fears. Painful memories I wanted to repress. Negative feelings I did not want to address. And I realised how much I had been lying to myself.\n\nI longed to be accepted by the world when I had not even fully accepted myself. I was always subconsciously comparing myself to others. I equated having money as absolute success. I thought being a multimillionaire would make me happy. I was an irrational optimist. I looked at happiness like it was an end goal (where you checked all the boxes you would be happy).\n\nSo I changed.\n\nI looked at all my life values and all my life beliefs.\n*Not the ones I thought I had. But the ones I really had, what I was living by.*\n\nI wrote down by new life values and beliefs on a piece of paper and asked myself if I lived according to them everyday.\nOne of them included radical honesty. To everyone but especially myself.\n\nMeditated daily, read daily, journalled daily to keep my clarity of mind. Spoke what I was thinking. Reached out for support, got vulnerable and authentic. I listened to my emotional pain and asked it what it was trying to tell me.\n\nWas it hard to face all the negative feelings I had and to change who I believed I was? Yes, it was extremely hard. But I know I am on the right path now.\n\nLife isn't meant to be perfect, its a journey of growth and courage. Sometimes that growth includes suffering and that's okay. It is the hard times that allow us to have compassion for others as well as for ourselves.\n\n❤", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ocvm0y/quit_my_day_trading_addiction_and_faced_my_inner/", "title": "Quit my day trading addiction and faced my inner demons", "social_network": "reddit", "user": "Artistic-Web-5406", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1625308550, "permalink": "/r/DecidingToBeBetter/comments/ocvm0y/quit_my_day_trading_addiction_and_faced_my_inner/", "nsfw": false, "first_save": 1635437498.185001, "replies_charged": false}