{"id": "t5_2tand_t3_l12sco", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Tonight my boyfriend told me that my negativity around my job when we talk on the phone is really draining for him to the point that he doesn't really look forward to talking on the phone sometimes.\n\nIt's really hard for me because my job sucks due to the work environment (shitty boss and coworker) and the work is less than stimulating.\n\nI don't want to drive him away by being negative but for me, speaking with him about the shit that goes on at work is my one release valve. I want to tell him about it because I want to tell him about everything bc he's my person.\n\nI don't see myself as an all around negative person, and I mostly keep work talk to the weekdays and out of the weekend. I tell him things on the day they happen, I don't really ruminate on it other than being salty that I'm stuck at this job. I am currently trying to get a new job, and waiting to hear back about a job that I'm fairly stoked about (interviewed a month ago but just heard back last week that the hiring process is taking longer than expected). My boyfriend told me he feels I just let life happen to me but I'm not sure what I can really do aside from continuing to try to get out of this job.\n\nI've been reading some of the other \"how do I stop being so negative\" posts on here, and some of it is helpful but I'm more negative about one specific thing and the venting to my boyfriend about that is what's causing the issue. Particularly the \"just let it go\" mentality could show me some improvement.\n\nSo, I don't want this to continually impact my relationship. I know I got a bit defensive when he brought it up, but I can understand where he's coming from. He didn't really have any proposed solutions, I proposed 5 minutes of bitching a day which he seemed okay with. But I also feel like at the risk of negative venting I may just end up bottling it up if I can't talk to him about it which doesn't seem very helpful either. \n\nAny advice or tips or experience welcome.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l12sco/i_dont_want_to_drive_my_boyfriend_away_with_my/", "title": "I don't want to drive my boyfriend away with my negativity around my job", "social_network": "reddit", "user": "bcoug", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1611121063, "permalink": "/r/DecidingToBeBetter/comments/l12sco/i_dont_want_to_drive_my_boyfriend_away_with_my/", "nsfw": false, "first_save": 1635438366.426174, "replies_charged": false}