{"id": "t5_2tand_t3_mfglq3", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I had a terrible time getting pregnant. Miscarriages, ectopic pregnancies, two fibroid surgeries, and a failed IVF attempt would all render me childless and hopeless. My husband and I agreed to use an egg donor despite feeling like less of a woman because my own eggs were proving to be useless at my ripe age of 39. \n\nWe found an anonymous donor and created embryos 4 embryos. We placed one into my womb and bam! I was pregnant, this time for the long haul of nine months with a healthy baby boy. What a joy it was to see his beautiful eyes look into mine moments after I birthed him. \n\nBut in true bad luck fashion, by joy would be yanked away from me in the form of a massive hemorrhage. I lost half of my blood thanks to an artery growing into my uterus and becoming severed by the hands of my doctor trying to release the placenta. Everything went fuzzy, then black. In medical terms, I coded. Less than 30 minutes later I was brought back with 4 units of blood, and then was rushed off to have an emergency hysterectomy not knowing what was going on but aware of was on the brink of life and death.\n\nAfter fighting for my life for 3 days in the ICU and then high risk maternity ward, I survived. I would ultimately need 35 units of blood products to make it, but I did. Thank you blood donors.\n\nNow that my one and only son is 3.5 years old, I have no ability to use my remaining embryos. Being a mother was a mountain to climb and I have spent many days accepting the fact I had to fight to be a mom whereas most women can do it effortlessly.\n\nBut I have a friend who lives many continents away and is childless, and has done IVF 12 times to no avail and depleted bank accounts. I offered her one of my embryos. I have no idea if she will accept but if so I can watch my sons sibling grow from a far and allow a women have the most amazing opportunity to be a mom like me. There is no greater joy than to be alive, and a mother. If I can help create both life and turn this woman into a mom, I will feel complete, and that my life wasn't in vain.\n\nThank you for reading and god bless.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mfglq3/giving_life_after_nearly_losing_mine/", "title": "Giving life, after nearly losing mine", "social_network": "reddit", "user": "Life_Maximum385", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 72, "down_vote": 0, "creation": 1616987972, "permalink": "/r/DecidingToBeBetter/comments/mfglq3/giving_life_after_nearly_losing_mine/", "nsfw": false, "first_save": 1635435562.77271, "replies_charged": false}