{"id": "t5_2tand_t3_o93g5n", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "67305ca4-ce30-4c37-9a02-05d70fe958db", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "This is a question that has been asked since humans first became  conscious intelligent beings. It is arguably the most powerful question  in philosophy, and the one that is most often associated with it. There  have been many different answers to this question throughout history.  Different philosophers, scientists and historians have all attempted to  give their unique spin to the question “what is the meaning of life?”.  In today’s post, I am going to examine some of these ideas, break down  the question into smaller pieces, and articulate my own response to this  philosophical inquiry.\n\n**Before we begin this journey, we must first define two important and relevant terms; the concepts “life” and “meaning”.**  \n\nLet’s first look at three definitions for the word “life”:\n\n1. The condition that distinguishes animals and plants  from inorganic matter, including the capacity for growth, reproduction,  functional activity, and continual change preceding death.\n2. The existence of an individual human being or animal.\n3. The period between the birth and death of a living thing, especially a human being.\n\nLet’s now look at three definitions for the word “meaning”:\n\n1. What is meant by a concept?\n2. What is the significance of a concept?\n3. What is the important or worthwhile quality of a concept?\n\n**Now that we have defined both concepts, let’s break things down even further.**\n\nWhen we are asking “what is the meaning of life?”, we are essentially asking the following 3 questions:\n\n1. What is life?\n2. What is life’s significance?\n3. How does one live life in the best possible manner?\n\nAfter having answered these questions, we will be able to synthesize  all of our ideas and create a response to the question that is the  subject of this article.\n\n**What is life?**\n\nAs mentioned earlier, life is the condition that distinguishes  animals and plants from inorganic matter, including the capacity for  growth, reproduction, functional activity, and continual change  preceding death.\n\n**Let’s dive deeper into some of these properties.**\n\n1. Organization. Living things are highly organized,  meaning they contain specialized, coordinated parts. All living  organisms are made up of one or more cells, which are considered the  fundamental units of life.\n2. Metabolism. Living things must use  energy and consume nutrients to carry out the chemical reactions that  sustain life, such as growing, reproducing and maintain the structure of  their bodies.\n3. Homeostasis. The maintenance of a stable internal  environment, even in the face of a changing external environment, is  known as homeostasis.\n4. Growth. Living organisms undergo regulated growth.\n5. Reproduction: Living organisms can reproduce themselves to create new organisms.\n6. Response: Living organisms show “irritability,” meaning that they respond to stimuli or changes in their environment.\n7. Evolution:  Populations of living organisms can undergo evolution, meaning that the  genetic makeup of a population may change over time.\n\nWhile understanding this list of properties will not greatly affect  our day-to-day framework of how we think and live our lives, it is still  important to know the difference between a living organism and  non-living entity.\n\n**The next question one might have is, how did life begin?**\n\nMany scientists believe that chemical reactions led to RNA, which was  the first molecule on Earth to self-replicate and begin the process of  evolution that led to more advanced forms of life, including human  beings.\n\n**Now that we know how life began in general, let’s examine how life began for human beings.**\n\nHumans evolved from a species known as Homo erectus. Furthermore,  humans share a common ancestor with chimpanzees. For most of our species  history, we were not the dominant force we are today; we were somewhere  in the middle of the animal food chain. Everything changed during the  cognitive revolution that occurred between 70,000 to 30,000 years ago.\n\nWe discovered fire, created tools, and developed language. The most  important thing we did was create and connect around ideas that do not  physically exist, such as religion, politics and capitalism. This level  of imagination and consciousness is something that no other living  entity possesses. It is thanks to the cognitive revolution that we are  the dominant, intelligent and conscious beings that we know ourselves to  be today, and it is thanks to our consciousness that we are able to ask  questions such as “what is the meaning of life?”.\n\n**Another big question that we have is the question of how the Universe started.**\n\nThe Big Bang theory is the most commonly accepted response to this.\n\n* The Big Band theory is the prevailing cosmological model  explaining the existence of the observable universe form the earliest  known period through its subsequent large-scale evolution. The model  describes how the universe expanded from an initial state of high  density and temperature.\n\nIn recent years, another theory called String theory has gotten quite popular.\n\n* In String theory, the multiverse is a hypothetical group of  multiple universes. Together, these universes comprise everything that  exists: the entirety of space, time, matter, energy, information, and  the physical laws and constants that describe them. The different  universes within the multiverse are called “parallel universes”, “other  universes”, “alternate universes”, or “many worlds”.\n\nWe now understand what characteristics separate living organisms from  inorganic matter, how life began, how humans evolved, and why humans  are different from other living organisms. Furthermore, we are able to  somewhat understand what the Universe is and how it started.\n\n**However, we are still left with many questions.**\n\nAre we special? Are we the only intelligent and conscious entities in  the universe or in the multiverse? Is anything “real”, or are we living  in a simulation? Does God exist? Is there life after death? How do all  of the complexities of the Universe work? Is there a deeper purpose to  life or are we merely just bodies of carbon living in a world that is  random and that does not care about us?\n\nUnfortunately, these questions have no objective answers to them. The  deeper we dig, the more questions we have. Science can only answer so  much. There is only so much we can understand about life, about  existence and about the Universe. String theory says that there are 11  dimensions. Humans are only equipped to experience and understand 4 of  those dimensions. With that being said, the progress that we have made  in the last few hundred years has been remarkable. With every year that  passes, we understand a little bit more about the Universe and about  ourselves.\n\nWe are curious beings and we are wired to want to explore, to ask  questions, and to try to find answers to the mysteries of the world.\n\n**What is life’s significance?**\n\nAs mentioned, we will never know whether we are merely just bodies of  carbon living in a vast apathetic and random Universe, or whether there  is a deeper purpose to our lives and to our existence. With that being  said, life is still meaningful and significant, and the best way to  figure how is to analyze how we are wired as human beings.\n\nSimilar to how machines and robots are wired to think and behave in  certain ways, human beings are wired to want and desire certain things.  If there is one thing I want to emphasize in this section, it’s that  while technology and culture have progressed drastically over the last  100 years, we still have the same desires that we had thousands of years  ago and we have not changed much biologically over that time span. The  only difference between today and two thousand years ago is that we are  now satisfying our desires and needs in newer and more complex ways.\n\n**Physical survival.**\n\nSurvival is the deepest and most important instinct that we have. As  mentioned earlier in this article, for most of our specie’s history we  were somewhere in the middle of the animal food chain. Without good  health and a good environment, life is difficult and filled with  suffering. No baby is born ready to give up and commit suicide. It takes  a process full of corruption and suffering for a human being to get to  that point. Humans and animals are wired to want to live. As Abraham  Maslow points out in his hierarchy of needs, physiological and safety  needs are the foundation of his pyramid.\n\nWhile physical survival used to be the act of running from a tiger or  getting shelter in a cave, physical survival today in the western world  is eating healthy, making money, investing, going to the gym, attaining  influence and power, sleeping well, etc.\n\n**Reproduction.**\n\nReproduction is survival in a different form; survival of our genes  and of our specie. We are wired to want to procreate. Evolution made the  act of sex enjoyable. Our desire for reproduction has not changed.  What’s changed is that as a result of newer technologies, safety and  security, and world dominance, people realize that taking care of  children is a time-consuming lifestyle and choose to focus on their  other needs and goals first, keeping their desire for children as  something to explore later in their lives. Thanks to technological  advancements such as birth control and abortion, people have more  control over their lives and are able to enjoy the benefits of sex  without its consequences.\n\n**Belongingness and Love.**\n\nHumans beings are social animals. We are not meant to live in  isolation. In large part, the way we learn, understand ourselves and the  world, maintain our health and sanity, and think about and solve  problems is by communicating and cooperating with others. There is a  concept that is known as Dunbar’s number. It is essentially a claim that  humans can maintain no more than 150 friendships and connections at a  time. Yuval Noah Harari’s talks about this in detail in his book  “Sapiens”.\n\nYuval went on to explain that the reason we are able to cooperate in  large groups and dominate the world despite our cognitive limit to the  number of people with whom we can maintain stable social relationships,  is because of our ability to connect around shares beliefs, such as  stoicism, Christianity, capitalism, money, etc. This shows just how  important connecting with others is for us. In fact, our ability to  communicate and connect with others is one of the biggest reasons we  went from being in the middle of the animal food chain to the civilized  and dominant people we are today.  \n\nIn connection with this desire to connect with others, we are also  wired to want to love and to be loved. Love is crucial for a child’s development. Without adequate love at  an early age during sensitive and critical periods, children develop  attachment issues that can affect them for the rest of their lives. This  shows just how crucial love is for us. Even when we grow up and become  teenagers and adults, we are still yearning for belongingness and love.  It might be something as simple as having anxiety in high school because  we don’t feel as though we have good friends. It might be the  experience of being depressed because a close family member passed away  and we regret not having told them how much we love them. It might be  throwing a fun surprise birthday party for a best friend or sibling  because of how much we cherish them.\n\nOur desire and need to love and to be loved shows itself in numerous  ways throughout our lives. Christopher McCandless wrote this before his  death, “Happiness only real when shared”. This was coming from a man who  had escaped humanity his whole life and who lived his final days in  isolation in the wilderness. Despite pushing people away his entire  life, McCandless realized moments before his death that our lives are  meaningless if we are not surrounded by loved ones.\n\nAnother important form of love is self-love. At the end of day, the  only person that will be there with us at every moment of our lives is  ourselves. It is therefore crucial to have a good relationship with  ourselves. If we can’t love ourselves then how can we expect others to  love us? Ayn Rand put this idea beautifully with this quote, “To say ‘I  love you’ one must first know how to say the ‘I’.”\n\n**Curiosity.**\n\nOn the evening of 3 August 1492, Columbus departed from Europe with  three ships. The explorer and navigator who completed four voyages  across the Atlantic Ocean is known today as one of the most important  figures in history, opening the way for widespread European exploration  and the colonization of the Americas. His expeditions were the first  European contact with the Caribbean, Central America, and South America.\n\nChristopher Columbus, as well as the thousands of others throughout  history who put their lives at risk for the sake of curiosity and  exploration, did so because they did not want humanity to be forever  bounded by geography and ignorance. The Apollo Lunar Module Eagle  landing on the moon on July 20, 1969 is another example of humankind  attempting to expend its horizons. History is filled with pioneers and  giants from all fields; people like Socrates, Isaac Newton, Leonardo Da  Vinci, Martin Luther King Jr, Albert Einstein, Steve Jobs, Elon Musk,  etc.\n\nGoing out of our comfort zones, taking risks, being creative,  expending our horizons, being curious, asking questions, trying new  things, and exploring the earth and space is something that is deeply  ingrained in us. Our desire to explore and to be curious is something  that sets us apart from all other living organisms; it’s what makes us  unique.\n\nCuriosity doesn’t always have to lead to world-changing events like  stepping on the moon or discovering America. Sometimes, curiosity can be  something as simple as sitting down and writing a paper on a topic we  find interesting. Curiosity can be the experience of taking a vacation  and visiting countries and cultures we have never seen. Curiosity can be  the decision to indulge in good habits and to stick to them despite the  discomfort they may cause at first. Curiosity can be the process of  starting a business on an idea we are passionate about. Curiosity is all  around us, and it is one of the most primal instincts that we have.  Let’s embrace our curiosity and our desire for exploration, and let’s  create lives that we will be proud of.  \n\n**Legacy.**\n\nAs mentioned earlier, one of the instincts that motivates us the  instinct for survival. We have already talked about two forms of  survival in this article; physical survival and the survival of our  genes and of our specie. There is a third form of survival that controls  much of what we do in life; spiritual survival. Immortality is a desire  that is primal to us. We have the gift of consciousness, but also its  curse. We are the only living organism that is able to imagine and think  about its own death. We don’t want to die. It’s in our nature to desire  survival. For that reason, we try to stay healthy and to physically  survive for as long as can.\n\nHowever, physical survival is often not enough. We understand  consciously that there will come a time when our bodies will no longer  be able to function. We understand that we will physically die one day.  For that reason, some people turn to religion and God and believe that  if they live a life following certain commandments and behaving in  certain ways, then they will go to heaven and live for eternity. Others  understand that the afterlife is something that we don’t fully  understand. Is there an afterlife? What happens after death? Despite  physical death, will our spirits and souls live on?\n\nThese are all pertinent questions. I have the view that there are  certain things that we can’t control. We can’t control what happens to  us after we die. We can control, however, what we do in this life. We  are not guaranteed the promise of heaven. For that reason, we must turn  our attention to building the best legacy we can. Perhaps our name will  be able to live on for generations. Perhaps the value that we will have  given to humankind will play a role in immortalizing our spirit. Perhaps  the legacy we desire is what we leave behind to our children, to our  family, and to our loved ones.\n\nThere is a reason that we still remember the names of some of  history’s greatest and most ambitious. There is a reason we still  remember Socrates, his Socratic method of questioning and the honor he  showed in the face of death. There is a reason we still remember Julius  Caesar, the empire he built, and how his empire played a large role in  the development of modern government. There is a reason we remember  Galileo, why we call him the father of observational astronomy, why we  call him the father of the scientific method, and how he stood up for  his beliefs and was a contrarian at a time when going against the grain  could get one killed. There is a reason we will remember Elon Musk long  after he is dead, and his contributions to electric vehicles, space  travel, and clean energy.\n\nThe desire for prestige, for  accomplishment, for competition, and for status are some of the most  primal desires that we have. Abraham Maslow, the prominent psychologist  includes esteem needs and self-actualisation as part of his hierarchy of  needs. It’s important to understand that only a few will be able to have  their names and work immortalized for centuries. Let’s not let that  derail us. It is not the final product that counts. It is the process of  working on something that is greater than ourselves that is of  paramount significance here. In order to build a great legacy, it is  important to help others, to provide value, and to try to push humanity  forward.\n\nSome people will argue that the desire to work towards a great legacy  is stupid. They will argue that one day humans will go extinct and that  when this happens, nobody will know Galileo, Napoleon, Einstein, or  whoever else we want to name. This is a strong logical argument. The  reason I disagree with this view, however, is that logic is not always  the most important factor in an argument. If there’s one thing I want to  make clear in this article, it’s the important of meaning and of  purpose. Where is the meaning in nihilism? Where is the purpose in  believing that we are insignificant and that our lives will mean nothing  millions of years from now?\n\nDespite the fact that these statements may both be logically correct,  what we are trying to articulate in this article is a framework that  will be helpful in our day-to-day lives. A desire for legacy is not only  deeply wired in us, but it is also honorable to want to better  ourselves and to want to better the world. It is honorable to want to  leave behind a piece of who we are, whether in the form of family, in  the form writing, in the form of art, in the form of inventions, in the  form of exploration, or in whatever other medium we choose.\n\n**Acquiring knowledge and transferring it to future generations.**  \n\nIf there is one thing history has taught us, it’s the importance of  protecting our species’ knowledge and successfully transferring it  across generations. This goes back to our desire for survival, and more  specifically our desire for the survival of our species. If we do not  safeguard our knowledge, then how can we make sure that the human  species will progress? How can we make sure that we will learn from  history and not commit mistakes that we have committed in the past? We  can’t. It is why books have always been valuable.\n\nWalking in a library is one of the most surreal things that one can  experience. In a library, we have the ability to read from the greatest  minds of human history; Plato, Aristotle, Albert Einstein, Stephen  Hawking, Will Durant, etc. We have more books and more wisdom than can  last a lifetime. Furthermore, our brain is a muscle and it must be  trained. If we spend our days mindlessly scrolling social media and not  putting our brain to use, then we will develop mental problems later in  life and we will not have fulfilled even an ounce of the potential that  we have.\n\nIt is our duty to acquire knowledge, to learn as much as we can, and  to put this knowledge into practice. Despite having books and wisdom  from some of the greatest thinkers of all time, our world and our  societies still face many problems. Every era has its own unique set of  problems, and it is our responsibility to learn as much as we can and to  turn our knowledge into practical action. Furthermore, it is our  responsibility transfer our species’ and our personal knowledge to our  kids and future generations so that they will be well equipped to deal  with the challenges of their time.\n\n**Well-being.**\n\nIf there is one thing that almost all religions, philosophies, and  schools of thought have in common, it’s that they aim to reduce  suffering and increase well-being.\n\n* Well-being is the experience of health, happiness, and  prosperity. It includes having good mental health, high life  satisfaction, a sense of meaning or purpose, and ability to manage  stress.\n\nThe desires to reduce stress, and to experience happiness and  prosperity are fundamental to who we are. Throughout much of our  species’ history, we experienced wars, diseases, natural catastrophes,  etc. Christopher Hedges, a Pulitzer Prize-winning journalist and author  wrote the following, “Of the past 3,400 years, humans have been entirely  at peace for 268 of them, or just 8 percent of recorded history”. This  is a fascinating statistic.\n\nAs mentioned earlier, our desires for competition and status, and our  instinct to separate into groups are all part of what makes us human.  Despite all the good that has come from those desires, there has also  been a lot of suffering that has resulted from them. The world can  sometimes be a cruel place filled with evil. It is for this reason that  so many religions and philosophies have attempting to figure out ways in  which we can reduce suffering.\n\nA large part of well-being has to do with health. Gut health, for  example, is strongly correlated with mental health. It is for this  reason that people who have gut problems suffer in life satisfaction. To  be happy, healthy, and to prosper are goals that everyone has. A big  part of making progress towards those goals is combining a lot of the  things that have already talked about in prior sections of this article.  Are we living healthy lives? Are we constantly trying to learn more and  expend our horizons? Do we feel loved and are we surrounded by people  who cherish us? Are we working on our legacies and on projects that  excite us, or are we wasting our time and potential?\n\nHappiness is not something that should be chased. The more we chase  happiness, the more miserable we will be. There is a great book about  this topic called “The Language of Emotions”. It’s important for us to  understand that all emotions are equally important, and that each  emotion serves its own unique purpose. Anger, for example, allows us to  create boundaries. Sadness allows us to release energy. Fear lets us  know when we are in danger. We need to allow happiness to come as a  by-product of a life well-lived, and when it does come, we need let it  be free like a bird; it will come and go when it pleases.\n\nContentment is a far better thing to aim for. When we are content, we  are grateful for everything that we have. With that being said, we  still try to get a little bit better every day. Mindfulness is also  important. In today’s world of over-stimulation, instant gratification,  and constant comparison, it is easy for us to spend much of our time  either stressing about the future or being depressed about the past.  It’s important to take a step back, to be grateful, and to ask ourselves  what we can do today to better our lives and to create good habits.\n\nFinally, we need to understand that well-being is something that is  unique to each of us. What motivates me and makes me happy, might be  different than what motivates you and makes you happy. It is our  responsibility to have self-awareness, to understand ourselves, and to  understand what drives us.\n\n**How does one live life in the best possible manner?**\n\nLet’s look at what some famous thinkers, philosophies, religions, and schools of thought have said about this.\n\n**Stoicism.**\n\n* Stoicism is a school of philosophy founded by Zeno of Citium in  Athens in the early 3rd c entury BC. It is a philosophy of personal  ethics informed by its system of logic and its views on the natural  world. According to its teachings, as social beings, the path to meaning  and happiness is found in accepting the moment as it presents itself,  by not allowing oneself to be controlled by the desire for pleasure or  by the fear of pain, by using one’s mind to understand the world and to  do one’s part in nature’s plan, and by working together and treating  others fairly and justly.\n\nStoicism was the primary philosophy during the time of the Roman  Empire. The beautiful thing about Stoicism is that arguably the two most  famous Stoics in history came from completely opposing situations and  classes; Roman emperor Marcus Aurelius and Epictetus, a man who was born  a slave. Despite their complete opposing life situations, both Marcus  Aurelius and Epictetus wrote and talked about all of the same Stoic  virtues. In recent years, Stoicism has had a resurgence. Marcus  Aurelius’ journal “Meditations” is now one of the most famous books in  the world. Furthermore, books from modern writers such as Ryan Holiday  have brought Stoicism into the mainstream.\n\n**Existentialism.**\n\n* Existentialism is a form of philosophical inquiry that explores  the problem of human existence and centers on the lived experience of  the thinking, feeling, acting individual. In the view of the  existentialist, the individual’s starting point has been called “the  existential angst,” a sense of dread, disorientation, confusion, or  anxiety in the face of an apparently meaningless or absurd world.  Existentialist thinkers frequently explore issues related to the  meaning, purpose, and value of human existence.\n\nFrench philosophers Jean-Paul Sartre and Albert Camus were some of the first and most important existentialists.\n\n* Sartre argued that a central proposition of existentialism is  that existence precedes essence, which means that individuals shape  themselves by existing and cannot be perceived through preconceived  categories, an “essence”. The actual life of the individuals is what  constitutes what could be called their “true essence” instead of an  arbitrarily attributed essence others use to define them. Human beings,  through their own consciousness, create their own values and determine a  meaning to their life.\n\n**Epicureanism.**\n\n* Epicureanism is a system of philosophy founded around 307 BC  based upon the teachings of the ancient Greek philosopher Epicurus.  Epicurus believed that the greatest good was to seek modest, sustainable  pleasure in the form of tranquility and freedom from fear, and the  absence of bodily pain through knowledge of the workings of the world  and limiting desires.\n* Epicureanism argued that pleasure was the chief good in life.  Hence, Epicurus advocated living in such a way as to derive the greatest  amount of pleasure possible during one’s lifetime yet doing so  moderately in order to avoid the suffering incurred by overindulgence in  such pleasure. Emphasis was placed on pleasures of the mind rather than  on physical pleasures. Unnecessary and, especially, artificially  produced desires were to be suppressed.\n\n**Objectivism.**\n\n* Objectivism is a philosophical system developed by  Russian-American writer Ayn Rand. Rand first expressed Objectivism in  her fiction, most notably The Fountainhead (1943) and Atlas Shrugged  (1957), and later in non-fiction essays and books. Rand described  Objectivism as “the concept of man as a heroic being, with his own  happiness as the moral purpose of his life, with productive achievement  as his noblest activity, and reason as his only absolute”.\n\nI read a large portion of the book “The Fountainhead” about a year  ago and I enjoyed it. This is one of the passages that has stuck with  me.\n\n* “It is not in the nature of man–nor of any living entity–to start out by  giving up, by spitting in one’s own face and damning existence; that  requires a process of corruption whose rapidity differs from man to man.  Some give up at the first touch of pressure; some sell out; some run  down by imperceptible degrees and lose their fire, never knowing when or  how they lost it. Then all of these vanish in the vast swamp of their  elders who tell them persistently that maturity consists of abandoning  one’s mind; security, of abandoning one’s values; practicality, of  losing self-esteem. Yet a few hold on and move on, knowing that that  fire is not to be betrayed, learning how to give it shape, purpose and  reality. But whatever their future, at the dawn of their lives, men seek  a noble vision of man’s nature and of life’s potential.”\n\nThe reason I like this passage so much is because it communicates in  very clear and poetic terms the idea that a desire for meaning and that a  desire for improvement and greatness are core elements of who we are.\n\n**Logotherapy.**\n\n* Logotherapy was developed by neurologist and psychiatrist Viktor  Frankl. Rather than power or pleasure, logotherapy is founded upon the  belief that striving to find meaning in life is the primary, most  powerful motivating and driving force in humans. A short introduction to  this system is given in Frankl’s most famous book, Man’s Search for  Meaning, in which he outlines how his theories helped him to survive his  Holocaust experience and how that experience further developed and  reinforced his theories.\n* According to Frankl, “We can discover this meaning in life in  three different ways: (1) by creating a work or doing a deed; (2) by  experiencing something or encountering someone; and (3) by the attitude  we take toward unavoidable suffering” and that “everything can be taken  from a man but one thing: the last of the human freedoms – to choose  one’s attitude in any given set of circumstances”.\n\n**My Thoughts.**\n\nAs can be seen, there exists many great schools of thoughts and  philosophies. What almost all of them have in common is the emphasis  they place on pursuing meaning. We live in a world filled with instant  gratification, overstimulation, misinformation, censorship, anxiety and  fearmongering. Furthermore, we live in a world and in an environment  that pedestalizes short-term harmful pleasure and makes it difficult to  delay gratification and pursue meaningful projects and activities. It is  our duty as individuals to take responsibility for our lives, to work  to better ourselves in incremental fashion, to work to better the world,  to try to enjoy the process of life, to love ourselves, and to pursue  meaning rather than short-term detrimental pleasure.\n\nAs mentioned earlier in his article, the are many existential and  philosophical questions that we are not able to answer. Perhaps with the  advancement of science we will one day be able to better comprehend the  complexities of the Universe. However, for the time being, we must  focus on what we can control as individuals and create frameworks for  thinking and living that are helpful for our development.\n\nI believe that a large part of the meaning of life is to live  according to our instincts; maintaining good health, being surrounded by  people we love, working on our legacies, acquiring knowledge,  transferring our knowledge across generations, procreating, and placing  great importance on our well-being. However, it’s important to also  understand that we are not chained by our instincts. Each of us have  something special in us that gives us the ability to think and to be  creative. This ability to be flexible, to explore, to try new things, to  learn from great thinkers and philosophers, to go outside of our  comfort zones, to take risk, to go against the grain, to be contrarians,  to be creative, to think outside the box, and to constantly ask  questions and find solutions is what makes us special.\n\nGoing back to Viktor Frankl, one of my favorite quotes is the  following, “Between stimulus and response there is a space. In that  space is our power to choose our response. In our response lies our  growth and our freedom.”\n\nI want to emphasize once more that there is meaning in life and that  this meaning can be found all around us. We sometimes see people who  have fallen into nihilism. As someone who once fell into nihilism,  perhaps I can shed some light on my experience and on why nihilism can  be appealing.\n\n* Nihilism is the belief that all values are baseless and that  nothing can be known or communicated. It is often associated with  extreme pessimism and a radical skepticism that condemns existence.\n\nThe reason I fell into nihilism was because I was going through a  difficult time in my life. I had just moved cities and schools, and I  had left behind all of my childhood friends and almost everything that  was a constant in my life. This happened when I was a young teenager and  it was the worst experience of my life. At the time, I struggled  greatly with understanding my emotions and with social anxiety. It took  many months for me to finally come to terms with my situation and to get  out of denial. For a long time, I tried to convince myself that my  situation was okay and that everything would be alright. I struggled  with anxiety, with depression, and with many more problems.\n\nWith that being said, the story has a happy ending; I got closure and  I now live a life where I am generally happy and motivated. My point  with this entire story is that sometimes our life experiences lead us to  philosophies that serve as defence mechanisms. Nihilism, as well as the  belief that free will does not exist, allowed me to tell myself, “life  is meaningless, and I have no control over my situation”. Nihilism was  an escape. The rose-coloured glasses that I had been so accustomed to  wearing had turned into dark-coloured glasses. I was seeing the world  through a completely different lens. When we feel that there is no  meaning in life, it’s probably because something has gone terribly wrong  in our lives.\n\nOf course, this is not always the case. There are plenty of nihilists  out there that believe in nihilism because they believe it to be the  most logical framework for understanding the world. However, as  mentioned earlier in this article, logic is not the only way to go about  looking for truth and examining topics such as the meaning of life;  emotions and instincts are sometimes just as important. An obsession  with logic leads to skepticism. David Hume demonstrated this with “the  problem of induction”. The problem of induction essentially explains  that nothing in the Universe can be proven for certainty. The problem of  induction, as mind-boggling as it is, demonstrates that the odds of the  sun rising tomorrow are equal to the odds of the sun not rising  tomorrow. That is the problem when we put logic on a pedestal and don’t  consider other important factors.\n\nNihilism is not natural because it looks at the world through a  pessimistic and defeatist lens, which is antithetical to how we are  wired and to who we are as human beings. No baby is born a nihilist.  Going back to Ayn Rand’s quote, “It is not in the nature of man–nor of  any living entity–to start out by giving up, by spitting in one’s own  face and damning existence; that requires a process of corruption whose  rapidity differs from man to man.”\n\nWith closure, with life experiences, with the process of slowly  improving, with information on how to deal with grief, and with  knowledge on life and existence, I went from being a nihilist to the  person I am today, the person I have always truly been; someone who  looks at the world with a glass half-full, someone who looks at the  world with curiosity, wonder and love, and someone who believes in  meaning, pursues meaning, and lives a life of meaning.\n\nTo further emphasize my point that life has meaning, and that  striving for meaning is natural and a core part of who we are, let’s  look at the science. Psychologist Jordan Peterson talks about the  orienting reflex in many of his lectures online. He explains that our  brain produces a very complex internal model of the world, and that our  senses produce a model of the external world. The hippocampus watches  those two models to see if they match, and if they don’t match, then a  mismatch signal is created; the orienting reflex.\n\n* The orienting reflex is an organism’s immediate response to a  change in its environment, when that change is not sudden enough to  elicit the startle reflex. The orienting reflex is a reaction to novel  or significant stimuli.\n\nThe orienting reflex essentially serves as a compass of meaning for  us; it is an instrument that guides us through life. It is one of the  deepest instincts that we have. The best way to articulate this point is  by quoting one of my favorite authors and entrepreneurs, M. J. DeMarco:\n\n* “Your soul will resonate its desires or discontent when faced  with quiet or minimal distraction; for example, sleeping, showering, or  during a massage. How are you responding to your soul’s voice? Is it  denied? Ignored? Muzzled with the intense demand of meaningless work?  Distracted by a television? Honored?”\n\nWhen we are wasting time and when we are indulging in behaviours and  activities that lack meaning, that are unnatural, and that are  antithetical to growth, our orienting reflex will let us know. It is our  responsibility to listen to our voice, to accept the mistakes that  we’ve made, and to take steps towards the right direction. Life is  filled with meaning. We must open our eyes and we must embrace this  meaning. Meaning is a core part of who we are, and we must live in  accordance to the instincts and purposes that have been explained and  analyzed in this article. Furthermore, we must also not follow  philosophies and ideas blindly and dogmatically, and we must understand  that the journey of life and the journey of meaning is unique to each of  us.\n\nThis article was a collection of thoughts from some of the greatest  thinkers of all time, as well as my own thoughts and my attempt to  synthesize all of this information. It is worth noting that someone  might read this article and not agree with everything. That is okay, and  it is completely normal. Each of us are at a different stage in our  process of life, and we come from different environments and have  different genetics. Despite the objective nature of some of these ideas,  the way I view life and the way you view life will not always be the  same. Two of the most important skills one can have are self-awareness  and critical thinking. If we are able to understand ourselves and our  thought process, and if we are able to question ourselves and to  question the world, then we have what it takes to grow as human beings  and to tackle difficult questions such as “what is the meaning of life?\n\nBest of luck my fellow readers. Please feel free to reach out to me to ask any questions or to discuss some of these ideas!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o93g5n/what_is_the_meaning_of_life/", "title": "What Is The Meaning Of Life?", "social_network": "reddit", "user": "RossWriter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1624820882, "permalink": "/r/DecidingToBeBetter/comments/o93g5n/what_is_the_meaning_of_life/", "nsfw": false, "first_save": 1635435092.8659918, "replies_charged": false}