{"id": "t5_2tand_t3_bitm3h", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Tl;dr: I have an intimidating coworker that I don't know how to approach or acknowledge.\n\n&#x200B;\n\nI (24M) work as a graphic designer in an open office space (everyone has desks, but there's no walls between us to form cubicles), so the 6-8 of us frequently chat during the work day. In this same open area there's a little lounge space with bookshelves and two chairs, and our web designer sits over there instead of at a desk and is on calls for most of the day. \n\nI get along with my coworkers really well. I've been working here for almost a year, and while it took several months for me to really feel comfortable talking with my coworkers, I'm proud to say I'm finally in a healthy spot where I'm confident in myself and how to navigate conversations with my coworkers. However, the web designer guy who sits off to the side, who isn't *technically* part of our department, I have had a really hard time talking to. I have a few theories about why this is the case:\n\n\\- Of the two chairs in that lounge space, the one he sits in directly faces me so I have the feeling that he's constantly watching and judging me.\n\n\\- On that note, he's already kind of an intimidating guy (at least to me personally). Full sleeve tattoo on one arm, makes music (I also make music), very soft spoken and just has the appearance of being an overall cool guy. \n\n\\- In order to leave my office space, I have to walk right past him in order to go anywhere. I'm not going to greet him every time I walk by, but now I'm just not greeting him at all. I don't like being so cold but every time I open my mouth to say something I just freeze up.\n\nMy coworkers love him and have no problem talking to him, even when it's not that often, and they speak endearingly of him and to him. I work in close proximity to him every day and just can't get over whatever it is that's keeping me from talking to him. I also get the impression that he thinks poorly of me, because for whatever reason, I don't make an effort to acknowledge him at all. On a good day when everybody is talking it's a lot easier, and we've had a handful of brief, surface-level conversations, but in general I can't even utter a greeting to him when he gets to work in the morning. I hate this and haven't had this problem before.\n\nAny advice on how to bridge this gap would be appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bitm3h/having_a_hard_time_acknowledging_an_intimidating/", "title": "Having a hard time acknowledging an intimidating coworker", "social_network": "reddit", "user": "psychic_egg", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1556566179, "permalink": "/r/DecidingToBeBetter/comments/bitm3h/having_a_hard_time_acknowledging_an_intimidating/", "nsfw": false, "first_save": 1635438289.8270924, "replies_charged": false}