{"id": "t5_2tand_t3_pkeztl", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "I’m a 20 year old guy currently in college that smokes cigarettes/vapes daily, smokes weed daily, occasionally drinks (couple times a month), and occasionally does some psychedelics like shrooms/lsd maybe 4-5 times a year. Recently I haven’t been feeling good about myself and decided to better myself and become a person that I’m proud of.\n\nI’m on my third day of quitting all substances cold turkey, and I know that it’s hard at first and it will get easier with time, but I just feel so bored. I’ve quit everything  before for over 6 months but I started again when summer started. I’m in my 20s and in college so I feel like this is the time where I want to do crazy things, go on adventures, and do fun stuff with my friends. The thing is that it almost always involves some kind of substance whether it’s smoking or drinking. It’s pretty hard to avoid those things especially when you’re already having a good time. \n\nI do have goals that I want to work towards. I’m studying environmental science and I hope to do something after college that will positively affect the environment. I started going to the gym again since I quit and want to build my physique. While going through a rough depression a few years ago I spent a lot of time studying philosophies/religions and looking for the answers to life. Along with my experiences with psychedelics I feel like I’m at a good spot where I’m just in constant amazement at the universe and our existence. I’m fully comfortable with death and I know that my purpose in life is what I make out of it, and that my only true responsibility is to just be one with nature. I’ve dabbled in things like Buddhism and stoicism which I want to implement into my daily life. Id also like to travel and explore the world and it’s cultures before I’m gone, as well as participate in volunteering and service to others. Ultimately I know that I want to spend my life pursuing self mastery, although you can never really get there and it’s all about the journey.\n\nI guess I just have FOMO, I feel like by avoiding the things that are bad for me I’ll have less fun with people. Or that people will stop reaching out to me because I’m no longer into any of those things. It all just feels boring. Self mastery is supposed to be a fulfilling thing, and I know that everything I will ever experience is all a product of what goes on in my brain, and that I’m in full control of that. But I can’t help but feel that it’s boring and I’d rather be doing something else. Maybe I’m just too accustomed to instant gratification and need to get used to self discipline. I’m just so used to doing those things that I can’t imagine something that is more fun to do. I can’t think of things to replace my bad habits with that will make me feel excited. It’s kinda like “ok I can pass that class, and get that six pack, and conquer these fears, but then what?”\n\nIt’s also kind of a validation thing, the feeling that my goals aren’t really meaningful unless people see that I achieved them. I won’t get as much satisfaction out of it if I keep it to myself, which I know is wrong and I really want to change. It’s a big part of stoicism to not what others think. That includes their harsh opinions but it also includes their validation. This is kinda hard to explain but I hope I got my point across. I appreciate any advice that I can get.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pkeztl/life_just_feels_boring_without_any_substances/", "title": "Life just feels boring without any substances", "social_network": "reddit", "user": "plamebay", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1631121860, "permalink": "/r/DecidingToBeBetter/comments/pkeztl/life_just_feels_boring_without_any_substances/", "nsfw": false, "first_save": 1635436716.3387675, "replies_charged": false}