{"id": "t5_2tand_t3_qcxd9j", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "32M\n\nI've been working hard the last two years trying to better myself. I've moved to a new city. I got a job that's completely out of my comfort zone so I can work on my social anxiety. I've been seeing a therapist for my bipolar disorder and toxic thoughts for the last 2 years (been medicated for my bipolar for the last 4). I've quit smoking and getting myself hammered every time I go out. I've started rock climbing again. \n\nI'm lonely though. Been single for 5 years. Used dating apps for all 5 of these lonely years. It's done quite a bit of damage to my self confidence and body image. I just don't know how to meet women my age bracket (25 to 35) without a dating app.\n\nAnd there are times it feels like I'm going to burnout. I'm scared of losing this new job of mine because it's so far from anything I've tried in the past. It's fast paced and there's potential to make a lot of money but there's also the risk of failing miserably, especially in the 1st year. I like the rush. Just scared of the fall.\n\nI am currently living with my sister and her boyfriend. Best sister a guy can ask for but I've been here since March and it's time I move out. I'm moving into a commune with 3 other people beginning November. I think having people  to talk to might help with the loneliness. Perhaps broaden my friend group. I do miss my friends but I had to do it because I was going to darker and darker places mentally.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qcxd9j/rebuilding_myself/", "title": "Rebuilding Myself", "social_network": "reddit", "user": "DonUboaty", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1634838670, "permalink": "/r/DecidingToBeBetter/comments/qcxd9j/rebuilding_myself/", "nsfw": false, "first_save": 1635435980.3703823, "replies_charged": false}