{"id": "t5_2tand_t3_ot3vxn", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "5d0f6d96-af53-4a9d-aba2-c5967c631e40", "f39f6441-79a5-42c9-8dca-c8455143a12a", "f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "The last year or so has been tough for everyone around us, and I’m sure that many of you will be able to relate to this on many a level. Before covid happened and before i got into a relationship that i thought was beneficial for me but wasn’t, I was killing life and meetings all of my goals aside from socially. Once covid and this relationship came, I was lacking in healthy eating, exercise, social situations and friendships, my mental health issues became more severe, and I just overall became so caught up in the day to day of trying to be a good partner that I lost sight of myself and of my own things that I had going on. To make things worse, I didn’t realize how much of an illusion of the great state of the relationship that I was under until my partner suddenly broke up with me without warning. It was a complete bomb dropped out of nowhere for me. I had been told I was a wonderful partner meeting all their needs. One day it was love and talking about having kids and a future, and the next it was that things were over. That pain was so terrible knowing that I didn’t want it, and knowing that it was not because of my actions or life alone, but because of my partners inability to communicate their needs and to be genuine with me. In that moment of the breakup, all I wanted was to just simply help, to be there like I always had been, to be supportive and take tbeir words to heart. But it was no more. Gone. My whole future. \n\nWhile i felt like I was on a mountain during the last year or so, I was in a big ole valley. Granted I did make major strides in areas like self care (the pandemic taught many of us this i’m sure) and career wise (landed an awesome job), I just completely lost it in everything else. I went from being a full blown bodybuilder with a physique I was proud of, and a passion and love for healthy eating and being active to completely stopping working out, eating like shit, losing my accountability for myself health wise, and just losing the body i was so proud of.\n\nWhile I have come to accept that I love my body even with a lot less muscle and more fat, and with being less athletic, it’s hard and it sucks. I want to go back to the 6am workouts, and the weekend meal preps while listening to great podcasts or interviews. I want to combine the good things I had before with the good habits I picked up along the way, with the lessons I’ve learned since. I’m scared as fuck to start over socially, physically, intimately and make my life what I want it to be for me and the people around me. \n\nI say all of this to say that I could sure use some motivation or a pat on the back or a go get em champ. I need to feel like I’ve got people in my corner even if they’re just some kind strangers. \n\nCheers and thanks in advance everyone. Your kind words are going to mea everything to my soul and spirit. Here if you need any yourself, too!!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ot3vxn/i_want_to_be_the_me_that_i_know_i_can_but_im/", "title": "I want to be the me that I know I can, but I’m scared.", "social_network": "reddit", "user": "MovingForward38295", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1627451484, "permalink": "/r/DecidingToBeBetter/comments/ot3vxn/i_want_to_be_the_me_that_i_know_i_can_but_im/", "nsfw": false, "first_save": 1635435098.2741268, "replies_charged": false}