{"id": "t5_2tand_t3_q448l1", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7", "c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "I will turn 30 tomorrow. This has, I believed, mildly triggered my depression the last month or two. I am trying to ensure that what I am indulging now ends with my birthday so I can do the work in my 30th year and continue to be better. \n\nIn many ways life has been going exceedingly well. I don't live extravagantly but that is by choice as to ensure that I have time to take care of myself. Money is being saved due to many good investments, I am comfortable, I have time and as such I'm pretty well rounded. Pre pandemic, in 2019, I lost about 75 pounds through diet and exercise, which I've been gaining and losing 20 of since. This has been due to some bouts of depression and injury. \n\nIn other ways, life has been a bit stalled. I've settled into a bit of mundanity, and have had difficulty recently putting in the work for some long term goals. Honestly, If I had another year like 2019, my physical goals would essentially be done, but putting in that work has been challenging, and I find I often trip over the finish line. The other goals have just been on pause. More troubling, the last couple years with Covid and all the changes brought with it, have hardened me somewhat in perhaps an unhealthy way. I'm finding it harder to care about being with people as of late, which is quite far on the other side of the spectrum to when I was in my early 20s and thirsted for any sort of validation or companionship. I'm afraid this is perhaps making me a touch dull. I've had a few relationships, and I know I can clearly attract partners, but I'm finding myself simply not caring anymore, and I think that is in a way unhealthy. Some of this is probably the depression talking but even so. \n\nNow that the collective nightmare we've been dealing with the last couple years is in its morning wake, I would like to work towards my 30th year being as productive as my 28th. I have a few months left in the year and would like to poise myself for 2020 to be a year of transformation and moving forward. I would like to finish my physical goals, I would like to work towards more engaging work, I would like to improve my living situation a bit, and I would like to spend a bit more time forcing myself to  do things that are meaningful to me like travel, which I have had to put off. I would also like to work on being a bit more social and caring about actually being charming like I was before, because I think the not caring anymore is a bit self defeating and will probably make things worse. \n\nPart of this is just writing this out for myself, part of this is asking for advice and wisdom of how you've managed periods of strong commitment to yourself. \n\nI look forward to any input. Thanks!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q448l1/turning_30_and_how_to_make_my_next_year_another/", "title": "Turning 30 and how to make my next year another year of growth", "social_network": "reddit", "user": "SpadesHeart", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1633719260, "permalink": "/r/DecidingToBeBetter/comments/q448l1/turning_30_and_how_to_make_my_next_year_another/", "nsfw": false, "first_save": 1635435815.409568, "replies_charged": false}