{"id": "t5_2tand_t3_dfrw4y", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": " \n\nI love video games. I started playing them when I was a little kid and haven’t stopped since. I believe they are the perfect combination of storytelling and challenge to play with. And just like with movies or books, there are a ton of good games, but the ones that stand out, the ones that are special to you in one way or another, these are the ones that you can count with only one hand. And for me, Dark Souls is one of them.\n\nDark Souls is one of those games that serve as a reference point, and with good reason. It is universally recognized as a really difficult game and you can’t play it without expecting to fail. A lot. And I mean, A LOT. The game is a real challenge, and it particularly stood out from the rest of the popular games for this exact reason. It seems like every other popular game at the time was to afraid to challenge the player, they tried to play it safe with easy objectives, easy ways to heal and restart the game when things didn’t went as planned. And I don’t mean to tell you a video game with those characteristics is by default bad, because that would just not be true. But by being different in that way, it managed to succeed. You can’t pause Dark Souls, even if you are being killed by the enemies. You can’t restart and open up a saved file, if you screw up, you have to live with that for that play through.\n\nWhat’s brilliant about Dark Souls, is that it is entirely fair. It is not difficult just for the sake of being difficult. In fact, making a hard game was never the main goal. The goal was to create a way to challenge the player and ultimately make him or her feel a sense of accomplishment after completing an obstacle, and the bigger the challenge, the more accomplished we feel after completing it. This is why so many players go out of their way to make the game even harder for themselves, working really hard to beat it using a “Rock Band” Guitar instead of a controller, a dance pad or a more common alternative, beating the game without leveling up (I did that. just saying lol)\n\nAnd if you don’t understand why people would willingly complicate something that is already hard, think about it. If you get a good grade on an easy test, you feel good. But if you get a good grade on a really hard test, the kind of test that most of the class fails, you feel amazing, the feeling is multiplied.\n\nDark Souls can be really frustrating, you fail way more times than you win, but you have to understand that each time you die, you learn something new. You always have to learn from your mistakes, otherwise you are doomed to make them again. And if you don’t understand that failing is to be expected and a huge part of the game, you won’t enjoy it and you will miss out on a great experience.\n\nAnd if you think about it, life is not that different. We all face a lot of challenges every day, life can be really hard, and we don’t choose the rules or the situation in which we are born into. But that’s just the way things are and complaining about it won’t make a difference, so there’s no use to it. But the challenges of life are not the problem, the problem is that everyone around you, including yourself, wants to avoid failing at all costs. We spend the majority of our time investigating ways to avoid failure, rejection, loses, etc. Yet, as we saw earlier, failure is the key to improvement. It’s impossible to become excellent at something without pushing through the hard times. And this got me thinking. Maybe if we played life as we played Dark Souls, we would enjoy it as much. We would place our mind on the end goal and not the enemy that respawns every time we sit to rest. Maybe we could take the role of the protagonist instead of the NPC that has lost all hope and just sits around doing nothing to change the situation. Maybe we could try to beat life with a “Guitar Hero” controller because why not?\n\nLife, just like Dark Souls, is tough. You can’t restart and do things another way. You can’t pause when things get hard. You can’t always have the help of others and you certainly can’t win every time, but that’s part of the charm. That is what keeps things interesting and make the experience unique for each person or player. The experience you get, the things you accomplish, the fun stories, the adventures, the secrets, the people that stand by you, the amazing chests ahead, all the dumb things you did and all the good things you learned, that is what makes it all worth it. But you can’t experience all that just sitting at the bonfire because for some reason you think failing is bad. If you don’t understand that failing is expected and a huge part of life, you won’t enjoy it and you will miss out on a great experience.\n\n\\---\n\nSimran Singh", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dfrw4y/what_a_really_hard_game_dark_souls_taught_me/", "title": "What a really hard game (Dark Souls) taught me about failure", "social_network": "reddit", "user": "TheSimranSingh", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1570676416, "permalink": "/r/DecidingToBeBetter/comments/dfrw4y/what_a_really_hard_game_dark_souls_taught_me/", "nsfw": false, "first_save": 1635435827.1302474, "replies_charged": false}