{"id": "t5_2tand_t3_84v7jr", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "We are born naked and we also get naked when we quit the human skin at the fall of life. Similarly, if we want to achieve a significant breakthrough in our spiritual progress, the ego-sheath has to go, otherwise we cannot pass the narrow gate, leading to the enlightenment.\n\nThe ego is our projected characteristics toward the outer world and ourselves. Its role is to protect our inner self from injuries and to guide us safely in the mysterious labyrinth of the Reality. However, the inner self is an eternal consciousness and cannot be destroyed, consequently does not even need protection. Still we build up an ego throughout our life, starting in our younger ages as part of our personal development. Unfortunately, in a world, based on false values like money and power, also the ego is hardened on a false ground. Early traumas and high expectations further add to this phenomenon increasing the bias within our personality.\n\nOur life will continuously try to send messages if we get out of the balance. Anger, frustrations, broken relationships and sicknesses are all part of the warning system which try to steer us into the right direction, to the direction of perfect harmony. As massive the ego gets, as bigger are the forces which try to gravitate us back to harmony.\n\nWhat is harmony though? You may say that it means something different for everybody, and you are generally right. However, we can state that the harmony requires a balance among physical, emotional and mental life. If any of the three are seriously neglected, tangible corrective forces will occur in our life. We may recognize them as part of a super intelligent signaling system or we may just consider them irritating difficulties and neglect them. This later may push us even more into the imbalance until we cannot neglect the warning anymore and we will be forced to deal with it. Harmony is also the unconditional love and accepting that everything is part of us, and if I hurt another (human) being, it is equivalent to hurting myself. The ultimate condition of a perfectly harmonious moment is to step beyond our ego-sheath. When we dissolve in a sweet conversation or forget about ourselves by watching a piece of art, those are the perfectly harmonious moments…and the whole life can be such a moment.\n\nThe perfect harmony is there for everyone. It is also called nirvana or enlightenment. It does not necessary need to be, though, a holy terminology coupled with eternal life and halo around our heads. Smaller enlightenments can happen numerous times throughout our life when we truly understand the above detailed principles and we align our life with them. But to this permanent harmony the way is not through the classical values, offered by our society and favorized mainly in a form of money and material objects or success. Small enlightenments may be seemingly insignificant moments when you might be alone, maybe broken hearted, maybe by walking a forest lonely and when you manage to take off your ego or the life breaks it off with a sickness or by taking something important from you. You are just there standing, crying, naked and somewhere inside you know that you have arrived because you can never lose anything, only win.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/84v7jr/you_have_to_get_naked_before_you_enter_the_most/", "title": "You have to get naked before you enter the most holy sacrament.", "social_network": "reddit", "user": "CHS_test", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1521205017, "permalink": "/r/DecidingToBeBetter/comments/84v7jr/you_have_to_get_naked_before_you_enter_the_most/", "nsfw": false, "first_save": 1635437138.2275856, "replies_charged": false}