{"id": "t5_2tand_t3_p5nvck", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Throughout my whole life, I thought my way of thinking was normal. This meant always being up anywhere from 20 minutes to two hours after lying down to go to bed simply ruminating or in deep thought about activities I did throughout the day, future plans, or really just anything. It wasn't until recently, about two months ago, that I realized that these may be signs of OCD when I began having both anxiety, and panic attacks which lead to intrusive ways of thinking. Since then, life has been pretty bad. I am slowly trying to climb my way out of it through therapy, etc., but i'm realizing my \"compulsions\" (if I truly have OCD) may be my rumination of random thoughts that I originally assumed was normal. I want to hear perspectives of people without OCD and how fast you ignore, or put thoughts in the back of your mind. I have the ability to disregard thoughts if I really work on it, but I really want to hear about how others without OCD work in the hopes of being able to take steps towards silencing the inner OCD in me.\n\n&#x200B;\n\nExamples of how I've seen this work with me and my girlfriend: She says something or suggests an idea and we talk for about 2 minutes on it and I can tell she just shifts to doing something else, but I will think about it and solutions, plans, etc. for the next 10, 20, 30 minutes and talk to her about it and she will respond with \"you're still thinking about that?\"", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p5nvck/do_people_without_ocd_simply_disregard_thoughts/", "title": "Do people without OCD simply disregard thoughts immediately after thinking them?", "social_network": "reddit", "user": "FlightRandom23", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1629144130, "permalink": "/r/DecidingToBeBetter/comments/p5nvck/do_people_without_ocd_simply_disregard_thoughts/", "nsfw": false, "first_save": 1635437500.760764, "replies_charged": false}