{"id": "t5_2tand_t3_c65jyp", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "We have eluded several times already about the roles each of us takes in their life. And we finally reach the part where we will dive deep into that. How many hats do you wear in your life? How many masks? Each of these is a role that you play. The more you try to multitask between the different roles, the more stress you generate in your life and the less satisfaction you get from what you do. And on the other hand, the more concentrated you can stay for a certain time period on one of your roles, pursuing one of your goals, the better results you get overall and the better life you have.\n\nThis article is about defining (or *uncovering*) the roles that you play, plan to play, and want to play in your life. About associating the goals (mostly long-term, but also mid-term) that you have already defined to your life roles. And ideally, about defining new goals that will improve your performance in one or more of your life roles.\n\n## Time to read\n\nTime to read: **12 minutes** (based on 150 words per minute).\n\n## Problem statement\n\nThe problem that you will try to solve in this article is the lack of concentration. If you associate your life with a juggler (for example), there is no way you can immediately start juggling with 6 or more balls. First of all, you start with one. Tossing it up in the air and practicing catching it. Then, you add a second one and you practice tossing each one of the balls and then catching it. Finally, you are ready to add a third ball and start juggling. And then, the forth. And the fifth. All the way to the sixth.\n\nThe situation with the life roles is similar. You have to possess the self-awareness required to define these roles. And you have to possess the discipline to give enough time to each of these roles.\n\n## Benefit\n\nLet’s again use one of the big companies as an example. Almost every successful company has multiple sources of income. Microsoft have their operating systems, their office tools, and their cloud services. Apple have their laptops, their phones, their tablets, and their services. Amazon have their retail business, their third-party seller business, and their cloud solutions. Each of these is a different hat that these companies have to wear in order to be successful. What would happen if you let one of the business dominate the other? You would get a dis-balance and one of the competitors will catch up.\n\nNow, imagine that you are the CEO of one of these companies. How do you distribute your time? Once again, if you give too much focus on one of the business, the others fall behind. What do you do with the businesses that do not generate profit? You dedicate less time to it if they don't have enough potential. What do you do with a business that has great potential, but is underdeveloped? You dedicate more time to it in order to help it grow.\n\nWhy wouldn’t you do something similar in your personal life? Start with defining the hats you wear. Are you a spouse? Are you a parent? Or are you a child? How about your professional life? Are you a business leader? Are you a technical leader? Or are you a follower (*for now*)? Achieving work-life balance (or *harmony*) means giving enough time to each of these roles in order to feel satisfied. Did you forget something important in the list above? What about yourself? Do you feel that you give you enough time to do the things that you like and that make you grow?\n\n## Personal story\n\nMy inspiration to define the life roles for myself came from Napoleon Hill’s Think and Grow Rich. There, the author talks about creating an imaginary discussion table in your head, where all your role models have a seat. When you are facing a difficult decision in your life, you meditate on it and “*ask*\" those people for their opinion and advice. As weird as this sounds, I do believe it actually works.\n\nI turned this process and this habit into a meeting with my life roles. If, for example, my Teacher wants to start writing a book. What would my Business Leader and my Technical Leader say to that? My Parent and Spouse would not agree to give the Teacher time to write this book, so it has to come from the other two. How would they continue striving for their goals if they give the required time to the Teacher?\n\nI’ve experimented a lot and I've even tried giving my life roles personas with names and different visions and mission statement. I am not saying this is good for everybody, but it is definitely worth a shot.\n\nThe most important lesson from this exercise was that I dropped a few of the roles that I either played or wanted to play. Why? Because there are just so many hours in the day. And as much as wanted to excel everywhere, I could not. So, in the end, I only left 7 roles in my life and I ordered them by priority, putting my Self first. This was another one of the big learning from this exercise.\n\n## Background\n\nThe essence of this exercise is to come up with a list of life roles to which all your goals belong. You want a promotion? This belongs to the Professional roles. Feel free to be even more specific if your profession is an intersection of two different roles (*e.g. Business Leader* and *Technical Leader*). You want to spend more time with your children? This is the Parent role. You want to have a good relationship with your spouse? This is the Spouse role.\n\nStart with as little as possible and gradually expand them over time. Or start with as many as possible and early on decide into just a few where you want to invest your energy.\n\n## Life Role - Call to Action\n\nThis is a list of practical steps that you can take to define (or *uncover*) your life roles.\n\n### 1. Start with your goals\n\nThe way we have been defining your goals in previous articles naturally leads to also uncovering the life roles that will benefit from them. If you picture your goals as a funnel, then you have one or several short-term goals feeding into one mid-term goal. Then, you have one or more mid-term goals feeding into one long-term goal. And finally, you have each long-term goal improving certain aspect of your life. Guess what? This will be one of your life roles.\n\n### 2. Look where your time goes\n\nAnother option to uncover the hats that you wear is just to track your time. Spend a few weeks only writing down how do you spend your time.\n\n* How did you morning look like?\n* Did you wake up and exercise?\n* Did you wake up and prepare breakfast for the family?\n* Or did you wake up and check your email?\n* What did you do while you commute?\n* What did your first hour at work look like?\n\nFinally, at the end of each week try to bucketize the time slots into bigger categories. These categories will be your life roles, or will gradually lead you to your life roles as you continue to summarize and aggregate.\n\n### 3. Did you forget yourself again?\n\nJust like the flight attendants in an airplane would tell you that in case if emergency you should put your own mask first and just then start assisting others, I also believe that putting yourself first (or at least *on the list*) will have the greatest benefits in your life. I am not saying that you need to be selfish all the time to the point where you drive away your friends and colleagues. But you need to be just a bit selfish.\n\n### 4. Find the gaps\n\n*Which aspect of your life where you want to invest time is missing?* This is very important question that will lead to your personal growth. Maybe you’ve neglected your career and you want to push harder there. Or, you have neglected your family and it is not even on the list. These are important realizations and once you make them, make sure to put these roles on the list.\n\n### 5. Visualize the role\n\nThe next step is to visualize the life role by putting a name to it, or a description, an avatar, or a persona. My personal choice was to describe each role with one noun and several adjectives. “*Hardworking, Trustworthy, Reliable, Supporting Tech Leader*” is one of them. I’ve bound the adjectives to my values as a person and to my principles. Feel free to experiment, but when you read or hear the description (or the avatar, or the name), you need to get a full picture in your head.\n\n### 6. Project into the future\n\nOnce again, I will help with a few questions that I always use:\n\n* Where do you want to be in each of these categories in the future?\n* Do your goals align with this vision?\n* What gaps do you see between now and then?\n* Do you see a path from now to the future?\n* What obstacles do you see on your path?\n\n### 7. Define your vision\n\nThe vision associated with each role is just something inspirational aligned with your values, principles, and goals. “*Love what you do! Learn weekly! Thing strategically about your career.*” This is the perfect vision of the future about this role. Think along Steven Covey’s 4 Ls that describe the four human dimensions: **Life** (physical), **Love** (Emotional), **Learn** (Mental), **Legacy** (Spiritual).\n\n### 8. Define your mission\n\nNow take step 6 and step 7 and combine them into a bold mission statement. \"*You love helping others achieve their life dreams. The legacy that you will leave behind will be the 10 books that you will write.*\"\n\n### 9. Review, re-write, re-do\n\nGo back to that list every month and even every few weeks and align what you’ve written with your actual life. Sometimes life will go in another direction and you will have to adjust your goals. Sometimes you will want to adjust your goals so that you can push your life in another direction.\n\n## Summary\n\nNo matter what your profession is, what your current relationship status is, or where your dreams go, you have a number of life roles. Whether you realize it or not, you emphasize some of them and neglect others. I believe that by formalizing your knowledge and paying attention to these, you will be able to position yourself better and you will be able to concentrate exactly where you want to concentrate (or think you are concentrated but fail to achieve your goals).\n\nTin Mayer\n\nAuthor", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/c65jyp/life_roles_how_to_find_and_influence_the_hats_you/", "title": "Life Roles: How to Find and Influence the Hats You Wear", "social_network": "reddit", "user": "tinmmayer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1561642286, "permalink": "/r/DecidingToBeBetter/comments/c65jyp/life_roles_how_to_find_and_influence_the_hats_you/", "nsfw": false, "first_save": 1635437134.4480453, "replies_charged": false}