{"id": "t5_2tand_t3_fnse8d", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "TL:DR -- I would like to become someone's battle buddy to ensure that we hold each other accountable for our goals and remain disciplined after the initial burst of energy wears off. \n\n&#x200B;\n\nWhile scrolling through self-improvement subreddits, I often come across a common problem -- people have trouble maintaining a high level of discipline for prolonged periods of time. Cool! Sounds like something I also have trouble with, so let's help each other. Will you be my.....battle buddy?\n\nWhat is a battle buddy? \n\nThe battle buddy system is utilized by the United States Army with the goal of decreasing suicide rates among soldiers and helping them assimilate into military life. It consists of partnering two soldiers up to build companionship, promote problem-solving, and to enhance leadership capabilities. Such a system has yielded positive results, and I want take this success and apply it to civilian life. \n\nThe goal of the battle buddy system is to hold each other accountable and to ensure that we are taking the steps necessary to achieve our goals. We will nurture discipline. We can be vulnerable to one another, overcome our failures, and rejoice in our success.\n\nWhat my battle buddy system entails:\n\nI will call you once a day (or every other day, or weekly) through Skype, Whatsapp, or some other voice call mechanism. These calls will generally be short (I'm thinking 15 minutes). We will give a quick recap of our day, and what we accomplished. We will bounce ideas off of one another and give each other feedback on ways we can reach our goals more efficiently. Yup, it's that simple! We'll be the friends that start our journey together and make sure that we don't stop trekking.  \n\n&#x200B;\n\nThe areas I wish to improve on (due to length, this is a really basic synopsis. We'll discuss more later):\n\nPhysically -- This is actually my strongest area. I do not consume alcohol, drugs, nor junk food. My diet has been consistent. I weight train four days a week. My goal is to introduce cardio into my weekly regimen. This will come in the form of doing one of these at least 2-3x weekly: 20 minutes on the stair master, 2 mile jog, jumping rope, and doing soccer drills (I don't play soccer, but I want to work on my agility). \n\nFinancially -- This is my weakest area. Also, it seems that the United States is entering an economic depression, so I anticipate that this will easily be the most difficult to improve. My goal is to be financially independent. While I do have a career path that I am working towards, I do not wish to stay in it for long. I understand that I will have to work a 9-5 for some time, but I'm hoping that my minimalistic tendencies will allow me to be self-sustainable enough to focus my energy on a few ideas that I have. \n\nMentally -- After I graduated from University, I  lost my identity and went into a bit of a depressive state. I went from driven, to becoming lethargic and complacent with what I deemed to be unfavorable circumstances. After some self-reflection and reading into stoicism, I have began taking the steps necessary to regain my aura.\n\nRelationally -- I isolated myself due to my prolonged depressive state. This was to the detriment of many of my familial and platonic relationships. I'm still on good terms with my friends and family, but I wish to re-connect. I wish to be a pillar of strength again for my friends, family, and community. I am also expanding my interests and will be more active in attending events so that I can meet new friends and hopefully form a few unbreakable bonds. I want to build new experiences and form new memories.\n\nSpiritually -- This category encapsulates the other four categories. I want to successfully disengage from all of my vices. I want to become a Man of Lotus (pure, re-born, and on my purpose). I must protect my essence and my aura at all costs so that I can channel it into helping my community and fellow man. I have a few ideas to help individuals with depression get back on track and not become completely desolate. One could say that what I am seeking here is a prototype for one of my ideas. \n\n&#x200B;\n\nI am:\n\n\\- A 24 year old male that lives in the United States\n\n\\- I have an undergraduate degree in general biology. I am attempting to get into graduate school to further my studies in cellular biology. \n\n\\-Hobbies I wish to start: Hammock camping, backpacking, the occasional roadtrip that will include a lot of stops and events\n\n\\-Skills that I wish to learn: Gardening, basic programming, violin, jiu jitsu, new languages (Igbo -- parent's Native tongue, Spanish -- useful in many places, Mandarin -- will be useful)\n\n&#x200B;\n\nType of person I am looking for:\n\n\\-Female between the age of 21-25 (And no, I am neither a creep, nor am I looking for a romantic relationship. Strictly platonic.)\n\n\\-Lives in the United States (because of cultural similarities) and is fluent in English \n\n\\-Wants to improve, set goals, and achieve them, but needs help committing to a disciplined routine\n\n\\-Big plus if you want to enter a graduate or professional program\n\n&#x200B;\n\nIf you're at a similar time and position in your life as me and wish to have me as your battle buddy, feel free to DM me with your background and your goals. I'm only looking for one battle buddy, but if this system garners enough interest, I'll create a mechanism for others to be able to connect with a battle buddy of their own.\n\nAlso, if there is enough interest, I will create a GroupMe for young men (18-26 years old) that wish to be their best self. I understand the feelings of loneliness, anguish, and despair that many feel as they attempt to regain their essence -- understand that you are not alone and we can all be there for each other through our hardships. We can share our progress, achievements, ideas, and positivity with one another in the group. \n\nNo more vices -- we must protect our essence.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fnse8d/dear_battle_buddy_a_phoned_connection/", "title": "Dear Battle Buddy -- A Phoned Connection", "social_network": "reddit", "user": "ManofLotus", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1584998975, "permalink": "/r/DecidingToBeBetter/comments/fnse8d/dear_battle_buddy_a_phoned_connection/", "nsfw": false, "first_save": 1635436060.4922485, "replies_charged": false}