{"id": "t5_2tand_t3_lvade1", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Hey all, just a bit of a vent here. Hoping someone can relate and help me out.\n\nI have always been a huge empath, extrovert and people person. I’ve had amazing friends and family, and always felt well loved. I was an honours student through school and felt capable and intelligent. I struggled largely with self confidence when it came to my physical appearance, but I always believed I was a good person. I was always known as the best friend to everyone. \n\nRecently, i’ve moved out with my boyfriend and I am beginning to notice a plethora of very negative traits that I have. I was an only child growing up (not an excuse), and I find I can be unbearably selfish. I desire attention regularly, and find it hard to respect other’s boundaries at times. I find myself saying/doing things I feel the need to say/do to feel better (venting, over explaining myself, etc) without concern or awareness of the other person’s needs. When I do something wrong, I vent about how upset and disappointed in myself I feel, which I know logically is manipulative and in search of the person I had wronged making me feel better. I feel awful about the way I have been behaving and desperately want to change.\n\nI feel unsure about my career - I’m ignoring important information, slacking off and procrastinating, and I feel like all the ways I used to view myself as a hard worker and intelligent are no longer true. I don’t know what happened.\n\nLong story short, I feel like i’m stuck in an identity crisis. I’ve always believed I was a good person and loved who I am, but now I’m not so sure. It makes me miserable, and all I want in the world is feel confident that I am not causing any distress or emotional/mental harm unintentionally to those around me. I love my friends and family, and I love my career - I just need to break away from whatever is going on with me. I’m scared that it’s “the real me” or is permanent. I’m scared that I’m a narcissist, as it is so unbelievably far removed from the way i’ve always known myself to be. I don’t know why I am like this or when it happened, but I am terrified.\n\nIf anyone has any idea what i’m talking about or has any resources (books, videos, websites, anything) please let me know. Major thanks in advance.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lvade1/realizing_my_toxic_traits/", "title": "Realizing my toxic traits", "social_network": "reddit", "user": "beanston", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 444, "down_vote": 0, "creation": 1614608417, "permalink": "/r/DecidingToBeBetter/comments/lvade1/realizing_my_toxic_traits/", "nsfw": false, "first_save": 1635435093.7757664, "replies_charged": false}