{"id": "t5_2tand_t3_orcwz3", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff", "802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "It’s not necessarily about new knowledge. Once you get to a certain point in the self-improvement literature it becomes quite repetitive. It has the capacity to get much deeper if you delve into the academic literature of psychology and philosophy which can help strengthen your views of self, meaning of life, biological and social factors, and stronger arguments within which to root your conceptions.\n\n\nBut for many people, what you will read here is now common knowledge. The point is not that you will have your mind blown all the time with new concepts and literature, but sometimes the point is to keep the concepts active in your mind.\n\n\nWhat good is knowing about all the self-help literature if it’s passive in your brain, not at the centre of attention, or forgotten? In many sports, and martial arts, the fundamentals consistently get worked on. The athletes know the basics, they are bored of them, the complacent ignore them, the champions keep practicing them. It’s the same with these concepts, you can’t let them fade, you must consistently keep practicing them, keep them in attention until they’re habitual. Then review them routinely to keep them fresh and renew the importance they play. \n\n\nThe basics get boring, but they must still be practiced. They won’t do you any good if they’re simply forgotten or ignored. \n\n\nIf someone asks you what your goals are right now, can you answer them (and how clearly, and how definite)? Are you still writing goals down (yearly, monthly, daily, maybe even hourly)? Are you meditating about the ideal point you want to reach? Do you take time daily to be grateful for what you have, while still creating a hunger to achieve more? Do you consistently continue working on a task that will get you closer to your goals? Do you try to develop a pleasing personality? Are you getting more or less confident as time passes? Are you conscious of the effects your environment, friends, and acquaintances are having on you? \n\n\nMany, if not most, people know the importance of setting goals. Many know the importance of having teams, taking action, being consistent, being motivated and disciplined. But most people don’t practice them, or they do for a bit then forget. Why is that? The importance is forgotten, and the repetition of the basics helps build, and maintain, a strong foundation upon which we can keep improving.\n\n\nIt’s hard to have all these things in tune at all times without having a serious passion or coach and teammates, or both. What most of us can do is intentionally focus on one aspect a day and gauge how it is in our lives. Yes, it’s boring, repetitive, monotonous, feel like we’re gaining nothing from it, yet our improvement will be harmed if these characteristics begin to falter. \n\nDon’t forget the basics.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/orcwz3/it_gets_boring_and_repetitive/", "title": "It Gets Boring and Repetitive", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1627224572, "permalink": "/r/DecidingToBeBetter/comments/orcwz3/it_gets_boring_and_repetitive/", "nsfw": false, "first_save": 1635436020.420884, "replies_charged": false}