{"id": "t5_2tand_t3_gijyvm", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I’ve struggled with social anxiety and mild depression for the past 8 years or so of my life (I’m 23) and they’ve both negatively affected every aspect of my life. I don’t participate in any activities at my university bc of my social anxiety so I often feel lonely, my life is kind of a mess, and it’s hard for me to get motivated to actually change anything about it. I’ve gotten to a point where I’ve become complacent about my situation and don’t actively try to change anything unless something big happens. \n\nFor example, two years ago I told my friend I had feelings for him but he didn’t feel the same way. So for the first couple of months afterwards, I was really trying to overcome my issues bc I was in a lot of pain (I even went to therapy), but once that pain subsided I stopped trying. Earlier this year, I told him that I still liked him (I thought this time was different) but he rejected me again, and for the first couple of months it was the same thing: I tried changing my maladaptive thoughts, improving my self-esteem, working on my social anxiety, and so on. But again, I stopped trying.\n\nIt’s become clear to me that I’m only motivated to change when my situation causes me a lot of pain, and I hate that. If I’m only trying to change in response to things like this, then it’s because I don’t even have enough love for myself to want to change *for me* regardless of what’s happening in my life. So my question is: how do I motivate myself to change in spite of the fact that I’ve become complacent with my situation? And how do I sow that necessary self-love to want to change for myself?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gijyvm/how_can_i_be_motivated_to_change_even_when_things/", "title": "How can I be motivated to change even when things are “ok”? And more importantly, to change for *me*?", "social_network": "reddit", "user": "Garcib9", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1589316216, "permalink": "/r/DecidingToBeBetter/comments/gijyvm/how_can_i_be_motivated_to_change_even_when_things/", "nsfw": false, "first_save": 1635436058.397773, "replies_charged": false}