{"id": "t5_2tand_t3_ngpjxs", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "d16532c7-3c5c-45c4-ab79-168cb2cfbb61", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I have seriously considered sharing my story here for a long time.  My story will be a bit long so I apologize. Today I turn 28, and it is very common for my daily routine to have these tides from the past that generally overflow with sadness. I gain strength and do my exercises stronger, I look back and, although the tears fall, I continue to concentrate on the present.\n\nI have loved a woman, what will we call D, even now, for many years.  Almost husband and wife, a beautiful relationship of almost 5 years that ended very badly. She was my best friend. All started very slowly. We met at a conference where I gave a lecture. We started to go out, we became friends, and over time we grew to like each other. From the beginning I undressed myself with my defects and virtues, hoping that from past experiences, I would not make the same mistakes. I thought she had done the same. But she spoke words that I will never forget.\n\n>When you find out who I am, and you will go.\n\nD had a beautiful personality, I considered her as the sun of my life, since I am the opposite (an Introvert). But that does not mean that I was happy on my own before I met her, everything was going very well. Over time I understood that it was the love of my life, we planned so many things and shared so many dreams that now it seems that I was fooling myself into pursuing the same dreams alone. I got to know her very well, well enough to know that she was carrying a sadness from far behind, which never wanted to heal, despite the fact that financial support was not a problem and I wanted to disguise everything as couples therapy.\n\nCurrently, I work as a professor at a university (head of laboratory practices). Since the virus arrived, my work tripled to the point that I rarely had the time to chat with her or watch a movie via zoom or google meet. Logically, our carnal desire was also even greater, but we could not satisfy it more than in a virtual way. We were unable to move together precisely because of the pandemic. So the relationship was like this for almost the last year. She can't quite understand it, so she thought she was being left alone. She also couldn't stand his family, and the only consolation that I could give her was that I would always be there for her whenever she needed me. Eventually, living with herself led (for a long time) her to take distance from everyone and tell me even I have time, she must tell me something. We had seen each other a couple of times before that, in reality it all happened in a month, and since the beginning of 2020, I had had a wedding ring forged that had written in Braille:\n\n>Even if the storms come, I know that if I'm your side we will overcome them together\n\nSo on the day he had met me, I was going to propose to her.\n\nTo summarise, that same day she ended the relationship with many excuses, they were very confusing, but I understood that she wanted to be alone. So I agreed, I kept the ring, and I was talking with her how much fun we had during those years. I recived a call in that moment, my grandmother was entering the hospital for Covid, so I told her and left. Before I left she had confessed to me that she tried to commit suicide in the time that I did not know her, I thanked her for how brave she had been for telling me, I hugged her and told her that I would always be there for her, only if she wanted it. That day, was probably the saddest day of my life, my beloved left me, my relatives began to fall one by one to the virus, and only I was left.\n\nI spent days going to the hospital and feeling very unhappy, I constantly felt that it would be best to end everything. But every time I remembered my family (my grandmother, mother, aunt, uncle and cousin) I understood that I still couldn't afford such a luxury. If I disappeared, they would have the least chance of surviving the virus, since someone who is not hospitalized is always needed. I got psychological help as quickly as I could, to overcome the duel and the crisis that I was facing. I started to exercise, to motivate myself and not let be defeated by anything, by the way, to prevent my thoughts from defeating, to have a stronger mind as well. Several months passed.\n\nLife sometimes plays in strange ways. My cell phone was stolen and I had to go back to the cell phone I used when I was with D. An old message that was never sent, that day it was sent to Discord and we started talking again. We agreed to meet. I had overcome the pain, I did not hold a grudge and still loved her very much. Not knowing why we broke up, I decided to win her back, what I saw was not pretty. I saw her thin, I could feel her ribs, she didn't eat well and all the time she said that I was better off without her. Immediately, I remembered her last words and began to hang out  more often in order to help her get out of the hole. Then the second attempt came, and his relatives finally found out about her illness. ***She has chronic dysthymia***, started therapy and also began to develop a very narcissistic and selfish personality that maybe she had been asleep all the time.\n\nI spent all my savings on my relatives and on her, I helped her in a modeling career on Instagram,  with makeup, I learned basically everything since cero, I thought in this way as a method upon which she would improve her self-esteem. Every time I had a chance I would tell her to go out, maybe play something like \"just dance\", go for a walk, watch a movie or talk about fun things. I understood her situation and for a long time I thought that she did not insist on seeing me because of her illness. Then, she began to force changes in his personality and beliefs. First, she is bisexual and a feminist, but somehow, she created a sexual account somewhere and got a Sugar Daddy, practically betrayed the ideology of selling herself to some stranger and tried to convince myself that it was a good idea. I've known her for so many years, not for nothing, but I knew that she didn't even believe it herself. In addition, doing this went against her therapy, I told her that if she needed financial support I could give it to her, it was not necessary to do these things and that I did not judge her, but apparently she continued to do so. Her depression increased.\n\nBefore everything was ruined. We went out to a boardwalk in our city. She said she loved me, but because of her condition she still can't be with me, since she wants to give all of her to me. I replied that if that is what she can give me, it is because it is everything and it is a lot, that it is not necessary to give great things for the relationship to work, just be honest and never keep things as hard as what she is going through right now. Normally, we consume our love whenever we see each other, but it was not just sex, it was deep conversations about life, our dreams, goals and the things we would have together once everything is solved. The final day arrived.\n\nAll happened in one day. First, she made me wait about four hours, without even answering my calls, an ugly mania that she always had. When she finally arrived, I saw her very badly, I couldn't even articulate coherent words (the meds I thought), and sometimes she looked at me as if we were talking, but it really wasn't like that, so as not to make her feel bad I kept asking her things while she answered me with her gaze. I asked her better to go home and see us another day, but she didn't want to. Then, for someone reason she showed me her TikTok account in which she reply to \"Four words that women like to say\" with \"I also like girls\". Also, showed me other videos talking about handsome tiktokers and that she hopes they are of legal age. Inconsistencies, I did not consider her immature to do this kind of thing either, but apparently she thought it would not affect me, it was very random and uncomfortable. I'll ask for the second time to go home with me, but she threw a tantrum, and then almost passed out. When I was about to call her mother, she asked me to please not do it, because they would not let her go out anymore. She told me to go somewhere that she needed to rest, so I took her to a hotel and she was sleeping for hours.\n\nAll was very confusing, I feel guilty because I knew I should have taken her home, but I was also afraid that her mother would forbid me to go out with her. Between the hours that she was sleeping, she had many nightmares in which asked for help and water. I helped bring down her fever with wet towels from the hotel. While hugging her, she pushed me once, She was already a little awake and I asked her why she rejected me like that. She could not answer anything. But asked:\n\n>Why you love me?\n\nWhen I started to answer her, she apparently couldn't hear me, her glance directed at the sheets, only she pay me attention when I did say a few words:\n\n>... This is why I am afraid to lost you again, because you are not telling me nothing else, it feels like you are being involved emotionally with new persons in TikTok and Instagram ... but ...\n\nIt was at that moment that she unleashed all her rage against me, among all the insults she gave me were: \"You are selfish, insensitive, you don't care about me.\" She pushed me with such force that ripped some of the flesh off my forearm. As much as I tried to calm her down, she kept attacking me with words. I haven't had an asthmatic attack in years and at that moment I felt like dying. When everything was calmer, she asked me to make love, then we would talk these things later. When we were in our homes, She told me that I was irresponsible for not taking her home, that she had blackouts and she remembers very little of the things that happened. I played along. Currently, I take it as a great excuse to justify her behavior that day. She rejected me twice after that, On February 14 I wrote her a farewell letter, which she surely did not understand, and for which she only thanked. She persisted in the conversation until a delayed gift arrived days later. And since then I don't know anything about her, she hasn't spoken to me, yet. Today It is my birthday, and she hasn't even said hello to me, I would like to end everything here. I think I helped her enough, but she does not love me, nor does she value me.  I recently met her sister, and she told me that last year (which was when we broke up), D told her that we broke up because I had no decision-making power and didn't know what I wanted with my life... A lie ... basically she has lied to avoid the fatigue of being asked of us, if she prefers to invent anything, rather than do justice to me, to us, I think those 5 years did not mean anything to her.\n\nI am going to translate this whole story into a book, which bears the title of the post. How much I have suffered this time. How today I threw the wedding ring in the nearby lake where we had our first kiss. I keep fighting not to have those thoughts of ending it all. I want to see how far I can go, and I feel like maybe someone reading this could benefit from this (**in become better**). Sorry if it was too long, I hope someone can read it. I also apologize for my grammar, I stopped practicing my English a long time ago. Thank you very much for reading me. Bye. J.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ngpjxs/what_the_past_left_me_a_chronicle_of_life/", "title": "What the past left me - A chronicle of life", "social_network": "reddit", "user": "Hitzugy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1621481400, "permalink": "/r/DecidingToBeBetter/comments/ngpjxs/what_the_past_left_me_a_chronicle_of_life/", "nsfw": false, "first_save": 1635436846.5936193, "replies_charged": false}