{"id": "t5_2tand_t3_qdbkxu", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I (24m) broke up with my gf(F23) of 3.5 years one year ago. The relationship was abusive (physical and emotional) right from the start but I was not aware of it. After she scratched, slapped and punched me she would get me flowers (with a note saying it all happened because of how much she loves me) The situation was that bad and I was that stupid.\n\nI gradually become less and less happy with myself and my life. My self esteem became worse and worse and I became attached to her. I rarely did anything just by myself, she was there even when I met with my best friends etc.\n\nThen my dad died and covid started in my country and I became depressed, I was putting %90 of the effort for the relationship before this so this affected us. Two months after my dad died, she said she was sick of supporting me, and I wasn't doing anything to be better. Breaking up with her happened 4 months later.\n\nBut stupid me, started to talk to her again after a couple of months, became friends again, kind of a FWB situation. But in last May I realized, she was just using me. I met her everytime she was feeling down, studied her lectures and then explained them to her, but she couldn't even pick up the phone when my mom fainted and I needed someone to talk. \n\nI stopped putting any effort after this happened. Last june her aunt got diagnosed with cancer(my dad died bcs of cancer) I sent her a message saying I'm there if she needs anything and she said thanks, but after that day she called me and said she was disappointed with me, because I didnt call her :') then said the most hurtful thing anyone had ever told me: I was happy that her aunt was diagnosed with cancer and I was praying that her aunt dies (because of the things she said to me about my dad)\nI cut contact with her immediately, ten days later she called me and asked me to apologize, for not calling her :') I told her to leave me alone, and blocked her on everything. This was our last interaction.\n\nThe long backstory is complete :')\n\nThis is for every abusive relationship survivor\n\nI started to work on myself, continued to going to therapy, spent time with my family and friends. Gradually I started to feel better and happy. I was filled with energy. My friends noticed the change and complimented on how much I became better and positive person. But what my best friend said really made me tear up, He said I didn't became simply better, I became my old self, before I met her. \n\nAbusive relationships makes you forget how you were before them. Strips you from your Self and changes it to some living thing that parasites feed on. I started to things that I couldn't do with her and again realized how much I lost in those 3.5 years and how much I can gain if I remember this lesson. I love myself and others more. I realized my best friends were always there for me and I didnt had to rely on her.\n\nDont get me wrong it wasn't over and done, I still have a lot to overcome about my self esteem and worth issues. Right now I am terrified of relationships but I will get to a point where I can start a new relationship, knowing my boundaries and worth.\n\nAnd to any abusive relationship survivors: Its okay to miss them, its okay to want to call them, I teared when I passed near our first date location or when I found her gift that I forgot to throw out. This does not make you any less stronger, hell I believe it makes me even more stronger. I know everything that happened and I know there is no turning back and I know the harm she caused me. I will overcome it all.\n\nAnd I know there will be a time which I wont miss her, wont even hate her. I owe this to myself.\n\nEdit: Thank you for the messages, comments and awards! I read all of them but can't answer them all, I just want to say, from the bottom of my heart, thank you! I don't know why I posted this today; maybe just wanted to rant, maybe to show myself again the path I endured and maybe to remind myself to be strong, but your reactions to my post made me feel so good and I felt proud of myself. And anyone who needs someone to talk or rant can send me a message, take care!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qdbkxu/about_leaving_an_abusive_relationship_and_what_my/", "title": "About leaving an abusive relationship and what my best friend said to me made me tear up (of joy)", "social_network": "reddit", "user": "Jack_of_all_trades54", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 251, "down_vote": 0, "creation": 1634887183, "permalink": "/r/DecidingToBeBetter/comments/qdbkxu/about_leaving_an_abusive_relationship_and_what_my/", "nsfw": false, "first_save": 1635436821.70799, "replies_charged": false}