{"id": "t5_2tand_t3_qaxzhu", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": " A little about myself, I (33m) worked in a major city for 8 years after moving away from home a couple years after college. During the pandemic I had a major meltdown. I suppressed a lot of emotions all my life , through drinking/smoking, friends that cared but weren't the best for me and being desperate for attention from women and coworkers. All the emotions I suppressed could not be avoided with all the isolation of the pandemic. Most of my life, probably since high school, , it's seemed like people knew I had an issue. folks would said things to me, but i ignored or wouldn't get where it was coming from. It feels like I'm the last one to find out how many issues i had.   \n\n\nDuring my meltdown I felt super weak. I had a lot of moments of weakness, reaching out to random people in my network with random ideas, and they all politely let me down easy. I broke down crying in front of a friend at one point. As a grown man, it was embarrassing.  \n\n\nI have uncovered a lot of my unhealthy habits--always making things about me, one upping stories, thinking I was special because I lived in a big city, sleeping with women i worked with, starting a relationship with a married woman who i worked with, being critical instead of kind. I hated myself and who i had become. I moved back home with my parents to start over and work on myself.  \n\n\nI noticed that when I see the few friends I still have, I talk about myself and I find it annoying. Who wants to hear about my depression all the time? I see a therapist so I have an outlet bi-weekly. I also now journal daily. I feel guilty for talking about myself and my struggles and I feel my friends feel I'm a bit pathetic at this point. Any advice on getting out of the cycle of always talking about yourself but also being open with your struggles?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qaxzhu/feel_pathetic_trying_to_get_my_life_together/", "title": "Feel pathetic. Trying to get my life together", "social_network": "reddit", "user": "Choice_Tomorrow360", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1634597291, "permalink": "/r/DecidingToBeBetter/comments/qaxzhu/feel_pathetic_trying_to_get_my_life_together/", "nsfw": false, "first_save": 1635436286.4526055, "replies_charged": false}