{"id": "t5_2tand_t3_qfyghq_t1_hi33cam", "creation": 1635230656, "origin": "t5_2tand_t3_qfyghq", "height": 1, "replied_to": "t5_2tand_t3_qfyghq", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Random_user_00000000", "text": "Set up a website blocker on your web browser on your computer to block YouTube and Reddit. Set up screen time limits if you have an iPhone because even if you know the code to unlock it since you set it up, you’re still less likely to interact with it since it’s locked to begin with. With my iPhone, I typically keep screen time on from the morning until like 2-3 pm but you should set it up so it accommodates your study time. If this doesn’t work for you or you just want another alternative, you can record a time lapse of yourself while you do your homework. This makes it so you can’t go on your phone since it’ll be recording you and after you’re done studying and doing work, you can see the video afterwards and see how hard you worked. It’s pretty cool and rewarding. I would also recommend contacting your professors during their office hours if you have any additional questions that you have after studying that you need answered. It not only shows initiative on your part but it shows them that you actually want to put in the work to learn and pass their class. It can also help you build a better relationship with your professors. \n\n\nAlso, most universities offer free tutoring (since it’s included in tuition fees) so I recommend checking out what your school offers if you think you need the extra help.\n\n\nAnother thing that helps is making a to do list every day. It helps you recognize what tasks or topics you should place focus on and it feels rewarding to check them off of the list after you complete them.\n\n\nBest of luck to you and “please believe there is still time for you to be all that you want to be, there is time” (just a quote I read today that I think could help you too)\n\nJust focus in on your priorities, and if tough encouragement helps, >!get your head out of your ass and get out of your own way!< You can do this.", "permalink": "/r/DecidingToBeBetter/comments/qfyghq/all_i_do_is_procrastinate_and_when_i_try_to_study/hi33cam/"}