{"id": "t5_2tand_t3_ik2d85_t1_g3o3fpz", "creation": 1599010246, "origin": "t5_2tand_t3_ik2d85", "height": 1, "replied_to": "t5_2tand_t3_ik2d85", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rock_kid", "text": "I don't have kids, but we mentored some teens through a youth group and they're struggling to understand. He also has a 2yo cousin we live with who stopped talking about my SO as soon as he disappeared from the house, but talks about me when I'm not home because I actively engage with him and he misses me when I'm at work. When he's older we'll explain a little more.\n\nBut I do have the magic answer for you about being lonely, I really do.\n\nLearn to enjoy your own company.\n\nI'm an introvert so that helps, but this was my best friend so I didn't want it to go like this. However, I value peace so much and he was only chaos in the end. Being alone now makes me so happy. I fall asleep with the TV on when I want to. I write stories openly whenever I want without the concern of him looking over my shoulder (it's an artist thing I guess, I can't create if I feel I'm already being judged). I can basically do whatever I want without ever feeling like if I'm not spending time with him at every opportunity it's my fault he's cheating on me. Which is untrue bullshit I never deserved to feel. I am *free*.\n\nOn another note, I lost my mom a couple years back and my dad took it hard. Cancer at 55. They could have had another 30 years together if they were lucky! But he's reached a place where, yes, he's lonely and would like company again someday. But he keeps busy and fills his time with projects that make him happy.\n\nWhile I'm delighted at my new setting, and he's clearly still hurt, we're both at a similar stage in life where we're suddenly alone and learning to enjoy our own company.\n\nSo please don't let the fear of being alone keep you with someone who's draining your life away. It's not worth it. If you rip the band-aid off, it will hurt but you will heal. If you don't want to feel alone, surround yourself with friends, get a dog, or maybe find a new social hobby that builds relationships. With Covid it's hard but I'm imagining, like a video DnD campaign, and whatever the non-geek version of that is if you're not into geeky things.\n\nRebuilding is definitely hard but never impossible, and I believe that if you go through it you'll come out the other side as a person you really like being.\n\nBest of luck.", "permalink": "/r/DecidingToBeBetter/comments/ik2d85/i_decided_to_stop_giving_my_husband_chances_to/g3o3fpz/"}