{"id": "t5_2tand_t3_ik2d85_t1_g3lau2e", "creation": 1598970219, "origin": "t5_2tand_t3_ik2d85", "height": 1, "replied_to": "t5_2tand_t3_ik2d85", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rock_kid", "text": "That's an amazing question I wish I had the right answer to but I'll do my best with my own experiences.\n\nFor me, \"doin' stuff\" is part of how I feel, idk, alive. Getting to participate in actions that bring me joy. When I can't do those things, I feel like my life has no purpose and depression sinks back in. These are things that, for me, make me feel like I'm growing, time is passing, and I'm part of a bigger picture. Writing, reading, making art, building skills like learning to play music, helping things grow like my new sea monkeys and the bonzai trees that are arriving today. Anything that's meaningful personally.\n\nI think, I love that stuff so much that without it I feel lost and pointless as a human, so I put myself into it and THAT becomes my identity more than depression. But I had to tip the scales that way, to make my passions weigh more than my desire to end it all. That was a choice and it's hard. Support and therapy help.\n\nI needed to get to a point where doing those things, and with joy, was a stronger desire than holding onto the excuses depression allowed me to not do those things.\n\nIt's uncomfortable and hard but I had to form routines and block excuses. I had to tell myself \"I am waking up at 6 am and writing, no excuses.\" So I'd start protecting my bedtime so my excuse of \"I'm too tired today\" was weak because I knew I'd gotten enough sleep. \"I am keeping the TV off when I come home from work so I can practice my ukulele instead of melting in front of the TV.\" Then I remind myself how uncomfortable growing fingertip callouses is when starting a stringed instrument so I have to play every day so that I only have to do that once, all while feeling myself get better at something I care about doing.\n\nI'm not a therapist and if you're struggling I recommend talking to one. The Better Help app is what I use but insurance doesn't cover the cost and I get that therapy isn't always accessible. If you can pay the $260 for a month or apply for a discounted rate (I get 15% off but it's still expensive) even for a month it can help.\n\nBut on your own, if you can find something that you want, or want to want, badly enough to tell depression to fuck off, focus on it and try to arrange your life or thinking to prioritize and identify with it.\n\nSomething I recently learned about with my last college class was setting \"SMART\" goals and I think that's useful here to fight off discouragement.\n\nIf you just want to identify as a happy person, or a person who ____, then a goal will probably help you get there. SMART means Specific, Measurable, Achievable, Realistic, and something about Time. You can Google this if you want.\n\nAn example would be \"I want to be a happy person\" as a vague goal, versus \"I want to be able to start and finish making that 1000 piece puzzle with my best friend within three months from today, because that would make me happy.\" It's specific (puzzle), measurable (1000 pieces get finished), achievable (because you're capable of doing it, rather than ending world hunger), realistic (only one puzzle instead of fifteen and painting a mural on every wall in your house in the time frame), and gives a time limit (3 mos).\n\nFind something you know or believe will make you feel happy and create a plan to get there, then defend that plan against depression's excuses.\n\n(And just to insert, these ARE *depression's excuses*, not yours. The illness creates them for you and makes them valid. You ARE too tired because depression says so. But if you do it anyway it's that much more rewarding. You aren't making excuses and you're not lazy, even though some people who don't understand what it's like might make you feel that way. I'm not using the word \"excuses\" to claim that anyone who \"fails\" isn't trying hard enough. It's that anyone who succeeds despite the struggles is that much more amazing, even if it just means living another day.)\n\nBecause I was depressed largely due to being unsupported and abused by someone I love, definitely plagued by questions of why I wasn't good enough for him, my happiness revolves around being so engrossed in my own growth that his falling apart can't matter to be anymore. I busy. That's happiness to me.\n\nYou have to find your own but I believe you can get there. You started by asking a question. Whether it's really for a friend, or just \"for a friend\" is for you to know but in any case just reaching out is a huge step. I hid my depression from everyone but him for years so no one else was able to help me or knew how bad things were until I was in crisis mode. Talking about our struggles saves lives, true story.", "permalink": "/r/DecidingToBeBetter/comments/ik2d85/i_decided_to_stop_giving_my_husband_chances_to/g3lau2e/"}