{"id": "t5_2tand_t3_ik2d85_t1_g3nhtc5", "creation": 1599000464, "origin": "t5_2tand_t3_ik2d85", "height": 1, "replied_to": "t5_2tand_t3_ik2d85", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rock_kid", "text": "Good for you!\n\nI'm still learning about it too. This is gonna be long.\n\nSo, I met him when I was 14. Back then, he'd tell me something, then, forgetting he went to school with friends of mine, he'd act otherwise. He got back with his ex back then and my friends caught him, but he lied to them and said we broke up. Only, we did not. Until they told me that, anyway.\n\nBut his stupid face got to me a couple years later, 16 and 18, long distance, and we got back together. I was manipulated by someone else into cheating on him, which is still my fault for acting out of fear instead of facing them, but it complicated things. Basically, my parents never wanted me with my ex husband so in high school I asked someone else to take me to a dance so my parents wouldn't get suspicious and think I was with my bf at the time by going alone after they told me I couldn't go with him. The decoy guy was a friend and cool with it but wanted some action for his effort. He pushed and pushed until I gave in, then I came out to my bf immediately out of extreme guilt, and he made it a huge deal for years and years. Held it over my head into our marriage, even after saying he forgave me.\n\nHe agreed to come to visit me once on the premise that we would have sex for the first time. I changed my mind and withdrew consent before the trip and suddenly he had something come up that prevented him from coming. I compromised and said sex is on again and suddenly that complication cleared up and he came. I was just so happy to see him. We had sex even though I didn't feel ready.\n\nThat was all teenage (18me/21him) stuff, before marriage.\n\nI finished high school and was trying to go to college near him but was daunted by the cost and commute of the school I picked, and found a local certificate program for 1/10 the cost that would keep me from being near him for just one more year, but he convinced me not to do that and just come so we would be close. I didn't want to lose him. I moved, my car broke down, he wouldn't fix it, and I never got to attend college after high school at all, even at the expensive school. He never really cared that much.\n\nHe lost his job and we had to move back home to one if our cities. We could go to my parents', or his. This was in 2012 when people in his city I knew were losing their homes but in mine people still had jobs, and I thought I could get mine back. I was so scared to move to his city. His ex was there, and we'd have no work.\n\nWe moved to his city. I don't even remember why I let that happen anymore but I was right. He fucked his ex within a month and we had no jobs for over a year. I didn't know about the sex until this year but did know they were spending time together and even attending college together which I thought was fucked up but what could I do? I was cleaning his shit out of my room this month, came across an old college notebook of his, and it was full of her handwriting. I got so pissed off that he let that live in my desk in my bedroom where I sleep, that I graffitied the shit out of it and packed it with the rest of his crap. I could have burned it but I'd rather he flip it open someday and see me calling him on his bullshit.\n\nWhat else. He took advantage of my desire for peace and aversion to rocking the boat and would go out with \"friends\" and never give details expecting me not to press him, while I sat at home alone. I told him once that if he died I'd have no idea where to find his body and sometimes he didn't come home for hours after he said he would and I worried myself sick. This is the tricky part. This is where he began to condition me to his non-responses. I would say something like that, which was actually calling him on his shit in real time, and he'd say nothing. Wouldn't give any additional details about that. I began to accept that he heard me and had nothing to add but had plans to get to and would leave. This is how he got out of getting caught in lies and also conditioned me to accept this bullshit as normal behavior. It forced me to enable him to do whatever and whoever the fuck he wanted.\n\nDuring this time he was verbal about how cheating is an awful thing to do, so I trusted someone who spoke that way about an action to not be doing that action. All the while, he occasionally brought up that he still gets upset that I cheated on him once, even though I told him right away and advocated for change in myself. He even made a disgusted face when I was digging through my closet and found the dress I wore to that dance where I cheated on him. I threw it out immediately even though it was still my favorite dress because it upset him I wanted to show him respect, and he just went on about how upsetting it was. Mind you, I cut contact with the boy I cheated with less than a year afterwards, at 17, and have never spoken to him since, and was transparent about who I talk to or don't.\n\nLike. Why the fuck did you marry me if you're clearly not over me getting involved with another boy at sixteen? I'm not saying it's okay for me to cheat but not him, I just feel like he was a real ass about it considering he was fucking his major ex literally the entire time he was giving me shit for one thing I was honest about that happened years before.\n\nI also believe he lied about why he lost jobs, and maybe even when he lost them. He admitted that lied about how much he made and had a secret bank account where a portion of his checks was deposited to do he had money to pay whores. When that job dried up he took from my paycheck. To pay whores. To cheat on me with. This shit still gets me livid. Thankfully all my accounts are separate and safe now.\n\nI think that's the gist of it. Basically there was a sort of grooming involved where he got me used to his behavior, talked against his actions so I didn't question him, oh! And sometimes when I brought up my concerns he'd laugh at me for having them. Gaslighting, baby! Yeah. And he was nice as hell nearly the whole time, so it was hard to get or stay mad at him. Even when bitching about that boy, he did it in a way to guilt me into feeling bad for and then rewarding him. Fuuuck that.", "permalink": "/r/DecidingToBeBetter/comments/ik2d85/i_decided_to_stop_giving_my_husband_chances_to/g3nhtc5/"}