{"id": "t5_2tand_t3_hqdy1u_t1_fxxv54t", "creation": 1594656228, "origin": "t5_2tand_t3_hqdy1u", "height": 1, "replied_to": "t5_2tand_t3_hqdy1u", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mooddr_", "text": "It seems from what you are saying that you two are stuck.\n\nFrom what I can see, the answer is neither \"you are right\" or \"he is right\" but actually \"you both are right\". Let's sztart with his perspective (as far as i can guess it) first.\n\n>(rather than “When you do X, I feel Y” statements).\n\nHe ended up cheating. I broke it off. He then vowed to be better, and actually turned his life around, so i agreed to try again. He was doing everything in his power to make the relationship stronger and to build trust. I appreciated the effort. But I guess I was still doubtful of his fidelity, so I said things like “this is how you should be” or “this is the correct way to be in a monogamous relationship” and “you clearly don’t love me if you still do X”.\n\nWhy would you do that? This pretty much guarantuees that your criticism will be seen as destructive/toxic, because it is. What these statements are saying is that there is an objective way of how things are or should be (\"you clearly do not love me\", \"this is the correct way\", etc), but in reality, there is no objective standard of what constitutes a monogamous relationship, or how love is expressed, or how your partner should be. However, what is completely missing from this \"objective reality\" is how your partner feels - the person you are supposed to care for, and whose feelings you are supposed to take seriously. You are completely ignoring them, treating them as if they do not exist. This is obvioulsy a relationship that is not healthy for him (and for you, but you will probably be able to endure a lot longer than the ignored partner). This can turn abusive easily (and there is some argument to be made that this is always abusive on some level - check out Non-Violent Communication, a concept developed by a professional mediator to resolve arguments satisfactory), and this is probably what your bf means when he says \"toxic\" and this is why he is avoiding the times to talk. From his perspective, you are ignoring his feelings, his motives, his well-being, his thoughts, his entire being essentially. This treatment is the anti-thesis of being respectful towards him, or towards what is going inside of him. This way of criticism is adequate when you deal with someone or something in a situation where feelings do not matter (for example, when you buy a computer: \"This Machine clearly does not follow regulations when it...\", \"The correct result when I pay you should be...\" or \"I want the computer to be able to run this program and that is how it should be\", not when dealing with a human, and that is provbably how he feels being treated by you when you criticise in this way.\n\nAgain, why did you choose this method of criticism? It will destroy your relationship (it has apparently already damaged it) if you persist, so you should probably change this asap, for the sake of the next relationship at least.\n\n\nNow to your points: Yeah, his response is utter bullshit. If he does not like the way you criticise, letting you sit there and wait when you agreed to certain times is just... I don't know, I can't even say what it is, but its utter bullshit. F that, definitely. Exploding back at you might be understandable, but is not helping anyone, either. Invalidating your feelings because he feels you invalidated his just locks the relationship/communication dynamic up in a super unhealthy way with no possibility of development. It is kind of a mexican standoff situation: who ever moves first loses. Not a good place to be as a couple.\n\nForm your other comments I gather that this ship has sailed, and I think it is a good idea to let it sail. He was acting super bad, in a way that is destructive, and the way you formultaed the criticism (and his response to it) allowed no room for growth as a couple.\n\n\nSo, In closing thoughts: His behaviour was gonna kill it one way or another, but the way you stated your feelings (ignoring whats going on inside of him, and stating subjective things as objective fact) wasn't helping. I would never choose to communicate this way, nothing good can come out of it. On the other hand, nothing good can come out of cheating either, so the situation looks unsalvageable either way.", "permalink": "/r/DecidingToBeBetter/comments/hqdy1u/some_insight_please_i_used_to_be_critical_in/fxxv54t/"}