{"id": "t5_2tand_t3_mf2j8a_t1_gsmerhy", "creation": 1616967714, "origin": "t5_2tand_t3_mf2j8a", "height": 1, "replied_to": "t5_2tand_t3_mf2j8a", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Mitch_Eth", "text": "Top tips from a non smoker 5 years gone:\n\nDon't use the word quit - you only quit things you enjoy. No one enjoys smoking, not.a.single.person. if anyone did, the responses on this sub wouldn't be 100% encouragement and support. \n\nInstead you are stopping smoking - better yet, you are now a non-smoker. If you're asked if you want a cig, don't say you're quitting or stopping, just say you are a non-smoker. It will help reassert your commitment :)\n\nNicotine isn't a strong drug - withdrawals to nicotine are actually non existent to mild at most. What keeps people hooked is their serotonin system. If you're having a bad day, remind yourself it's your serotonin, not nicotine. \n\nIt might be a bit late but if you have smokers in your immediate circle, don't tell them you're stopping. There's nothing a smoker friends hates to see more than seeing someone stop, usually because it makes them have to consider stopping themselves. Subconsciously or otherwise, they will seem supportive but pounce on you when you're vulnerable with stress etc and they'll be getting a cig out for you before you've even said anything. \n\nWhen I stopped smoking for the last time, I didn't tell a single person. I got a month in before my step dad at the time mentioned he hadn't seen me smoking. I said I'd stopped and he scoffed and said I wouldn't last a week (shit like this is why it's better not to tell anyone), it was all kinds of satisfying to say I'd already gone a month and watch him figure out he hadn't seen me smoking. \n\n\nBy far the biggest tip:\n\nYou may well pick up a horrible cough after a few days and will bring up a lot of phlegm, that's your lungs cleaning themselves out, don't worry, it's super good for them. You'll have a moment 3/4 weeks later where you will take a breath and think holy shit, that felt amazing- your lungs will be taking in so much more oxygen. Same for food, plan a favourite meal on week 3 or 4 and pay attention to just how good it tastes.\n\nAfter that, it can be difficult, because for a bit life is all kinds of colourful whilst you transition from smoking to non smoking and then that buzz disappears and life just becomes that of anyone else who doesn't smoke. Hold on to the memories from weeks 3/4 of clean breaths and amazing tasting food and also try and have a 'lowest' point memory. Mine was throwing up tar after chain smoking at a house party. Even now when smoking slips into my mind, I remember the highs of stopping and the lows of when I did smoke and the thought quickly vanishes. \n\nHope that helps\n\nEdit: rudely forgot to say good luck, but actually, you don't need luck, you got this :)", "permalink": "/r/DecidingToBeBetter/comments/mf2j8a/smoking_my_last_cigarette_today_excited_to_wake/gsmerhy/"}