{"id": "t5_2tand_t3_kg2ygf_t1_ggceb5g", "creation": 1608367253, "origin": "t5_2tand_t3_kg2ygf", "height": 1, "replied_to": "t5_2tand_t3_kg2ygf", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kudos_22", "text": "Okay so here's the thing, you can't not try to stop the feelings and just snap out of it lmao. It's a thought process that leads you to the edge and once you're on the edge your mind stops processing decisions. All it thinks then is that its just a small step away, an ending from all of this pain inside. Then for a slight moment it just feels like making the move is a slight more worth it than to go back and feel shitty again. Because none of us know what's on the other side but we always keep believing that its probably better than going back to what we were doing and thinking about how miserably life's treated us and is going to treat is again. (Coming from a 2 times attempt failure, lmao i even suck at dying) Anyway, hey I'm still alive. And I'll tell you, there's no way to snap or boost your thoughts with some magic inside because when reality hits, reality fucking hits. \n\nBut to get back up from there, you need to stop letting yourself being on the edge. You need understanding, perspective and wisdom mate. At least that's how I got out. (Till now lmao) And it's not like you need to start being super productive, push yourself into change everything you lead about life. Hey I'm still self deprecating as fuck. but I know that other's are too.\n\nI know that all these models, fitness instructors, gurus, entrepreneurs making 6 or 7 figures a year, are living the best life imaginable right inside your feed on social media. But that's where you need perspective and wisdom to understand that their life sucks too even having 2 Bugatti's in their garage they're still sad that they don't have a loving partner, that they never got to spend enough time to their family, heck some of them got into their work so much they don't even have a family lmao.\n\nWhen you start to realize that the money they made which enables them to have so much materials and also a bomb ass lifestyle, is just the money humans created themselves just to create a hierarchy to their system to different between people like you and them. Will never mean you're a worse inborn person from them.\n\nMaybe you have a better ability to love, a better ability to understand even more complicated things. And there's absolutely nothing wrong if you never ever tap into those sides of you, ever. Because the goal of all of this fuck we call life is to not be everything we possibly can and achieve some hugeass place of success, it's all about leading a happy life with a few meaningful people drinking around a fireplace, knowing you can survive tomorrow. And you're having a fun night having a meaningful conversation with only a few people who know how you're feeling deep inside. Start doing that, start asking what would give you peace today, if its making a little sketch about spiderman, then that's that.\n\nBut know that it's not that if doing it pushes you towards the edge of things once again. Sending a lot of love homie, please take care of yourself.", "permalink": "/r/DecidingToBeBetter/comments/kg2ygf/failed_suicide_attempt_dont_know_where_to_go_from/ggceb5g/"}