{"id": "t5_2tand_t3_kg2ygf_t1_ggci2x3", "creation": 1608371337, "origin": "t5_2tand_t3_kg2ygf", "height": 1, "replied_to": "t5_2tand_t3_kg2ygf", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TwilightMountain", "text": "Social media truly let's people paint pictures for a perfect life. Trust me when I say nobody's life is as good as it seems online - that's coming from someone who lies about it online themself. \n\nI'm exhausted. I have rape flashbacks on the regular and earlier tonight had a panic attack from it. I have no friends really, and I'm burnt out from work but I've only been working at my new job 2 days. \n\nOnline it looks like I go out with my big friend group of 13 people 1-2 times weekly, have a job I *love*, and keep up with my hobbies of playing guitar, photography and painting. But truly they aren't my friends just my brothers and I tag along. Then I take pictures and post them on Facebook with a lighthearted caption like I'm \"living the life\". I have no time for my hobbies at all. I'm always tired and depressed. \n\nTake time off social media for sure. At the beginning of the year my phone broke and I couldn't afford to replace it for 5 months. I had no laptop or tablet or backup, and I lived with my best friend so if my family needed me they just texted her. I never got online. I couldn't believe how much of a difference it made to not be on social media, it was amazing. But I got a new phone in May, a nice one for the camera, and just like that I was roped back in and addicted to social media again. If you can, please really try to get offline. You'd be amazed at how much free time you have. \n\nAs for the psychiatrist - and just the entire experience with the hospital in general - I'm so sorry. It sounds extremely unprofessional, but I can tell you right now it isn't a reflection of your worth, but just the stress that covid has put on the healthcare system. It's no excuse, but it is a reason. But I will say this: if 5 minutes was all it took for a trained professional to tell you to leave your partner, I really think there's probably a good reason. And everyone will do things in their own time when they are ready, but speaking from personal experience (I have a few failed attempts from my last relationship), my relationship with my ex was pushing me over the edge. She caused me to relapse several times with my self harm, and it even got so bad to where she was telling me I should kill myself so I wouldn't bother her anymore. I'm not saying your relationship is like that because clearly I have no context, but there must be some reason the psychiatrist told you to leave them. \n\nI'm not too sure how to tell you where to go from here. We are talking about an entire life for some reason being spared from death, and I know you weren't expecting to live past the attempt. I'm sure now you feel out of place, like it is an out of body experience and you're living when you aren't meant to be. It is **such** a weird feeling, but it does go away. I think maybe just slow down and take your time with things. Take care of yourself and meet your needs when you can. Reflect on your life, why it came to that point, your relationship, and more, and figure out what you could do, pursue or change to make it so you aren't wishing you could go to sleep and not wake up. Because I do promise you it can get to that point. It isn't easy and I know you're tired and just want to fall apart and rest and stop being so strong for a bit, but until you face things you don't want to face, bite the bullet and do what's best for *you* regardless of how it effects others, you will be stuck in the same place. My no means am I saying you're at this point because of some fault of your own, but what I am saying is you can't keep doing the same thing and expecting different results - and that can go for anything going on in your life.\n\nYou deserve a happy and fulfilling life where you're content and at peace, you do and I mean that. I'm so sorry you've come to this point. I hope somehow what I've said has helped you in even a small way, but I'm sorry if it didn't, or if I don't even make sense as I'm super tired right now. If you need to talk you can DM me, and I mean that. I'm on reddit every day and if I can help I'd really like to. Please slow down and focus on you, take care of yourself.", "permalink": "/r/DecidingToBeBetter/comments/kg2ygf/failed_suicide_attempt_dont_know_where_to_go_from/ggci2x3/"}