{"id": "t5_2tand_t3_kg2ygf_t1_ggcl5os", "creation": 1608374797, "origin": "t5_2tand_t3_kg2ygf", "height": 1, "replied_to": "t5_2tand_t3_kg2ygf", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Nomadsghost", "text": "I survived six suicide attempts in my teens to early twenties, I’m 23 now and the idea of even attempting it again never even enters my head anymore. Every time was just like yours, they zipped me up or pumped my stomach and sent me on my way with nothing more than a small chat. \nI managed to get my shit together when I finally hit rock bottom, confessed to my family that I was sexually abused growing up and had a massive mental break down which led to me quitting my job and moving in with my mother who I hadn’t had a proper relationship with for a long time. I realised that it was finally time to do something about my mental health instead of sweeping my issues under a rug and using drugs and alcohol to numb the pain. \nI managed to get into government run therapy where I found out I had bipolar disorder. \nThrough getting a real diagnosis I was able to find medication that actually worked and now I have a beautiful life living overseas with my amazing husband. \nSo my tips for you would be to:\n1. Admit to yourself what is really wrong even if it hurts way more than keeping it hidden inside, whether that’s the fact that your partner is keeping you from living your truth, childhood traumas you haven’t confronted or anything that’s really stopping you from being the best version of yourself that you can\n2. Get help. It doesn’t have to be weekly therapy like I had, maybe just a one hour chat with a psychologist could help you recognise what’s really stopping you from being happy \n3. Consider medication, you might not have to be on it forever like I do, bipolar is a neurological disorder which means I’ve got it for the long haul but many mental illnesses can be overcome. Medication can help balance the chemicals in your brain long enough for you to get yourself to a happier place where you can hopefully come off the meds. But if you do need them for quite a while, it’s not the end of the world! Just means your brain needs a little push :)\nAnd lastly 4. Really WORK. You can rely on the people you love or a therapist for help but at the end of the day, your mental health is entirely up to you. Depression is a fucking struggle and I know how hard it is to wake up every day and have to TRY to be happy, it’s almost like the trying ruins the emotion. But your mental strength has to be grown the exact same way as physical muscles, start small and work your way up to being the strongest motherfucker out there. How I did this was getting a journal, tracking my moods, writing to do lists (they make you feel accomplished even if it’s small stuff like making your bed, which can feel huge when you’re depressed), tracking when I’ve exercised/eaten right/drunk enough water (all absolutely vital to beating depression) and tracking habits. Habits are another big one that helped me, pick a new one (like brushing your teeth before bed, meditating for five mins in the morning if you’re into that etc) every week, no more than that so you don’t overload yourself, and focus on just getting that one small action down. Soon you’ll be a fully functioning little thing even if you still don’t feel great about yourself and from there you can build on your mental resilience. \nOh and get vitamin D tablets! Lack of vit D is huge on killing your moods\nSorry that this is so long, your post touched me as I feel like I’ve been in your shoes before and felt absolutely no hope for the future. And now that I am where I am in life I am SO glad those attempts did not work and frankly I’m fucking proud of myself for getting this far and I want you to feel like that one day. Just always always remember there is hope for a better life, you’ve just got to realise you’re in charge and that you’ve got to make some hard decisions and changes for your own well-being. Don’t kill yourself, kill the parts of you that you don’t like and work from there. Good luck my friend.", "permalink": "/r/DecidingToBeBetter/comments/kg2ygf/failed_suicide_attempt_dont_know_where_to_go_from/ggcl5os/"}