{"id": "t5_2tand_t3_pvhd7f_t1_hebgubu", "creation": 1632638641, "origin": "t5_2tand_t3_pvhd7f", "height": 1, "replied_to": "t5_2tand_t3_pvhd7f", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JuggernautLate5507", "text": "I had this problem use to smoke a lot for few years and while in college it had a impact on my degree. First thing I learned most of the withdrawal symptoms are directly related to you thinking you haven't SMOKED and need a hit. Weed actually does not have a strong withdrawal. It is more like a negative placebo. But there are severe cases where you can develop a disorder (https://www.drugabuse.gov/publications/research-reports/marijuana/Marijuana-addictive). If this link seems relatable please visit a professional.\n\nNow I come to how my friends helped me. When I told them I want to quit smoking weed they came up with a system where we only roll 1 small joint and all 3 of us will share that. This made sure I have significantly less intake and still sideline the withdrawal. We made only 1 for the entire day. And it was so small we each got only 4 puffs each.\n\nMake it difficult for yourself to buy weed. It isn't cheap dude. Use that money for something else or save it. Doing anything is not a bad thing. Doing it in excess is. I mean you will die you drink a lot of water. But as long as we have it under a certain limit it is okay. Don't quit is 100% just bring it down to 10%. Smoke once a month. \n\nOnce you quit the struggle will begin because now you will have some long term affect on your memory. I started forgetting numbers way too easily. Long term memory is awesome but my short term is fucked. I look at a message and in 2 seconds forget the otp.\n\nHaving an emotional support system is really important. We all are here for you but having someone pat your head and say \"I believe in you\". Will always be better then reddit. Have someone mother, father, gf or even just a friend.\n\nThat was only 10% of what can be done. In the end it all falls down to how much can you fight that urge. You can not read a comment on Reddit and do those things and all will be hail Mary. Sit down and think what you could have done if you didn't smoke, cry if needed man. I fucking did and I am glad because then I realized how badly I wanted to quit.\n\nSo take care and let me know if you need me.", "permalink": "/r/DecidingToBeBetter/comments/pvhd7f/please_help_weed_is_killing_me/hebgubu/"}