{"id": "t5_2tand_t3_pvhd7f_t1_hec2mnw", "creation": 1632656106, "origin": "t5_2tand_t3_pvhd7f", "height": 1, "replied_to": "t5_2tand_t3_pvhd7f", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "petrus4", "text": "I don't know whether you would consider me an addict or not, because I'm still perfectly happy to admit that I love weed, and will smoke it if it's around me.  I don't have any at the moment though, and although there are reasons why I have been unhappy recently, weed dependency isn't one of them.\n\nI lived in Nimbin, in northern NSW in Australia, from November 2011, to November 2017, with some breaks totalling prolly 18 months in between.  During that time I smoked a very large quantity of marijuana, including some which I have on good authority was among the finest quality on the planet.  I had hookahs, bongs, joints, and occasionally pipes.  I was a certified human steam engine.\n\nIronically, the single biggest contributor to me getting rid of any grasping or addictive tendencies that I might have had with marijuana, was living in a scenario where there was more of it than I could possibly smoke anyway.  I've done the routine of smoking first thing after I woke up, last thing before I slept, and every moment in between.\n\nEventually it just got boring.  The novelty wore off.  I started to realise that there were other things I wanted to do, which coherent thought and short term memory were prerequisites of.  I also didn't enjoy the fact that peanut butter and cheese sandwiches were the only form of food that I could afford.  Mary Jane can be a very expensive mistress; at least when you desire her company as constantly as I did.  Then there were the breathing problems, paranoia, and periodic sobbing with shame and terror about the possibility of going to Hell, because I was a degraded stoner.\n\nEventually I got to the point where I realised that I didn't want the guilt associated with being full time any more, but if my brother comes over from interstate and brings a bag with him, I will freely enjoy a couple of grams over three days or so.  Weed comes into my life for a brief period, and then it goes out again, and I don't try and chase it when it does.\n\nIn my experience, people are only really \"addicted\" to something when they are actually still enjoying it somehow, or if they're not enjoying it, then they at least have some reason in their own minds to keep consuming it.  When I was playing World of Warcraft, I saw heaps of players who claimed to be addicted to that game, but once Blizzard started turning it to shit to a sufficient degree, they all dropped off and went and did something else.\n\nSo my advice for quitting marijuana, would be to stop trying.  Fighting yourself on anything never really works.\n\nYou actually need to do the opposite.  Smoke as much as you possibly can.  Smoke as much as you can afford.  Smoke until to you, weed becomes as common and as boring as oxygen itself.  There is no guilt, no novelty, and no reason to feel emotionally attached to it whatsoever.\n\nThen, once you're at that point, look at the consequences it is having in your life, (because it will definitely have some) and work out whether or not those consequences are something you individually enjoy.  No compulsion.  No \"my parents/friends/girlfriend wants me to do this, so therefore I HAVE to.\"\n\nJust ask yourself if zero motivation, paranoia, and asthma are things you find fun.  If they aren't, then because you have made that decision autonomously and for your own reasons, you won't have any difficulty gradually tapering off.  If you find yourself experiencing withdrawals, get some more weed, and experiment to discover the minimal amount that you can smoke, in order to get rid of said withdrawal, and then again, see if you can keep gradually lowering that amount over time.\n\nDon't judge yourself, don't fight yourself, and don't hate yourself.  Don't do anything which causes this issue to seem novel or important within your own head; because the more novel or important you make it seem, the harder it will be to do.  Make it totally boring and insignificant, and then it will be easy for you.", "permalink": "/r/DecidingToBeBetter/comments/pvhd7f/please_help_weed_is_killing_me/hec2mnw/"}