{"id": "t5_2tand_t3_pvhd7f_t1_hed2a85", "creation": 1632673557, "origin": "t5_2tand_t3_pvhd7f", "height": 1, "replied_to": "t5_2tand_t3_pvhd7f", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "alacp1234", "text": "This is false, there’s a few percentage of people (around 5% I believe) who experience marijuana withdrawals with similar symptoms as being dope sick. Not as severe in intensity as an opioid withdrawal and it depends on the amount, frequency, and how long you’ve been smoking. For very heavy users who’ve been smoking multiple times a day for years, they have a high chance of developing [cannabis withdrawal syndrome](https://scholar.google.com/scholar_url?url=https://cme.csam-asam.org/sites/default/files/17%2520Cannabis%2520Withdrawal%2520Syndrome%2520-%2520Budney%25202004.pdf&hl=en&sa=X&ei=NqZQYciTPMKbywSX34PQCQ&scisig=AAGBfm20gTATamDEB5GM8kIelhUY54611Q&oi=scholarr) and [cannabinoid hyperemesis syndrome](https://www.cedars-sinai.org/health-library/diseases-and-conditions/c/cannabinoid-hyperemesis-syndrome.html).\n\nSource: a pothead who smoked a 3 grams of concentrate a week for almost a decade, currently in rehab and starting Marijuana Anonymous. \n\nIf anyone has a hard time quitting weed, I’d highly recommend rehab and going to a Marijuana Anonymous meeting. If you need help quitting, there’s no shame for asking for help.\n\nI also recommend trying to figure out why they’re using (usually from an adverse childhood experience). For me it was running from my anxiety and depression caused by suppressed sexual trauma and emotional neglect from when I was young. I was self medicating and it worked for years until it didn’t and made me more paranoid and get really bad panic attacks/nausea. \n\nIf you just quit weed or any drug and not do the work on dealing with your emotions and your past, I can guarantee your addiction will come out in other ways (whether that’s other drugs including alcohol, sex, gambling, shopping, video games etc. [addiction transference]).\n\nI’m all for the legalization of marijuana and decriminalization of drugs but I don’t agree with people who think weed is harmless. For some people it will be, but everyone’s body and chemistry is different. I’m worried that there will be a generation of kids (who are already dealing with so much as it is) who won’t know how to deal with their shit and navigate life without needing a fix to get through their day.\n\nIf my story resonates with anyone, or just need someone to talk to, PM me.", "permalink": "/r/DecidingToBeBetter/comments/pvhd7f/please_help_weed_is_killing_me/hed2a85/"}