{"id": "t5_2tand_t3_pvhd7f_t1_hebzhzc", "creation": 1632653820, "origin": "t5_2tand_t3_pvhd7f", "height": 1, "replied_to": "t5_2tand_t3_pvhd7f", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "brennanquest", "text": "If you have tried and failed at the cold turkey approach, you may like to do it like hard drug addicts do and get off it slowly by tapering down over time.\n\nIf you do decide to keep smoking and you don't have a balloon vape I suggest you get one because it changed my health and usage habits dramatically when I switched. The same day I switched, the vape started actually clearing the black gunk from years of lighter burnt weed using bong and bowl...that went on for months...and not sure it would have happened if I stopped smoking...just my two cents on the cold turkey quit vs change the method and/or taper down thing.\n\nI don't want to encourage addiction and don't know your life, but imo some problems with weed isn't the plants fault or our fault but rather the method fault. If you cook it at a lower temp you can get different effects. The first noticeable is no more benzene and other harmful voc's. You can set the temp to non psychoactive and just get the cbd and small amounts of thc and other compounds, then save that half cooked weed for later to be done at a higher temp for the sedating or psychoactive effects depending on your strain. You can keep many jars of diff temp cooked herb for different purposes.\n\nI almost went the cold turkey way but decoded not to after learning that multiple health conditions I have and some I fear getting are actually treated with weed, so I took my usage as being medication that my body craves, and that also helped my mindset...instead of thinking \"I am using drugs, that's bad m'kay\" I thought instead, \"medicine is good if you use it right\".\n\nThere is a colorful chart when you search google for vape temp chart weed...the \"daytime meds\" and anything below on that chart is ideal for most cases and night time meds or above when you need a big sedative effect. The other nice part is some temps don't cause nearly as much dehydration or hunger (lower temps). Lots to think about here...and again please do quit if you think it would still be a serious problem even with the vape temp changes, just offering alternative solutions to some problems many face with weed in case you hadn't thought of them.", "permalink": "/r/DecidingToBeBetter/comments/pvhd7f/please_help_weed_is_killing_me/hebzhzc/"}