{"id": "t5_2tand_t3_pvhd7f_t1_hecb5yj", "creation": 1632661333, "origin": "t5_2tand_t3_pvhd7f", "height": 1, "replied_to": "t5_2tand_t3_pvhd7f", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "____Squid", "text": "Hey, I can relate to this. I can share my two cents & I hope it helps. \n\nIt took me 2 years to quit and even then, I still from time to time have a smoke because the temptation is too much. \n\nBut that’s still a massive accomplishment for me - from smoking 1g + per day, being stoned 24/7 to once a month at the very most. \n\nFirst things first: I wish someone told me that I was going to fail, and failure is part of the recovery. If you beat yourself up, that emotion will likely lead to more smoking and further denial. \n\nSecond thing: you will fall off the wagon. Get straight back on. If the withdrawal is so bad you can’t continue with your normal life, then having a small bit (arguably) will help. I think a lot of people think ‘cold turkey’ is the answer, but the trouble with that approach is it’s ‘all or nothing’. So when you fall off the wagon, you fall hard and the wagon flys off the cliff. I personally find that the slow & steady reduction was most effective to truly stay off. So keep on trying, don’t stop. You will find your own way, but you need to keep trying to reduce even if you stumble. \n\nThird: you also need to replace the weed addiction with something else. You’re likely to really going to struggle with this, but stick at something for 6 weeks and I promise you suddenly those two cogs will start spinning and both things will become easier. Weed kills motivation, so you might need to force yourself out to do stuff. Try and move away from spaces that you associate with getting high - try a brand new hobby, go and do something brand new. \n\nFourth: be patient & kind to yourself. You have to make a realistic plan to quit. Measure your weed intake, and start to reduce. For example if you smoke 1g per day, measure out 0.8g for the day and that’s your lot for a week. Then try 0.7, then 0.6 etc. Also try to increase the amount of sober time you have and do dopamine inducing activities: sport, outdoor walks, stroke some animals, anything that makes you feel good. Plan a reward for yourself the first 24 hours/week/other relative time goal of being clean. Keep rewarding yourself every time you hit a new goal. Plan how much you want to cut down by, create a diary and check in every day. Be honest about how you’re feeling too. It’s okay to fuck up. You’ll do yourself more favours by admitting it & dealing with the cause than denying it and hiding from it. \n\nIn a nutshell: reduce, don’t beat yourself up if you fall off the wagon, keep trying to increase the time between your smoking sessions (if you increase by one hour or one day, that’s the start of you taking back control!), distract yourself and challenge yourself with a plan. \n\nYou can fucking do this. Good luck amigo.", "permalink": "/r/DecidingToBeBetter/comments/pvhd7f/please_help_weed_is_killing_me/hecb5yj/"}