{"id": "t5_2tand_t3_miaxrz_t1_gt4c8pc", "creation": 1617348417, "origin": "t5_2tand_t3_miaxrz", "height": 1, "replied_to": "t5_2tand_t3_miaxrz", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "joonimo", "text": "So much this to all the things people have mentioned above. This year is absolutely brutal. I totally hear you, OP, and I'm so sorry that you are having to manage new losses - both the personal ones and the global ones.\n\nThis year, I've found myself becoming deeply sad when hearing about acts of violence in my country, and almost a sense of super heavy responsibility. Whether it's a hate crime, a trial, or rhetoric from government officials, I feel a huge sense of loss for everyone involved - like, how did things get this bad? Where does violence and animosity come from? It's easy to feel like I'm both A) powerless to stop it, and B) not doing enough to stop it. And though I hate feeling uninformed, I started realizing that constant social media flow of societal pain wasn't really prompting me to productive action - it was just making me sadder, and in a weird way, more complacent. So I definitely hear--and can vouch for--the approach of re-framing your relationship with the news and/or your electronic devices.\n\nIt also has helped me to adopt what I could clumsily label \"restorative detachment.\" I try to think of everyone in the world as capable of positive change, while also reconciling that there are all kinds of situations I don't have immediate control over. It helps me be hopeful about humanity--even when it's in scary shape--without taking on excess emotional work. My thought process becomes less of \"This person/this incident absolutely sucks and I hate what's happening, I hate the world and that I'm a part of it\" and more of \"This situation sucks, I hope the person/people/institutions causing harm can fully realize what they are doing and start stepping up differently and help the community heal. Are there ways, small or big, that I could support similar healing efforts in my community today?\"\n\nDo your best, and hope that others do their best, too. Identify your values and realize that you have the opportunity to live them, and start fresh, every day. The best of all possible worlds includes all of us and we've got to take care of ourselves.\n\nAvatar: The Last Airbender helps too!!", "permalink": "/r/DecidingToBeBetter/comments/miaxrz/how_does_anyone_stay_optimistic_when_the_world_is/gt4c8pc/"}