{"id": "t5_2tand_t3_pv736b_t1_he91z47", "creation": 1632595207, "origin": "t5_2tand_t3_pv736b", "height": 1, "replied_to": "t5_2tand_t3_pv736b", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Fabulous-Advantage", "text": "Your happy place: I liked playing my instrument/music but haven't done it in 4 ish years since school. \n\nShower arguments: Sometimes I have these albeit painful arguments in my head to gain insight and make changes forward.\n\ncomfort zone: Don't like this question too much because honestly-- lot's of things. It'd be like oh I greeted someone today or something, which isn't 'cool' enough for some people. Well I volunteered last weekend when it was the exact opposite what I felt like doing. I helped out in work when I could have sat at my desk. All comfort zone steps. That's what I'm about.\n\nsocial anxiety: I have it but it hasn't stopped me... I say it stopped me from asking people to hang out because I don't like putting myself out there with texts and waiting on responses.\n\nold friendships: Well there are a few and I'd like to do that, but it'll feel forced like I want something from them\n\ntoo busy to feel: yes definitely. I feel like getting things done is the way for me otherwise I start feeling hopeless.\n\ntimesucks: sometimes reddit but I'm pretty good with managing it. \n\nself worth: from stepping comfort zone sometimes. from outside things, people recognizing my presence, reviewing all my past accomplishments, comparing to others (which is bad)\n\nalone with thoughts: have to be alone with thoughts. That's how I make my connections and think. I need to think. But it's scary when meditating for a while because I start to panic.\n\nmonkey on your back: Am in therapy\n\nyour discontent: Though my job is 'good' it doesn't feel what I should be doing so improving that. Then having the friends I am 'supposed' to have. \n\nsupport system: Just doesn't exist. I don't really know who I can trust really. I want to try reaching out again, and then not at the same time. I've been trying again but there are things people just don't relate. Thanks.", "permalink": "/r/DecidingToBeBetter/comments/pv736b/83_questions_to_troubleshoot_your_life/he91z47/"}