{"id": "t5_2tand_t3_ppigy4_t1_hddnl1u", "creation": 1631999123, "origin": "t5_2tand_t3_ppigy4", "height": 1, "replied_to": "t5_2tand_t3_ppigy4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TomDC777", "text": "If you are still interested in Abraham/Esther Hicks's method, check out her most popular book *Ask and It Is Given: Learning to Manifest Your Desires.* While I don't believe the title of the book is a good one for the content, this Amazon review by an anonymous customer is a very on spot summary:\n\n>The emphasis on **learning from life by listening to your own emotional guidance system** and responding to that is refreshing. For the longest time, some part of me just wanted to read something that told me to pay attention to how I feel and choose to feel good. This book makes it that simple, and it is that simple.\n\nFor more details, the rest of her review:\n\n>Let me give you some of the main ideas from the book. The only thing that matters is how you feel, and you have control over how you feel. Even how much you can benefit others is determined by how you feel, so **your attention must be on how you feel**. You choose how you feel based on what you are doing with your energy - **allowing well-being to flow** or resisting well-being. Well-being is always predominant, so the quality of any experience is determined by the degree to which you allow well-being to flow freely. **What you give attention to, what you think about, and what you focus on determines how you feel**, and how you feel determines what kinds of experiences you have. Bodily health, financial circumstances, relationship situations, and all other details of physical life are faithful reflections of how you feel. **The only thing that really matters is paying attention to the way you feel, and allowing your energy to flow in a way that feels good to you.**\n\nDoes this magically work by some spiritual law? I don't know. But for the logical person who is always burnt out emotionally, focusing on feeling good throughout the day can keep him functioning at his best. And I think that's a good strategy to try.\n\nLike the reviewer, I think I too just needed someone to just tell me that: to pay attention to how things, the world and even my thoughts, are making me feel and use that to navigate my life (and to stop needlessly collecting logical information unless it feels right). It's a new kind of intelligence to gather/skill to work on—a good distraction for the self-help junkie.", "permalink": "/r/DecidingToBeBetter/comments/ppigy4/how_to_stop_being_a_selfhelp_junkiehow_to_stop/hddnl1u/"}