{"id": "t5_2tand_t3_hrz014_t1_fyavwyt", "creation": 1594939326, "origin": "t5_2tand_t3_hrz014", "height": 1, "replied_to": "t5_2tand_t3_hrz014", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Black-Talon", "text": "I too spent years depending on weed for my anxiety, the more I coped, the more stress I could “manage,” and the more I took on. At times I felt weed was just enabling me to dig deeper into stress debt. Then I suddenly, despite the local legality, had my career threaded by potential drug testing. I quit cold turkey and then had the most stressful year of my life w/o my go-to coping mechanism. It was “easy,” to quit...but very hard to resist the cravings. \n\nAnyway, I came here to suggest /r/leaves and another thing I’ve learned about dopamine, seeing the suggestion of the subreddit as soon as I went to comment caused me to piggy back my second suggestion here in reply...\n\nWeed helped me learn about myself, learn my anxiety. Learn my tendencies to “treat” my stress with “relaxing,” and then realizing that my idea of relaxing wasn’t really rejuvenating me. It turned out to be all about the dopamine. Hard day, make sure to relax with a bowl. Long week, make sure to take the weekend to play video games. Just too tired and overwhelmed, might as well watch some YouTube and relax. This video, https://youtu.be/9QiE-M1LrZk combined with other things I’ve learned later in life than I wish I had (meditation), helped me realize that I was seeking cheap and easy dopamine anytime I needed a break from the stress. And unfortunately, cheap and easy dopamine doesn’t restore you, it wears you out by expending mental energy, undermines your drive and motivation to overcome whatever caused you to need a break, and wastes your time that you could spend taking a real break doing nothing (no phone, no computer, no dopamine, just comfortably being bored and resting the mind). Doesn’t mean you can’t do those things...but recognizing it has been key to truly managing my stress by ensuring I allow my brain to rest, recover, and remotivate to chase my real dreams instead of daydreaming. \n\nYou might like this post in /r/leaves about the relationship of weed and dopamine. It really drove this lesson home for me. And a great intro to the sub. https://www.reddit.com/r/leaves/comments/hjtino/earned_vs_unearned_dopamine/\n\nIn the last year without weed, a year that I almost lost my wife, house, and career (and then COVID and police brutality making me fear for the world and stress further about my future), I’ve learned more about managing stress and anxiety than I ever have in my life. Weed showed me there is a world where I can be calm and relaxed despite the stress... but it isn’t a solution. I wish you luck and strength on your journey.", "permalink": "/r/DecidingToBeBetter/comments/hrz014/doctor_recommended_i_quit_smoking_weed_for/fyavwyt/"}