{"id": "t5_2tand_t3_ivk1uw_t1_g5rydjy", "creation": 1600484468, "origin": "t5_2tand_t3_ivk1uw", "height": 1, "replied_to": "t5_2tand_t3_ivk1uw", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Hey, me too. And im 23. Im extremely, extremely behind. I am just now applying to colleges. This is exactly how i feel, so youre clearly not alone.\n\nAnd no, turning off social media doesnt make those people disappear; but youll stop seeing it. That makes a big difference if you really stick to it. You cant delete social media for a week and then get it back— you have to really quit cold turkey.\n\nPlease, if you can find it in yourself to do so, try to really hammer this in your mind: time you enjoy wasting is not wasted time. Unless you have some really specific dream in mind, some big goal that you need to “grind” to accomplish, taking your time in life really is okay. I know when I look back on my life when Im old, id rather say “Damn, I wasted a lot of time dicking around” than “Damn, i wasted a lot of time being chronically unhappy.”\n\nObviously you dont want to become too complacent, and you want to always keep in mind what you can do to “better yourself”, but for people like us, our first step is to learn how to enjoy ourselves instead of comparing. It really seriously is the most helpless feeling. But seriously though, who gives a fuck? I recently took up gardening and it makes me happy. Do you know how many people have the same hobby and probably know how to take care of plants better than I do? Fucking millions. Im not special for planting a bunch of seeds in the ground. But theres something so nice about watching something you planted grow and become a whole vegetable or fruit or flower because you put your time and love into it. Gardening doesnt allow for comparison, haha, so I really like it. And I like being alone with my plants outside. Find a hobby like that. Learn how to be patient with something and maybe youll learn to be patient with yourself in turn.\n\nHope you feel better, whatever you choose to do ❤︎", "permalink": "/r/DecidingToBeBetter/comments/ivk1uw/i_cant_stop_comparing_myself_to_others_and_its/g5rydjy/"}