{"id": "t5_2tand_t3_ivk1uw_t1_g5s17t3", "creation": 1600485933, "origin": "t5_2tand_t3_ivk1uw", "height": 1, "replied_to": "t5_2tand_t3_ivk1uw", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "joonimo", "text": ">I know that I should just get off social media if that's the case, but I don't know if that'll change anything. Turning off social media doesn't make young people less successful, anymore than not watching the news makes world events not happen.\n\nI have thought about this point often. But I think even if turning off social media doesn't make things better right away, and even if not watching the news won't solve the world's problems, it may make ***your sphere of the world*** more manageable, meaningful, and deliberate. People who watch the news every morning, noon, and night may be more informed. People who go on social media every hour might be more on top of trends and aware of what others are doing. But being well-informed doesn't necessarily equate to being a philanthropist. Being aware of what others are doing doesn't necessarily equate to having a vivid and loving community life. \n\nThe most wonderful gift is realizing that nobody has to be behind. There may always be social norms or commonly shared experiences, but if we look closely, aberrations of the norm are much less scary than they're made out to be - and they have all the power in the world to live remarkably meaningful lives. There are so many lovely older adults I've met in my college classes. They were wise and insightful, and many of my younger classmates felt the same. The same goes for folks I've met who decided not to go to college and instead attended a training or vocational school. Sometimes the exception to the rule is pretty freaking kickass and just goes to show that the rule didn't matter all that much in the first place.\n\nAs a 22, I can identify with a lot of what you are feeling. It's a rough world out there right now, and things like social media that were intended to make our lives easier don't always end up being kind to us. One thing that helped me was creating my own sense of structure and focusing on learning new skills. I may not be making as much in my job as I would be if I were an engineer, but by golly I like being able to play Dungeons & Dragons with my friends on the weekend, taking free online courses, and having some money to spare for ordering occasional cookie treats for my folks and me. I promise you that a life of glamour is not always a fulfilling one. Just like how some over-the-top cakes are visually amazing but gastronomically don't hold a candle to a messy homemade loaf of banana bread!\n\nQuotes by Uncle Iroh I quite like: *\"There's nothing wrong with a life of peace and prosperity. Protection and power are overrated. I think you are very wise to choose happiness and love.'\"*", "permalink": "/r/DecidingToBeBetter/comments/ivk1uw/i_cant_stop_comparing_myself_to_others_and_its/g5s17t3/"}