{"id": "t5_2tand_t3_pgr8sa_t1_hbhw86v", "creation": 1630705045, "origin": "t5_2tand_t3_pgr8sa", "height": 1, "replied_to": "t5_2tand_t3_pgr8sa", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "adeline_ca", "text": "It’s difficult to describe. I never went to therapy even though I should, because I didn’t want to tell anyone what I was going through. The people I did at the time didn’t understand, and I realized it just made me feel worse. Just made me think I didn’t have anyone. I was suicidal for a moment, but never could bring myself to do it. Thinking back on that time is painful and has next to no color in those memories. Everyday felt like a cycle.\n\nWhat helped me was being more aware of my surroundings. I enjoy journaling/ writing stories quite a bit, and I would constantly write how I feel. Either my thoughts and feelings, or incorporate how I feel through my characters. Granted, many of my characters are quite depressing, but they had their good moments, as I do too. \n\nWriting helped me think about the situation as a whole, and question how I thought I felt. Why am I sad? Is it because I have no friends? \n\nI never really came up with solutions, but I would think about how I ended up here. I have no friends because I’m busy doing my hobbies or spending time with my family- and I focus on this because this is what I treasure most, instead of attempting to make friends and failing at it. Doesn’t mean I sometimes long for it though. \n\nAnd when I can’t think of anything, I’d just sit there with some good music and be sad. I’d watch the trees blow in the wind, feel the cool air and how the wind rustle against everything. Watch how the sunlight in the fall look thick and heavy as it tumbles through the trees, and how summer is almost buttery. \n\nI started gardening- and I was absolutely fascinated over the whole life cycle of it. A little tomato seed can produce 100’s of tomatoes for you, produce more seeds, and yet also provide nutrition for the ground. Once I had snapped a tomato plant in half with just the stem and planted it anyway. I thought it would die but it grew another plant! But sometimes plants don’t make it and it’s disheartening, but I can always grow another.\n\nAnd as stupid as it sounds, even the immune system in our bodies is quite fascinating. It fights so hard to protect us from pathogens or bad bacteria! If the liver decides you ate too much sugar and too much of it is running around your blood, it turns it into something called glycogen to store it. (Not a scientist, just studied on it) I may not be the skinniest or prettiest person ever, but my body works so damn hard to be alive and I’m thankful for it. \n\nI also would try not to watch the news and watch something happy instead or read good news. I’d eat something good, and pick some flowers. Play Christmas music in the summer, or blast Chicken Noodle Soup (a song from Jhope) while leaving all my windows open so my hair is flapping around in the wind. Watch a spider build its web at night, and watch it take it apart when the sun rises. \n\nIn the end, to answer your question, I started small. I talked to myself in why things occur and why I feel this way. I started noticing the small, but beautiful things in life and built up on it. Now I’m very thankful I’m here to experience and see what life is going to bring at me, whether I’m ready or not. Again life is cruel, but it also has some beauty to it; it’s bittersweet. There’s no such thing as happy endings.\n\nI’ve been told advice before to overcome depression and anxiety, but it really is difficult to listen to. There are days I feel like I’ve fallen back into the rabbit hole, but I try my best to remember all the good times I’ve had in life and how far I’ve come. \n\nI’m not sure how much of this actually makes sense or helps, but I hope you find something you need to hear in this. There’s going to be ups and downs in life, as everyone says. It’s ok to be sad. But think it through, and focus on the little things in life that makes you happy.\n\nEdit: gotta also start thinking optimistic. Makes a huge difference. I’d give you a deeepppp hug in person if I could! I’d also show you all my plants and make you smell my plumerias. You can do it!!!!!!!", "permalink": "/r/DecidingToBeBetter/comments/pgr8sa/what_to_do_if_you_dont_want_to_live/hbhw86v/"}