{"id": "t5_2tand_t3_pgr8sa_t1_hbh9m9j", "creation": 1630694957, "origin": "t5_2tand_t3_pgr8sa", "height": 1, "replied_to": "t5_2tand_t3_pgr8sa", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "The_Dude_of_Pala", "text": "You point out an interesting observation. To some degree you'll definitely never be able to do \"enough\" to please everyone, maybe even anyone. At one point in my life I was working 100 hours a week 7 days a week, for months/years because I was trying to please everyone and prove that I was capable of it all. They asked for 50% and I gave 60%, then they asked for 80% and I gave 90%, they asked for 100% and I gave 110%, sacrificing sleep and my health. They didn't hate me and they weren't punishing me, I'm the one who kept saying okay, I'll do it. I've only got myself to blame.\n\nBut there's definitely a grey area between doing what you enjoy and being selfish. I don't know your situation, but the general idea is if doing what you want is disrupting the environment and people around you it's your responsibility to recognize that and make some wholesome adjustments. For example, if you enjoy playing video games for 12 hours a day that's completely fine, it's your life, but if it means others around you have to \"pick up the load\" and do things like extra chores because you're to busy doing what you enjoy, then I think most people would agree that's being shity and selfish. Again, I don't know your situation, but I've observed that behavior in my own life.\n\nAnd then there's the deeper, interpersonal level. While you might enjoy playing video games (or anything else) for 12+ hours a day, and it's not burdening others, is it fulfilling? On a mental, emotional and spiritual level completing an RPG doesn't leave you with the same sense of worth that volunteering in a soup kitchen or building a home with habit for humanity provides. You could spend a lifetime doing what you like to do, but does it make you feel whole...? \n\nFor Me, these days guilt and shame are nothing more than muffled whispers from the shadows. And since we can ONLY really control our own reactions to what other people say and do, feeling guilty or NOT feeling guilty is really up to us as individuals. Sometimes what people confront us with is so much like a mirror that we dislike the reflection so much we take on the guilt they're projecting and amplify it ten fold. Sometimes automatically and seemingly unconsciously. \n\nI found that part of really growing up (was around 40 for me) and gaining wisdom came from looking at what I was doing and how I was acting and accepting that mostly I was a selfish asshole and while I was crushing it at work, had my degrees and a six figure job, I was pretty empty inside. With all my intelect and experience I was doing what I \"enjoyed\" but it wasn't doing much for me.\n\nThe best cure for and against things like guilt and shame is wholesomeness, kindness and compassion. If you enjoy these virtues and enjoy things that put these virtues into action then you'll likely find that guilt and shame are just words, just labels and just don't apply anymore. \n\nAgain, I don't know anything about your life or situation, I'm not personally accusing you of any behaviors, I'm just bringing to light my own experiences in this area in hopes it resonates with someone, anyone else.", "permalink": "/r/DecidingToBeBetter/comments/pgr8sa/what_to_do_if_you_dont_want_to_live/hbh9m9j/"}