{"id": "t5_2tand_t3_pgr8sa_t1_hc9ltup", "creation": 1631243062, "origin": "t5_2tand_t3_pgr8sa", "height": 1, "replied_to": "t5_2tand_t3_pgr8sa", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "The_Dude_of_Pala", "text": "I can understand the difficulty with your parents, while my relationship with parents was much, much different... I was told from the day I was born that I was a mistake and I completely ruined my parents lives. At 13yo I was left in my uncles backyard after suffering an automobile accident and my mother remarried and moved away, leaving me temporarily crippled and permanently homeless... But I've had friends and colleagues from China, Japan and New York city that have stories incredibly similar to yours. Parents who never let them doing anything to learn how to do it, e.g. cook, clean, drive, etc. They essentially coddled them hoping they'd do well in school so they'd get a \"good\" job so that they would have it better than their parents. But without letting them do and learn, life hit them hard when they went off to college. Then they were trying to figure out college life and how to cook a meal and do laundry. It was pretty overwhelming for most of them the first several years. And it made life difficult, then the parents yelled at them and got on their case because they had \"provided\" everything for them why were they struggling so much. Most of my friends in this position didn't really start to get traction in their lives until they were well into their 30's. It took them that long to stop worrying about what their parents thought. One guy even got his PhD and his parents didn't speak to him for two years because it wasn't in the field they wanted him to go into. \n\nI joined the military at 17yo and some of the best times I ever had was making $600 a month living in a tent in some god awful desert somewhere. All I had to worry about was me and the job I had to do right then. Noone to be disappointed in me or tell me I was doing it wrong, well except my Sgt, but that was kinda his role...\n\nAt the end of the day the ONLY one that can make you happy (or miserable) is Yourself. And the ONLY person who you should be trying to make happy is You.", "permalink": "/r/DecidingToBeBetter/comments/pgr8sa/what_to_do_if_you_dont_want_to_live/hc9ltup/"}