{"id": "t5_2qh1i_t3_2znizy_t1_cpkkz11", "creation": 1426816884, "origin": "t5_2qh1i_t3_2znizy", "height": 1, "replied_to": "t5_2qh1i_t3_2znizy", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RikM", "text": "I don't go into the chain of events too much but long story short. \n\nAfter a break up related to me not being in love with her she tried to kill herself and I saved her life. A month later she started telling everyone that I tried to make her kill herself. This was not true but I started feeling pretty shitty about someone trying to die because of me. She then devoted her life to ruining mine and turned everyone I knew against me. She started dating my housemate and he moved her in. Everybody believed her and felt it was their duty to give me shit. A lot of shit. I felt so empty. So broken. I couldn't feel. It was like suffocatong. Like every breath was water and every room was a coffin. It was awful. So I took a lot of pills and drank a bottle of whiskey. I ended up vomiting a lot and that saved my life. After I did it there was still no feeling. No regret of doing it. No hoping that I would vomit or survive. I still didn't care.\n\nNext morning I awoke feeling refreshed and then I realised. It is one of the most crhshing feelings ever to realise you are so fucking useless that you cannot even get that right. I was crushed. Everything felt so much worse. I still wanted to die but this time I didn't even have the energy to try. I was just begging to be hit by a bus or involved in some other tragic accident.\n\nAbout a year before that I had made a half hearted attempt after a break up. I still regret it now. But the next morning I woke up feeling so perky and happy. I noticed the sun for the first time in months and could hear the birds singing. I do not know if that had happened before. I had overslept and found texts asking where I was. People cared. I was so hapoy to be alive. That time I felt so good afterwards. Maybe because that morning I realised a breakup no matter how bad is not worth dying over. ", "permalink": "/r/AskReddit/comments/2znizy/serious_suicide_survivors_of_reddit_could_you/cpkkz11/"}