{"id": "t5_2tand_t3_qgu9s6_t1_hi91nap", "creation": 1635344980, "origin": "t5_2tand_t3_qgu9s6", "height": 1, "replied_to": "t5_2tand_t3_qgu9s6", "down_vote": 0, "up_vote": 54, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "daitoshi", "text": "Alrighty, let's start with the basics: \n\n1) **Self-Worth, Self-Respect, and Self-Acceptance are all learned behaviors. Self-Hate, Hyper-Criticism, and Self-Minimizing are** ***also learned behaviors*****.** \n\nThey are not some intrinsic part of you, where you magically develop them one day. The patterns of thought that conclude in 'Actually I did a pretty good job' or 'everything I do is worthless' - they are trained into you, throughout your life. \n\nUsually through comments and reactions from people who you trust and respect. Something about the way you were treated makes you automatically conclude that you're always failing, always missing something, and anything YOU make will be sub-par *because you're the one who made it*. \n\nThe constant self-hatred and self-degrading reflex **is not the honest truth of yourself,** it's essentially a habit of emotional self-harm. Often formed as a defense mechanism, because if you beat yourself on behalf of someone else, when they say those same words it won't hurt as much.  \n\n2) **The good news:** \n\nYou CAN re-train your brain. You CAN change that cringing conclusion. It does take time and effort on your part, though. \n\n3) **Where to Start?** \n\nFirst, read up on C[ognitive Behavioral Therapy](https://www.apa.org/ptsd-guideline/patients-and-families/cognitive-behavioral).  While I definitely advise the help of a therapist to make it fully effective, you can also pursue many of the techniques on your own. \n\nSecond, learn about [Cognitive Distortions](https://www.healthline.com/health/cognitive-distortions).  \"Stress could cause people to adapt their thinking in ways that are useful for their immediate survival. But these thoughts aren’t rational or healthy long-term.\" - In particular, look at Mental Filtering, Discounting the Positive, and Emotional Reasoning. \n\n&#x200B;\n\n**4) Actual actions to help:** \n\n\\- REPETITION IS A VERY EFFECTIVE SELF-TRAINING TOOL! YOU ARE NOT IMMUNE TO INTERNALIZING REPEATED MESSAGES! It's why advertisements get repeated so many times - humans DO internalize what they see over and over, whether you want to or not. \n\nFor you, this means that the more you repeat self-loathing sentiments, the more you're believe them. \n\nIt also means that **you can repeatedly vocalize self-affirmations** and **you will begin to believe them**. The human brain is wild like that.\n\nYou don't have to jump straight to self-love and ultra-uplifting conquer the world type stuff. **Start with Neutrality.** \n\n\"My body is not disgusting, ugly, flawed, or bad. It is just a human body, like everyone else's body.\" - Take the perceived social value of 'conventional attractiveness' away from judging your body's overall value. Your body is doing exactly what a body should, right now. It's digesting stuff, letting you walk around and type on the computer. Your brain is letting you learn and notice patterns, and so: It's fine. It's doing a pretty decent job being a human body so it's *fine*. That's all you need it to do right now. \n\n\"I put in an acceptable amount of effort\" - No one *actually* gives 100% all of the time. 'All your effort!' is a bullshit request. Most folks give like... 40%-80% effort on any given project, depending on how interested they actually are in it. \n\n100% effort is like... hyperfocus, dedicate every moment being utterly consumed by something without taking breaks for food. That's completely unreasonable to expect every day!  If you put in 30% effort, and you got the job DONE, then you met expectations. You did FINE.  **Accept that 'average' outcomes are normal, and fine to have**. \n\nLikewise, *perfection* is not a real expectation. We make a good effort, but occasionally a typo slips through, or someone forgets to attach a file to an email, or [sends a tweet before finishing their thought](https://i.dailymail.co.uk/i/pix/2017/05/13/22/4049038A00000578-4503384-image-a-13_1494712044458.jpg). \n\n\\--- \n\n**\" the way I look, the way I talk, the things I talk about, the things that I do, I feel like I\\['m\\] boring\"**\n\nYou're really concerned & preoccupied about how other people perceive you. Especially, it seems, people who have *nothing in common with you, and aren't your friend*, if they think that your thoughts and hobbies and passions are boring. \n\nDo **you** pay *that* much attention to how total strangers look, speak, topics they talk about, or hobbies they have? Do you think they're boring or terrible, useless people for not catering to YOUR every interest and whim at all times?  Total strangers also don't think about you that often. They just... don't care, and any value judgements are as fleeting and distant as noticing a car is slightly dirty, or a wild bird has a feather sticking out of place. Momentarily noticed, then forgotten. \n\nSo, if they see that your tag is sticking out of your shirt, or you stumble over a word... so what? They *might* notice it, and they *might* have an internal chuckle, but 99% of the time, they'll forget that it even happened within a couple seconds. \n\nYou're boring?? To WHOM? \n\nBuddy, there's an old guy at my local farmer's market with a table set up of rocks he's found. If you stand by his table, he'll start explaining facts about his rocks, and handing you the rocks to look at.  Most people at the market don't care about rocks, and avoid him.  I *fucking love rock facts!!!!*  I try to visit his table every weekend, and always learn something new.  I get so much joy out of seeing him, and seeing a new rock at his table, because I know we're about to get hyped about something we're both passionate about. \n\nSo whose opinion matters more, to this old man with the table of rocks that aren't for sale? \n\nRandom strangers who don't give a shit about him or his rocks? Who think he's a bit weird for buying booth space every weekend, just to *not sell anything*, and who think it's really boring and strange to be excited over *rocks* of all things. Ugh. \n\nOr me and the other people who are fucking *stoked* to share his passion, learn from him, and get hyped about unusual rocks? The people who he's bringing joy and excitement to, who bring examples from our own rock collections to share, to see his face light up as well? \n\nSo? Is he boring and weird and stupid for having a rock table?  Should he feel bad for setting up every weekend? Should he hate himself? \n\nOr does he just have a niche interest with a small group of people who share his interest, that outsiders don't understand, and so their opinions don't really matter.", "permalink": "/r/DecidingToBeBetter/comments/qgu9s6/how_do_i_stop_hating_and_cringing_at_myself_for/hi91nap/"}