{"id": "t5_2tand_t3_aameom_t1_ectil7p", "creation": 1546111467, "origin": "t5_2tand_t3_aameom", "height": 1, "replied_to": "t5_2tand_t3_aameom", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gurneyhallack", "text": "Honestly, thank you. This is wonderful advice, the idea of doing it over time makes sense. I wish the situation was simpler. It is not that the advice is not helpful, it is wonderful, I will try to incorporate it. I just wish it were simpler. Phoning the cops for example. If I phone the cops or someone else does he isn't going to stick around in all likelihood, if he does he will be submissive to the cops, and he is a well known mentally ill man. They will either tell him to go home and he will, which does not prevent him from returning, or they will take him to the hospital, which will immediately release because he is not actively suicidal or assaultive. I really am sorry, the advice really is good, this is simply venting to some extent. It is just hard emotionally. Him not getting help for example. If he were younger or in a different position it would be different, I would expect more from him. But it is not really like he has as much access to services as others. He likes this social worker for example, but they have only met 4 times, I have no reason to think that will last. \n\nSince returning to the old hometown and getting into therapy and recovery 18 months ago he has fired 2 social workers and been fired by 3. Same is medication, it is easy for me to think he should take meds, but even with socialized medicine here in Canada he still has to find a doctor who will work with him, he has lived in this town many years, it is tough, him and his issues are well known. This is true of addiction counseling and therapy, he is good enough it is not anger on their part, they simply see him as a hopeless case pretty often, and it is hard not to see their point. He truly, absolutely believes everything he says, I am certain of that. \n\nWhen he thinks I have all sorts of computer knowledge, that I am intentionally not helping him to be mean and screw with his head, he believes that completely. When he believes the federal and town government are bugging his walls, that they, the local cops..fuck. I am sorry. My sister came over, I am finishing the message now. You are right, I have to create solid boundaries. If I am not going to cut him off, which I guess I feel unwilling to do yet, meaningful boundaries are needed. I was going on, and it all makes sense and is true, I am sympathetic, but I am making excuses for him. \n\nThis needs to stop, at least to a serious extent. What boundaries I figure may not end this sort of thing entirely, with how he is nothing likely will, but I will figure out how to keep this sort of stuff down to months rather than weeks, which I can handle. If I can't/won't cut him off I have to open the door to him less often and end interactions sooner, which logically should slow all this down. I do love him, and am sympathetic, but all my excuses are not helping me, and are not likely to help him if I burn out completely in 6 months or a year.Thank you so much for the great advice. It really seems to have been a catalyst, it helped me figure out ways of making things better and more sustainable, and it really was nice of you. I hope so much things are good for you, and that your day can be so awesome. :)", "permalink": "/r/DecidingToBeBetter/comments/aameom/looking_for_advice_on_how_to_handle_a_relative/ectil7p/"}