{"id": "t5_2tand_t3_aameom_t1_ectbqce", "creation": 1546106138, "origin": "t5_2tand_t3_aameom", "height": 1, "replied_to": "t5_2tand_t3_aameom", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tgaz", "text": "Good on you for standing up to, what seems to be, good reason.\n\n> but really the only answer is yes or they throw an angry fit and yell.\n\nBecause they're not seeing repercussions when they throw a fit. You shouldn't accept yelling. End the conversation right then and there, but explain that you are happy to talk to them again when they behave better.\n\n> returning 5 minutes later to yell a bit more. \n\nThis sounds like a situation that is outside your control. If walking away doesn't work, you need professional help to deal with it. Try to get the police, or get a neighbor to do it for plausible deniability, if it's a touchy subject. Set boundaries; your boundaries. He can walk away, or he can behave. Staying and misbehaving is outside your boundary. Protect your own sanity and integrity first and foremost. Without it, you can't help your uncle.\n\n> He is trying, and has been for years. He won't do therapy or take medication for the schizophrenia.\n\nSounds like someone who is \"trying\" as long as it's on his own terms, not on yours. I.e. not trying very hard. Would he not even do that to keep your relationship?\n\n> he made me feel seen and heard during a childhood that did not have that.\n\nSounds like he was a gentleman, and a win-win situation. What has changed that makes it a lose-lose situation now? Badly set expectations? Lack of mutual respect? Set your expectations. Help him understand what you want from the relationship, what you are prepared to give, and that this one-sidedness doesn't work anymore. It's then up to him to decide if the relationship is worth having.\n\nIf you have such a relationship; create a plan with milestones:\n\n* \"In one month, I walk away instead of yelling\"\n* \"In three months, I can accept a 'no' and not feel bad about it\"\n* \"In six months, we can sit down and have a conversation both of us find entertaining\"\n* \"In nine months, I have done *something* more to battle my illness\"\n* \"In twelve months, our relationship is back to \"kid-in-lap\" stage.\"\n\nThis probably only works if you're both people who like making plans. If you're not, then focus on only the next step. Always focus on the most important issue, but set a timeline. Allow time for change, but not \"forever.\" Decide to be better *together*, and hold each other accountable.\n\nYou need a rule set for the relationship, and these \"processes\" are just ways to start adding structure. There are lots of other ways, but start small.\n\n> And I am in recovery, I am working with the practical social worker [---]  it hurts to consider cutting him off, but this paranoia and rages every 2 or 3 weeks is getting hard.\n\nYes, take care of yourself before trying to help others. Do not place yourself at risk of undoing what you have been fighting for. It doesn't sound like your uncle would give a crap later, and he probably doesn't even understand what he's doing to you anyway.", "permalink": "/r/DecidingToBeBetter/comments/aameom/looking_for_advice_on_how_to_handle_a_relative/ectbqce/"}