{"id": "t5_2tand_t3_o4acgk_t1_h2iff19", "creation": 1624256848, "origin": "t5_2tand_t3_o4acgk", "height": 1, "replied_to": "t5_2tand_t3_o4acgk", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Yrdinium", "text": "Thank you. :) I hope it was useful. I've written a smaller essay below, maybe it will contribute more.\n\n\\---\n\nPersonally, I believe humans as a species have gotten most things in life wrong.\n\nWe treat adulthood as a \"collectible\"-stage. We're collecting those big things, right?Get an education, check.Get a job, check.Get a relationship, check.Marry, check.Have kids, check.Climb the career ladder, check.\n\nBut, miserably, we fail to stop and ask - why am I doing this? Is this what I want? Does this align with my values. Btw, wtf are my values anyway?\n\nWhen one become an adult in the eyes of the law, their only job should be to take responsibility for themselves, and this is what I mean by taking care of and getting to know oneself.\n\nMost humans have an incontrollable desire to connect with other people, the desire to have a job is secondary.  \nSo, I believe, in all things, relationships with others should be top priority.  \nLook at it like this, if I told you that what's most important to you is inside a burning building and you have to run in to save it, most people will imagine their children, a romantic partner, family member or a pet, not their desk at work.  \nWe are social creatures.\n\nA job and a meaningful activity is up there, absolutely, but it's not the main thing.  \nYou will need to work to financially support yourself, but also to find a possible job match, to find something you can stand doing 40 hours a week without going insane.I used to think I love IT, and I work in IT now, but ultimately I found out I hate it and I actually want to plant vegetables. Life is a funny thing.  \nWhen you're in school, you have no idea what it's like actually working with it, you don't have the experience.  \nOn paper it's one thing, but in the real world things might not be what you were expecting and hoping for.  \nFinding a line of work you thoroughly enjoy is crucial for your mental wellbeing, and your mental wellbeing will tie into any relationship you have, it will 100% affect the quality of it.\n\nIt isn't impossible to have a relationship in your twenties, it's even quite possible to have a successful one that will stay intact, but it takes work and it takes dedication.  \nFor a relationship to stay healthy, both parties need to be invested and take their responsibility when it comes to working on the relationship.  \nA young adult might not yet have developed the frontal lobe enough to do adequate estimations of the correlation between actions and consequences, and thus, it might cause unwanted and unnecessary problems, unless their partner is ridiculously forgiving.  \nNow, I know, this sounds very complicated, but it's actually very simple. It's basically just about communication and empathising. But nobody can communicate and empathise thoroughly without honing these skills, so work needs to be put in - personal work.\n\nWe also have this idea about relationships that basically \"you're two single people who are together, but you're still an individual and don't you impose on your partners individuality because if you do and if you depend on your partner you are dependant and that's fucked up get a life fix yourself!\" which is absolutely mindboggling.  \nA relationship is a unity, it's an agreement between two (or more) people about what they want from this unity.Just like at work, you can't just roll in, flip everyone off, piss on the coat hanger and do whatever you want all day without there being some sort of lash-back.You have to consider the other parties feelings and needs, and you will have to compromise. You will constantly need to weigh things against eachother.  \nYoung people aren't known for their diplomacy, and this might cause a problem.\n\nYou might want \"A\", but is \"A\" beneficial for this relationship to keep functioning properly?  \nIs this something you need to keep functioning or to not cause yourself distress, yes or no?  \nWill this possibly cause distress for you partner/s, yes or no?  \nWe circle back to the empathy.  \nWe can't be single while we're in a relationship, just like how in the family you come from, you can't do whatever you want at any given time. There will be plenty of room to be yourself and enjoy your hobbies and activities, but you will still need to pull your weight to help the family function.\n\nAnd, the last side of it is that taking care of oneself ultimately means to stay in shape in all ways.  \nI am not talking about sculpturing the best abs or butt one can, that's just superficial bullshit we're sold so we'll consume more.  \nNo, I mean eat clean, get regular and moderate exercise and keep your mind healthy.  \nThings don't grow well in toxic environments, and a healthy mind doesn't reside in an unhealthy body. There's a circular flow between physical and mental health.\n\nWhen entering a relationship, you're suddenly not just responsible for just yourself.  \nIn any healthy, functioning relationship, be it family, friendship or romance, there will be an exchange of 'favours', if you will. Scratch my back, and I scratch yours.  \nIf there comes a day when your partner experiences an accident, they might need to lean on you for a while until they recover. Everyone's weak every now and again, and everyone will eventually need support in one way or another, also you.  \nStaying in physical and mental health ensures that you're able to help when the time comes, and it's up to any potential partner to do the same, or they are failing to take on their responsibilities.\n\nEntering a relationship, and especially marrying, without understanding yourself and how you function can be devastating and destructive for both you and your partner in more ways than one. And if you have the moral capacity to understand you're not ready to take that responsibility on, the best thing is to not engage in anything that might harm yourself and/or others.  \nThat's the first sign of emotional maturity.\n\nEdit: Grammar is hard.", "permalink": "/r/DecidingToBeBetter/comments/o4acgk/help_a_23_year_old_put_the_length_of_life_into/h2iff19/"}