{"id": "t5_2tand_t3_pjd1mf_t1_hbxvavu", "creation": 1631028086, "origin": "t5_2tand_t3_pjd1mf", "height": 1, "replied_to": "t5_2tand_t3_pjd1mf", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dauty", "text": "can anyone relate? Yes, and then some\n\nI remember some wanky thing a productivity guy Leo Babauta said about having the previous day 'in review' as you go about the next day\n\nIn other words you decide to become deliberately conscious of all the ways that you fuck up on a day-to-day level, as well as all of the things that you do well (there will be some). Once you've done that you make a \\*plan\\* to slowly introduce more of the good things and fade out some of the bad\n\nAlso I would stress that that the above process needs to happen \\*over time\\* (isn't there habit change theory out there that anybody only ever manages to change one habit at a time?)\n\nOn a related note, for myself (and this ties in to what you wrote) you have to believe that you are worth redeeming in the first place. Someone mentioned 'self-love' but there's also a kind of decent selfishness you need to have about your own life. So the way that you live makes you miserable? \\*You\\* have a responsibility to help yourself. Nobody is going to do it for you. If you don't do it you'll carry on being miserable forever, because realistically nobody is going to step in and sort your life for you. You have to begin to satisfy your own life goals in an extensive, not just a shitty lazy way. That takes self-belief, courage, and a firm mind, there are no other way to do it\n\nThat is the position you are at at the end of the day: if you want to carry on having boring misery in your life, do nothing. Laziness isn't even fulfilling your basic needs. Take the easy way out. Never get up from the sofa another day in your life. You have to consciously choose what's hard, at least in the beginning. It will become easier in time", "permalink": "/r/DecidingToBeBetter/comments/pjd1mf/how_to_fix_extreme_laziness_brought_on_from/hbxvavu/"}