{"id": "t5_2tand_t3_qgawxm_t1_hi8rm3l", "creation": 1635340406, "origin": "t5_2tand_t3_qgawxm", "height": 1, "replied_to": "t5_2tand_t3_qgawxm", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "silverscope98", "text": "Start with being thankful for what you have. You say you have nothing, but you obviously have intelligence (You're attending gradschool), you prolly are well off if you can afford to go to gradschool, you dont have any disabilities and I assume you are physically healthy aside from the obesity, nothing unsolvable. \n\n&#x200B;\n\nDo you live in a developed nation? What are you studying?\n\n&#x200B;\n\nYou post so much asking how to improve and getting pity from others, why dont you just apply the improvements you already know you should do instead of continuing to post again and again? \n\n&#x200B;\n\nAnd so what if you are brown? Do you mind clearing up why this was included as a reason to be exhausted? Seriously hope you consider responding. Many people have asked and you havent answered. \n\n&#x200B;\n\nWatch Greg Doucette, thank me later. Do cardio and work out. Get into a caloric deficit. Lose the fat. You have the motivation. Stop being sad about being 22. You are fucking 22, you have a life ahead of you. You are just getting started. If you are persistent, in 5 years you prolly can have a physique better than 90% of the population on earth. Stop being sad about your state and do something about it so that in 5 years from now, you can look back and see how far you have come.\n\n&#x200B;\n\nTheres nothing wrong about you, other than your attitude. Chase knowledge and pay attention to your health and live! Travel, work get experiences ! Women and people will come with time. Some might stay, some might leave. It doesnt matter, you are the only constant so stop being so self-pityful. Realize how good you have it.\n\n&#x200B;\n\nI barely even know you, but I honestly think you have a lot of potential if your only problems are bad social skills/social circles and fat. Both are literally solvable in a years time. And luckily for you, they compliment each other, which means when you get fit, you will be feel better and be more confident and thus improve your social skills. \n\n&#x200B;\n\nJust stop wasting time doing stupid shit like making another kind of these posts. What do you think people will tell you?? I seriously think you have all the answers to all your problems and you just are barriered by your attitude.", "permalink": "/r/DecidingToBeBetter/comments/qgawxm/i_22mdont_know_why_but_im_not_like_other_guys_my/hi8rm3l/"}