{"id": "t5_2tand_t3_qgawxm_t1_hi5qh9b", "creation": 1635279458, "origin": "t5_2tand_t3_qgawxm", "height": 1, "replied_to": "t5_2tand_t3_qgawxm", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "StarfishWizard", "text": "It’s a frustrating paradox that we have to learn. The less you care about “how your life is supposed to be” and just live your life, grow, do things you enjoy, and work hard, the closer you get to “the life you’re supposed to have.”\n\nI’ve seen a few comments saying seem professional help as well and I completely agree. I could only afford 2-3 sessions but I was recommended medication and it has changed my life. I finally feel like my life has started at 25. Essential medication might not be the answer for you, but I swear by the work of professionals. Your life is too important and valuable to not have help making you as happy and fulfilled as you can be.\n\nI also want to add that this isn’t a switch that will happen over night. I slip back into that mindset time and again, and it’s just coming less frequently and less powerful as time goes on.\n\nAnd lastly, and this is the most important IMO, is actively working on and fostering a feeling of gratitude. This can be insanely hard work, and it might be hard to see things to work with on that right now, but I can’t stress enough that this is maybe the most important thing you can do. My medication didn’t fix me, it gave me the material/energy I needed to start working on myself. A grateful life is one free of envy, full of confidence, and a more or less peaceful day day to day.\n\nAnd look at it this way, if you’re in a point where you feel really hopeless and it’s hard to find things to be happy about, imagine how invincible you can become if you can master this ability now? If you can train yourself to be actively grateful for your day to day, your family, the relationships you do have, and even going so far as to be grateful for the simple joys of taking a nap, eating a good meal, taking the time to stop and breathe, you’ll be absolutely unstoppable. I can promise the confidence boost is exponential my friend. And with that comes a dramatic increase in overall joy.\n\nWhat you said about your friend groups literally might as well have been out of my own mouth not too long ago. It felt like I just had poison in me and was completely alone. And even after getting into this groove, I was still not hanging out in “the main squad” but now I didn’t really care as much. And I was a lot happier despite the fact. All of a sudden I blinked and I have more fulfilling relationships. Some of those being with some of those old friends. Some of them still moved on though and that’s okay.\n\nIt’ll take time, it’ll take work. But it is essential. I believe in you buddy, you can do it.", "permalink": "/r/DecidingToBeBetter/comments/qgawxm/i_22mdont_know_why_but_im_not_like_other_guys_my/hi5qh9b/"}