{"id": "t5_2tand_t3_qgawxm_t1_hi7egvb", "creation": 1635306083, "origin": "t5_2tand_t3_qgawxm", "height": 1, "replied_to": "t5_2tand_t3_qgawxm", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TiredForEternity", "text": "> I'm 5'6\" brown and fat\n\nCool. Now list off five positive or neutral things about yourself. Here's some starters: You care about your health, and you care about what others think of you.\n\nIf you talk negatively about yourself, you're gonna feel negative about yourself. You're reinforcing and encouraging your own depression and self-hate. If you want to have a better impression of yourself, you HAVE to stop this talk. In your head, too.\n\nI'm not saying pretend you're hot shit and made of steel. But give yourself some reward for things that on the surface seem bare minimum but a lot of people don't do: You're conscious of your weight, you care what others think, you want to improve yourself, you want to learn new things, you're willing to admit you're not perfect. Honesty, compassion, health-conscious, pursuing knowledge, aware of shortcomings. All of those, amazing, wonderful traits. \n\nSearch yourself for more. There's more. But you gotta cut out this negative talk to start changing.\n\n> \"No matter what I do relationship-wise, I fail\"/\"This is the age you form the most relationships and go on dates and stuff\"\n\nI'm gonna assume you're between the ages of 15-25, and if that's the case: No, this is NOT the time for that.\n\nThat ideal milestone is made up. It's an expectation, not a rule, not a sign of development or worth as a person. Your value doesn't depend on how many connections you have. People into their 40s, even 50s, end up divorcing, finding love, reconnecting in new towns, starting families, making friends, joining clubs, forming work partnerships...our lives are FULL of making new connections, enjoying them, then eventually departing. \n\nThere's no such thing as \"this is the age for this.\" It's made up. Society has expectations and you are not required to follow them. \n\nIn fact, you shouldn't, if the only reason you do is because you think you're expected to. Yeah, the movies depict those age ranges finding love and that being single at 40 is a fate worse than death, but it isn't. It's a fabricated belief. \n\nYou're not doing anything wrong, or missing out, because you're not in a relationship. \n\nI encourage you give yourself more support first, before looking out for a companion (romantic, platonic or otherwise). \n\nAnother thing - Take. Your. Time. \n\nYou could be taking 2 years or 20 years to lose weight. The only thing that matters, is that you reach the goal, not when. \n\nMost millionaires did not achieve their wealth before 30, or even 40. A lot of people are marrying later in life nowadays because they want to enjoy life on their own for a little while first. Don't rush headlong into anything, relationships included. You won't be happy in the end. \n\nSo Go. Slow. Small. Steps. Self improvement is long, it's repetitive, and takes building up self-discipline snd finding what works for you. You have time. \n\n> \"My friends keep forming their own groups\"\n\nThis is rather normal. Humans usually have multiple circles they interact with. They might have some close bonds, but most hang out in multiple different social spaces. Like I said before, attachments come and go.\n\nSure, it could be the way you interact with others. If you talk and act negatively - about yourself, about life, about your ambitions, about differences between you and others - you're not going to find any long friendships. People are more attracted to self-confidence and independence (usually. Sometimes that's not the case) in a friendship. Ever looked up at a public figure or role model and thought \"they seem so high up there and have everything together and don't need anyone\"? Bingo.\n\nYou do also have to manage your relationships. Expecting to stay friends even if you don't talk to them for months is not realistic. Expecting someone to stick around if you constantly ask for their presence all day is also not realistic. \n\nIt's also entirely possible it isn't you at all. It might be all sorts of things - not sharing interests anymore, changing homes, changing living arrangements, work picking up, stress, health, personal doubts, finances, political alignment, there are SO MANY things that can put strain on a friendship that causes it to start being distant. Always ask. Always check in. It'll go a long way.\n\nAs for romantic relationships, I could go on for a century about how to create and maintain a healthy relationship but I'd run out of space so I'll leave you with this: If you're looking for relationships because you're expected to, or because you hate being lonely and you think they can help, you're not ready. \n\n> \"I wanna work out and go to class and learn something cool\" \n\nSo do it. \n\nIf you find there's some kind of 'wall' stopping you, analyze it. Are you frustrated that you'll start out \"bad\" at it? Is the learning process to get to where you want to be seem daunting? Are you afraid if you fail once, you'll never get back on again? Is it that you fear you'll fail? Is it fear you won't be adequate? Or is it fear you won't get the results you want? Some other reason, like time, or access to better, healthier food, or schooling?\n\nThere's ways to address all these questions. And others never say it, but I want you to know that *it is completely and totally normal to feel that 'wall' there.* Our brains are programmed to seek the easiest, least stressful path in life, even if it sabotages us emotionally or mentally. Picking up a workout, changing diet and keeping that diet, picking up a new skill - all of these take effort. (And if you're like me, you could be really bad at predicting just how much energy something will take.) And even if we're unhappy, if it's easier for us not to do it, our heehoo monkey brain will want to avoid doing the difficult 'task.'\n\nLuckily we know how heehoo monkey brains work (mostly). Set small steps. Like, really small. \"Definitely able to reach this if I put forth effort\" small. Make it rewarding. If you don't have time to hit the gym, work out at home. Lots of courses online show how to get the best workouts. Not able to go jogging? Dance! And REALLY dance, get your heart racing, break a sweat! Ten minutes of dancing does about the same amount of work as a long jog. No access to better food? On a budget? Got a picky stomach? There's healthy alternatives and substitutes for pretty much anything, now. Check out websites for those who are on low budgets (there's entire sites with recipes of all types of eaters!). Set a weight loss goal that's doable, not The Biggest Loser goals. Learn on how the human body processes fat, so you can have a better idea about how losing weight works. And be gentle and forgiving if you miss the mark by a few pounds. Everyone's bodies work and carry/drop weight differently. _And for the love of God, don't do any diets suggested on the internet, I guarantee they won't help._ \n\nIf you wanna learn something, but aren't sure what, check out your interests. Like Mass Effect? Learn the lore, read the comics. Like video games? Learn about how game engines work. Like to sleep? Learn about sleep studies. Or just go totally off the wall. Saw a cool car once? Look it up! Learn about its parts. Think that movie sets look cool? Learn how films are made! Think Japanese is a pretty language? Learn it! (To the extent that you want to. Learning is really in your hands in terms of goal setting.) Just be aware of the Dunnung-Krueger Effect, too.\n\nHopefully some of this helps. If you need anything elaborated, or other questions, hit me up. (I might take forever to reply. Not because I don't want to talk, I just sleep a lot.)\n\n(Advice shared by a psychology student who has Been There Done That)", "permalink": "/r/DecidingToBeBetter/comments/qgawxm/i_22mdont_know_why_but_im_not_like_other_guys_my/hi7egvb/"}