{"id": "t5_2qh5i_t3_iywdeo_t1_g6hz80l", "creation": 1601003632, "origin": "t5_2qh5i_t3_iywdeo", "height": 1, "replied_to": "t5_2qh5i_t3_iywdeo", "down_vote": 0, "up_vote": 23, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mcguffin9000", "text": "It’s something I’m actively working with and bumping up against in my daily life for sure. I do eat meat-and I think everyone who does should have to experience the reality of what meat is. It’s one thing to pull something off a shelf and quite another to actually kill. I’ve noticed a lot of people will try to point out the bad of my killing, but feel innocent in their eating. Taking life to sustain myself and the farm makes me feel a deep reverence for the food. When I eat a burger, I always thank the cow out loud before taking a bite. One thing we do here is our dairy cows live much longer lives than the typical dairy cow. We slaughter when they are in pain from old age and are beginning to look tired and skinny. In that way, we try to model nature. As in, an old animal that is fast declining would be left by the herd or eaten by a predator in nature. We also allow our cows to be mothers, and share the milk with cows the baby. None of our cows are going ever tied for long periods of time in barns like you often see in the dairy industry.I also try to be present for the death whenever possible, I owe it to them to be with them to the end even when it is uncomfortable for me. But we do slaughter some steers young-about three years old. It would be impossible for me to keep all the young male cows and take care of them and the others. So that’s thought provoking. Is farming animals inherently wrong? I’m not sure-like I said I sit with these questions often. Cows are also fully domesticated at this point so if there wasn’t farming there wouldn’t really be cows anymore. I don’t know-that was a long non answer I suppose. Always interested in hearing people’s thoughts and ideas on this journey of mine through my love of farming and my hatred on modern farming practices:)", "permalink": "/r/happy/comments/iywdeo/oma_seemed_like_she_was_having_pregnancy/g6hz80l/"}