{"id": "t5_2tand_t3_lb17qy_t1_glszvm5", "creation": 1612313465, "origin": "t5_2tand_t3_lb17qy", "height": 1, "replied_to": "t5_2tand_t3_lb17qy", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Saf94", "text": "James Clear’s atomic habits is about making small changes you can stick to. He says you need to establish a habit before you can optimise it. \n\nIn that vein, think about little things you can do to improve your diet. It doesn’t have to be that you cut your portions in half from the start. He says most people start too strong, even if they know they’re meant to start small, they still start too big. Establish the habit first before thinking about optimising it. He gives the example of the guy who turns up to the gym and leaves immediately without working out. What can you do so you’re just turning up. Maybe it’s at least taking one less bite of a meal each meal. Maybe it’s adding one small scoop less of food onto your plate. Establish the habit of improving your diet.\n\nThe other thing he says is make it easy. In another book, good habits bad habits, the author talks about external forces. Everything that’s in your environment or context. When James Clear says make it easy he’s saying structure your environment as much as possible to make it easy to keep your good habits.\n\nOne really obvious thing is don’t buy unhealthy food. Throw away all the snacks and junk food. Other creative things you can do as well. Move any food you want to eat to the front of the fridge or cabinet and hide other things at the back. Eat on smaller plates? Grab a timer and time yourself between bites and make sure you chew your food slowly. \n\nStart small, make it easy. Do these things and you’ll manage this for sure! You’ve already started really well so keep going", "permalink": "/r/DecidingToBeBetter/comments/lb17qy/i_will_succeed_with_changing_my_diet_for_good/glszvm5/"}