{"id": "t5_2tand_t3_q87rc2_t1_hgqjhk4", "creation": 1634304922, "origin": "t5_2tand_t3_q87rc2", "height": 1, "replied_to": "t5_2tand_t3_q87rc2", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "EchoFloodz", "text": "15 years old is a pretty rough age. It’s equivalent to being stranded on a boat in the middle of the ocean with just the people in your immediate life. That’s either a good thing or a bad thing in itself. If I could go back and give my 15 year old self some advice on how to cope and excel, this is what I’d tell him: \n\nYou need two things. You need to search for something you love to do, love to be apart of or love interacting with. A hobby, a craft, etc. For me, it was the guitar. I loved playing the guitar and after 26 years of playing it, I’m pretty damn good! Use this to focus your mind and inspire yourself. It only helps if you truly love it. Doing this will also inject you into a community of folks that love doing your thing as well… maybe even help to find you someone special.\n\nThe second thing is you need to commit to the things that are required of you. That continues to be one of the hardest things for almost everyone in this world but there is definitely a difference between forcing yourself to do what’s needs and fully committing. Commitment means you are all in and in with a smile/ of your own free will. Having a reinforced attitude will have a major impact on the results you have. Your grades, your interactions with people, even your self confidence will benefit from your commitment.\n\nNone of this is easy but it’s not supposed to be. It’s supposed to be challenging and you aren’t meant to achieve all of this over night. The very first thing you have to do ready your mind and heart and then go for it, but according to this post, it sounds like you’ve already made that choice.\n\nI’m sorry for the long post. When I read it, it went straight to the heart and I wanted to offer something. Idk if it will help or not but for what it’s worth, I wish you the best of luck and really do hope you find your way through this funk. You’re very young and have a future waiting to fascinate you. You just need to be willing to make it there and allow it to. See ya, kid.", "permalink": "/r/DecidingToBeBetter/comments/q87rc2/im_15_and_deciding_to_take_things_in_my_own_hands/hgqjhk4/"}