{"id": "t5_2tand_t3_o6j5iq_t1_h2trpc8", "creation": 1624491400, "origin": "t5_2tand_t3_o6j5iq", "height": 1, "replied_to": "t5_2tand_t3_o6j5iq", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "fructuss", "text": "I suspect the same thing, ASD, from reading your comments and descriptions. Lack of empathy, sensory issues, not reading the social situations properly. \nYou don’t have take the label if it doesn’t help you. If it does, and gives you a frame work to understand yourself better that’s great. \nPoint is you are ok as you are, and now you have some awareness about yourself. You can work on developing skills you want. \nI’m sort of the same. I’ve been told I’m neuro-diverse, but never actually got a diagnosis of autism. I’m not good at recognising when people need help. This one time in grocery shop I saw an old lady using her cane to reach to the top shelf, pulling some item, it made rattling sounds. My first thought wasn’t she might need help, I was thinking if she is angry. Until I saw a guy next to us reaching for the item and handing it to her. Then it clicked !\nMy struggle is empathy too. I’ve got better about it, but even after all these years there are situations that take me back to my younger, ass-holish days. \nWhen that happens I know I’m out of empathy. \nIf you like to build some empathy, there are bunch of meditation you can try. It’s not an intellectual thing it’s a feeling you can learn to feel for yourself and others. \nOdds are your own self talk is not very compassionate, the way you relate to yourself is not kind, and guess what you relate the same way to others. \nTake the feedback from your loving family with a grain of salt. \nI would highly recommend talking to a therapist if you can afford it. If not there are plenty of resources you can use. \nI list a few that helped me here :\nKristen Kneff : self compassion. \nSensory acuity ( from NLP)\nSensory profile ( from a reliable ASD source)\nDon’t be hard on yourself because you mind works differently. Be proud of yourself for noticing this and looking for ways to work on it. \nLife’s empty without empathy", "permalink": "/r/DecidingToBeBetter/comments/o6j5iq/everyone_is_telling_me_that_im_an_egoist_and_not/h2trpc8/"}