{"id": "t5_2tand_t3_htzlp8_t1_fylkvsk", "creation": 1595195955, "origin": "t5_2tand_t3_htzlp8", "height": 1, "replied_to": "t5_2tand_t3_htzlp8", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Beyond anything else I recommend reading books. Reading books made up 70% of my success in the last three years. In those three years I went from almost-heroin-addict to soon-physics-student at a worldwide Top10 university. Anyways, I will list some activities that I learned from those books so that you can start right away:\n\n**Activities:**\n\n* BulletJournaling (don't go overboard, a checklist is enough, you need time for other stuff)\n* Cardio (20min at 80% of your max Hearthrate and after that do some balance stuff)\n* DopamineDetox (Buy Nokia, No YouTube, No Porn, No TV, No Sugar, No Drugs)\n* Delete all Social Media\n* Daily Mindfullness Meditation (5min is enough)\n* Set Big Goals (Mine is a nobel price, nothing less, before that I wont stop. Similar stuff pushes you. Maybe you'd like to earn a million? Go for it!)\n* Learn about Neuroscience\n* Cut everything down to the essentials. What doesn't help you reach your goal(s) doesn't have a reason to be in your life.\n* You think you're smart? Take a IQ-Test and see where your strong areas are.\n* Move out. Living alone or with friends will stress you to get your life in order fast.\n* You are the average of your 5 closest friends. Cut contact with 2 lowest ones, search 2 for the top and repeat. You only have bad friends? Cut contact to all of them!\n* Download \"DF Tube\"-Extension for Chrome\n* Supplements like Omega3 fatty-acids and Coffee fruit extract can help a lot.\n* If you can, go to a psychotherapist/coach that will help you reach your goals. I have no mental disorder (just some depressive symptoms because of the lockdown and other stuff) but I anyway go there as she loves to help me as long as my insurance pays :)\n* Somehow the best comment (as of now) starts with the suggestion that you should use more reddit. DONT! On reddit there is really good information, but it's not nearly as dense as it should be to be profitable. Most likely you will end up being on reddit for multiple hours while doing nothing. It's delusional that you will only surf r/DecidingToDoBetter. Most likely you will waste 4h of your day surfing reddit and write comments like I just did. I could have read another 100 pages of the history book I'm currently reading but instead I've commented on ELI5 and wrote this comment. I hope this at least makes you a better person.\n\n**Mindset:**\n\n* You can change your brain!\n* All thoughts are habits! You can change your habits and so can you change your thoughts!\n* Always, ALWAYS take the long-term instead of the short-term profit!\n* Only invest time, energy and money only into things that help you reach your goals! Everything else is just for the short-term, don't fool yourself.\n* There are different voices in your head (not in a schizophrenic sense) and some of them are always criticising you. Those different voices have different feelings to them. Learn what the bad voices (those you want to eliminate, eg. shame, self-doubt, addictions) feel like and whenever you hear them count from 5 backwards and then eliminate them. This will break the habit of thinking those thoughts.\n* Make others hold you accountable for your actions. Tell your fellow students (if you feel confident enough) that you want to be the student with the highest marks. Humans don't like to contradict themself and thus you will act like a all-A-student\n\n**Books:**\n\nI list them in a meaningful order for you to read them. Some  are essentials as you can't form the habits used in the later ones.\n\n* The power of habit (more theoretical, didn't like it that much)\n* Atomic habits (more practical, always keep in mind that your belief influences your habit them heavily, your are NOT a neurological machine, you DO HAVE free will)\n* BulletJournal by Ryder Carroll\n* SPARK by John J. Ratey (This does wonders and change your life, only read it when you're confident that you can afford to work out daily after you've finished the book)\n* Deep Work by Cal Newport\n* If you consume nicotine: \"Allen Carr's EasyWay to Stop Smoking\" does wonders\n* Essentialism by Greg McKeown (this has always been my natural mindset so it wasn't a big gamechanger for me but I attribute much of my success to this mindset so yeah, try it)\n* A Mind for Numbers by Barbara Oakley (Best book for students teaching how to learn)\n* Ultralearning (If you'd want to learn something on your own, good book but the advice can't be used in a normal environment)\n\nThese are on my to-read list:\n\n* How to become a Straight-A Student\n* Books on Stoicism (Marcus Aurelius, Epictetus, Seneca)\n* Why we Sleep by Walker Mathew\n\n**Good YT-Channels:**\n\n* TEDx (Make this the only channel you're allowed to binge watch)\n* [Amy Landino](https://www.youtube.com/channel/UCR9gMSj0UUxGvgfpNhhF3Jw)\n* [Better Ideas](https://www.youtube.com/channel/UCtUId5WFnN82GdDy7DgaQ7w)\n* [Tim Ferris](https://www.youtube.com/channel/UCznv7Vf9nBdJYvBagFdAHWw)\n* [Thomas Frank](https://www.youtube.com/c/Thomasfrank)", "permalink": "/r/DecidingToBeBetter/comments/htzlp8/18_years_old_never_developed_life_skills_where_do/fylkvsk/"}