{"id": "t5_2tand_t3_htzlp8_t1_fyoag2h", "creation": 1595263902, "origin": "t5_2tand_t3_htzlp8", "height": 1, "replied_to": "t5_2tand_t3_htzlp8", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "djblackpharoah", "text": "TRUST ME THIS IS WHAT YOU NEED TO HEAR\n\nI found this really interesting because I see myself the same way as you (especially when I was 18) and I just learned to break out of it. I’m 21 now and I’m graduating from UMD in CS so believe me it wasn’t easy getting to this point, I’ve had a semester where I literally flunked all my CS classes in the same semester and almost got kicked out of the program because of it. \n\nThe one thing that really drove me to be better and actually make sacrifices to do better at school and in the rest of my life (and it’ll probably sound like a broken record) is to do a keystone habit. Keystone habits are ones that everyone should be doing but 90% of ppl fail to do. They significantly improve your life and will cause a domino effect for you to want to be better in the rest of your life. When I tell you what I did it’ll sound pointless and unrelated but I promise you it really does have a domino effect and YOU WILL BE BETTER. \n\nMy keystone habit was going to the gym 4x a week and following some kind of diet regimen. I have a fitness goal of getting down to 165lbs (started at 200 and I’m currently at 185lbs). I highly recommend you having an actual fitness goal so that there’s more of a sense of purpose to the routine. For me, sticking to my fitness routine physically improved my overall mood and I can visibly see changes in my body everyday that more closely resembles the ideal version of me each and everyday. \n\nI know it sounds completely irrelevant and like you’re not moving towards your actual goal but I’ll explain how it pushes you towards your goal more than you’d imagine. Everyone should be following some sort of fitness routine since we’re humans and we’re meant to exercise and eat properly (you don’t have to eat chicken/broccoli all day, I still eat my favorite foods but I just make healthy versions of them). \n\nIf you can stick to a fitness regimen for just 1 week you’ll see visibly see positive changes in your body. It’s not even about the gym or the food itself, it’s about you going in there and giving it your all despite wanting to stop. How you do one thing is how you do everything. Once you’re consistent, you’ll feel significantly more confident in yourself since you know that you’re willing to sacrifice short term pleasure for long term success and that will bleed into other aspects of your life. I dare you to find someone that’s the top 1% of their field and doesn’t follow some sort of fitness routine, there’s a reason for it. \n\nThe way you see yourself will change and that’ll cause you to use that same motivation into school and everything else in your life. I’m not bullshitting you when I say that how I saw myself before I made fitness a priority to how it is now as night and day. \n\nThere’s a shit ton of psychology that backs up the concept of your habits/actions being based on how you perceive yourself. So you’re already ahead of the game by seeing yourself as gifted. Follow an actual fitness routine and you’ll change your perception as a 1 in a million human being that many couldn’t ever get to even if they tried. You can find millions of people that are 6’7 with gifted athleticism. These people could easily excel in high school ball. But unless they put in the work/discipline, they’ll never make it into the NBA let alone D1 ball. The Kobes, Jordans, Lebrons and all those guys have the rare trait of not only having rare elite genetics, but also pairing it with a ridiculous work ethic that makes it nearly impossible for anyone else to get to their level. I can promise you that the most trash NBA player you can think of dominated high school and was seen as a star for making it into the league. \n\n99% of incoming players in the NBA played for a D1 school and was probably a starter. Imagine how good you have to be to do that. In the NBA tho, they’re mediocre at best cuz everyone else was also a starter for their school.\n\nNote: I use an app called HabitShare to track my consistency. I highly recommend you do the same. Good luck!", "permalink": "/r/DecidingToBeBetter/comments/htzlp8/18_years_old_never_developed_life_skills_where_do/fyoag2h/"}