{"id": "t5_2tand_t3_qfyghq_t1_hi696xg", "creation": 1635287059, "origin": "t5_2tand_t3_qfyghq", "height": 1, "replied_to": "t5_2tand_t3_qfyghq", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Mcastavet", "text": "If it is ADHD, you are treated with therapy, medication, or ideally both. No one can or will force you to do one or the other, so don't worry about that. If you do meds it may be something like Adderall, which helps balance out chemical deficiencies in your brain to make it easier to stay focused. It's not something you need to take forever like insulin if you're diabetic. It's also possible there could be other stuff contributing to your symptoms so please speak with an actual doctor about this! (I am not a medical professional, just have a lot of health issues I've had to deal with.)\n\nI recommend checking out this site to get a basic idea of what ADHD is, what signs are, and how to treat it:\n\n[https://www.understood.org/articles/en/what-is-adhd](https://www.understood.org/articles/en/what-is-adhd)\n\nYou don't need to be afraid of getting a diagnosis; if you get diagnosed with a physical or mental health issue, it opens pathways to treating and fixing the issue. If you don't get it diagnosed and treated, you still have the health problem and the negative affects that come with it, but without a means or knowledge of how to fix those things.\n\nIt's normal to be apprehensive when you're dealing with something you don't understand well. Learning about it will take away some of the uncertainty by giving a better understanding of what you can do, which gives you better control of the situation. Again, PLEASE SEE AN ACTUAL MEDICAL PROFESSIONAL about this. Talk to your doctor about the challenges you're having and ask what can be done to find the cause of the problems. There are solutions and you don't have to struggle with this stuff every day for the rest of your life, I promise!", "permalink": "/r/DecidingToBeBetter/comments/qfyghq/all_i_do_is_procrastinate_and_when_i_try_to_study/hi696xg/"}