{"id": "t5_2tand_t3_psj2kx_t1_hdsz2xm", "creation": 1632282147, "origin": "t5_2tand_t3_psj2kx", "height": 1, "replied_to": "t5_2tand_t3_psj2kx", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "therealskaconut", "text": "You are WONDERFUL. You can do AMAZING things. The platitude is true, life is a journey not a destination. The depression and loneliness will teach you so much about yourself and what other people go through. It is NOT a fun place to be. I know. I have been a mess for a while. I have had a hell of a year and most recently my wife left me. The darkness is difficult to confront.\n\nI would recommend avoiding making any major life changes. Don’t move out of where you are—given you are not being abused. Don’t jump into a relationship. Small changes like hair, makeup, wardrobe, can help with creativity, but be sure you aren’t running from or neutralizing the pain. The only way through, unfortunately, is through. Make sure you are physically safe. Save a suicide hotline number in your phone, and find someone, anyone, to listen—even if it is a kind stranger on the internet. There are beautiful people in this world that love other people. You’re one of them! You have so much to give and you deserve to receive loving kindness. \n\nOne helpful thing is to make a sensory box—a loved stuffed animal and blanket, some tea and treats, headphones, incense, (palo santo is a very anchoring piece of holy wood that really engages your senses when you burn it), a journal, and something to watch or some sudoku puzzles, chess puzzles, Nonograms, adult coloring book can all go in the box and you can set a timer for 20-30 minutes. Spend that time engaging as many senses as you can to ground yourself in the present.\n\nOnce you have a safety plan to keep the abyss at arms length take steps to work on yourself—to love yourself. Shawn Achor has some wonderful books about the science of how to heal your brain. If you can’t get a diagnosis or meds, you can find vitamins to help. Some magnesium, vitamin D, and melatonin can work wonders for your sleep and give you a fighting chance. I would also recommend Marcus Aurelius “Meditations”, a book on stoicism, the fragility of life, and the inherent beauty in the fact we exist. \n\nIf you think there is an underlying psychological issue—and I don’t recommend self diagnosing—but you can take a couple self tests online, read symptoms for common things like ADHD, OCD, Depressive disorder etc, and see if any of the tools and descriptions can’t help you treat some symptoms. It might also give you some vocab for when you *can* talk with someone. \n\nI just went into the mountains with a journal and spent several hours meditating and thinking about love, support, loneliness, and community, and what I need to feel or receive from others. It really helped me with my current dire feelings of loneliness. Above all, remember *you* are always here for you. Treat yourself like a friend and a teammate. You deserve love. Let that come from you first.", "permalink": "/r/DecidingToBeBetter/comments/psj2kx/i_hit_rock_bottom_where_to_start/hdsz2xm/"}