{"id": "t5_2tand_t3_psj2kx_t1_hdrym2d", "creation": 1632264314, "origin": "t5_2tand_t3_psj2kx", "height": 1, "replied_to": "t5_2tand_t3_psj2kx", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NosoyPuli", "text": "You know when I saw your user name I almost called someone with the same name initials on the phone just to check on her, mostly because I still love her even tough we haven't seen each other in five years and I live in Argentina and she in Russia, fun story.\n\nAnyways, I hope that gave you a chuckle, now for the serious part, I have been in your place, three years ago my girlfriend dumped me via phone, my dream of becoming a journalist got trampled by the reality that journalists are mercenaries who do not really care about people, grandma died of cancer, my political aunt died of cancer, my cousin got depressed, and on top I had to make my thesis to graduate, so I was under a lot of stress, I had a panic attack and things were awful, I wanted to be the one I was.\n\nNow one day I was by the countryside and I got this crazy idea \"Hey man, go check that old broken bridge and see what feelings come up to you if you take a peek over it\" So I did, I followed the idea not really thinking, and just moving my legs, so I kept on walking, and I saw the new bridge which is the main reason they never rebuilt the old one, and kept on walking.\n\nThe old bridge, it was rebuilt, instead of peeking, and maybe jumping, I decided to cross it and I saw the path I was walking, I took it as a sign from God, so I curled up in a ball and cried, then I sought help.\n\nLook, I know you can't afford therapy, and I know things look bad, but hear me out, I did whatever I can to overcome that and I did, sure sometimes my anxiety gets on my bad side, but I can overcome it, and I forgive myself for all the past mistakes I made.\n\nWHere to start? Anywhere, but start, and do not mind for false steps, false steps are still steps, and as long as you get walking you will get better at it.\n\nTrust me, just start.", "permalink": "/r/DecidingToBeBetter/comments/psj2kx/i_hit_rock_bottom_where_to_start/hdrym2d/"}