{"id": "t5_2tand_t3_q8ucx4_t1_hguklf6", "creation": 1634383325, "origin": "t5_2tand_t3_q8ucx4", "height": 1, "replied_to": "t5_2tand_t3_q8ucx4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "butwhatsmyname", "text": "You need to hear this.\n\nYour problems with self esteem have held you back from feeling like you are someone who can pursue their goals and interests. Your self esteem is **totally fixable** but without mending yourself that way you will continue to move through life as if your hands are bound. This is the first step and you are not going to be able to do it alone. Accept that. Don't tell yourself you should be able to manage without help, it's a lie that your poor self confidence tells you in order to avoid experiencing scary, difficult changes. You need those changes, they will be scary and hard sometimes, embrace that and find a professional to help you learn how to make them. You wouldn't try and learn to fly a plane all on your own. Your brain is also a complex machine, don't waste your time and energy trying to work it all out yourself.\n\nThe second thing you need to have is an important tool to help you stop all this panicking about past decisions and \"wasted\" time. \n\nEvery day of your life, every thought and action, has brought you here to this realisation that you need to change and you need help to do it. **This is the most important work you are ever going to undertake; it is vital**. You needed to arrive here and it's taken some time to do so, and that's precisely how life works. Things take time. Experience is required to learn to recognise patterns in your thoughts, your needs, your actions.\n\nThis is exactly where you need to be. This is the start of your life's great work. Everything you've done has been necessary to get you here. No day was a waste. Not one. Every day of dissatisfaction, of anxiety, of frustration, of despair, of idleness, was required to bring you to this point. It doesn't matter that you did not know this at the time, or that you weren't consciously trying to arrive at this destination. The passing days did their work anyway and carried you here. This is the truth, and you will come to feel it as such once you get into the work of improving your self image and understanding.\n\nHere's the important bit: \n\n**If you could have done it sooner? Then you WOULD have done it sooner**\n\nThis applies to _everything_.\n\nWe are complex animals cursed with an inherent desire for simplification. You will want to say \"if only I'd seen this thing sooner, if only I'd started earlier\" but the truth is that if you could have done? Well of course you would have done. Something held you back from these actions. Something else clearly had to happen first - and sometimes that thing was \"nothing at all\". Sometimes we need proof that inaction isn't going to help. Sometimes we need time to be afraid and overcome that fear. Sometimes we need time to get bored, or impatient, or desperate before we can see what needs to come next.\n\nThis journey is different for everyone. Really, it is. The complex cogs and gears of your mind do not work the same as any other living being's. Comparison is useless, worse than useless. It's just another thing holding you back from arriving at the point of action. It will whisper to you that you aren't capable, or that you aren't ready, when in reality it's just that you aren't the same.\n\nStop allowing regret to drink away the well of your energy - you *need* that energy to fuel you as you undertake the work of changing and building yourself up. When regret creeps up and hisses \"you could have started this five years ago, think where you could be by now\" understand it for the lie that it is, turn regret away with the words \"if I could have done, then I would have done\".\n\nBecause it's the truth.\n\nIf you could have done this sooner then you would have. Believe it. Trust it. Carry it as your shield as you Wade into the precious, vital work of mending yourself. When you find an obstacle in your path, pick up your shield, say \"I've tried everything I know how to try. If I could do this then I would be doing this, so I will return to it when I find I'm ready\" and make it the truth. Be brave. Be honest. Be real. Try your best, say out loud \"it frightens me to try so hard because it will hurt if I fail, but I have to try so that I know I did what I could.\"\n\nIf you could have done it in the past, then you would have done. Things held you back; be brave. You're already being so brave to face this the way you are. Hang on to bravery, be vulnerable, try your best. This is the work of your life, *your* life. You can do this: that is the truth.", "permalink": "/r/DecidingToBeBetter/comments/q8ucx4/ill_be_25_in_a_month_is_it_too_late_for_me/hguklf6/"}