{"id": "t5_2tand_t3_q8ucx4_t1_hguq55b", "creation": 1634387218, "origin": "t5_2tand_t3_q8ucx4", "height": 1, "replied_to": "t5_2tand_t3_q8ucx4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Aristox", "text": "You say most people have figured our their career/life by now but in reality what is actually true is that loads of people have just settled on something that looks safe and half decent because they don't have the courage and ambition to craft some real dreams and goals and actually go after them.\n\nIf it was mandatory to only pick a career and direction in life once you were actually sure its the right one for you to make the most out of life I think most people probably wouldn't seem like they have their shit together until they're like 50.\n\nThe fact you're even making a post like this means you're aiming for better things than just yhe average schmuck. Don't let the fact that some people get married to their first gf and have a lousy marriage while working as some office boy at a job they barely tolerate after 5 years make you feel bad about not being in the same position as they are. You shouldn't want to be.\n\n25 is still basically a kid. I think the science is that the brain only finishes fully developing at 25 (and that's uust on average) so you're literally basically just about to become an adult for the first time. Dont race to throw away your potential by needing to look good to your unambitious peers. Compare yourself to who you were yesterday, not who someone else is today. And just don't compare yourself at all with people who's lives don't actually inspire you.\n\nJoe Rogan is the biggest deal in the world right now and he says it was only when he turned 30 that he realised he needed to quit his videogame addiction (he played competitive Quake) and focus on actually building a career for himself. Im sure there's people who have awesome lives now who only started at 35 or 40. It doesn't really matter what age you are or when you start or how different your life is to your high school class or whatever. What matters is what skills you develop that open the doors you wanna go through, what moral character you build for yourself, and what dreams you allow yourself to have. Most people die without having truly lived. Dont use them as a measure for how successful your life is and how optimistic you should be about your future. Youve got your whole life and the whole world in front of you. Go build something and do something and achieve something. Don't let superficial things like age number get in the way of you becoming someone other people look up to.", "permalink": "/r/DecidingToBeBetter/comments/q8ucx4/ill_be_25_in_a_month_is_it_too_late_for_me/hguq55b/"}