{"id": "t5_2tand_t3_q8ucx4_t1_hgs8zme", "creation": 1634330794, "origin": "t5_2tand_t3_q8ucx4", "height": 1, "replied_to": "t5_2tand_t3_q8ucx4", "down_vote": 0, "up_vote": 21, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "castleclouds", "text": "I keep seeing a lot of these posts \"I'm x years old, is it too late for me to do x\"\n\nIt might be too late for you to do some things, like apply for scholarships and competitions that have an age limit of 18 for example, and realistically if you decided to become an athlete now you would probably never become a pro player or make it to the Olympics. Some things are very age-determined.\n\nHowever for most goals I see like \"is it too late for me to get a degree in Computer Science\", \"is it too late for me to change my career\", \"is it too late for me to learn to play an instrument\"... I think people have the wrong mindset.\n\nThey are wondering if it's too late to try and change careers because all their peers have already chosen a career. But what's the alternative? You might still have 40-50 more years of work in you, if you don't try and change careers now, what else will you do? Just work in the current one you are stuck in for the rest of your life because you think it's too late?\n\nIs it too late to try and make an improvement to your life because other people have done it earlier? If so then you should just not try to take classes because I guess there's no point in trying anything. That's bullshit! You're only 25! How long do you expect to live? Why wouldn't you try to improve your life no matter what age you are?\n\ntl;dr If you think you're too late then just don't change and spend the next 40+ years in the same career then. Is that a good option to you?\n\nEdit: Btw I understand the confidence gap, a lot of times we hold ourselves back because we're afraid that we are failures or we are afraid to look foolish when we try. So if you are at 25 and now starting to gain a little more confidence to try things out, good for you! We all have different upbringings and backgrounds that affect our confidence as children, and some people never gain their confidence. However long it takes, it is still a positive change.", "permalink": "/r/DecidingToBeBetter/comments/q8ucx4/ill_be_25_in_a_month_is_it_too_late_for_me/hgs8zme/"}