{"id": "t5_2tand_t3_q8ucx4_t1_hgrw064", "creation": 1634325227, "origin": "t5_2tand_t3_q8ucx4", "height": 1, "replied_to": "t5_2tand_t3_q8ucx4", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CopperPegasus", "text": "While young people are in the majority, there are plenty of older students in almost every university. I did my pHD with a woman in her seventies.\n\nAnd when I say older, I mean 35-90. You don't actually make that age group.\n\nYOU may feel older than the 19-21 year old set , and you might not be as drawn into some typical on-campus clubs because of those feels. This is not actually bad. However, say you start at 26. You still ARE the young student, and there's PLENTY of you guys on campus.\n\nPeople who got married/had kids out of school, people who took gap years or volunteered, people forging straight into a second degree for their work, people who changed majors or had to go slow, balance finances, or repeat on 3-year degrees, people who've only just realized they want/need the degree, people who got some work experience and now want to retrain or push for promotion with official qualifications, people changing careers, ...and so on. The list is endless\n\nYou aren't going to stick out in the slightest. Even if we narrow it to 'slightly older to start a bachelors' you're easily going to be about 30-40% of the people on campus. A further 5-10% (or beyond) will be way OLDER than you in the same boat. Open it up to just everyone on campus, bearing in mind 2nd degrees, post grad, masters, associates with work funnels, research, young and old faculty, TAs and so on? People your age could be 50% or more of the people on campus and, again, a big chunk older too.\n\nAlso something you will learn fast in tertiary education is that no one cares. At all. Unless you actively go seek out some giggly frat/sorority house with ONLY air headed morons, no one is going to give you a second look. Your LECTURERS will barely care- not in an ugly way, but because this isn't High School anymore. If you don't pitch up at class, don't interact, don't make the most of your opportunity, they're not going to come after you. If you ASK for help most decent profs will support you (there are some d\\*cks in academia) but they aren't going to chase you. And peer pressure and cliques? Again, this isn't High School. You shrug them off and go hang with the people who are like you. Or study. Or talk to the professor. Or go home, if your schedule suits. You don't have to have ANYTHING to do with the people in lectures with you, and for some degrees or topics there's a lot of flux in who's in what lecture. You may not have a single person doing the exact same class schedule as you.\n\nIf you're anxious, it's actually very freeing. There's a reason many shy people blossom at uni. And there's a LOT of research on how being a slightly older student is far, far better than going straight from school. You will make much more of the experience with a little life behind you.a  \n\n\nTBH, you are literally at the very best age for Uni. post-mass idiocy, pre-mass responsibility. Old enough to have discipline and life experience, young enough to fit in and have fun.", "permalink": "/r/DecidingToBeBetter/comments/q8ucx4/ill_be_25_in_a_month_is_it_too_late_for_me/hgrw064/"}