{"id": "t5_2tand_t3_isd355_t1_g579thm", "creation": 1600058063, "origin": "t5_2tand_t3_isd355", "height": 1, "replied_to": "t5_2tand_t3_isd355", "down_vote": 0, "up_vote": 39, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bangbangurhead", "text": "The best time to plant a tree is 25 years ago.\n\nThe next best time is *now*.\n\nThe crabs-in-a-bucket which help keep you where you are are not indistinguishable from eachother.  They have identities, names:  \n\n- Self-Pity\n- Fear\n- Anger\n- Shame\n\nnb:  this is not an exhaustive list.  \n\nThe shit-ton of excuses I read above I cannot parse because I don't have the time, so I'm going to invite you to get rid of those excuses, and start doing something valuable.\n\nStart a home business.  Learn to code.  Get a second degree via distance learning, and a teaching certificate.  Live in a tent and thus isolate from your parents and flip bloody burgers.  \n\nNevermind your 'nads.  Sex with some hot chick isn't a human right.  \n\nAnd for fucksakes lay off the porn if you use it.  It is ugly, created in ugliness, and can never create beauty.  I guarantee you've never heard \"I love you\" in a porno.  \n\nKudos on kicking the weed, keep up the good work.  Now improve yourself somewhere else.  Learn a musical instrument.  A foreign language (if you don't speak Spanish, why the hell not in California of all places?)\n\nThere is so much to do.  Go on a three-day fast from food and drink only water. \n\nMeh.  I'm the first commenter here, and it's rare to not be fuming at the armchair psychologists on reddit who absolutely *love* to presume to diagnose just about anyone in a support thread with depression, anxiety, or something equally invented and pointless.  \n\nAmong those from a certain Gambian ethnolinguistic group, there is no such word in the language as *depression*; the closest cognate is *thinking too much*.  \n\nThe cure for thinking too much is dancing, singing, cleaning, working - the cure for you, brother, is joy.  And joy is the result of hope fulfilled:  not hope in things or outcomes, but in ideals put into flesh and blood, and wood and stone.  Long term planning and goals.\n\nThere is no reason why by this time next year you cannot have a solid novice status in any sort of trade.  \n\nPick one thing, it does not matter, use a dartboard if you need to - I'm not even kidding here - and move in that direction.  Like interviewing for jobs you don't want helping you interview for the jobs you do, the investment in learning from home is such that your loss, if / when you change direction into something you really **do** want to do, is minimal.\n\n> When you come to a fork in the road, take it.\n- Yogi Berra", "permalink": "/r/DecidingToBeBetter/comments/isd355/looking_for_someone_to_try_and_give_me_hope_if/g579thm/"}