{"id": "t5_2tand_t3_q33xb4_t1_hftlmzl", "creation": 1633670748, "origin": "t5_2tand_t3_q33xb4", "height": 1, "replied_to": "t5_2tand_t3_q33xb4", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PrinceJamRoll", "text": "I met my best friend after highschool. It's just just something that happens. You can't force a genuine friendship. You can of course go out more and meet people and that creates the conditions conducive to potentially building meaningful relationships. \n\nOne thing I'll say though is I don't NEED my best friend to get through life. It's just a nice bonus. \n\nYou really do need to love yourself if somebody else is going to be able to connect to you on a deep level. And the twisted irony of labeling yourself a loser and constantly having negative thoughts is that it informs how you perceive - or rather misperceive the world, people and events and that is causes you to behave like a loser. \n\nYou become what you think you are. I know from experience. Sounds like you just need to work on yourself, like most young people do in some way. It seems like you're projecting the need of having a best friend as if it's going to solve your problems and if it were so simple you wouldnt have to do any work on yourself.\n\nHappiness is all that matters. And the truth is you don't need anything to be happy. It comes from within. Think about it logically. Every requirement for happiness is established by YOU in your own head. \n\nIf you think you need this or that to be happy you will never be happy without that thing. But if you would only drop your beliefs surrounding happiness there would be no more requirements. \n\nYou could simply be happy for no reason. And in becoming truly happy and fresh from the tyranny of your minds arbitrary beliefs about yourself your life will have the opportunity to flower in ways you never expected.", "permalink": "/r/DecidingToBeBetter/comments/q33xb4/how_to_copedeal_with_not_having_any_close_friends/hftlmzl/"}