{"id": "t5_2tand_t3_ld1kuk_t1_gm3apze", "creation": 1612509064, "origin": "t5_2tand_t3_ld1kuk", "height": 1, "replied_to": "t5_2tand_t3_ld1kuk", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tendonouting", "text": "A lot of what those people say is being said not only to convince other people, but to convince themselves of it, too. Everyone’s brain thinks things all the time, not necessarily because they believe it, but because they recognize that such a ‘thing’ or action exists, and that there’re spectrums that exist and these things fall on some far end of the spectrum. I’m sure everyone has a quick thought of like murdering an old person or raping a young teenager, not because they actually want to do that, but because their brain recognizes that such a thing exists, and the brain carries the thought for a moment, and it’s gone. You have the choice to hang onto something and let it fester until you convince yourself and believe that you actually want to think about those things, by choice, or even carry out those acts. I think this guy hung onto those thoughts, mixed with a variety of outside factors, and it produced a man with a very unhealthy mental state which brought about evil behavior. Everyone wants to feel validated, and spouting shit out at people and them believing it and saying it right back at them can make someone feel validated because all these people around them agree, so it must be true, and through that they’re convincing themselves that they’re right, too. I also think sure he said what he said to manipulate others, but I personally think there’s always at least a twinge of true personal belief in people who may also spend a lot of time conniving on how to use their words or the representation of belief to manipulate others. I mean look at Hitler, you don’t go that far unless you actually believe that stuff, I don’t think. \n\nMy advice for anyone really is to try to find a way to calm and quiet their mind in a way that works for them so you can recognize whether hey I actually truly believe this, or if it’s just your brain thinking thoughts.", "permalink": "/r/DecidingToBeBetter/comments/ld1kuk/what_do_i_do_when_i_think_im_the_bad_guy/gm3apze/"}