{"id": "t5_2tand_t3_hqjx9p_t1_fxycumc", "creation": 1594664746, "origin": "t5_2tand_t3_hqjx9p", "height": 1, "replied_to": "t5_2tand_t3_hqjx9p", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Start by thinking about where you would ideally like to end up a few years down the line. What would your general routine look like? What things will you be capable of doing? It’s worth considering all areas of your life: physical, financial, professional, mental, etc.: just figure out where you want to get to.\n\nIf goal setting is new to you, I would suggest picking out the things (2-5 is probably about right) from your ideal life that are most important to you right now. It will be easier to set goals for things that you actively want to improve on, and you can always start on the rest later! \n\nFrom there, come up with a rough plan of how to get there. The aim here is to come up with a series of baby steps, to make the changes to your life as manageable as possible. This will help to keep you committed! \n\nOnce you’ve done that, use those baby steps to come up with progress-based goals for yourself. A progress based goal is an aim to do the thing regularly (e.g. I will run for at least 10 minutes, 3 times a week). They are generally preferable over target-based goals (e.g. I will run 5k without stopping at the end of the year) as the focus is on the daily actions it will take you to achieve a longer-term target-based goal. You will also get gratification more often from progress-based goals, plus it doesn’t have the same binary sense of success vs failure. \n\nA few key things to remember:\n\n- Baby steps are everything. Small, consistent changes are far more beneficial than grand overnight ones as they encourage long term change and are generally more sustainable\n\n- You can set lots of mini goals to help you reach the harder ones. You don’t have to jump right in at the deep end!\n\n- Review your goals regularly. Sit down with yourself once a week/month (whatever works for you!) and reevaluate how things are going. Are you sticking to your goals? Are they still beneficial for you? Is it time to alter them a little to bring you closer to where you want to be?\n\n- Have a bare minimum to fall back on. There will be bad days. You are going to screw up at times. That’s not the issue: doing something tiny each day to work towards your goals is what will show results, even if you can only manage something small. \n\nTake it easy on yourself, and stick with it! Good luck ✨", "permalink": "/r/DecidingToBeBetter/comments/hqjx9p/i_want_to_set_some_proper_goals_for_my_life_where/fxycumc/"}