{"id": "t5_2tand_t3_bzdv0j_t1_eqsvpjw", "creation": 1560295069, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BiggerBadgers", "text": "I’m relatively young like you and have and do still sometimes feel these things to. I stay of social media now because a lot of that negativity is bred from there. Since getting off I’ve realised how outside of that, people are much more normal human beings and I myself am less burdened by this strange societal negativity. Also you’ve got to remember what fills and entertains our minds is the exciting and extreme. War over water sounds like this crazy dystopian future, that yes may now be a possibility, but will more then likely never happen. So much of what we hear now is statistics spun to look completely terrible so we click on it and fuel ad revenue. It gets spread and here we are. \n\nYou’ve also got to remember that the vast vast majority of people want the best for their life and this world. Europe is now prioritising global warming as the number 1 international threat (I’m pretty sure Britain has just declared it an international emergency). There are solutions to all these problems and people in power (especially recently) are realising these things aren’t just going to get swept under the rug. And if they’re not fixed there will be no more power for them to have. \n\nFocus on yourself, if you have creative or work outlets you can sink yourself into do that. If you think you really want to have an impact on these issues look into how you can. Often times when I feel the world is bleak it’s because I myself am unhappy and am unable to see past the negativity. Enjoy your life and don’t put importance in what just anyone says, they don’t know.", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqsvpjw/"}