{"id": "t5_2tand_t3_bzdv0j_t1_eqs74ig", "creation": 1560278228, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 16, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "furrysurender", "text": "I’m going to post one more thing because I feel like I have so much in me I could say about this because I was once in your shoes. I remember nights where I would just be laying on the ground, staring at the ceiling, feeling paralyzed at the thought of knowing all the terrible shit going on in the world and not being able to do anything about it. Mine was the entertainment industry, and all the evil shit going on behind closed doors, especially with children involved. Know that your acknowledgment is enough. Your energy of love being sent out is enough. You’re not here to fix it. It’s okay to move on from it after acknowledging it. You can’t function properly in continuous sorrow and morbid thinking. \n\nMy other advice to you. Pay attention to the information you are receiving. Is there a solution that is being mentioned when a problem is being informed? Or is it only addressing a problem with no solution. What is the purpose of this information if there is no solution? How factual is it? How many years of research has it been tested? Is it only a theory? What is the counterclaim, are there other researchers and scientists claiming the opposite? Does the solution require your money or allegiance to a political agenda/belief system? Is the information inspiring to unite or to divide? Does the information have a moral, righteous tone? Is it trying to sell you something? Is the tone based mostly on fear? What is the purpose of this information? Why does the author or researchers believe fear will drive results? Shouldn’t the truth be powerful enough? Ask questions. You are an investigator of life in a world that is trying to cover up story after story. Hiding the real truth. The truth will set you free, but it can be too much to handle as well. Live life trying to find balance and love. Love and unity is what creates solutions, not fear or moral judgments. Try to hold your judgments aside regarding information you have been given. An insect is going extinct. Your judgment of this is a bad thing. We are always trying to judge things as right and wrong, good and bad. It’s the religious dogma that is still programmed in our collective conscious since the many years of living under self righteous ruling. Sometimes things are just are. It is what it is. Not good or bad. It just is. Controlled media and government has a track record of not having clear judgment as well. \n\nBless", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqs74ig/"}