{"id": "t5_2tand_t3_bzdv0j_t1_eqsapug", "creation": 1560280592, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "poundofwhat", "text": "I wanted to reply because I can understand - or at least I think I can understand - what you’re feeling. You seem to suffer with excessive guilt. For that I recommend therapy. It helped me to deal with it, notice it, decide what to do with it. I’ll address some things that helped me; there’s already so much good advice in this thread, so I’ll try not to repeat any of that.\n\nI spent years tormenting myself over issues like climate change, child abuse, oppression, human trafficking. I would lay awake at night and despair,  unable to get out of bed in the mornings because I couldn’t help feeling “it” (life) was just all so torturous and pointless. So much suffering, danger, hurt, abuse etc. I had already suffered through terrible things inflicted on me by others, and I forced myself to be aware of all the bad things I could in the world. I would feel excessive guilt, like you. I haven’t completely “escaped” that feeling, but I’ve chosen to embrace it as my motivator. I made lifestyle changes. \n\nI decided I had to do “something”. Now I work with kids who have gone through horrendous shit. I had to accept I can’t save them, can’t fix them, can’t protect them from everything. But I can help, a little bit. I can do SOMETHING to try and bring them a little joy, empathy, understanding. All things that HELP. They don’t fix the problem, they won’t stop other little kids from being hurt, from suffering, they won’t stop predators from being predators. But helping just a little bit is better than being like so many people on this earth who are focused purely on their own success and “fuck you got mine” mindset, to hell with others and the planet. Which I understand, but that isn’t how I want to live my life. And it sounds like it’s not how you want to live yours. \n\nI also decided I wanted to focus energy on being environmentally aware and conscious. This does NOT MEAN reading every horrendous and terrifying piece of news that comes out. I did some research to see how, as one person, I can live in a way that does minimum harm to the planet. That can mean a lot of things (i try to eat vegan or sustainable/local grown diet, but not with an obsessive and self punishing attitude, use reusable coffee cups/water bottles, not buying “fast” fashion from companies that use sweatshops or destroy crops/forest etc. But could also mean taking part in protests, growing your own food, building a career somewhere in environmentalism). Maybe this could help you? It’s given me something to focus on and rebuff those horrible depressive thoughts with.\n\nAll this helped me manage my depression/anxiety/feelings of worthlessness, and has given me purpose and fulfilment, a life worth living. I’m living life on my terms. I don’t read or watch the news very much because it ruins the energy I need to to be a “good citizen”. \n\nWhichever solution or advice speaks to you in this thread, just remember personal change always takes time. I’m only a stranger on the Internet, but if you really wish to change your relationship with yourself, your thoughts and life etc, do not expect it overnight.\n\nSending you love, caring stranger. I hope you find a way through it all. ❤️", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqsapug/"}