{"id": "t5_2tand_t3_bzdv0j_t1_eqrthrg", "creation": 1560269499, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 21, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RodneyRodnesson", "text": "I'm not sure how to help you but I'm rather older than you, around a half-century old now.\n\nAll I can tell you is these few things:\n\n-\tI was born in South Africa and lived through the first truly democratic elections. I'm white. A lot of people thought we were all going to get killed and the country would descend into chaos so they stockpiled food and water, bought electricity generators and prepared for armageddon. **We were all fine**\n-\tThe entire world was going to collapse when at the turn of the millennium because of the Y2K computer bug. Again, stockpiling etc. **We were all fine**\n-\tTigers were going to be extinct in 2004 when I was working in wildlife rehabilitation. **They're still around**  !It's important to note here that we should make sure **no** animals go extinct and too often it depends on how big or loveable they are but the point about doom and gloom remains.\n-\tThere was a prediction that oil would run out... I think it was sometime in the early 2000s but then they found new reserves and better ways of refining it.\n-\tSome years ago chocolate (and coffee and bananas) was going to become unbelievably expensive or even cease altogether for various reasons. All still fine.\n-\tCurrently I'm in the middle of Brexit, which was going to be an instant disaster and... well, it remains to be seen but I think we'll be fine.\n\nThe point I'm trying to make, badly, is that the news is always going to be full of sensationalist doom and gloom but we are almost certainly going to be fine. We are an incredibly inventive, curious species and have a knack for solving problems. An example is those black floaty balls they invented to stop water evaporation in California not too long ago.\n\nAll I would say is try and be aware of how you're being manipulated. Try and concentrate on your world locally. Make a difference where you can.\n\nIt will almost certainly be fine.\n\nBe strong.", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqrthrg/"}