{"id": "t5_2tand_t3_bzdv0j_t1_eqtnxro", "creation": 1560315467, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DeltaCharlieEcho", "text": "Stop watching the news, stop consuming media, stop having discussions on politics. Stop it all IMMEDIATELY!  \n\n\nIf you want to be happy live your life and do it as you see fit. Freedom comes from the person permission to have freedom. When you live in a way where you consume all the shit that's thrown at you \\[be it pop culture, the news, social media, marketing, ect...\\] your brain gets completely overrun with information that is not pertinent to survival and personal advancement.\n\n  \nIf you're going to use Reddit, do so by only subscribing to and including positive subs on your homepage. If there's a toxic culture in a sub that you like the rest of the content of, unsubscribe; if you find yourself irritated everything you read the comments in a sub, unsubscribe. Only include subs that you're excited to see posts from. For me it's r/boxing, r/amateurboxing, r/caferacers, r/space, and a couple others that are location specific. Just gotta find the right mix, it's like every other imageboard on the interwebz lots of retards that shouldn't have access to a keyboard let alone the internet and a few good people sprinkled in. I'm not sure where I fall in that grouping FYI.  \n\n\nIf you're really getting overwhelmed by these thoughts of doom and gloom, find a project. Spend your time and money doing this project, perfecting your craft, researching new ways to do what you want to do, and become a master that people want to hear from. It'll change your whole perspective. I never thought I'd want to be a mechanic or tradesman but after 10 miserable years in college I'm dropping out and going to a trade school to fix motorcycles where I'll also take side classes in welding and fabrication and use those skills to open my own customs shop for bikes so I can build people one of a kind machines that they'll baby with everything they are.  \n\n\nPeace, Brother; it's not all doom and gloom even if the stats say it is.", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqtnxro/"}