{"id": "t5_2tand_t3_bzdv0j_t1_eqs5slh", "creation": 1560277362, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 167, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheBigKrangTheory", "text": "I feel like we're on the same page. For the last year, I've had to take a step back because sometimes everything feels too heavy. I don't go on Facebook because I can't stand the drama or the \"telephone tough guys\" picking fights over every minor thing. It's honestly too much for me to handle. I've lost friends because I've turned inward and there are times where I think I might be depressed.\n\nBut I honestly feel hopeful for the future. People like us have felt the exact same way through history so we're not unique in that regard. It's easy to feel hopeless when all you hear is bad news.   \n\nIf you take a relatively short amount of time, say 5 years, and you really think about it, how much has changed in that amount of time? Probably a lot. Things have happened that you never could have predicted. Now, 5 years might seem like a long time, but it's really not. The year 2000 was 19 years ago, doesn't feel like it but the thought freaks me out when I do the math.\n\nMy point is that a lot can change in a short amount of time. These issues that are bothering you may be resolved sooner than you think. Or, maybe they just need the right person to help fix them.\n\nI honestly believe that intelligent people are the ones that worry about these things. Intelligent people sometimes can't handle the stress because they're more aware of what's going on. All it takes is one intelligent person to redirect the flow of the future. You could be that person if you really want to. Focus on your desire to do good in the world rather than focusing on all that's going wrong. Problems and solutions pop up all the time. You don't have to find the cure for cancer, but you can definitely make an impact of you put your mind to it. Start small on the issue that bothers you most and see what happens. Turn your blinders on to the nay sayers and your internal beliefs that tell you that you can't make an impact to the world. If you believe in yourself, you can accomplish anything.\n\nPlanting a tree or using reusable bags might not seem like a lot, but you could be the tipping point that changes things for the better. You could be the change you want to see in the world.\n\nNow, that being said, I know it's not always that simple, and it's sometimes hard to put your plans into action. Sometimes it feels impossible just to get out of bed in the morning. I recently saw a quote that said \"you are allowed to be a masterpiece and a work in progress at the same time.\" Take your time and figure out who you want to be without any concern for anyone else first.\n\nMaybe solving the world's problems isn't something you'll want to work on and that's totally fine. Or maybe you'll start making small changes 5 years from now. Everyone has their own pace. \n\nWhat you really should focus on is gratitude. It's impossible to feel sad when you're truly grateful. Feel gratitude for the birds chirping outside your window and how they signify spring and new beginnings. Send blessings to the hands that picked the beans, molded the cup, and built the water treatement plant so that you could enjoy that cup of coffee.\n\nI don't know if I'm helping or if I'm making things just feel worse, but I do know that life is hard. It's like waves on the ocean; sometimes the waters are calm, and other times you're caught in a storm. Sometimes, the waves keep hitting before you can even come up for air. But every storm passes; you just have to keep swimming.\n\nYou're looking at these issues as one giant storm that you're caught in the middle of but the best way to get through it is to focus on one wave at a time. \n\nLife is definitely worth living. There are always good people doing good things. A 24 year old invented a method to help clean the ocean and it was launched in September. India became the world leader in renewable energy. Nepal's tiger population doubled. The ozone layer is healing. Niger has planted over 200 million trees. Morocco has criminalized sexual harassment and being gay is no longer a crime in Lebanon.\n\nGood things are always happening and good people are everywhere. People come together in times of strife. Have faith in humanity and help out as best as you can when the situation arises.\n\nAnd it's not selfish to work on yourself. Do what you need to do to become a happier person and you'll affect the lives of the people around you.\n\nI'm definitely not qualified to talk about this stuff, I only know from experience. I don't know if any of this is helpful. But please, if you're depressed and feel like you can't take it anymore, please talk to somebody. It's okay to be weak sometimes but don't ever give up! You're more important than you'll ever know.\n\nEdit: Thank you so much for the silver and gold! If I'm completely honest, I don't quite understand what that means but it seems like a big deal and I'm incredibly grateful! I will be getting a Reddit crash course later on today so that I understand better.\n\nThank you to OP as well for putting into words concerns that I have also been dwelling on for a long time. By writing this post, you've not only opened my eyes, but have created a platform for people to reach out to each other. I feel so good right now knowing that I'm on the path to better, more positive thinking. \n\nThis post has honestly restored my faith in humanity. It's an amazing feeling to be reminded how many good people there are out there and that none of us are alone in our struggles. I feel a lot more confident and hopeful today. I honestly can't believe so many people read through that monster of a comment and still took the time to upvote. You're all amazing!!! \n\nNow, I have to get those damn aforementioned onions out of my office so that my coworkers can stop giving me weird looks.", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqs5slh/"}