{"id": "t5_2tand_t3_qh5sxu_t1_hidz0nx", "creation": 1635433031, "origin": "t5_2tand_t3_qh5sxu", "height": 1, "replied_to": "t5_2tand_t3_qh5sxu", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PhoenixFallingFast", "text": "I’m thirty. I have a lot of regrets about my twenties. I’m not happy where my life is now and I’m in the process of trying to turn that around. Honestly though most of it is just pressure on myself that I should have been “successful” by now. I’m behind though because I was behind emotionally and I gave myself to everyone else instead of building myself up.\n\nIf I could give anyone advice on living in their twenties it would be this. Don’t focus on what anyone else wants for you. Just focus on you and figuring out who you are. \n\nBe open to trying new things. Your twenties really are all about experiences that tell you who you are, that way, by the time you are in you late twenties or early thirties (when most people start settling down) you know a good amount of who you are and what you want for your life. So when you do find someone that you fall in love with you will be more of who you are and less of who you were raised to be. You and your partner will be more aligned with your true values and what kind of lifestyle you want etc. \n\nIn a lot of ways that’s what your twenties is. You leave your childhood home and you start questioning whether you agree or disagree with the things you were taught as a kid. You can’t know for sure what you believe or what you want out of life if you don’t question what you were taught. Your twenties is like the transition decade where you go from living your life as the person your parents wanted you to be and (usually by the time your in your thirties) becoming the person that YOU want to be. \n\nSo just figure out what that means. \n\nAre you extroverted? Introverted? Are you religious? Spiritual? What beliefs matter to you? What do you value? Do you like to travel? What’s your passion? What kind of people do you feel most comfortable around… or rather do you feel drawn to because you can be yourself? \n\nIt’s a great time to try hanging out with different groups of people to see where you relate. That’s part of why people love to travel so much, to see how other people live. It really opens your eyes. The more you can experience the more you can see what you enjoy and who you like to be. \n\nDon’t be afraid to switch jobs every six months if your unhappy with the one you have (you don’t owe any loyalty to any company because they don’t give you loyalty in exchange for all your hard work and dedication. Hard lesson to learn if your a loyal and dedicated worker, so just move from job to job after getting your six months of experience until you find what makes you happiest. Also it’s how you move up the pay scale in a given career). \n\nLots of people are irresponsible when they are in their twenties and they make huge mistakes because they are young and get lost in the moment and give in to peer pressure. So if you want to let loose and have fun, do it, just make those choices for you and no one else. \n\nYou are the one who has to live with them. No one else. If you know you can live with yourself if you do something then do it! But if it goes against who you are and what you believe it’s likely going to be something you regret. Just own your decisions no matter what and you’re much more likely to be okay with how your life turns out, even if it’s not where you expected to end up (most likely it won’t be). \n\nPeople regret a lot when they let life happen TO THEM instead of choosing to lead their own life.\n\nTry letting yourself just be in the moment and to choose to feel joy. It’s incredibly freeing.\n\n As a person with lots of anxiety and depression, myself, I learned a lot of it stems from trying to make everyone else happy and not living life as I really am. I gave more to my relationships than to myself and after all these years most people I thought would be in my life forever or for a long time aren’t here. I don’t have the home I thought I would have or the job or the relationship, because I put everyone else’s happiness before my own. It’s sucks a lot because in your thirties everyone is busy settling down into their own lives. They don’t have time to devote to you if something bad happens in your life. You have to rely on yourself. That can be really scary if you have never put yourself first or you have to struggle to support yourself.\n\nThat’s why, I believe, most people say you gotta live it up in your twenties. Once you turn thirty and settle down with a family and you have no time to sleep or do anything for yourself and you gotta be responsible all the time, ALL THE TIME… So before then people want to be wild and reckless and crazy. Just make sure your living it up doesn’t permanently prevent you from enjoying the rest of your life. \n\nYou are likely to love real hard and get real hurt. You are likely to make lots of stupid decisions especially because of alcohol or your emotions. It’s very common in your twenties to make a lot of painful mistakes.\n\nThe thing is sometimes that’s the only way to really learn who you are. And it’s best to do it while your young and not responsible for a spouse or a family because then it’s not just your own life you’ll be fucking up. \n\nIf I could go back, I would focus on living my life for me and not for other people (once you have a family every moment is about someone else). \n\nFind what makes you happy. Surround yourself with people who make you feel good about yourself. Work at places that make you feel proud and accomplished. Travel to countries you’ve always dreamed of. Go for walks under the stars. Stay up all night laughing and being free. Jump in the ocean when it’s cold out. Run in the rain. \n\nFind things that set your soul on fire and make you feel alive. That’s the beauty of your twenties. You get to live life for YOU and only you, so embrace it. Don’t let anyone else tell you who to be! Don’t let anyone (including you) hold you back from finding who you are in your soul. \n\nExperience life and set yourself free!", "permalink": "/r/DecidingToBeBetter/comments/qh5sxu/how_do_you_live_up_your_20s/hidz0nx/"}