{"id": "t5_2tand_t3_pvbeqp_t1_he9jqms", "creation": 1632603124, "origin": "t5_2tand_t3_pvbeqp", "height": 1, "replied_to": "t5_2tand_t3_pvbeqp", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ancquar", "text": "When you say 'I was resenting shit tbey said to me when they treated me like trash\" judging by your words, your relatives probably can also name a number of incidents when it looked to them that you treated them like trash for reasons they may not fully understand.\n\nWhen people explore in detail the justifications they had for acting like they did, but don't do the same for others, it's very common to have people who are upset with each other for reasons that are perfectly valid as far as facts *everyone* has in their head go. You describe enough raging and exploding even in your own words that if it happens regularly, a person who does not have the will to sort through exactly what you are feeling (and looking at your words you don't sort through that for your family, like whether your sister feels validated or your mom has her own ton of issues) could easily call that unbearable.\n\nWhen you say \"pushing my buttons\" was it outright manipulation or arguments that just had this effect on you? Could your family view things you do as just pushing their buttons if they don't dig deeply enough?\n\nAlso keep in mind that a person who regularly has to deal with others' anger (that they may believe to be unjustified) may find it almost impossible to express real positive emotions. That is they may consciously wish to mend fences (e.g. by buying things), but if they keep thinking about recent cases where in their mind you were angry unfairly, they may just be too emotionally tired to be able to express real care and positivity - though according to what you describe, your mom is tired of both you and your young sister.", "permalink": "/r/DecidingToBeBetter/comments/pvbeqp/i_just_exploded_emotionally_at_my_mother_and/he9jqms/"}