{"id": "t5_2tand_t3_po2fuk_t1_hcuagbx", "creation": 1631638860, "origin": "t5_2tand_t3_po2fuk", "height": 1, "replied_to": "t5_2tand_t3_po2fuk", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Javka42", "text": "It is easy to get stuck on the idea that you must follow the same path in life that \"everyone\" follows, and want the things \"everyone\" does, but you don't. You can take things at your own pace. In reality, many people don't follow that predetermined path, we just tend to see those who do since we think it's what we should be doing too.\n\nI don't have a partner or children, and don't know if I even want them. I'm in my thirties, no particular career. I've never been ambitious. I have a job I like but don't work full time, so I have some free time to do with what I want. I'm not rich, and have to adapt my life to my low income, but that's fine with me, especially since no children depend on me. I have friends and family members I'm close with. I find meaning in those relationships and in trying to make the world a little better for having me in it, by helping others for example. I have food and a roof over my head. I've had some depression and anxiety in the past, and still wrestle with that sometimes, but now I can mostly wake up and feel good in the morning, and that relief is worth everything. It makes me feel grateful. Of course I have bad days but on the whole, I'm happy. My life could be so much worse.\n\nSome marry their childhood sweetheart, some don't fall in love until they're 50. Some know from the start what they want to work with, some change careers completely every ten years. Either is fine, of course. I am open to whatever the future holds, but I see no reason to try and rush towards it.\n\nI think of it as having chosen to get off the highway and instead wandering through the countryside at my own pace. Those racing down the highway still, where are they hurrying to? It's not like there is a destination we have to reach. We travel for the time we have and then we die. That's all. Up to you what you want to do with that.", "permalink": "/r/DecidingToBeBetter/comments/po2fuk/how_do_you_stop_comparing_yourself_to_people_your/hcuagbx/"}