{"id": "t5_2tand_t3_hxsnpq_t1_fz90dry", "creation": 1595719685, "origin": "t5_2tand_t3_hxsnpq", "height": 1, "replied_to": "t5_2tand_t3_hxsnpq", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Slartibradfast", "text": "Something you should think long and hard about is this: Are you trying to fix your damaged reputation, or find genuine peace? Regardless, she doesn't ever have to forgive you, and you need to be prepared to accept that. She may never be able to talk to you, see you, or hear your name without fear. Additionally, if she is triggered by you, approaching her is not really to help her. I would imagine she will reach out to you if she needs closure or is ready for an apology. Don't attempt to rush her healing for your sake. She is carrying an emotional weight that you can't understand, and has to process it however she can. Assault is about taking power from others, whether you were aware of it or not. Her reclaiming that power is not something you can help with. Respect her space.\n\nThe good news is that your life needn't be defined by a single act. My advice is to acknowledge the truth of it when asked by others, and don't make excuses for your actions or comments about her. Don't make any further mention of her emotional or mental state. That is harmful, and can make people think that her feelings are somehow invalid, when you know there is a direct cause. It is another way that people seek to take power from people (again, whether they realize it or not). I say this only to point out that you have work to do in how you process and talk about this. I urge you to talk to a therapist to help with this. Our past actions can haunt us if they are not processed with guidance. Thinking they will just stay in the past will make them worse in the long run. If you have the strength to truly understand your past, you will find your burdens lighter, and be able to reach more positive emotions (empathy, serenity, patience, and wisdom).", "permalink": "/r/DecidingToBeBetter/comments/hxsnpq/tw_i_sexually_assaulted_someone_and_i_dont_know/fz90dry/"}