{"id": "t5_2tand_t3_7c30x1_t1_dqlhy9t", "creation": 1512106519, "origin": "t5_2tand_t3_7c30x1", "height": 1, "replied_to": "t5_2tand_t3_7c30x1", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KreamoftheKropp", "text": "I was absolutely fed up,  I had lost the love and respect from my family after completing treatment a year earlier because I relapsed and hid it until I ended up in jail twice in one year for DUI.  They’re is an old saying “nothing changes if nothing changes”, I used to wake up and say I am not going to drink tonight every morning, and did absolutely nothing to prevent me from it through out the day then I was lucky to make it past noon without it.  Willingness is huge, I had to do what was suggested by another alcoholic who had been where I was. I relocated myself to another state 700 miles away with no car, 300 dollars to my name and lived in a sober living complex with 30 other dudes and went to treatment and some days I walked and it was 7 miles if I remember correctly, because I wanted a new life really fucking bad, not for anyone else but me. I keep referencing my addiction but it’s all about quality of life in the end.  I haven’t been perfect and I slipped and went on a bender for two months and ended up in inpatient treatment and it emotionally and physically killed me last time. But..I got out and wanted it even more after that so I dug in deeper and tried harder and today I am 456 days sober. \n\nI didn’t give up! I cried in meetings and at home I threw stuff and I screamed and I prayed and it’s the most alive I’ve ever been though. Today, I have a  job, a dinky apartment a license and a car and it’s all mine. My first steps I identified I had a problem, a really bad fucking problem that spawned other problems and those problems decided to have children too, I made a plan: step 1 get the fuck out of my parents influence and safety net: step 2 Go back to treatment and be “willing” to learn about my disease and take advice in that time, find employment and a bike and find a friend. I pulled off all those things and it all started out with a plan and goals. Some of those goals took baby steps and trial and error but one thing remained the same I never gave up, I quit at times but my desire to be better never went away and today I am grateful for that.", "permalink": "/r/DecidingToBeBetter/comments/7c30x1/i_dont_know_if_i_want_to_be_better_or_just_dont/dqlhy9t/"}