{"id": "t5_2tand_t3_8w49s1_t1_e1v78o7", "creation": 1530840212, "origin": "t5_2tand_t3_8w49s1", "height": 1, "replied_to": "t5_2tand_t3_8w49s1", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "i_Got_Rocks", "text": "Thinking your way out of problems is rarely a good way to solve problems you created by over-thinking.\n\nOne thing that works for many is getting out of your head, by getting into your body. A lot of people try running or jogging, but there's many, many forms of exercise you can try.\n\nThe dopamine boost from exercise also helps to keep you in better moods and helps control emotional outbursts, such as anger, that can come from addiction recovery.\n\nWhenever you can't control a lot, the one thing you want to *show* yourself is that you are not helpless.  A good way to do this is by controlling your breathing.  IN this case you don't want to *over-do it* by forcing yourself to breaths slow and deep! \n\nRemember **Force =/= Control**\n\nIt's like pushing a gas pedal; pushing it doesn't mean you're in control, it just means you're jamming it forward!\n\nHowever:\n\nSteering = Control.\n\nIf you're at the wheel, no matter how fast you go, you're in control.\n\nSo, back to the breathing. Anytime you feel you're losing control, **relax** your breathing.  \n\nBreathe in deeply and slowly, all the way into your belly (not just your upper chest--this is called shallow breathing). Hold for 5 seconds, you might feel your heart slowing down as you do this. Exhale fully, slowly, through your mouth for 5 seconds. Repeat.\n\nRemember, if you try to rush through it, you're trying to force control.\n\nThis is a type of meditation, it's good for the brain. But it's also rooted in physiology and biology.  Usually, when you're stressed, you begin to breathe shorter breaths--shallow breathing.  This means less oxygen in your blood, and less oxygen in your brain.  This means you have a shorter fuse and can't deal with stress easily.  \n\nBut, by breathing deeper and making it a habit, you train your mind, and your brain, to slow down...to remember that you can *always* control your breathing.  Once again, exercise can ease you into better breathing habits without even thinking about it.\n\nIf you google it, you'll find much better guides, but I thought I'd send you something practical that wasn't about thinking *more.* I know what it's like to over-think, and thinking more hasn't helped--at least, that's my case.\n\nGood luck.", "permalink": "/r/DecidingToBeBetter/comments/8w49s1/i_would_like_to_worry_less_about_things_out_of_my/e1v78o7/"}