{"id": "t5_2tand_t3_io2rtf_t1_g4d1tn5", "creation": 1599504165, "origin": "t5_2tand_t3_io2rtf", "height": 1, "replied_to": "t5_2tand_t3_io2rtf", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "realperson67982", "text": "If you haven’t already had one, expect a day where you just sort of explode. Lots of emotions, for me it was a shit ton of anger that my addictions had been covering up. Exercise reeealllly helps to get this out. Just run run run.\n\nI had a day I was so mad I couldn’t see straight, went sprinting to relieve it, couldn’t sleep so I ran like 8 miles, went home, slept for an hour or two and was wide awake the next day.\n\nJust know emotions will get crazy if you keep this up. It’s good, that’s what we’re here for to experience emotions and feel for each other. That’s what gives life meaning and makes it full and in color, beautiful.\n\nIt will be intense, but know you will get through it. Over time, maybe months it will level out. Your milage may vary, but that’s how it’s been for me.\n\nOh and get ready to feel amazing too. Better than you can remember possibly. \n\nJust don’t be afraid to ask for help, YOU’LL NEED IT I’m guessing, ask for help *during* your breakdown, when your at your worst and most vulnerable, to someone you trust. This can be so incredibly healing, you will teach yourself you don’t have to go to addictions to avoid these feelings.\n\nOh and meditation. Meditation has been HUGE for me, you can always start with just 1 minute per day if you want to make it a habit but not put too much pressure on yourself. Let it increase as you go along. Meditation can help you learn to soothe yourself and better accept and live with your emotions. So does the book, Radical Acceptance.\n\nMay not all be the same for you, trust yourself, you know what you need. Good luck <3", "permalink": "/r/DecidingToBeBetter/comments/io2rtf/i_am_13_days_without_cigarettes_weed_or_alcohol/g4d1tn5/"}