{"id": "t5_2tand_t3_q5ewee_t1_hg8lfmj", "creation": 1633966219, "origin": "t5_2tand_t3_q5ewee", "height": 1, "replied_to": "t5_2tand_t3_q5ewee", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Itshardtofindanametf", "text": "How does one truly develops confidence ? \n\nLet me drop some concept I learned from a writer: \n\nConfidence has a lot less to do with achieving  something . It’s all about being comfortable in having less. \n\nIn your case a bf probably. You might’ve acted needy around him which was perceived by him (subconsciously) as your lack of confidence.\n\nDon’t google it. Research can help but the easiest way is this.\n\nMake a list of things that you like and that actually push you in day to day ( gym games learning a skill studying , socialise out of your comfort zone , make new friends that match your vibe , expand the horizon of your actions ) \n\nDo hard shit for some time you’ll being to see how confident you get.\n\nAnother big thing. Knowing isn’t half the battle as they say  , it’s noting. Doing is everything.\nI have this knowledge and even then I’ve been finding it hard to actually put it into action and I’m slowly resolving the issues that keep me from acting.\n\nMeditate or just be aware of egoic thoughts that pop up once you try to do hard stuff.\nAcknowledge them\nThere will be an aha moment \nThen \nJust do it \n\nGive yourself time , take care of yourself heck remember nothing is owed to you , go back ,don’t just read this line , feel it. \nYou could drop dead rn and nothing changes. Realise this and feel the gratitude of present moment. You will love yourself, you already do , you just have to switch off the background noise of surroundings and your thoughts that  (by just recognising them and not fighting against them which does more harm than good )\nKeep moving much love take care", "permalink": "/r/DecidingToBeBetter/comments/q5ewee/loving_myself_but_how/hg8lfmj/"}