{"id": "t5_2tand_t3_q5ewee_t1_hg7hl4g", "creation": 1633941514, "origin": "t5_2tand_t3_q5ewee", "height": 1, "replied_to": "t5_2tand_t3_q5ewee", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LogiccXD", "text": "I think the \"Be more confident\" is an important part people seem to miss, it's not just love yourself more. \n\nBasically, believe in your decisions, not in their outcomes.\n\nWe are all flawed human beings and we don't know what decisions will lead to good and bad things. We can't know. However, nonetheless the best thing we can do is to make the best decision we personally can, stick with it even if people criticise us, unless we deem it to be completely flawed, and observe the results. If the results are more good than not, it was a good decision, if they are not which is more likely, you get to learn from your mistakes. You become arrogant only if you completely ignore others and don't learn from your mistakes. But don't be a pushover, afraid of voicing your opinion. Also worry about yourself as well.\n\nFor example, if you decide that changing your career is the best option you could make, and everyone discourages you, think about it, but if you still it's the best idea you have, do it, and be confident when you say \"No, I think changing my career was the best decision I could make\", no matter the consequences. If it was a mistake then admit it, and think about what caused your judgement to be incorrect. Either way you gain something, a better career or personal development. \n\nAlso make sure when you help others not to hurt yourself in the process. If someone needs minor help, but you really need to do something important, prioritize that. The point of a relationship imo is not to live for the other person, but for both of you. Think about what would be the most beneficial for you both. Don't accept an invitation from your boyfriend if it's on the same day as your interview. If you hurt yourself more than you help the other person you effectively hurt the relationship. If you always decide to do what is most important for you both, your relationship will grow. \n\nI hope that helps", "permalink": "/r/DecidingToBeBetter/comments/q5ewee/loving_myself_but_how/hg7hl4g/"}