{"id": "t5_2tand_t3_lfq04q_t1_gmq996p", "creation": 1612897571, "origin": "t5_2tand_t3_lfq04q", "height": 1, "replied_to": "t5_2tand_t3_lfq04q", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "akellah", "text": " I was also 30 when I took the plunge and made the needed changes in my life!\n\nThinking back on it, there are a few things I think that made the biggest difference. Forgive me, it's pretty long-winded and does get a little philosophical.\n\nStrive to be ego-free in your work.  This doesn't mean you can't be proud of your accomplishments, but being consistently open and calm when working through challenges and not taking things personally is something that I've had folks call out as a rare trait when I've been nominated for promotions. In practice, this can be remaining calm and talking through interpersonal issues with understanding and compassion for the other person (even if they're being a butt), or being resilient when someone makes personal attacks or nasty comments. Don't be a doormat, but try to step outside your personal feelings/reactions and look at the problem objectively. It takes practice, but it's been a huge help (both in the workplace and for my overall stress). I recommend **Working with Anger** by Thubten Chodron to explain what I'm struggling to convey. \n\nBe honest and take ownership of mistakes. I know it sucks to have to shine light on a failure or error, but it's better that you fess up and explain what happened to a manager before it becomes gossip or office dirt. Own it, provide your next steps on how you're planning to solve the problem, and go from there. It saves time and builds trust with your managers. And, if you're like me and tend to fall down the shame spiral for not doing something perfectly, it takes the teeth out of the subconscious tendency to catastrophize about the unspecified doom that will come from not being perfect.\n\nBe compassionate but firm, respectful but not obeisant. Your coworkers are people, too. Treat them like peers deserving of respect (everyone, including the janitor) but make sure you know your boundaries. Some personality types will make the mistake of interpreting respect as weakness and engage in weird hierarchical office politics. Approach it with good humor. Objectively, we're all just people working our way through life. There's a measure of hilarious absurdity to the idea that thousands of years of human advancement and struggle have led to an office encounter with Paul, the Fitness Guru, asking if you even lift, bro. Take that good humor and continue to be friendly; everyone is trying to ensure they have some measure of social status and be respected by their peers -- Office Paul is just going about it in all the wrong ways. Some people struggle with the idea that respect isn't a zero-sum game and that you lose nothing by giving it to others. \n\nTry not to take joy in the failures of people who make your life hell. You're all on the same team trying to work toward a common goal -- their failure is still a failure for the team/company/etc. Help out where you can, work through the misstep with them, and keep moving forward.\n\nI hope this helps in some way. These are things that I've received positive feedback on in commendations and performance reviews, and are strategies I've used to turn a stressful work environment into a more peaceful one. There are definitely people in the wake of my career progression that really didn't like me (and still don't), but it can never be said that I treated them with anything other than professional respect. Good luck!", "permalink": "/r/DecidingToBeBetter/comments/lfq04q/evidence_i_needed/gmq996p/"}