{"id": "t5_2tand_t3_a6cp7a_t1_ebttn7l", "creation": 1544854667, "origin": "t5_2tand_t3_a6cp7a", "height": 1, "replied_to": "t5_2tand_t3_a6cp7a", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "findinghomeagain101", "text": "From a non-lawyer 😎\n\nOthers will see what they want to see. Only you know you. You don't have to defend or justify yourself to anyone including yourself. A suggestion would be to nurture yourself and treat yourself compassionately with what you say and think to yourself. Stay aware of your internal dialogue and adjust it if it becomes negative. Patterns can change as we know with practice but it takes time and commitment.\n\nJoining a non-intimidating group such as a walking group or even going for some nature walks regularly on your own whilst practicing mindfulness e.g. noticing your clothes on your flesh, the feel of your socks  against your feet as you walk, how your watch feels agaisnt your wrist, the sound of the leaves in the trees rustling, birds calling etc. It is a great way to be reminded of the wonder of life and the bigger picture. Animals just be animals; they don't reflect much on how they come across to others. They have many answers to the common problems of humans I think.\n\nI get caught up in rumination often. I'm learning to just do, and just be without so much rumination. It isn't easy.\n\nGood luck on your career! The best argument should always win in a just courtroom. Believing in yourself (and doing your homework on each case) is what radiates confidence and ability, not how sociable one is able to be whilst amongst their work colleagues in social settings outside of a courtroom.\n\nYou will be fine. Achieving a law degree is just so huge. Putting forward your case should be easier *in theory. Good luck!\n\nP.s I'm just about to start studying a foundation studies course at a university in my city and I need to utilise the tools that I have, that we all have within us; to let go of what we cannot change which is what anybody else thinks. Most humans go through this. You're not alone in your line of thinking. You're just as human as anybody else!", "permalink": "/r/DecidingToBeBetter/comments/a6cp7a/need_a_word_from_the_wise_from_any_lawyers_or_not/ebttn7l/"}