{"id": "t5_2tand_t3_oem6gn_t1_h47nlk1", "creation": 1625554129, "origin": "t5_2tand_t3_oem6gn", "height": 1, "replied_to": "t5_2tand_t3_oem6gn", "down_vote": 0, "up_vote": 14, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DidntHaveToUseMyAK", "text": "100% through your hobbies my friend! There's always a group about whatever you're interested. Remember, the internet is a little bit of everything, all of the time.\n\n First step is figuring out what those hobbies are, then what the social aspect of those hobbies are. Cooking? Cooking classes, message boards, forums /r/cooking etc. etc. Is it slightly more niche, like maybe you are the one person who ACTUALLY underwater basket weaves. All you gotta do is post photos and express yourself, and people will come to you. \n\nBut u/DidntHaveToUseMyAK, what if the hobby I like to do is isolated? Like meditation, or doing a puzzle? Well, fortunately, that might even be more helpful for you, if you don't like talking too much when first meeting someone. It might take a bit of initial investment, or not depending on where you go, but I bet you if you started working on a big ass puzzle in a library with a little sign that said \"Come help me\" you'd have someone putting a piece or two in in no time. Meditation, on the other hand might be a bit trickier, but still, there's always people to talk to about the topic, and it can then branch to further interests, then asd;'okfnqe;ouirnbgqoinfonsf'l;aksjfg'paiw and you have a friend. Simple as that!\n\n\nNo but for real, you build friendships with mutual attractiveness (personality, not necessarily physically.) proximity (such as a coworker, or that guy who goes to the same game store to play Magic: The Gathering where you also happen to have a D&D group) and common interest. Which all three of those things are typically from work, or hobbies. Gone unfortunately are the days we get to know the neighbors through house warming parties (Haha, who can afford a HOUSE these days?) and shared meals. Best of luck to you, as well as OP on the journey of adult friend making. I'm doing it too, just with a bit of cynicism if you couldn't tell.", "permalink": "/r/DecidingToBeBetter/comments/oem6gn/i_deserve_better_friends/h47nlk1/"}