{"id": "t5_2tand_t3_o9y42t_t1_h7yphct", "creation": 1628273804, "origin": "t5_2tand_t3_o9y42t", "height": 1, "replied_to": "t5_2tand_t3_o9y42t", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Embarrassed-Future28", "text": "I don't know how helpful my advice can possibly be, but I commend you for doing this. Seriously. I'm 22 now and I have another 3 whole years until I finish my degree - it feels like a lifetime away, but it goes by quickly. Good for you for putting this first!! There is no greater investment in a dream than education. My advice is similar to what everyone else has been saying, but here's some tips that my best friend used when she moved out last year on her own: \n\nFood stamps are a great resource and you can definitely qualify for them. She wasn't a full time student, but her job at the time didn't pay very well and she was able to get them. \n\nStick to a strict budget to make your savings last throughout the semesters. There's plenty of apps that you can download to keep you accountable and organized. \n\nFind odd jobs on your summer and winter breaks from school - lots of restaurants and coffee shops are used to having college kids come in and out of the business during their breaks; it'll be great pocket money for when you want a coffee sometime. \n\nAs far as loans and grants go, talk to the financial aid office! They will be able to give you the resources to apply to as many as you possibly can. The community colleges near me also take into consideration students like yourself who are young and trying to make it on their own - see if they offer any work study programs to make up for tuition costs. I personally worked the front desk of the school library and was able to get tons of school work done. - it was like getting paid to study. Great part time gig and you can pick your hours. \n\nAbove all know that you GOT THIS!! You've taken the first big steps, now do the work and keep doing the work until you get where you want to be. It takes a lot of gumption to do what you're doing. You will be great!!", "permalink": "/r/DecidingToBeBetter/comments/o9y42t/after_dropping_out_twice_im_going_back_to_college/h7yphct/"}