{"id": "t5_2tand_t3_o9y42t_t1_h3gamo9", "creation": 1624982535, "origin": "t5_2tand_t3_o9y42t", "height": 1, "replied_to": "t5_2tand_t3_o9y42t", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "zackcheese7", "text": "I (22M) write this as a college drop out who made the same decision to go back to school when I was 21. I have 40 credits now and it’s been one of the most rewarding years of my life. I learned that my preconception that I am stupid is completely wrong and fueled by a less than ideal childhood. After a year in the workforce as an insurance agent I’ve cultivated a work ethic that I never knew possible and was an important lesson for me in realizing if I didn’t put my all into work I would get fired. It has translated into achieving something I never thought to be possible, mostly straight A+ in my course work. I say this not to brag, but to show you how the experience you gained while out of school can help you find success in school. I’m trying to transfer now, and I’ve been accepted to University of Wisconsin-Madison, #16 in the country for my major. It is possible to achieve your goals. I’ll get some advice I wish I had when I was going back to school after dropping out:\n• If you’re anything like me you will battle yourself on your dreams and have doubts. Trust in your gut, the rest is just noise. You want an education and it helps to think about where you’ll be in 10 years if you act on doubts and not on what you really want.\n•You will be challenged. This isn’t a diss on your character or intelligence, it’s one of the purposes of education. I had to learn that when you are learning new things it can be uncomfortable and difficult, keep trying and realize that the the point is to have your beliefs challenged.\n•As others have stated, look into scholarships once you start looking at 4-year colleges/universities. Try to get all the aid you can get as well. \n•Use a calendar. Procrastination will backfire and continue the cycle of shame and guilt.\n•Join/make study groups and make social obligations tied to work. This one may be trial and error depending on your levels of extraversion. Personally I found study groups and discords imperative to my success in difficult classes, it keeps you motivated having a community that can relate to your struggles and you may find friendships!\n•I know you can do this, I need you to develop a voice within you that believes in YOU. You will have doubts about yourself after dropping out twice and upon re-entry everything will be scary. Try to cultivate a voice of encouragement inside of you. If you can’t find it right away, find people who can give that to you. \nAlso feel free to PM me, I know it’s super scary getting started back up, especially when you know this time it’s for real.", "permalink": "/r/DecidingToBeBetter/comments/o9y42t/after_dropping_out_twice_im_going_back_to_college/h3gamo9/"}