{"id": "t5_2tand_t3_f853ec_t1_finiygd", "creation": 1582564179, "origin": "t5_2tand_t3_f853ec", "height": 1, "replied_to": "t5_2tand_t3_f853ec", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "jettfresh6", "text": "Oh, I completely get it as a recovering addict. I also suffer from extreme anxiety that I have been working through for years. I'm a single mom of an amazing 15 year old. I see a lot of myself in him and that scares the SHIT out of me!\n\n I try to educate him without making him feel like I assume he 's going to follow in my footsteps He was very into video games for years. I had a hard time setting boundries because I have a tendency to Mother out of guilt. I'm totally open with him about my mistakes even as I work through understanding myself.\n\nFreshman year has been a game changer for us because of him. He made the marching band which is one of the top 5 in the States! So, he lettered as a frosh because it's considered a varsity sport. He lost 30 lbs (and prob replaced half with pure muscle) He  also wrestled JV which just ended and he got a job! All of this and his grades went from stuggling to care or pass to honor roll!\n\nI mean....I am blown away! Sorry for the gushing but he has opened my eyes and given me such pride! I have never known what that feels like. \n\nI have thought a lot about how our environment and relationships effect us growing up. We had a fire and had to move out of a pretty bad school district to one of the top. There are all of these tiny situations that go into forming who we are. I am relearning everything and I understand now that I deserved the same kind of uncondirional love that I give my Son. I broke the cycle of abuse, but it is ongoing. \n\nYou really touched me with your post. I wish you nothing but the best in your journey! I'd type more but, I have to make eggs, lol!", "permalink": "/r/DecidingToBeBetter/comments/f853ec/changed_my_life_addicted_to_video_games_4_time/finiygd/"}