{"id": "t5_2qh1i_t3_42g2ql_t1_cza9lr2", "creation": 1453663265, "origin": "t5_2qh1i_t3_42g2ql", "height": 1, "replied_to": "t5_2qh1i_t3_42g2ql", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PatrickBatemans", "text": "I posted this on a similar thread a while back, but here goes again;\n\nThree weeks ago, on a Thursday afternoon, I was finally ready to go through with a plan to commit suicide. I had planned for weeks, and made sure that I had a finished note, full tank of gas, and much more. After school, I drove out to a bridge in the mountainous areas of Arizona. \n\nNow, I live in Phoenix, where the city freaks out if it goes below 50F. It was raining in Phoenix, and I never thought of the weather in the mountains. I was driving in the mountains to get to the bridge when it started sleeting. Five minutes later, it was snowing, but I just kept driving. \n\nEventually, the snow turned into downright whiteout conditions, and I was going 2 mph through 6 inches of fresh snow. I shit you not, I saw a semi roll off the road, and snowplows and emergency services desperately trying to get up the mountain.\n\nEventually, I pulled over to check on my car and to see if I could keep driving to the bridge. As I tried to get back in, my car wouldn't start. It was completely stuck in snow. \n\nSo, I walked about a half mile in flip flops and a t shirt until I saw a ranch. I just walked into the property, and saw two kids playing with snow and building snowmen in their front yard. They greeted me, they were friendly and naive. Right then, I knew I couldn't commit suicide. It sounds cliche, but seeing such happy children made me realize that maybe I can find happiness.\n\nI eventually was let into their home, where their friendly father drove me out to an area where I could call my mother, as there wasn't any 3G in his house. Thank christ he had a pickup truck that basically plowed through the snow. \n\nI called my mom and told her I'd be home. After the plows finally cleared the snow from the road, the man helped me push my car out of the snowbank on the side of the road, and I was on the way home.\n\nI've never driven faster in my life. When I got home, I just hugged my parents and cried for the longest time. I told them everything.\n\nEdit: To answer the \"how am I now,\" I can't lie. I'm still struggling with severe depression. I upped my dosages of medication and have talked with some doctors about all this. I'm trying to find new ways to cope and distract myself, and I'm just trying to turn my life around.", "permalink": "/r/AskReddit/comments/42g2ql/serioussuicide_survivors_of_reddit_how_did_your/cza9lr2/"}