{"id": "t5_2tand_t3_oi76pd_t1_h4yxrhk", "creation": 1626127510, "origin": "t5_2tand_t3_oi76pd", "height": 1, "replied_to": "t5_2tand_t3_oi76pd", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PunkLibrarian032102", "text": "\"Am I missing something fundamental in the learning process?\"\n\nYes, you are.\n\nYou don't 'get really good' at art, or guitar, or language, or a sport, or *any* endeavor without investing YEARS of effort.\n\nIt sounds like when the first thrill of accomplishment fades, you jump to something else, because you've reached a plateau and suddenly it's not fun anymore, or you mistakenly think you've learned all there is to learn.  Progressing to the next level would take real work, and temporarily experiencing a loss of competence, since you will not be as skilled at the higher level at first.  This feeling is uncomfortable, so you flit to something else.\n\n\"How do I get past this?\"\n\nBy loving the **process** of learning something thoroughly.  Don't be satisfied with half assed effort.  Embrace the work, and you will come to value it.\n\nAny person who achieves at the highest level may have innate talent, but they put years of work into their craft, and this work does not stop when they reach the pinnacle.  And they have 'beginner's mind'.   Professional musicians sing or play scales every day. as well as creating new music.  Prima ballerinas do the same barre exercises they did when they were beginning ballet students, as well as perfecting a role they will be starring in.  None of them think they are 'too good' to play scales or do barre exercises.  These 'beginner' activities are the foundation of these artists' crafts. \n\nThe best explanation of this mindset (learning to love the work of mastering an endeavor) is in a short book called *Mastery*.  It's by George Leonard.  I recommend it without reservation.", "permalink": "/r/DecidingToBeBetter/comments/oi76pd/having_trouble_consistently_learning_different/h4yxrhk/"}