{"id": "t5_2tand_t3_kc6dxd_t1_gfp6967", "creation": 1607869728, "origin": "t5_2tand_t3_kc6dxd", "height": 1, "replied_to": "t5_2tand_t3_kc6dxd", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "findingtemo", "text": "So we’ll said! Parenting is always challenging because your child is always changing and the scene is always changing. And what ends up happening is any frustration that arises becomes ultimately a reflection of self. I’m sure there are some parents who don’t see it that way but I do. Your reactions to your child many times can be based on something you may have issues with like control or not being heard  etc. The you can chose to change. I’ve always said my child has been my best teacher. Shown me who I really am, what I believe & why. \nAgreed a shit ton of mistakes you’ll make & you’ll say things you wish you hadn’t but always remember this.... mistakes are teachable moments. What a great opportunity to show your kid & yourself & your family how to recover from failure.\nAnd yes take all the wonderful opportunities ahead by being involved with people, places, experiences & books you would hope your kid would chose someday. You are going to be a great dad, you already are. You are taking the path of love for yourself & family. Welcome to the parenting club it’s a crazy ride of fun, mess, frustration, glee, torment, silliness & love. And know you are not alone in feeling overwhelmed. We all are! Most aren’t brave enough to share it. When you share it does make you vulnerable to other parents but trust me those parents will be so glad you shared cause they struggle too. \nMy kid is now 18. Life goes by in a blink.\nThe very best to you & your family! \nPS Parenting books are a great resource for encouragement & guidance. You can get recorded books as well while doing yard work or folding laundry.", "permalink": "/r/DecidingToBeBetter/comments/kc6dxd/today_121220_i_have_2_years_clean_my_daughter/gfp6967/"}