{"id": "t5_2tand_t3_gal9nu_t1_fp2y0px", "creation": 1588269784, "origin": "t5_2tand_t3_gal9nu", "height": 1, "replied_to": "t5_2tand_t3_gal9nu", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ChickenCamelClutch", "text": "Oh man  the feels. I was the Superman of white chips. Could never get it down. I woke up in a hospital at 40 yrs old and said \"what the hell am I doing\" \"I have a child, I am a really good person with a great heart And I know I have lots to give in this world! \" And ever since Jan 1st 2018 I've been on the up and up. Feels great to be sober. You're talking to someone that lost everything. I have been homeless, sleeping behind dumpsters, falling asleep I'm public places, crashing in the bushes and sleeping as I was trying to walk back to my brothers. He found me on the side of the road. Friend. I have had a few times with a .5+ alcohol level to where the doctors were baffled that I was at least not in a coma let alone talking to them. I was bad.\n\nNow I have had the same job. I am a manager/lead tech and a cleaning and restoration company (similar to Stanley Steamer). I train new people. I have a relationship with my son. He tells me he loves me. We laugh together. We go to the movies and have so much fun together just cracking jokes and playing pranks.(nothing crazy) He got a kick out of me saying to people that were leaving the theatre \"hey thanks for coming out guys hope you enjoyed the show(like I worked at a theatre) he gets a kick out of me asking for a senior citizen discount when at the ticket counter. He's got my sense of humor. I never thought I'd be that for my son. It's the simple things j have so much gratitude for. I had resigned myself to die an alcoholic. You know what's really cool? This would sound weird to a 'normal' person but I've even had the same phone number this whole time! I'm always on time with my bills. My credit is improving slowly but surely. Most of all, I am happy and I know life will only continue to get better so long as I follow this path. I say to you. If this raging alcoholic can do it anyone can!\n\nI hope for the absolute best for you, friend!", "permalink": "/r/DecidingToBeBetter/comments/gal9nu/what_do_you_want_for_yourself/fp2y0px/"}