{"id": "t5_2qh5i_t3_952zbj_t1_e4030or", "creation": 1533984277, "origin": "t5_2qh5i_t3_952zbj", "height": 1, "replied_to": "t5_2qh5i_t3_952zbj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "marknotgeorge", "text": "Oh, I see. I've not been unemployed for  the last 24 years, just not has a job in development. When I left uni, I was lacking in confidence and communication skills. I had a job at McDonald's, and eventually tried to make the best of that. \n\nAfter 10 years and getting married to a woman who already had children, I found that my job and my family life collided. I then moved to a job in car manufacturing, which I really wasn't suited for, but I stuck it out for another 4 years or so. \n\nAt this point, my oldest stepdaughter was unhappy with A-levels, and found a trainee job at an accountancy firm where they would pay for her to study for the AAT (accounting technician - the step below chartered). I thought about it, and decided that since work at the car plant was making me depressed and anxious, I would leave and study the AAT myself.\n\nTwo years into my 3 year course, I found a junior position at a local accountancy firm. Unfortunately, my marriage failed around the time I was taking my final exams, so my firm decided they would not fund any further exams, so no chartered for me. That being said, they did help me through the dark years. \n\nAll this time, two of best friends were doing very well in their careers, and while I wasn't trying to compare myself to them, I knew I could do better for myself. Since uni, I'd been playing with code on and off. I'd even got some money out of an app I wrote back in the Nokia Symbian days. I tried a couple of start-ups, but I'm no CEO. \n\nIn the spring of 2017, I met a wonderful woman who has been my inspiration. I made it my goal to get a development job in 2018, and spent the first half of the year sorting out my CV, my Github, and preparing  for interviews. And in about June, I posted my CV on a jobs website for a completely different job.\n\nI got a call from a recruitment agent telling about this job. Two face-to-face interviews, a technical test, a phone interview with head office in France, and I got the job on my first attempt!\n\nTLDR: A woman, confidence and timing, I suspect.\n", "permalink": "/r/happy/comments/952zbj/just_got_home_from_first_day_at_a_development_job/e4030or/"}