{"id": "t5_2tand_t3_kgl55y_t1_ggfuxev", "creation": 1608437032, "origin": "t5_2tand_t3_kgl55y", "height": 1, "replied_to": "t5_2tand_t3_kgl55y", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Valaddictorian", "text": "I’d like you to first take a deep breath. Then realize that you can’t change the past, but you can choose what you do today. It won’t be easy, but acceptance is the first step to moving forward. Once you’ve come to terms with your past, you can now start taking actions to move forward.\n\nRemember that comparing yourself to others doesn’t serve you in any way. You are exactly who you need to be. There is no other you. \n\nIt sounds like what you need is to take action. Think about what you want to achieve right now. If that is to find an entry level job, cool. I don’t know about you but that sounds like a gargantuan task to me when I’m in the same headspace as you. How about we break it down into something smaller and turn it into actions that you can take. For example, I will find 1 job and submit 1 application today. You may have negative thoughts before hitting the submit button. Acknowledge those negative emotions and apply anyways. You will never be able to control the outcome of the application, but you can feel proud of completing an action that could lead to something amazing. If you can break down what you want to do into small actionable steps and do them, you will be a lot better off.\n\nAs for your worries about explaining your situation, IF it even comes up, I would suggest that you try to steer the conversation back to why you’re a good candidate. It can be as simple as “I was taking some time off for myself, but now I’m ready to take on this exciting opportunity to work with your company...”. My experience with this is that it’s not a deciding factor and if it is, it is not a company that you want to work for.\n\nGood luck and stay strong.", "permalink": "/r/DecidingToBeBetter/comments/kgl55y/i_feel_like_ive_messed_up_ill_be_32_by_the_time_i/ggfuxev/"}