{"id": "t5_2tand_t3_kgl55y_t1_ggfvdn8", "creation": 1608437301, "origin": "t5_2tand_t3_kgl55y", "height": 1, "replied_to": "t5_2tand_t3_kgl55y", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Dopaminjutsu", "text": "Hello. Your story resonates with me. I went through something similar. I'm currently 28 and working \"entry level.\" \n\nThe door is not closed. We're on different paths it sounds like but I do want to share my story since it may help.\n\nI graduated from a brand-name undergrad (did pretty mediocre gpa-wise) and then went to medical school, which I failed out of after failing to address mental health issues that had been lingering since high school. I continue to struggle daily with the feeling that I'm a failure that wasted all the taxpayer money put toward my education, and that my family's love and care was something I happily took and then shit all over and then set it on fire and then left it on society's doorstep and then rang the doorbell and finally ran away.\n\nI too was extremely burnt out but in complete denial about it. It was a little \"big fish small pond,\" a little relationship issues, a little existential dread, and a whole lot of losing myself in addictions (videogames continue to be the one I struggle with, though I've been frequently day drunk as well).\n\nI work in healthcare because at this point it's all I know. I do still love medicine. I reapplied to medical schools. Rejected all around. I applied to PA schools. Rejected. Now I'm going for some health adjacent stuff, hoping to get some certifications under my belt. All of this while rolling the sisyphean boulder of a house's worth of debt working for close to the average national minimum wage and paying for my own health insurance among other things.\n\nThe door isn't closed at all. Working where I can find it, I've run into people just getting things started in their 30s. I've met waiters still dreaming of law school at 30. Veterans who left the service with fewer skills than advertised ending up working a desk somewhere. An architect's apprentice who was 27 iirc. \n\nYou've kept productive in your \"time off.\" Lean into that. Talk about the positives, what you did--they don't know what you didn't do, and just looking at a CV it's hard to say \"this person should have been doing this and this and so and so time.\" They may think it's weird you're older and it is indeed unusual, but at the end of the day they're looking to fill some shoes, ultimately they don't care if you're old or not. You learned and grew and have something to bring to the table that a more 'typical' applicant doesn't. You got this.", "permalink": "/r/DecidingToBeBetter/comments/kgl55y/i_feel_like_ive_messed_up_ill_be_32_by_the_time_i/ggfvdn8/"}