{"id": "t5_2tand_t3_pyynau_t1_hey9vm9", "creation": 1633074982, "origin": "t5_2tand_t3_pyynau", "height": 1, "replied_to": "t5_2tand_t3_pyynau", "down_vote": 0, "up_vote": 19, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JGWol", "text": "Addiction is spot on here. I definitely had highlights of my life when I was in the center of them. My teenage years I was addicted to video games. My college years, drinking and smoking. Last year it was my girlfriend and gambling. Now this year I have nothing. I quit smoking (2.5 years), three months off drinking, and have quit gambling. Still have speculative investments but they’re long term holds and I never put more than 10% of my net worth in at a time, and I don’t double down. Either go for bust or wait a year for a profit.\n\nHow do I feel doing this? Replacing all the time of mindless indulgence with exercise and sitting at bar tops with friends stone cold sober?\n\nMiserable. Scared. Bored. Lacking purpose. Desperate for my ex to ring and tell me it’ll be okay. Thirsty for a drink. Considering a cigarette. Anything.\n\nBut, I’m 30. I’m grown. I’ve realized that it’s a blessing when things come into your life that help carry you along and give you comfort and purpose. But that it’s also okay when there’s times in life when you’re caught in the dark. When you’re insecure, when you’re alone, and no one seems to want you around.\n\nBut that’s the time you grow. When you process. You might be In this place because *you deserve it*. You fucked up. Or, other people are at fault. But, you’re grown. Eye for an eye isn’t a viable, healthy option. You have to turn the other cheek and keep moving. Welcome to being an adult.\n\nSo, all I can say to OP is.. just wait. You’ll find something. Especially if you’ve depended on codependency or substance abuse for a long time to keep you occupied, you’re expecting a miracle to *quickly* find meaning. You’re reprogramming your brains rewards centers to seek out long term efforts. It craves excitement and stimulus. But you have to actively fight against that call to action and be comfortable with the grind.", "permalink": "/r/DecidingToBeBetter/comments/pyynau/i_cant_give_meaning_to_my_life_nothing_interests/hey9vm9/"}