{"id": "t5_2qh5i_t3_futur2_t1_fmgb1cq", "creation": 1586045077, "origin": "t5_2qh5i_t3_futur2", "height": 1, "replied_to": "t5_2qh5i_t3_futur2", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "brgr_face", "text": "What an excellent question! I have a few pieces of advice outside of general colour theory:\n\n - *Exaggerate your use of colours.* It’s rare that I follow colours as they appear in real life/references. If you’re illustrating a mountain, throw some bright blues and teals in the ridges. Painting a face? Emphasize the undertones and add some bold blues and magentas. Maybe some bright reds. Don’t get carried away trying to draw things exactly as they are\n\n- *Avoid using pure blacks in your work.* It tends to look unnatural and bleak in contrast to other colours. [In this piece for example, the darkest colour I used was a deep orange brown.](https://www.instagram.com/p/B8v40r_nZ6u/?igshid=16uvj8pgewdmb) black can definitely be used well, but it gives a more “cartoonish” look to the finished product\n\n- *Use white minimally.* Rather than using white to highlight an area, substitute it for a pale blue/pink/yellow/purple etc. to make your overall image look softer. Play with your highlight colours as well, just because the overall tone of a piece is yellow, it doesn’t mean your highlights have to be yellow as well. Try a light purple instead and see how you feel with it.\n\n- *Balance your bold colours with muted ones.* For a long time my illustrations looked really harsh on the eyes because every colour I picked was extremely vivid and bright. If you want to use a neon orange, go for it, but remember to balance that colour with some some dark oranges or greys as well\n\nI don’t have any particular resources to share - all I can suggest is to keep looking at other art and take whatever you can from it!", "permalink": "/r/happy/comments/futur2/i_started_illustrating_full_time_this_year_and/fmgb1cq/"}