{"id": "t5_2tand_t3_mjw9g2_t1_gtdxoro", "creation": 1617571485, "origin": "t5_2tand_t3_mjw9g2", "height": 1, "replied_to": "t5_2tand_t3_mjw9g2", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Chader_", "text": "Interesting discussion and I now realize that I was a bit fast on describing the whole situation and I didn’t realize that it could be interpreted as toxically codependent.\n\nThe thing is that my mom i a narcissist and her goal was to make me codependent on her. So when I realized what a monster she was I had no fundamental ground to stand on because everything was built around her. Not much I can do about that really since she is my mom and I was a child. That is why I have had problems with getting out of it on my own.\n\nMy gf was the one to help me realize that my mother was a monster, since she is quite into psychology and such and she made it clear that she would be there to help me get through it, which I have never asked from her until today. She has been trying to support me and I have partially accepted the help, but never fully since I didn’t want to drag my gf down with me.\n\nSo to be able to survive, yes, I have become a bit codependent on her, but not in a toxic way. I am very careful not to be toxic with my mental health towards my gf, and we talk about it all the time to make sure everything is healthy. \n\nThe thingy when she left was that before she left we worked on me getting better together, which worked really good, but then she left for the weekend and I was on my own again without any fundamental tools to cope, so I crashed and asked her to help me up. Not to carry all my weight, but just to be there as support. Our goal is to make me independent, and it is getting better, but it will take time. And in the meanwhile, I will lean on her on her conditions. I am never expecting any help from her and she can leave me whenever she wants without me getting any hard feelings. I understand that being around a depressed person can be hard, but she is up for the challenge too. Just wanted to clarify that.\n\nThis explanation is also simplified. There is so much more to the story and it is essentially proven that my mom has mentally abused me and my siblings. It is not just me opinion, it is everyone in the family, friends, etc.", "permalink": "/r/DecidingToBeBetter/comments/mjw9g2/i_beg_you_please_read_this_if_you_feel_like/gtdxoro/"}