{"id": "t5_2tand_t3_mjw9g2_t1_gtexpnb", "creation": 1617591743, "origin": "t5_2tand_t3_mjw9g2", "height": 1, "replied_to": "t5_2tand_t3_mjw9g2", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tent1pt0esd0wn", "text": "Glad you feel better and didnt harm yourself. I agree anyone feeling suicidal should def reach out for help. \n\nCalling up the ex and dishing all that out sounds does seem like manipulation, but its not if you are genuine in your words and follow through with actions to reflect that. \n\nTake internet feedback with a grain of salt and dont let irrelevant or misunderstood responses detract from the wave of relief you feel right now. I dont use much if any social media on my good days. You are in a fragile place right now, be diligent about guarding your well-being however you have to.\n\nI been in depression hell for a few months (really much longer, but one of the pits rn) and I just stopped by to say I been doing and plan to continue doing the opposite of what you suggest. Disclaimer: See first paragraph! I am not suicidal, just hate life and living more often than not. And I feel its exclusively due to continuous hurt and betrayal from other people. How many times in the past have I been doing just fine until someone came along and I allowed them acess to my life or emotions, successes or weaknesses, time or assets, only to be exploited? Even the people who probably have good intentions for you, really only want for you what will best serve them. So fuck everybody fr, all anyone has ever done for me is make me feel worse. I feel like I need a total purge of people in my life because I have decided who I am and who I want to be and it doesn't suit the people who havent seen themselves stage left yet (family). \n\nDifferent situations I know, thanks for letting me vent. Congrats on climbing out of the pits of depression hell, what worked for you hopefully helps someone else struggling. I know I could use therapy and I support everyone doing what they gotta do to love themselves.", "permalink": "/r/DecidingToBeBetter/comments/mjw9g2/i_beg_you_please_read_this_if_you_feel_like/gtexpnb/"}