{"id": "t5_2tand_t3_mjw9g2_t1_gtf566c", "creation": 1617596587, "origin": "t5_2tand_t3_mjw9g2", "height": 1, "replied_to": "t5_2tand_t3_mjw9g2", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kenna_renaeee", "text": "I think it’s wonderful that you’ve come to this realization, and I agree, asking for/accepting help from the people closest to you is critical, especially in fragile/unstable points in your life, and can have immeasurable benefits, so I’m definitely proud of you!\n\nHowever, what myself, and I believe many of the other “negative commenters”, are concerned about isn’t the fact that you’re asking for help from someone you trust, but more so the fact that she may not be ready/willing to give that help, seeing as you stated she left you. That factor really tilts the story from this “beautiful, vulnerable experience of finally seeking help” that you’re trying to illustrate, to an unhealthy, toxic way of getting someone roped back in to something they just tried to leave, whether consciously or subconsciously. Now I’m not saying that’s the case, because only you know your life and relationship, I’m just letting you know how it’s perceived from an outside perspective. \n\nI guess my goal in writing this is to hopefully urge you to consider sitting down with her, while your head is clear, and making sure that she really is ready and willing to help you in the way that you need. Because as someone who’s been in her shoes before, it’s very hard to say no when someone you care about calls you like that, no matter how desperately you want to leave. But t I can assure you, even if she said yes and came back, unless her heart is in it, it won’t end well.\n\nI hope for nothing but the best for you and your girlfriend, and I apologize if my perception of the situation is inaccurate, but I hope you know nothing I said was written to be judgemental/attacking in any way, shape or form.", "permalink": "/r/DecidingToBeBetter/comments/mjw9g2/i_beg_you_please_read_this_if_you_feel_like/gtf566c/"}