{"id": "t5_2tand_t3_8gz1cv_t1_dyfxdz4", "creation": 1525446939, "origin": "t5_2tand_t3_8gz1cv", "height": 1, "replied_to": "t5_2tand_t3_8gz1cv", "down_vote": 0, "up_vote": 15, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "onebytebetter", "text": "I always see people mentioning meditation, because it helps improve every single aspect of your life. If you're not already meditating maybe start that. I'm trying to start out with 5 minutes and I'm going to increase it to 15\\-30 minutes a day.\n\nIt feels like you're happy with your life, but you're getting a bit comfortable and you know there's more that you can do. Take some online courses, I'm going through all the Crash Course videos on YouTube right now. There's everything from Computer Science, to Philosophy to Psychology. Taking online courses is a great way to get knowledge on various subjects, when you're well informed on different subjects it's easier to hold conversation with different people. The more knowledge you have of various fields  the better you'll be able to communicate. If you find something you're passionate about learning maybe go back to school and get a degree in that subject.  Or you can make that subject your hobby and turn it into a side hustle.\n\nWrite down goals for yourself. What would the best version of yourself be doing right now? Like if your wildest dream could come true what would you be doing? Would you be traveling more? Would you be helping other people more? Would you go back to school and get a degree in dance?  WRITE IT DOWN! Read that list every morning. Even though your life is great right now, there's still got to be some things that you've always wanted to try, but you haven't been able to try. \n\nSome other ideas\\(to help others\\):\n\n\\- Start volunteering, try to volunteer at least one day a week.\n\n\\- Maybe become a big sister through big brother big sister or another program like that.\n\n\\- If you want to make a difference on a larger scale, maybe take a few political science classes and try to run for local office. If you're in local office you can actually make changes in the local community. \n\n\\- Become a mentor, your job can probably team up with a school and your best friends and you can help mentor younger children.\n\n\\- Start a personal development podcast. You've learn so much information on your own personal development journey, maybe make a YouTube channel or podcast to help others with their development journey. You may not get a bunch of viewers at first, but if you can even affect one person's life that's still influential\n\n\\- Maybe start a personal development blog, learn web design and design the blog from scratch.\n\nMore ideas \\(things that can help you develop\\)\n\n\\- Read Read Read Read. The most successful people in the world read a whole lot. Find a list of top 100 books and go through them.\n\n\\- Find some people you really admire and read their biographies or watch some of their interviews. Try to mimic their style of talking and mimic their confidence.\n\n\\- Travel. ", "permalink": "/r/DecidingToBeBetter/comments/8gz1cv/what_are_some_experiments_i_can_try_to_help_me/dyfxdz4/"}