{"id": "t5_2tand_t3_et3mig_t1_ffgbenk", "creation": 1579902527, "origin": "t5_2tand_t3_et3mig", "height": 1, "replied_to": "t5_2tand_t3_et3mig", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LizGarfieldSmut", "text": "Yeah, I've had a lot of struggles to, I'm still nowhere at 25. I see people work on themselves of being less socially anxious, with more reason than me to be that way. I just don't get how when you go out there, you see that people don't think what you think they think, they don't think mean things to you. All the time I go out, people insult me cause they perceive I'm weak according to others, mentally. I interpret everything, from coworkers to clerks as being insulting. I've tried for years at just learning and getting out there on how to not let it effect me, I can write books on it. And yet I still can barely go outside without for days arguing against why the shit people, from anywhere that I went that day, what they said about me isn't true, lest I risk suicide from depression. I don't know why I'm 25 and I'm doing what you and OP post and nothing changes. I don't have a job, I don't go to school, I fucking live at home because I'm a fucking target. Like don't get me wrong I always try, tomorrow I'm hanging out with friends, but I know, regardless of who I meet, I just know they'll say a bunch of fucking things that bother me and make me depressive unless I spend days trying to argue in my own head against them. I go to therapists but either they're mean, or they tell you to read a book that is only marginally helpful, in my experience. I just don't get it. I'm just trying to ignore this frame of mind and just get distracted with other things. I try my best, and if God wants to know that I'll be homeless when my parents kick me out at I guess 30, then that's the way it goes. Heck, it's better than my great grandparents generation, most taken out of their homes and shot in front of each other by Nazis, if that's any consolation to myself .....", "permalink": "/r/DecidingToBeBetter/comments/et3mig/i_had_my_first_kiss_at_23_years_old_after/ffgbenk/"}