{"id": "t5_2tand_t3_osnhs6_t1_h6ryaep", "creation": 1627434390, "origin": "t5_2tand_t3_osnhs6", "height": 1, "replied_to": "t5_2tand_t3_osnhs6", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "stickysweetastytreat", "text": "There isn't any easy way.. ideally if you guys could get into couples' counseling and maybe even individual counseling, that could help-- you could both learn tools to anchor yourselves (for you when you start to get mad, for her when she starts to get reactive/defensive, etc) but also, oftentimes therapy sessions are a once weekly thing, so it's like having.. bumper lanes (is that what they're called, when you're bowling & they put the things out in the sides if there are too many gutter balls lol) that help you guys work through issues as they come up.\n\nObviously I don't know more than what you've said, so I'm sure some of what I'm saying will be filled in with my own assumptions so please keep that in mind.\n\nThat's great that you've worked on your anger a lot! Is she aware of how much you've worked on it? Does she understand that you know your anger has contributed to this dynamic? Was there ever any closure from her perspective, or was it something you worked on by yourself? Because if she wasn't aware that you were actively working on the anger issues, she may still feel like she needs to walk on eggshells.. and/or even think that the deflection has been working and that's why you haven't been as angry with her.\n\nIt's kind of a chicken/egg thing, which really sucks BUT the silver lining is that you don't necessarily have to dig & address the \"root cause\" because at this point, it's its own root cause. ANY improvements that are maintained consistently can help break the cycle. But when it involves more than one person, it means both people need to be conscious & actively engaged with this work.\n\nGetting mad at her for shifting the blame is still being angry at her. She might not be in the right _frame of mind_ to start to understand the exact reason why you're angry (because the message she's getting either way is that you're angry at her.. whether it was her action or her deflection **this isn't speaking to what she's contributed to that dynamic)... there could even be a bit of a fear response on her part, especially if your anger in the past scared her (and esp if it still does.. whether that fear is founded or it was built up in her own mind is a separate issue). None of us are at our best when we're in a shitty headspace-- meaning, we're even more inclined to default to the patterns that we're the most used to, even though logically we know it's not for the greater good (it's interesting stuff, if you read up on the polyvagal theory of trauma & the nervous system) It'd be one thing if this was a new dynamic but if it's been going on for a significant period of time, it's probably pretty worn in. That's the sucky thing about how our brains work. We form habits, not just like a smoking habit or always reaching in the snack drawer after dinner, etc.. we form habits based on emotions & thoughts too. \n\nNormally I'd recommend addressing the issue head on. Maybe that's something you can do here (or if you already have, what happened?). Go into the convo when you're both in a good headspace. It might be that you and/or her can't be in a good headspace at all, which would be totally understandable.. in this case, having a third party who knows these kinds of issues would help a lot. How you approach it matters-- like if you're coming at it like \"I KNOW I get angry a lot but you get so defensive that you won't even hear me!\" it won't go over well right? Maybe you could write a letter instead-- remind her that you love her, that you know you struggle with anger, that you've worked on it a lot, that you're continuing to. That you need her help, her patience, her trust in your commitment to her, to your marriage, to yourself as self-improvement. And this isn't you saying \"this is my/your fault\", I'm saying to just share facts at this point. Pretend like blame & who's fault it is, isn't even a thing that exists. And you don't have to get to the point of \"I need you to stop doing XYZ\", \"When you do ABC, I get angry because XYZ\", etc just yet. I know it's super fucking frustrating (and hurtful) to have your wife not see you.. I think if you two re-establish that you're both on the same side first, the approach to improving this will be more of a partnership and collaboration which will also help reinforce the fact that you guys are on the same side. (like the start of a better chicken/egg scenario!)", "permalink": "/r/DecidingToBeBetter/comments/osnhs6/husband_said_he_made_my_730am_appointment_for/h6ryaep/"}