{"id": "t5_2tand_t3_l1oerg_t1_gk0y9t9", "creation": 1611201474, "origin": "t5_2tand_t3_l1oerg", "height": 1, "replied_to": "t5_2tand_t3_l1oerg", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CreepyTarot", "text": "I continue to realize that my anger serves no purpose. Lately I have been very clear on what I want and the fact that all my emotions come from me, which means I have the power in any situation to make myself feel better. A couple thoughts I remind myself of when I'm angry:\n\n1. Everybody is just doing what they think will make them feel good. Even in the worst, most horrible situations, it's not that the individuals themselves are inherently horrible. It's that the circumstances in their lives have lead them to believe that what they are doing this moment will make them feel pleasure or feel happy. If I had grown up with their exact same experiences, I would feel the same.\n2. If I can find just ONE thing that I genuinely like about a person, my anger is temporarily disabled. It doesn't have to be their personality. I can like their teeth. Their sense of fashion. I can like that they are passionate about something. I can appreciate that they are speaking calmly instead of screaming. I can appreciate the fact they put on deodorant today and don't stink. As long as it is a genuine feeling, no matter how stupid, it renders the anger invalid for a couple moments.\n3. If I get mad at another person for not behaving the way \\*I\\* want them to behave, I can't ever be mad at a person for wanting me to behave the way \\*they\\* want me to behave. I am asking someone to give up their selfish desire to follow MY selfish desire, which is silly. And the same is true for the opposite. I don't inherently owe anybody anything that will compromise my happiness. I am entitled to be happy and calm in any situation. But I know that when I am happy and calm I genuinely enjoy helping others, and I can even fake being stressed or upset if it makes others happy, while still being peaceful inside.\n\nEach day I sit down and think about all the things in life I appreciate, and realize that when I am in a state of appreciation or gratitude, I don't feel anger, and life seems better, so if I want to be totally selfish I need to learn how to live without anger and I feel confident I will have a richer and more wonderful life. I also use self-hypnosis to suggest letting go of anger. Hope this helps.\n\n(Sorry for the long post, lol!)", "permalink": "/r/DecidingToBeBetter/comments/l1oerg/to_all_of_you_who_overcame_severe_anger_problems/gk0y9t9/"}