{"id": "t5_2tand_t3_p71vph_t1_h9httd4", "creation": 1629346713, "origin": "t5_2tand_t3_p71vph", "height": 1, "replied_to": "t5_2tand_t3_p71vph", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "epozzo", "text": "A good analogy for life is that it is a long, drawn out marathon and you can only run/walk it one step at the time. That step is always in this moment right now. Are you being great right now? Are you taking a step in the right direction or is it backwards. \n\nWhen you focus on your effectiveness in the moment, you will see that you can win many moments. (You do not even have to win all of them) Anxiety always comes from anticipating a future that will likely never come. It is the product of an overreactive body because something likely happened in the past.  We all have that. Just let it be. Make the anxiety at home and act on your commitments as much as possible. If you make it wrong or make it go away, it will actually be all over you.  Let your body have that anxiety and act anyway. Don't let the anxiety stop you. However, don't push yourself too hard and to quickly either. Your body can backfire with a panic attack. Get comfortable being slightly uncomfortable. Within no time you will see how far you have come.\n\nJust win right now.... and now....  and now...\n\nFuture and past is actually a concept we human beings created to describe moments that are no longer now and have not yet been now. Life is always and only lived \"now.\" The more you master that, the freeer you will be.\n\nI am actually creating a Youtube Channel where I plan to address many of these concepts and ideas.  I think these lessons / concepts  can avoid a lot of anxiety and will allow many people going through these phases to thrive faster.  Here is a video I posted today: [https://youtu.be/obNb9bu6IFw](https://youtu.be/obNb9bu6IFw)\n\nGood luck on your journey and your growth!", "permalink": "/r/DecidingToBeBetter/comments/p71vph/my_20s_were_challenging_also_you_will_work/h9httd4/"}