{"id": "t5_2tand_t3_pxagby_t1_hencybf", "creation": 1632866314, "origin": "t5_2tand_t3_pxagby", "height": 1, "replied_to": "t5_2tand_t3_pxagby", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rocksteady2R", "text": "(A) keep on going, man.  sometimes we have to trudge forward.\n\nA few other thoughts, not necessarily directly relate to you and your post, but they're my common thoughts on the matters like this:\n\n(B) when you get a counsellor back, consider recording the sessions and then playing them back on your commutes/hikes/workouts.  I did this while i was in therapy, and it was a godsend.  I'd get so emotionally charged during the session that i'd blank out things that were said, or just didn't hear them for my own talking or thinking.   listenging to it a few times was ... a godsend.\n\n(C) /r/theXeffect .  did this shit for 4-5 years.  i'm out of the whole, for hte most part, and i surely wouldn't be without it.   it doesn't work for everyone, but i won't not reccomend trying it.\n\n(D) new things.  sometimes we burn out on old things.   maybe your workout needs to change and you need to pick up rock climbing instead of weight-training, or basket-ball instead of rock-climbing - whatever your situation is.   the reason... the reason is new things require a lot of focus, and result in a lot of immediate growth in the learning process.   Basketball would require new rules, new practice methods, new postures, the best way to X, Y, or Z.   whatever it is, it's new to what you're doing.\n\n(E)  Men's groups.   google up mens groups in your area.   I judge you're young and resistant to these, but they're incredibely valuable.   Other men *do* share your pains, your fears.  and what's more, even the ones who don't empathisize.  and you can learn, yourself, from men on both sides of that equation.   I am in The Mankind Project, and it's *well* worth looking into.   Even fi you cannot find an MKP weekly group, i'm sure there's something google-able.   Shit man... even 12step places are valuable sounding boards.   Getting into  MKP is why i was able to ween off my therapist.   \n\ngood luck.", "permalink": "/r/DecidingToBeBetter/comments/pxagby/booked_a_doctors_appointment_booked_a_counseling/hencybf/"}