{"id": "t5_2tand_t3_pvbeqp_t1_he9ukvy", "creation": 1632608172, "origin": "t5_2tand_t3_pvbeqp", "height": 1, "replied_to": "t5_2tand_t3_pvbeqp", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ancquar", "text": "Ok, my apologies, seems I misread your situation.\n\nPersonally I was until late twenties in a situation where I had no relations (only a very short one around 25 which the girl dropped with no explanation though we remained friends), my job was low-intensity freelance with no prospects and I had a lot of social anxiety and little undestanding of how to act around people, plus regular arguments with parents (in hindsight I think they made some valid points but largely poorly expressed them).\n\nThings that helped me get out of this were:\n\n- Going out to random social meetings of people that are not part of my circle. That was uncomfortable but gave me practice of how to act around people in low-stakes situation when I didn't care (too much) about messing up. With more experience in social situations the social anxiety lessened. Things I did were e.g. meetup hiking groups and language exchange meetings.\n\n- Physical exercise, eventually moving to latin dance classes. It may be trite, but exercise does change how you feel and raises your energy. And latin dances combine that with social training (though I probably wouldn't be able to handle them at the start)\n\n- Cutting on porn - basically loss of energy and often loss of self-esteem, particularly the angry kind.\n\n- Keeping a journal. That was back in Livejournal days so it also benefitted social experience to a degree, the thoughtfulness+social combination is harder to find in twitter/snapchat age.\n\n- Eventually finding a fulltime job and moving away from family (to another country for that matter) - a lot of things people argue when living together lose their importance when you only meet once per year.\n\n- This is likely much more subjective, but reading Atlas Shrugged had a strong effect on me. Some people find it very motivational, for some its message of \"only you are responsible for what happens to you, don't evade the facts and don't look for excuses\" just doesn't compute, and it doesn't mesh well with millenial sensibilities. Later \"The Six Pillars of Self-Esteem\" reinforced the message\" as its rooted in the same ideas but is expressed more thoughtfully and less radically.\nFor that matter you may find that different books resonate with you, but trying some selfhelp books and seeing which ones work would be beneficial.\n\n- Meditation. I never got into it too seriously, but just doing it sometimes can lead to moments of clarity where you get new ideas on how to address things. And basic mindfulness meditation is very easy to pick up.", "permalink": "/r/DecidingToBeBetter/comments/pvbeqp/i_just_exploded_emotionally_at_my_mother_and/he9ukvy/"}