{"id": "t5_2tand_t3_mw6x8f_t1_gvhgyuj", "creation": 1619122169, "origin": "t5_2tand_t3_mw6x8f", "height": 1, "replied_to": "t5_2tand_t3_mw6x8f", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "orihihc", "text": "Been there -- got through med school with severe depression. My tricks included:\n\n\\-caffeine (but not too much because if you get to the \"jittery\" stage you'll be too hyped up to focus)\n\n\\-bribing myself with chocolate (like, 15 minutes of studying = 10 M&Ms or whatever)\n\n\\-putting intense music on with noise-cancelling headphones\n\n\\-spending 10 minutes reminding myself that I am smart and capable and can do whatever-it-is (this is a little pathetic but I had a box of papers/exams/whatever that I had done well on, or recommendation letters from professors I respected, or whatever, that I kept to look at when I was feeling stupid and hopeless)\n\n\\-spending 10 minutes thinking about what I want to get from all this studying (for me, it was being a good enough doctor that I could be of use to people)\n\n\\-studying in public (so I wouldn't be tempted to just turn Netflix on or whatever)\n\n\\-studying with other people, either in a study group or just like quietly studying independently together\n\n\\-using a pomodoro method app like [Be Focused](https://apps.apple.com/us/app/be-focused-focus-timer/id973130201) (this actually might be the most important tip; this helped me a lot)\n\n\\-if you get so tired/depressed that your brain stops working but you have to keep studying anyway, try doing a rote task with the information like making flashcards or writing the information over and over again or something \n\n\\-if you're trying to understand a difficult concept and aren't \"getting it,\" switch up your method -- try to find a video or podcast about it\n\nThat's all I can think of for now; I'll post another comment if anything else occurs to me. Good luck, friend.", "permalink": "/r/DecidingToBeBetter/comments/mw6x8f/i_have_to_study_but_im_too_sad/gvhgyuj/"}