{"id": "t5_2qh5i_t3_q2tli1_t1_hfptwgz", "creation": 1633606829, "origin": "t5_2qh5i_t3_q2tli1", "height": 1, "replied_to": "t5_2qh5i_t3_q2tli1", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Commercial_Bend9203", "text": "That’s why it has to be related exclusively to the child and their well-being. It helps if you have a working definition for “unfit” according to your state, that takes a ton of time and research to uncover but you can make a few critical assumptions towards this meaning: \n\n-if a parent consistently harms a child physically (not just spanking, it must be excessive in some states) then write that down\n\n-if a parent is consistently abusing a child mentally (not just the occasional grounding for poor behavior, it has to be excessive) then write it down\n\n-if a parent is emotionally abusive (not just the rare outburst, after all we’re all still human and prone to such behaviors) then write that down\n\n-if a parent is sexually abusing a child then immediately find a way to vacate the child from the home; you can bet you’ll document that with pictures and a thorough doctors examination\n\n-if a parent is abusing drugs of any kind, that is a strong argument that they’re unfit so write it down\n\nYou can make an argument, really, that any behavior can make a parent unfit but I’ve been told that your best bet is the above as well as to use a mixture of common sense/objectivity. You almost have to think like a judge for all of this, emotional items (unless from the child) won’t go far so you gotta stick to cold, hard facts. \n\nThere is the other issue, however, that both parents might be “fit” to raise the child. In that instance, as difficult as it is to admit, you gotta bite back your pride and just work it out the best you can with the other parent. You may not like your ex but, hell, it can be a LOT worse in the end… trust me.", "permalink": "/r/happy/comments/q2tli1/i_got_full_custody_of_my_son_seven_years_ago_and/hfptwgz/"}