{"id": "t5_2tand_t3_q3wuc2", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "\nHey I’m a 22y/o male & I need help with my porn addiction. My girlfriend comes over on the weekends cause during the week we both work so that’s when we have sex. The sex is great I love her in bed so much cause she does all the right things but the only problem is I feel like I’m getting worse in bed cause lately I’ve been watching porn everyday that I’m not with her ever since I moved into my own apartment so now when we have sex I don’t always cum or stay hard for too long. I have to blame it on me being sleepy or me being out of shape cardio wise. One time She said something like “What’s wrong, am I not attractive to you anymore” ?. No we can’t watch porn together cause she feels like it’s weird & doesn’t like me watching it. I used to watch it with my Ex so it was no problem back then but anyway I can’t tell her the reason why I’ve been performing bad lately cus ive been watching so much porn. I had to fake my orgasms with her just so she would think I finally came but I never did. I’m scared this is going to become a even worse issue cause sometimes while we’re together I think about her leaving so I can watch porn & I hate it. PLEASE help anyway you can! Should I tell her & maybe she can help or should I keep it to myself and just try to do better? I don’t want to get comfortable with porn to the point that head/pussy no longer excites me", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q3wuc2/please_how_to_do_better_with_porn_addiction_help/", "title": "PLEASE how to do better with porn addiction!! Help me !", "social_network": "reddit", "user": "Yellow_Is_Bluee", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1633696522, "permalink": "/r/DecidingToBeBetter/comments/q3wuc2/please_how_to_do_better_with_porn_addiction_help/", "nsfw": false, "first_save": 1635435983.2406251, "replies_charged": false}