{"id": "t5_2tand_t3_lw2ftp", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "A year ago I was 24, living at home, had $200 in savings, working part time and trying to finish my associates degree. I was drinking heavily, about 1-2 bottles of wine a night but the definition of a functioning alcoholic. I’ve struggled with pretty severe GAD for years, and drinking was the only thing that helped for a long time, too long. People who knew me knew I loved to drink but no one knew how bad it was. I started dating someone in October of 2019 who realized how unhealthy my lifestyle was and, gently but firmly, helped me see it for myself. \n\nI’m now about to be 26. I graduated last august, my SO and I moved into our first apartment together in October and I started a new, better paying job the same week we moved, and I actually enjoy going to work now, working for a small family owned business that has thankfully survived the pandemic and has plans for expansion and growth in the near future. \n\nI have maybe 1-2 drinks per week, sometimes none at all, and when I do it’s usually after close at work with one of my bosses (I’m a bartender, so shift drinks are pretty normal but about half the time I turn it down just because I actually enjoy not drinking, which is crazy to me thinking about how I used to not be able to sleep without 4-5 drinks in me). I go to the gym twice a week, I want to go more but it’s better than not going at all.\n\nThis morning, I hit $10k in my savings account. Seeing that number made me realize how much has changed in the last year, and how thankful I am to be where I am now. \n\nI’ve lurked here for a while, drawing inspiration from other posts that I felt I could relate to, and cheering people on but I don’t comment/post much, usually a browser. Just wanted to share my progress, and if anyone feels like they can relate to the way I used to be and wants to talk, I’m here and will do my best to be a listening ear even though I am still very much a work in progress myself.\n\nStay safe and healthy everyone ❤️ thank you for reading this and letting me share my progress.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lw2ftp/ive_done_a_180_and_didnt_even_realize_how_bad_a/", "title": "I’ve done a 180, and didn’t even realize how bad a way I was in until I got to the other side.", "social_network": "reddit", "user": "ReginaFilange21", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1218, "down_vote": 0, "creation": 1614693230, "permalink": "/r/DecidingToBeBetter/comments/lw2ftp/ive_done_a_180_and_didnt_even_realize_how_bad_a/", "nsfw": false, "first_save": 1635435860.4520783, "replies_charged": false}