{"id": "t5_2tand_t3_ncp91j", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "In my head I feel like I’m slightly above average in my intelligence. I took multiple IQ tests (for what they’re worth) in the past and scored above average which proved my abilities. \n\nThe problem is people close to me wouldn’t describe me as smart. They would choose knowledgeable aka a walking encyclopedia. Sometimes I fish for comments (so low of me) to validate it. It hurts. \n\nWhy do I care about looking smart? We live in a superficial world. For the better part of my life people would think of me smart, because I was shy and wore glasses. \n\nMy biggest problem is that when I converse with others I overshare, go on tangents, stutter and jumble my words. It’s the biggest reason why I’m not perceived as intelligent. I even recorded myself and cringed at how stupid I sounded. I’ve been more aware of my behaviors, started meditating and journaling. \n\nIt doesn’t help that I purposely act stupid or say things to get a reaction from others. It’s some sick twisted shit. Even in public, I pretend to be naive so people don’t get to really know I am. It’s all very perverted and sick.\n\n\nI talk to various people online. We have long chats. Often times they call me smart. I feel like maybe I express myself better through text or it’s easy to misjudge me. \n\nI would love to be an eloquent speaker with a warm calm demeanor. Maybe I should shut up and do something about. Sorry, for being too negative. I’m laying it out as how it is. \n\nWhat are your thoughts?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ncp91j/i_feel_stupid/", "title": "I feel stupid...", "social_network": "reddit", "user": "Rich_Ad_788", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 30, "down_vote": 0, "creation": 1621046999, "permalink": "/r/DecidingToBeBetter/comments/ncp91j/i_feel_stupid/", "nsfw": false, "first_save": 1635435792.6735017, "replies_charged": false}