{"id": "t5_2tand_t3_jz1q69", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I'm a 17 year old girl and I've just shaved my head last night. My boyfriend is taking a sociology class and I frequently sit in on his lectures. This has lead me to question practically every societal norm and especially what gender really is and how it applies to me. Not only that but in a world that actually thrives off of our insecurities to sell beauty, I wanted (and needed) to put myself in a vulnerable position so that I could grow. \n\nI've been unsatisfied with my hair for as long as I can remember. I was always bleaching, dying and cutting it to fit who I thought I was. Whenever I'm alone or with my close friends and family, I always have it tied back into a slick bun. Why was I keeping this hair if I hated it so much? To look beautiful to people who weren't worth impressing? \n\nWhile I was in the process of shaving, I couldn't stop thinking about what other people would think of me. How would they react? More importantly, how would I react towards their negative opinions? \n\nThe whole point of all of this was to do something for myself. I forgot to mention it earlier but I love my buzz cut. \n\nNow, when I'm alone in my room I feel so confident, so happy, so free. As soon as I'm around others I'm thrown into crippling anxiety. \nI genuinely think this might be the hardest thing I've ever done. I'm really testing myself. I hope I can look back on this post one day and be proud that I made things work.\n\nThe best piece of advice I've ever been offered is two words: \"Trust yourself\" and I'll just have to keep doing that.\n\n- \n\nEdit: The amount of love on this post is overwhelming. I've loved reading all of your stories and suggestions. I knew I was on the right track but the support I've received has just confirmed it. I wanted to let you all know that my boyfriend absolutely adores the new cut and he will also be shaving his head with me. Much love to you all!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jz1q69/i_shaved_my_head_and_now_im_struggling_with_my/", "title": "I shaved my head and now I'm struggling with my confidence", "social_network": "reddit", "user": "eggkubo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1888, "down_vote": 0, "creation": 1606073346, "permalink": "/r/DecidingToBeBetter/comments/jz1q69/i_shaved_my_head_and_now_im_struggling_with_my/", "nsfw": false, "first_save": 1635435398.123981, "replies_charged": false}