{"id": "t5_2tand_t3_bwkf55", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "After completing my bachelors degree in philosophy, I've found that there are endless benefits that this sub might find interesting. While this isn't a comprehensive list of all of the benefits philosophy can offer, it's a few things that I've personally been positively influenced by:\n\n&#x200B;\n\n**- No purpose?** Read existentialist philosophy, which is a common entry point for philosophy. Very different from nihlism (the idea that life has no meaning). Sure, existentialism brings up a few grim realisations about the nature of purpose, but it often has optimistic suggestions on how to find purpose. For example, read Nietzsche's book *Thus Spoke Zarathustra,* where he brings up the three metamorphoses and outlines how to find purpose and progress to a child-like state of constant joy and creation. \n\n**- Going through tough times, want to reduce procrastination or want to sharpen your mind for peak performance?** Read stoic philosophy (such as Seneca or Marcus Aurelius). The philosophical element of stoicism stresses the importance of being virtuous and rational. Reading stoic philosophy, by extension, often touches on the psychological discipline of how to regulate emotions and take action toward the things we know we should.\n\n**- Stressed? Fed up with consumer culture?** Read epicurean philosophy (such as Epicurus or Lucretius). Epicureanism can help you to reprioritise your goals to reduce your \"vain and empty\" desires and focus on a core set of desires that, in principle, are more likely to secure your happiness. The idea underlying this is that happiness is extremely elusive when you desire goals, or a state, that you are not currently in.\n\n**- Want to flourish, or self-actualise?** Read Aristotle (his book *Nicomachean Ethics* is great). He laid out the building blocks for virtue ethics, which focuses on how to be more virtuous and consistently make decisions that improve your own life, as well as the lives of those around you.\n\n**- Want a brain upgrade?** Read philosophy generally. This one's a bit hit & miss but general study of philosophy upgrades your capacity for rationality & anecdotally I just find myself believing a lot less stupid shit. The beliefs you hold after getting your head around the principles of solid argumentative structure tend to be much more justified. The area of philosophy that most relates to this is called epistemology.\n\n&#x200B;\n\nA lot of the posts on this sub bring to mind a particular philosophy that could be applied to help someone with the problem they're bringing up. Hopefully this list helps some of you!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bwkf55/how_philosophy_makes_me_better/", "title": "How philosophy makes me better", "social_network": "reddit", "user": "will___t", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1559621538, "permalink": "/r/DecidingToBeBetter/comments/bwkf55/how_philosophy_makes_me_better/", "nsfw": false, "first_save": 1635436552.1832137, "replies_charged": false}