{"id": "t5_2tand_t3_got0cy", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I've just moved back in with my parents for several reasons and my dad needs a lot of help with his business and his life.  He's been my mom's primary caretaker for over ten years and as a result has completely neglected his own development and growth in favor of simply keeping the house afloat, since he's the caretaker and sole breadwinner (which he hasn't been able to do with too much success and is generally in a struggle). \n\nI'm kind of a self-improvement nut and I see so many problems that need fixing, but of course I cannot fix them for him. He lacks focus and discipline, self-control, and is utterly scatterbrained, distracted, and unaware of most of his failings. He's a smart man, he just had to kind of abandon his inner life and not pay attention to it just in order to survive. \n\nWe talk often and we uncover lots of his issues and reasons why he cannot get ahead, and I encourage him to exercise, eat better, meditate, journal, exercise introspection, read useful material, listen to informational videos and podcasts, etc, etc, but if I'm not present right there with him pushing he pretty much does none of it. He works from home and his lack of structure is a killer on top of that so he does not thrive in the WFH sphere but he has to WFH in order to be available for my mom.\n\nIn any case...one of the things that I am trying to help him with is to develop a habit of reading helpful material that will encourage his growth and introspection and self-awareness, and help shift his perspectives and paradigms. The problem is I have no idea where to start in terms of recommendations for him. I've started him off with \"The Courage to be Disliked\" because it's a book that has been heavily recommended and that's been on my personal reading list and that I hope to read after he's done with it. He and I (like father like daughter) have a lot of the same issues so I figured it'd be a great start for him (since a lot of our issues come from seeking external validation and lack of true self-confidence). But once he's done with it I have no idea where to steer him next. Productivity? Philosophy? Something more practical? Some allegorical tale or inspiring biography? I have a five-foot-long reading list for myself but I'm not sure that what I'm interested in and what is helpful for me will necessarily be good for him, and we're also on drastically different stages in our journeys and need different things at this juncture despite being uncannily similar. On top of it all, the book needs to have a translation available in Spanish otherwise it'll be too much of an obstacle for him to pick it up and read it, and is much less likely to stick. He speaks English, but it's still a struggle and it would just all be easier if the book can be found in Spanish.\n\n  \nTL;DR: what books might you recommend that I could pass on to my 50yr old father who is a smart and capable guy but has completely neglected his self-development for the past fifteen years (and is now kind of a scatterbrain) and that I could find a translation of in Spanish?\n\nThank you all!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/got0cy/book_recommendations_for_my_50yr_old_dad_whos/", "title": "Book recommendations for my 50yr old dad who's completely neglected his self-improvement?", "social_network": "reddit", "user": "puppiesandsunflowers", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1590185557, "permalink": "/r/DecidingToBeBetter/comments/got0cy/book_recommendations_for_my_50yr_old_dad_whos/", "nsfw": false, "first_save": 1635436525.6639671, "replies_charged": false}