{"id": "t5_2tand_t3_mizuy8", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Like a lot of ppl I lost a fat chunk of my weight during Covid. I’m happy and all w how far I’ve come, but I’m not close to my goals lol. \nman this shit not hitting the same anymore. In the beg I was so spot on with everything, would veryyyy rarely find myself binge eating or having “off” days. I would wake up so excited to workout. \nBut now it’s just different.\nSince December my groove has just not been the same. I’m a jobless student sitting on my ass all day at home. I walk when I can and workout 5x a week. I even have some dbs.\nHere in Canada starting tmr another lockdown is descending upon us and I just don’t have the courage anymore on goddd. \nI haven’t touched a gym for the past year and it’s like I don’t even fight myself anymore when it comes to food. It’s like lol fuck it whatever just eat the damn chocolate. And if it was once a week I’d b fine but this happens on the daily lmfao. \n\nPoint is, I lost my spark. I rlly dk wtf I’m gonna do. \nI’m an only child w no company or anything like that either so u can imagine how boring. \nIt’s never been this bad before. I used to have a bad day and then get back on track like it was nothing. \nAnyway, can somebody pls give me advice that will actually help me get out of this long ass stupid ass slump \nPS u might see this on other R/‘s but that’s Bc I’m trynna get as much help as possible so I’m sry in advance if this annoys u", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mizuy8/lost_my_spark_another_lockdown_coming_up_is_not/", "title": "Lost my spark, another lockdown coming up is not helping :/", "social_network": "reddit", "user": "north_bea", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1617418336, "permalink": "/r/DecidingToBeBetter/comments/mizuy8/lost_my_spark_another_lockdown_coming_up_is_not/", "nsfw": false, "first_save": 1635438000.5724628, "replies_charged": false}