{"id": "t5_2tand_t3_cfr4rn", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I just wanted to share my short story and some new techniques/ ideas I will start implementing from now to become a happy person, enjoying life and becoming the best version of myself. \n\nI hope someone finds my ideas useful. Also it's kind of an accountability post for me.\n\nSo looking story short:\nI found myself at the edge of depression some months ago. While offered a simple way out (antidepressants), I decided that it's time I learn to cope with it by myself. I just decided that i was not going to be depressed and followed the rule: no depressing thoughts allowed. And it worked!\n\nAlthough I would not consider myself depressed any longer I still found myself incontinent with life, stressed and full of fear from the thoughts of the upcoming challenges (mainly work related). Today I came onto another great option to solve this and change my life and myself to be better with these steps:\n\n- I decide to stop playing the victim and accept full responsibility for my life\n\n- It is my life, this life is created FOR me and there is no point in living it without feeling happy every second (that I would wabt most of all as of now). To get to this point I will treat my life as a game: a game that lasts 90 years in which I could play many different mini-games like \"building my own business\", \"building a happy family\", \"the money game\" etc Each game has a goal, aspiration or dream in its base. \n\n- My game,  my choice: instead  of thinking \"I am scared\" or \"it's gonna be aweful\" I will say to myself \"I decided to feel scared\" and \"I decided to see this as aweful\"\n\n- I accept that there are only two types of situations in my life/game in any point in time: \n1) pleasant - the times I feel joy and other positive emotions and \n2) situations to analyze, make new decisions and grow. \nAny point in time could only be one or the other, no third option!\n\n- Every situation that is not joyful means that life wants to teach me something,   and to get better. Stressful workday? It's game of how much I can manage, how fast could I go. I will try my best to win. Made a mistake and flunked a project? Lost a mini game, make conclusion and move on. Try again if I like the game/ these types of projects. \n\nTLDR By following two main ideas:\n- Life is just a game &\n- It's either just fun or educational ( I have to figure out what is it trying to teach me),\nI will become a happy and successful person.\n\n\nFor accountability I will start a diary of my \"lessons\" from this game. \n\nIf anyone feels they too want to become content with life and are willing to implement these ideas, send me a PM. I would love for an accountability partner. \n-", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cfr4rn/becoming_a_happy_and_successful_person/", "title": "Becoming a happy and successful person", "social_network": "reddit", "user": "flowerunderthesky", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1563658086, "permalink": "/r/DecidingToBeBetter/comments/cfr4rn/becoming_a_happy_and_successful_person/", "nsfw": false, "first_save": 1635437712.4859443, "replies_charged": false}