{"id": "t5_2tand_t3_pdnt8j", "request": ["b69cf201-6737-4217-b486-9096135546b8", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": " \n\nI (27f) use my boyfriends (33m) car to get around since I am not confident yet riding my motorcycle in a bigger city (we just moved to his homecity of California from the midwest). I have a lot of trauma around cars due to my childhood but have been trying to be more independent and have done therapy to work on car trauma and abuse related traumas.\n\nMy boyfriend and I are already tense since we fought a lot because I didn't know how to help as much during the move and unintentionally took him for granted. He is already mad and I've been proving myself as responsible to him. I've seen facebook posts from friends and realized I have a lot of toxic habits I didn't realize I did like love bombing, emotional blackmail, and guilt tripping unintentionally.  \nI didn't realize that I was emotionally abusive til I saw that facebook post and still need to confront him on that so I can apologize. We are in a tiny apartment for now and have a homeless friend crashing with us. We are all squeezed into a tense fit. Studios suck. We move soon to a bigger place though just the two of us despite the tension and I'll just stay in the guest room in a bigger place til shit works itself out.\n\nWhile driving my friend to the 99c store I got into a fender bender. There is barely any damage, but I feel this is just one more thing to add to the pile of what makes me a failure. I keep messing up and now I got into a minor accident that was my fault. The front of his car fine except for the plate which is sort of coming off now. I barely scraped the back of this one older dudes car. He was nice and told me not to panic. We aren't involving insurance and I will pay him all that I can.\n\nWell things have been tense anyways and my boyfriend went to a sports game to relax so he doesn't know yet. I came home to the place being empty. I'm sitting at home while my homeless friend begs. I'm sitting here panicking. I want him to enjoy the game since life has been hard. He deserves rest and fun after dealing with his family, moving, and me annoying him for help on every little thing I can't figure out alone. I'm waiting to tell him and am hoping he reacts well to the fender bender because I hate myself.\n\nI have been miserable when moving to California to be near his family/friends was supposed to be our new beginning away from traumas we faced in our midwest college town. I've tried forcing myself to be happy by walking around and enjoying the sun but then I yearn for cuddles when I'm home and realize I'd have to violate his consent to get them so I lie there alone while he is miserable and trying his best to be supportive while still feeling hurt by me too. I try not to pout or guilttrip about it so I will often go cry in the shower. I just feel so helpless and also feel bad for complaining when my homeless pal has it worse and my ptsd has at least been helped by moving here so I shouldn't complain. Especially since if he broke up he still wants to be friends and make sure I have support in the city, I just want to marry him one day....so I don't think that is good enough.\n\nHow is the best way to properly improve and not be so terrible? I'm trying to be better about being needy emotionally and finding less codependent ways to handle my emotional need and trauma. How can I handle my guilt without putting it on him or make it seem like I'm guilting him for things I did wrong. Should I hide emotions entirely so as not to guilt him when I fuck up? I already try to fix things in a practical sense when I fuck up but I have no idea emotionally what to do or how to handle all my pain and guilt without putting it on him?\n\n I can give more details below.  This is just what happened today and my mind is racing", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pdnt8j/please_help_me_be_a_better_partner_and_adult/", "title": "Please help me be a better partner and adult", "social_network": "reddit", "user": "ReadIt2MeAgain", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1630207414, "permalink": "/r/DecidingToBeBetter/comments/pdnt8j/please_help_me_be_a_better_partner_and_adult/", "nsfw": false, "first_save": 1635436452.9572692, "replies_charged": false}