{"id": "t5_2tand_t3_mcy85t", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I am 7 months pregnant and usually always keep up with my toenails. It’s just something I like to do. Makes me feel good when I go to put socks on and my toes sparkle. \n\nThe other night my husband offered to paint them for me, he’s a lovely man, and I’m a lucky woman to have such a supportive partner. As he was painting, we looked over and the bottle had spilled and pooled on our couch cushion (whoops). We looked at each other, looked at the mess, and then we started laughing! He quickly ran to the kitchen, got some supplies (paper towels and polish remover) and cleaned it up. It’s barely noticeable. \n\nI can’t stop thinking about it. Growing up, when accidents like that happened, which is inevitable with children, my parents would scream, yell, cuss. They would scream at each other and argue about whose fault it was. They would yell at us and call us idiots or fuck ups, any number of nasty things.\n\nI don’t have to live like that. I don’t live like that. My husband and I break things or mess them up, and we pause and fix it. It’s so different to how I grew up and I am just so happy to know that’s how we handle tough situations. My children have the chance to grow up very differently. \n\nI actually really struggle with anger and reacting in the moment, so I’ve been fighting tooth and nail to leave those urges to scream/yell behind and handle situations in a much healthier manner.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mcy85t/husband_spilled_nail_polish_all_over_our/", "title": "Husband spilled nail polish all over our relatively new, expensive couch", "social_network": "reddit", "user": "GirlGotYourGoat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3504, "down_vote": 0, "creation": 1616678895, "permalink": "/r/DecidingToBeBetter/comments/mcy85t/husband_spilled_nail_polish_all_over_our/", "nsfw": false, "first_save": 1635435771.9809005, "replies_charged": false}