{"id": "t5_2tand_t3_p4vjws", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "I know it sounds so pathetic...but it is so so true! I am 42 and literally have no friends that text or want to hang out etc. I am married and it is a lot for that to be your only outlet. You need other people. A little about me well one I have never posted on here or even know how to use this app...yet, two, I am a person with a colorful past like most of us. My \"friends\" used loosely here, were people I used drugs with and when I stopped using in 2004 and got married and we got his children from dfacs and he got custody I became an instant mom of 2. I focused solely on their well being they had a lot of trauma resulting in sever behavior problems requiring me to stay home full time. Lots of psychological appointments and trips to the school for issues several times a week. Then when they got home trying to do homework and feed them with some sense of normalcy with their oppositional behavior. This isolated me even further than I felt in recovery and walking away from all the people I used with because other moms weren't dealing with what I was and our conversations didn't line up. I really became depressed and felt so stuck. They got older and we moved to a bigger city...I was in school when they first came and I stopped after seeing how much of my time they needed. So I returned to school, I got on with most people but at that time I was often the oldest person in the room and though we laughed and would go to lunch they all were in very different places in their lives. Went to church met some great people, but I wanted people I could really talk to and this particular group EVERYTHING was wrapped around religion, I'm a legalistic way...if that makes sense. Everything was the devil...just was too much for me. Kids are grown and out the house now...I took some very demanding jobs working in mental health and lastly as the director of an addiction center...the stress I was under and not practicing self care took a huge toll. I met people at work but didn't really hang out, I was so spent from work and the stress I came home and just vegged out (dissociated really) Watchung tik tok or Netflix. I stepped away from that job in June to focus on my health and well being, and slowly I am trying to learn to take care of me. I started painting and trying to remember who the hell I was before. And I am seeing I am so so lonely! And trying to find people who don't want to spend their weekends drinking to excess or just sitting around is hard. I really want someone where the relationship is mutual and they text me and we hang out. It is effecting me so much. I read some articles that said this isn't that uncommon. But I don't want to be this person 😔 I am at home now because of Covid and not wanting to go out too much so this doesn't help as far as looking for people. And I like travel, theater, cultural or just unique expierences, food, art in all forms...I am no painter I go to the local painting place where they show you step by step...anyway such a ramble and I don't know who or if anyone will ever see this or take the time to read it. But if you made it this far Thanks 😊", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p4vjws/42_and_no_friends/", "title": "42 and no friends", "social_network": "reddit", "user": "Simplistic_Fantasia", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 20, "down_vote": 0, "creation": 1629041290, "permalink": "/r/DecidingToBeBetter/comments/p4vjws/42_and_no_friends/", "nsfw": false, "first_save": 1635438428.516303, "replies_charged": false}