{"id": "t5_2tand_t3_p4vgbg", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "About a year ago, I was at a very low and confusing point of my life. The pandemic began and with the time off from school (I was 17 then, 18 now), I went through some tough but good changes. I started cleaning up my diet, exercising, laying off games/youtube so much,nofap,cold shower ,meditate.Yanno, all the good stuff. I did this for about 4 months and I used to study about 5 hours a day, aside from online school and I was very content and satisfied with my life, it felt like the peak honestly because I was previously unhappy with my grades/work ethic. Not sure if it was burnout or what but yeah eventually it all came crashing down, I got very suicidal over the fact I couldn't study more than 2 hours a day or took hot showers instead of cold ones. This lasted about 3 months of internal turmoil but I still managed to keep some semblance of a routine. I did exams recently and now I'm on break and honestly I'm not sure what to do anymore. I consumed a lot of hustle/discipline content so I wanted to suffer. I didn't feel right if life was comfortable. I don't know if I was even truly happy during the 'peak' but I felt better than everyone else; it calmed my anxieties and added fuel to my furnace. Here I sit now at 18, 2 weeks into my (late due to exams being pushed back) summer break and I've never felt this bleak before. My identity and satisfaction came from this iron discipline mentality I had; the ability to take on suffrage and reach to the top. It's not like I lost everything because I still have decent study habits,mindfulness and my diet isn't terrible. Rapid growth from where I was from felt like a drug. I used to wake up at 4am hungry to do more and improve. I can't even call myself a shadow of that version of me right now. Back at the bottom here I realise, maybe I can get back to where I was easily but when I peel away all those things about myself.... I'm just unhappy. It's hard to appreciate the things in my life right now, and that's a very strange thing for me. I'm struggling with the anxiety like if I did this to myself, or if I'm lazy and I can fix myself but I just don't want it enough. With 2 weeks of break remaining, I want to recharge, rejuvenate and plan for the future but all the gears in my head are turning against eachother. Apologies about the wall of text, I'm on mobile. I'd genuinely appreciate any advice or insight for this rough patch I'm going through.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p4vgbg/i_want_to_learn_to_be_content_aside_from_external/", "title": "I want to learn to be content aside from external conditions I set on myself.", "social_network": "reddit", "user": "dreameater9", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1629040961, "permalink": "/r/DecidingToBeBetter/comments/p4vgbg/i_want_to_learn_to_be_content_aside_from_external/", "nsfw": false, "first_save": 1635435789.2886152, "replies_charged": false}