{"id": "t5_2tand_t3_ob4xja", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "If there is only one thing I could teach to my younger self, it would probably be the 80/20 principle, which states that states that for many outcomes, roughly 80% of consequences come from 20% of the causes. The reason the 80/20 rule is so important is because time is our most valuable resource. The best way to take advantage of our precious time is to focus most of our attention on the few things that will make the biggest difference in our lives.\n\nEvery day, we wake up and we have thousands of choices. If we do not understand the 80/20 principle, then we are bound to waste our time, make bad decisions, and focus on the things that don’t matter. I’m currently 21 years old, and I’m choosing to put my time and energy towards the following things:  \n\n* Being as healthy as I can be.\n* Cultivating good friendships and relationships.\n* Learning as much as I can during my youth.\n* Building a successful and meaningful career that will lead to financial freedom.\n\nUsing the 80/20 principle, each of these 4 facets can further be broken down into smaller pieces. For example, “being as healthy as I can be” can be broken down into these core elements:\n\n* Exercising daily.\n* Having good sleep hygiene.\n* Eating healthy well-balanced meals and drinking sufficient water.\n* Having a good social support system\n\nObviously, there is lot more to life and to being healthy, but for the sake of this article, I want to keep things short and concise. Going back to my example, once I have these core elements, I can break things down even further. For example, “exercising daily” can be broken down into the following components:\n\n* Weightlifting three times per week.\n* Walking 10k steps per day.\n* Playing tennis on the weekends.\n\nThe example above is just one illustration of how the 80/20 principle might work in practice. Another way I use this principle is when I need to decide what tasks to accomplish during the day. I usually break my daily tasks down by what’s important and by what’s urgent.\n\nFor example, when I woke up this morning, I knew that my most important task of the day was to write this article. The reason this task was so important is because one of the things I want to do in my life is be a writer. I want to publish my own book in the next few years, and I know that in order for me to get there, I need to first practice and build an audience through my blog, through reddit, and through my social media. One of the reasons I love writing is because I want to help as many people as I can.\n\nThe examples above demonstrate why it’s important not only to use the 80/20 rule on big picture things, like what you want to do with your life, but also on the small picture stuff, like how you can break down your goals into daily actions and habits.  \n\nSelf-awareness is important. You need to decide what you want in life, and then you need to figure out how to use your energy in a way that is effective and efficient. Being burned out and feeling overwhelmed is no fun. Let’s all use the 80/20 principle to the best of our abilities so that we can live lives of focus, of contentment and of incremental improvement.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ob4xja/the_8020_principle/", "title": "The 80/20 Principle", "social_network": "reddit", "user": "RossWriter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 27, "down_vote": 0, "creation": 1625082274, "permalink": "/r/DecidingToBeBetter/comments/ob4xja/the_8020_principle/", "nsfw": false, "first_save": 1635435142.4274578, "replies_charged": false}