{"id": "t5_2tand_t3_ongj5r", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "For my entire adult life (yay I'm almost 30), I've struggled so much with having a good image of myself in my mind. I hated my behavior at times, I hated being consumed by depression often, I hated that I was a constant failure in every aspect of my life, I hated being paranoid and afraid of what people thought of me. At times, I hated the way I looked too. All of this has made my social connections extremely difficult to maintain.\n\nMy best friend, who's been by my side for nearly a decade now, never stopped believing in me and reassuring me that I'm a better person than I realize. And I've done the same for him. Almost two years ago, we decided to date, and it's been a truly soul-bonding type of relationship where we couldn't be happier. However.. now we're struggling as we've begun facing our individual flaws, insecurities, and traumas. It's begun to strain the relationship.\n\nWith his advice (and his own decision to focus on improving himself) and spending lots of time thinking and going through therapy.. I've decided to do better for myself. I've decided to face my fears, my insecurities, my trust issues. I've decided to learn to love myself, appreciate myself, and truly pursue the passions that light a fire in my soul and bring me sheer joy. I need to discover my independence again and live true to myself.\n\nThanks for reading, and I wish you all well in your journeys too.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ongj5r/deciding_to_love_myself_and_everything_about_me/", "title": "Deciding to love myself and everything about me", "social_network": "reddit", "user": "rizusan", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 29, "down_vote": 0, "creation": 1626709118, "permalink": "/r/DecidingToBeBetter/comments/ongj5r/deciding_to_love_myself_and_everything_about_me/", "nsfw": false, "first_save": 1635437300.0728104, "replies_charged": false}