{"id": "t5_2tand_t3_l4pi8n", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "In 2006 I was a (relatively) young and inexperienced CEO. I was sure that my main task is to think strategically. My imagination drew a picture – I am a captain gazing at the night shadows. The 2008 crunch made me sober. It was painful but efficient. \n\nBlaise Pascal, a French mathematician and philosopher, said: “Today you are where your yesterdays’ thoughts have led you”. Our “today” is a consequence of ours’s yesterday. Our current life results from the decisions made some time ago, the choice we made in the past. \n\nBut it also means that our tomorrow will be the result of our today. Therefore, we have to know exactly who we are and where we are going. We need to know where our point A is to make a route to the point B.\n\nSome books and speakers try to persuade us that the goals and persistence in reaching them are the most important parts of success. But let’s imaging an artist who watched motivation videos too much and decided (by mistake) to become a businessman. For instance, he wants to be rich, and business people are typically wealthier than artists. But the more persistent he is, the more unhappiness it brings in his life. Because deep inside he is still an artist, and pursuing a false dream drives him further from his real goal. \n\nA business entity can change its conception, strategy, and mission, but a human being can’t. Every person is a unique combination of the neural links formed in her or his brain many years ago, in childhood. They determine his or her temper, talents, personality. It doesn’t mean that a person can’t evolve and develop within a lifetime. But people always do it in line with their nature. It is fine-tuning, not creating “me 2.0”. \n\nTheoretically, it is possible to change it slightly by trying to do something we don’t have inclinations to. An artist can try to behave like a business person, but why? Happiness is not about money; it is about harmony between what one wants and what one does. It much better to develop one’s strengths than to fight with one’s weaknesses. \n\nStrategic thinking starts with embracing our original selves. We have to learn ourselves and accept that our life is a result of our past decisions. We need to find a point A. In the next posts I will suggest a couple of tools for how to do it. Stay tuned!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l4pi8n/a_strategy_is_not_just_the_goals/", "title": "A strategy is not just the goals.", "social_network": "reddit", "user": "sbiryulin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1611586850, "permalink": "/r/DecidingToBeBetter/comments/l4pi8n/a_strategy_is_not_just_the_goals/", "nsfw": false, "first_save": 1635437128.5984292, "replies_charged": false}