{"id": "t5_2tand_t3_mufqse", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "I have been on and off for years about changing my life and deciding to be better. I’ve decided to be better a long time, but I only talked the talk. This is what happened and now it’s time to walk. \n\nI see a doctor for my blood pressure and anxiety. I was at my Doctor and she said for the last year that my liver enzymes were high and they need to find out what it is causing it. \n\nI did a lot of blood work. \nI got an ultrasound. \nI got a Ct scan. \n\nAll the years of abuse and living wrong I put on my liver I though for sure with all I did that I was going to be told my liver is failing or some sort of disease. \n\nI went to see a specialist like requested. This was all in the last two weeks or so. \n\nFinally I found out today as I got my cat scan Friday that I don’t have anything seriously wrong with me.  \n\nI have been given so many chances and if I don’t take this chance right here to change my life. Eat better, work out, stay sober, become more active and just be the best person I can be then I know it will be something serious next time! \n\nI caught the blessing of a lifetime. I literally thought I was dying. I thought to myself please if I have one more chance I will make things right. I thought about all the things I will do and now I’m going to do them. This is not just going to be something I’m doing to do. This is going to be an amazing journey and I’m going to get guidance from it from you guys and eventually I’ll be the one guiding. \n\nI have one more chance. I am healthy right now. \n\nIf anyone is healthy and trying to think about changing and not doing just remember you can be one phone call or one problem away from your whole life changing. \n\nThank God for all this. It was seriously Devine intervention I believe. Thanks to all you guys and thank you to anyone who ever believed in me. \n\nIt’s my turn to change and let this be my last lesson / scare. This time I won’t be asking where to start because I’m just going to start. Be well everyone. We can all do it if we’re not already!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mufqse/i_believe_i_was_just_given_my_last_chance/", "title": "I believe I was just given my last chance.", "social_network": "reddit", "user": "Zombiefood40", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 31, "down_vote": 0, "creation": 1618882550, "permalink": "/r/DecidingToBeBetter/comments/mufqse/i_believe_i_was_just_given_my_last_chance/", "nsfw": false, "first_save": 1635435560.7303224, "replies_charged": false}