{"id": "t5_2tand_t3_nkuqtj", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I've (26/M) had treatment resistant depression for about 5 years. This coupled with Severe Anxiety and OCD has made my life extremely difficult. Plus, recently I got the news that I might have Multiple Sclerosis\n\nI made the effort to move to another city to get better medical treatment, I'm living alone.  \n\n\n**I do NOT live in the US. I live in a developing country.**  \n\n\nI'll start of with the things that I *am* doing.  \n\n\n1. I'm in treatment with a myriad of medication. Progress is slow. But I am very diligent with it.\n2. I'm going every week to therapy/psychiatric evaluation\n3. I'm in process to be admitted as a patient in a Neurological Institute to determine if I do have MS or not.\n4. I'm keeping my apartment clean\n5. I'm trying to maintain a hopeful view of the future\n6. I'm keeping up with my hygiene as best as I can.\n7. I'm eating relatively healthy for the most part and drinking plenty of water. (I've dropped 15 kilos, woo!)\n8. I have an amazing emotional support system that consists of my mom, my girlfriend and my bestfriend.\n9. I keep my time occupied with hobbies such as Video Games, Books, Movies, Series, basically media. Mostly uplifting\n10. On occasions, I write. Whether it be letters to my gf or just something for me. But this is difficult since it tires me out quickly.\n\n&#x200B;\n\nNow, things that I'm *not* doing and the reasons why:\n\n&#x200B;\n\n1. I don't work due to the fact that I don't have constant motivation. And also due to fatigue and overwhelming intrusive thoughts that provoke panic attacks.\n2.  I don't study for the same reasons as stated before\n3. I don't exercise dude to the same reasons\n   1. This can have a possible exception. I can swim. I love swimming and have the motivation to do it, unfortunately pools are closed here due to COVID\n4. I don't do many social or productive things because I lack consistency as stated before, and because of COVID\n\nWhat won't I do/can't do/not interested in doing:\n\n&#x200B;\n\n1. Weed or any type of drug. This is due to the fact that I'm alone and don't want to risk having a bad trip or something go wrong.\n2. Anything not supported by science.\n3. I reserve the right to determine if something is going to be actually useful, but I'm keeping an open mind.\n4. Move. I don't have the resources and with COVID it's even harder.\n\nPossible questions you might have:\n\n1. If you don't work, how are you sustaining yourself? \n   1. I have the fortune to have a very good support structure, the funds come from my mom, my bestfriend and sometimes my girlfriend. It's not a situation I like, I would like to be self-sufficient, but I needed help and they agreed.\n2. Is your mental disability so bad that you really can't do these things? Have you tried?\n   1. I have tried many things many times for last few years. Exercise (Swimming worked, but alas), I've gone to three different schools to try and finish a degree, couldn't keep up. Meditation, psychology, medication, homeopathy (Lol what a bunch of crap), I've tried to start working again multiple times, I couldn't keep up or would have severe panic attacks.\n3. What resources do you have? \n   1. This is kind of a difficult question. I live in a developing country, no free healthcare, I live alone. But I am not giving up. I'm still fighting. I have loved ones that will help me with pretty much anything within their power. Unfortunately, I have no one close to me, everything is over the phone. And also funds are pretty tight, but I'm good with money. I make it last.\n4. So no one in your support system is there with you?\n   1. That's correct. My mom is in another part of the country, my friend is in another country and I'm in a long distance relationship  \n\n\nThank you in advance for reading. Please if you have any advice, I want to receive it", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nkuqtj/am_i_doing_everything_i_can_or_could_i_be_doing/", "title": "Am I doing everything I can or could I be doing something better?", "social_network": "reddit", "user": "Simmering_Beagle", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1621962504, "permalink": "/r/DecidingToBeBetter/comments/nkuqtj/am_i_doing_everything_i_can_or_could_i_be_doing/", "nsfw": false, "first_save": 1635436624.0436878, "replies_charged": false}