{"id": "t5_2tand_t3_qfd7oj", "request": ["f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "(Sorry for the awful writing, I've had way too much rum...)\n\nI'm 21 years old, male, and have been dating this girl I really like for some time now.\n\nTo explain things a bit, I grew up in a rough neighbourhood, and in a difficult household. My father was a very insecure man, and he'd usually explode every time you did something that hurt his ego; my mother, for example, usually laughed at jokes answering with something akin to \"You dummy!\" (I'm from Argentina, but this translation is close), and that was enough to go into a full-blown crisis, insulting everything and everyone; he drank so much it was common to find him stumbling through the house at night. You had to walk on eggshells. That was the least of my troubles, as I pretty much had to survive 'till 19 years old, when I had the oportunity (Which I took btw), to leave the neighbourhood. I was almost killed twice by some thugs that tried to stab me to death, every day there was a new fight I had to put up with (I've received way too many punches for a 21 years old, man!). When I left, things went downhill quickly, and I ended up living in the streets for a bit, plus, I was a functioning alcoholic at 17, was able to leave it at 20, and seem to be returning now.\n\nAnother thing: I was in part raised by my aunt and uncle, and I loved them like parents, and I'll do 'till I'm dead. They were the only people that provided love, and a sense of safety. Both died before I was 15. My uncle died because of an aneurism, my aunt ended up having a brain tumor, so I had to watch her die slowly.\n\nNow, although I've come a long way, and I'm actually very well educated (I'm a financial analyst, advisor, electronics technician and studying international business), this happened the other day: I was chatting with my gf when I made a simple spelling mistake; my phone changed a few words of what I wrote and ended up a disaster; and while I'm able to laugh this things off, I was having such a good time when this happened (That is, I was in a vulnerable state) that, when I heard her audio laughin a bit at my message, I had this whole disproportionate emotional reaction that sent me into a crisis like the ones my father had. Thank God we were only chatting, and I was sensible enough not to answer and go walk a little. But this kinda reactions are becoming more and more common in me, and I'm afraid I'll go through the same road my father did.\n\n&#x200B;\n\nThis is, of course, not the whole story, but I wanted to make it short. I think I'll go to therapy, I just wanted to rant a bit, and maybe receive some advice from people who've had similar trouble.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qfd7oj/insecurities_and_relationships/", "title": "Insecurities and Relationships", "social_network": "reddit", "user": "UrMtherWthrngAway", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1635155509, "permalink": "/r/DecidingToBeBetter/comments/qfd7oj/insecurities_and_relationships/", "nsfw": false, "first_save": 1635438399.3637362, "replies_charged": false}