{"id": "t5_2tand_t3_a41kv5", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hi, all-- I'm very grateful for this sub. Well, long story short I'm 40 and feel completely directionless and hopeless. I already know that I have to dry out from marijuana (I smoke daily in the evenings. Occasionally I miss a day, but otherwise I'm pretty regular), which I don't want to do because honestly that's the only thing that ups my mood and at least brings me to a level of equanimity about life. But I'm not in denial about its abilities to bring down mood, so that's one step that I can take (I've done it before, and it sucked, but paid off after about a month). \n\nI believe my midlife downturn started around 2.5 years ago, after my 6 yr-old nephew was diagnosed with leukemia. Supporting him through that, and living through the family implosion that the cancer brought about, took so much out of me. He suffered unbelievably. He's 9 now and cancer free, but of course his body and entire life revolves around continued treatments, hospital stays, and coping with new/changing disabilities. About a year after that, I put down my beloved dog. That was terrible, even though I know it was the correct thing to do, it was awful. Awful.\n\nI don't have children, something I'm happy about. I do have a loving partner who is so supportive of me around my struggles, but of course I worry that one day she'll get fed up with my constant doldrums.\n\nI'm in therapy. I have a \"midlife coach,\" I have a little bit of savings and work from home and have a BnB, so I'm able to pay my bills. I do need additional work in order to be financially safe, so I'm looking for a part-time gig that maybe will open me up to new things/people.\n\nAll that said: what is the damn point? Wanting to help people, I went into the fed gov't/nonprofit/political world and was at the height of my career and making very good money, when I realized it's a game that I no longer wanted to be a part of. Cynical is one way to describe it, truth is another. I went to work for a local org instead, and they quickly revealed themselves to also be playing the game, except on the city level. \n\nTL;DR: Has anyone else gone through a midlife crisis/transformation? Any advice? How long will I be stuck in this empty, pointless limbo? I am so lucky and privileged in so many areas of my life, I want to be able to be there more and love that more. But my view of the world and living is so incredibly jaded and scarred by loss and pain. \n\nThank you for any advice or well wishes.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/a41kv5/feeling_beat_down_by_lifemidlife_doldrums/", "title": "Feeling Beat Down by Life/Midlife Doldrums", "social_network": "reddit", "user": "NeatPrune", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1544200925, "permalink": "/r/DecidingToBeBetter/comments/a41kv5/feeling_beat_down_by_lifemidlife_doldrums/", "nsfw": false, "first_save": 1635437864.8954844, "replies_charged": false}