{"id": "t5_2tand_t3_ijrj65", "request": ["5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "hi guys! i’m 19 year old girl! PLEASE READ ALL!! i’m going to try to make this short hopefully i’ll get some advice afterwards!\nsince I was in elementary school I went to 2 different schools to help me with my learning difference. School was really hard for me and I struggled a lot. I went to college and I failed out because my mind set wasn’t in the right place. I didn’t have sold friend group, I got raped, and I had roommate situations. ever since than my mom doesn’t think going back to college is what I should be doing. my mom came from a fortunate family were she didn’t have to work. her dad was a famous restaurant owner and started for the ground up and become very successful. I sadly don’t have a job. i’m so stuck on what everyone else is doing and everyone wants me to do, I haven’t thought about what I want to do. I love creativity and have a vision of art. i’m into hair and make up as well. since I was kid I dreamed of helping others such as being doctor or therapist. my mom on the other hand made me feel like I couldn’t achieve those goals because I don’t have that drive to do so or i’m not good at school. even though I didn’t do good in school. I feel like I would do so much better if I was in good mind set and I liked the major I was in ( my mom choices it) I was interested in real estate and my mom says “ you don’t have the personality think realistically” even though they are realistic things my mom doesn’t think so. I feel like no one doesn’t see that I can be successful. \n\nmy boyfriend is a smart boy. who is really smart although it makes me feel like I can never be as smart of him it still makes me feel bad about myself. he wants a future with me after he gets his doctor degree. I just feel like I have nothing to do with my life. I applied for a job. but I want to do something for my future. I have no idea what’s interesting and what my passion is. I spent my whole lofe feeling like I can’t achieve those things because people would always say “ that’s too hard for you” “ you’ll never be able to do it”. I want to show my family and my boyfriend that I can be successful. but how? my mom disgrees with everything I say and said she won’t pay for school. even though my college was 20 mins away I feel like that if it was further away things would of been better and I could of done better. i’m not stupid i’m just struggling. I want people to be proud of my achievements. I don’t want to be looked at this girl who can’t do anything. but I have no idea where to began. I have no idea what careers would earn good income and be very successful and would suit me with learning difference. I suck at math and is a slower learner. but i’m normal and function normal. no matter what I say my mom has a say. she’s a great mom and everything but she was grown up differently. hair dressing school and community college is a idea but I want to do something big and to make everyone wow. I know there’s something out there but what? I was thinking of maybe starting up my grandpa restaurant again. he was smart and did it with no money and he became a millionaire just by doing that. that restaurant closed in 2010 and he did when I was 3. but my family should of kept it going. my mom doesn’t work btw. but I would love to rebuild that again but how??? I major in hospitality and I feel like I would of done so much better if I was happy and had that help. please I just need ideas or something i’m so stuck. I feel like if I got a tutor and got help to achieve these I do. I just need some help and advice really struggling. I also want to mention my family spent so much money on me for education which i’m grateful for. I just need my family to support me and to believe I can do it becsuse I need that", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ijrj65/i_have_no_idea_what_i_want_to_do_with_my_life/", "title": "I have no idea what I want to do with my life feeling really lost. need Guides PLEASE READ ALL!!!", "social_network": "reddit", "user": "SnooMacaroons1239", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1598848166, "permalink": "/r/DecidingToBeBetter/comments/ijrj65/i_have_no_idea_what_i_want_to_do_with_my_life/", "nsfw": false, "first_save": 1635436735.5229094, "replies_charged": false}