{"id": "t5_2tand_t3_jhriqg", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I have been putting off making this post since a long time. I've never been this vulnerable my whole life and am ashamed to ask for help to friends and family. Finally decided to lay it down in front of total strangers on the internet.\n\nIt seems like I have nothing to complain about. I have a steady job with decent income and cheap housing affords me a decent savings. I'm also fortunate enough to be able to work from home during this pandemic. I am extremely fortunate to have that in my life and am very grateful.\n\n  \nI've observed that I've been spiraling down for the last 4-5 months. Since the beginning of  work from home directive, my consumption of junk across all social media, especially YouTube and Reddit, has increased steeply. I've been slacking off in all aspects of my life. I've stopped taking care of my hygiene, taking showers as infrequently as once a week or less. I haven't cleaned my room for over 2 months. I've constantly been eating loads of junk food and skipping all the meals. I don't remember when I last did any physical activity. It's been ages since I read a book or anything that'd help me grow. I've lost all my motivation to work. If things get even a tiny bit tough, which they often do, I fall back to scrolling nonsense on my phone. I am constantly missing deadlines. On top of that I've developed a crippling addiction to smoking cigarettes (more than a pack a day). It feels like there is no way to climb back up from this pit. Feels like I keep falling and falling with nothing to grab on to.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jhriqg/spiraling_down_need_help_to_get_back_up/", "title": "Spiraling down. Need help to get back up.", "social_network": "reddit", "user": "sattyrox1000", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1603623216, "permalink": "/r/DecidingToBeBetter/comments/jhriqg/spiraling_down_need_help_to_get_back_up/", "nsfw": false, "first_save": 1635436639.1195092, "replies_charged": false}