{"id": "t5_2tand_t3_4eaej8", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "**My Reasons for writing...**\n\nRecently I've been thinking a bit about the idea of humility and what it means to me. Out of curiosity I did some googling on the topic and although I agreed with many of the points people have written about the idea of humility, I didn't really find any articles that really hit home for me. So tonight I wanted to try and clear my thoughts on the subject and share what I'm thinking. I thought it would be beneficial to myself to try and share and cement my thoughts on this topic, so that I may become more certain of the things I am feeling about it, and see what other people thought about it, so that I can see how others also feel about it, so I hope you will read this and share your thoughts and responses to what I have to say.\n\n**What I think Humility is...**\n\nHumility, to me, is a mindset and an emotion. The mindset can trigger the emotion, and in reverse feeling humble may also bring forth the mindset of humility.\n\nLike taking a walk late at night and taking a glimpse into the heavens, you're left with a sense of awe and wonderment towards how gigantic and powerful the universe and life really is. Like seeing yourself for the first time in relationship to all the things outside of our constraints, humility provides us with a satellite view that we often miss. Humility seems like a mindset that lets us see the completely puzzle in reference to our tiny piece. It provides us an \"Aha!\" and then a feeling of \"Oh my...\"\n\nA lot of the articles that I read seem to suggest that our global society is in lack of humility. That we have some how become so narcissistic that we have forgotten the worth of humility but I don't know if I agree with the idea that narcissism is what counters humility. In my opinion it seems like the idea of narcissism itself, by cultural definition, is seen as deplorable act of looking too far into one's importance, but I feel like when one does look very deep into one's own, it is only natural for us to see both sides of the coin, or worth as well as our limits. Perhaps if narcissism is only viewed as the act of looking only at the good or the prettiest parts of ourselves, as Narcissus did in the tale of old, then we may forget to see our blemishes, then it could become a hindrance to seeing our true selves, but I feel like it is, in a way, impossible only to see the good when our minds are so inclined to seeing all sides of systems to create order, as many minds are want to do.\n\n**The Benefits of Humility...**\n\nI do, however, think humility does have many benefits.\n\nA lot of the articles talked about the powers of humility in reference to the rest of society, and how humility can be waged in a way to benefit living in the often times self-aggrandizing reality that many of the authors painted, but I believe that, for myself, I will focus more on how humility benefits us within our own systems of self reflection and self study.\n\nThe most interesting benefit that I have considered is the idea that humility can, infact, empower us in our journeys in life and often times humility can also let us reflect upon our short comings in a different way from the often times guilty and self hating conscious. A different way to see some of the facets within ourselves that we sometimes mistakenly think of as \"bad\". I think that the mindset of humility allows for us to benefit from the mindset of self-acceptance which often comes by balance of seeing both the parts we love as well as hate within ourselves. In short, the mindset of humility can help us look at ourselves in a different light from our other views.\n\nAnother benefit of humility, I think, comes from the idea that realizing our powerlessness in certain aspects frees us from some of our worries and frustrations. It can help us ease our pain and discomfort by allowing ourselves to realize that we are not perfect, nor do we have to be, and that our \"failures\" are steps that many people have taken before us, and that these failures are just as much as part of the story as the successes we may incur, and that even the successes are just another normal part of our attempts in life.\n\nAnd because I like ending on 3s, let me try to think of another benefit. The first had to do with self-acceptance, while the second had to do with our journeys, so it's only fair that even if I didn't want to focus on the outside system so much, I should probably iterate the third benefit to be in relevance to it.\n\nThe third benefit of humility is that it can help us to accept our place in society and in our relationships and free us from many of the stressful feelings and thoughts we may have from certain relationships. It allows to feel many of the emotions, positive and negative, from a place more objective, a place more grounded in reality, without having to let our naturally inclined aggressive, reactive take full control of our actions. More specifically, if we get hurt within our frames of relationships, humility can allow us to try and accept our pain and even allow us to see the reasons for the other person's actions and intentions with less malice, which is sometimes very hard to do. In fact, dare I say, beyond relationships, humility allow us to learn more about the out side systems, the world, the universe, theories and ideas with a wider lens because it helps us see these new things from a different perspective, one where we are not so filtered by our own self-importance.\n\n**How I use Humility...**\n\nFrom the benefits that I have listed, I think the core concept of how I use humility always comes down to the idea of \"Stepping back to see my place in the system, and seeing where I fit in.\" I think it comes down to the often mentioned idea of seeing the self not just as the whole \"me\" but that the aspect of \"me\" that I see is only a small part of everything else. Okay, that's pretty confusingly written so let me try again.\n\nThe core concept for humility to me, is the idea that I am seeing myself as part of a whole that is beyond just myself. Instead of focusing my reference point of everything to only myself, as some would call the ego, I focus the reference point to the system. So even in study of self-acceptance, using humility I try to come from a mindset that what I think of myself is only a small sliver of what I truly understand about my whole. I can only ever think of facets of myself, only see the \"good\" or \"bad\" as I deem it at that very moment. But once the moment has passed, all the \"truths\" that I may have realized will changed just as naturally as we grow and change moment to moment.\n\nSo for instance, some times we have self-hating moments when we are proven by reality that people do love us and that we are deserving of their interest and favor. But often times we can get stuck thinking something like \"They don't really know what I'm really like. I'm a bad person. They might think that I did something good, but I did it because I'm selfish.\" But with the help of humility we can potentially humble ourselves and say that their views of who we are, are just as justifiable as our views. Maybe we do think we are smarter than them, and that they are not working from all the knowledge that we are, but are we, ourselves, really working from a full book anyway? If we cannot truly know each other, how can we truly even know ourselves? Is that not the whole process to life anyway?\n\nSo when I do have such thoughts of \"They only like me because they don't know the true me.\" It sometimes helps to be able to say \"The reasons that others like me are just as good as reasons for why I like myself.\" In effect, letting humility see yourself in a bit wider of an angle than just guilt and self hate.\n\nI also think, when considering self-acceptance, humility also helps us allow ourselves to see our short comings and what we consider weaknesses from a more accepting angle. Instead of feeling guilty for each past mistake, or fear from each \"crime\" we may have committed, by using humility, by seeing that we are not the only heroes in the world, by seeing that we are only another small part of a more gigantic and every changing society, we can see that our weaknesses are only just a small part of us. Our ill deeds are just a small piece of what truly makes us us. And our weaknesses, our hateful sides, our greed and lust, and fears, and anger, they are also just part of the human experience. Humility allow us to be not perfect. Because we shouldn't have to be. We should strive to grow and learn each day, of course, but that does not mean we have to be monks or saints. The only requirement we have in living is to just be.\n\nAnd when we become humble within ourselves and our actions, I think it becomes a lot easier to become humble of other people's actions. Using humility can help let us see our relationships in a new light. To be able to take a fight that may happen between someone you love and yourself and put it in reference to all the other good times you have had. To see that not all of our actions are additive and that the top is the defining moment of everything, but to see that the top is only the most recent event and see that beyond this moment of anger and betrayal, that there are so many years of love, bonding and understanding that builds on each other. I think benefit #1, in such situations, helps you see that only a part of you is being attacked and that they still love the other parts of you, and that if someone is angry because of an action you took, instead of reacting in self-defense and anger we can use benefit #2 to say \"I'm sorry. This was my mistake.\" and be able to show them that action is only a very tiny part of you, and that there is so much more beyond. And to be able to do that for the one you love, so that when they may hurt you, you can realize that, that action is only a very small part of them as well.\n\n**Some ways I exercise Humility...**\n\nSo if what I talked about sounds pleasing to you, and you want to give it a try, I can offer the couple of times in life when I have felt myself becoming humble. I think the more you are able to explore this feeling and mindset, it becomes habit forming in real life automatically.\n\nI think the easiest and clearest way for me is when I get to look at the things around me from a different reference point. Like climbing the near by peak to see your town so small and see that you are only one of the worker ants in a bustling city out there. Or when I take walks out late at night and look into the heavens and that certain moment clicks when all the stars become points on a massive and dark canvas that covers the whole of the heavens. Or when I sit and look inward and realize that what I feel at that moment as myself is only a small tiny piece of a much bigger whole that I cannot truly fathom.\n\nAnother way to be humble, for me, is to see great masters at work or when they discuss their limits. For instance, Bruce Lee's interview on the Clive Barton show is very humbling to me. For such an awesome guy to say that his only goal in life is to express himself wholeheartedly through his motions and body, it makes me realize how, although others may consider him a master, he in his mind, is still a student like anybody else, just reaching for their dream. Or even going to see masters at work, at whatever they may do, and realize that they are not masters because they consider themselves geniuses, but because they themselves have a deep want for something, just like us, and that this product they have made, this art, this moment, is only just a reflection of their love for something. Just like us.\n\n**Conclusion...**\n\nWell, I hope you enjoyed my little rant. Like I said, this is mostly for me to figure out what humility means, and the more I write, the more I realize how little I really understand about it. Although there is a piece of me that has some kind of abstract feel for humility, I honestly don't know if I will truly understand it well enough to be able to explain more than I have tonight. But I think that's okay. Doing something like this is always helpful to me. I would love to know what you think about it as well. Abstract ideas like such, they can be very difficult to start talking about, because who can really know where a good starting point is, or what the correct words may be to explain, but I hope you will give it a try. What does humility mean to you? How does it affect your life? Is it something worth thinking about? Is it something purely fictional? What are some pitfalls of we rely too much on it?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/4eaej8/my_thoughts_on_humility/", "title": "My Thoughts on Humility", "social_network": "reddit", "user": "bauski", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1460376301, "permalink": "/r/DecidingToBeBetter/comments/4eaej8/my_thoughts_on_humility/", "nsfw": false, "first_save": 1635437191.578726, "replies_charged": false}