{"id": "t5_2tand_t3_9i8u29", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "This is a weird topic for me because I live with a mental illness that really impacts my social intelligence. I guess EQ is the right term. I can be very charming but I don't really know how social interactions work. This leads into me being at least somewhat mentally and emotionally immature for my age (30), so please keep that in mind when you comment. I'm not being intentionally ignorant, weird, inappropriate etc.; I just don't know how you guys think. :P\n\nSo, I'm starting to worry that I've got some compassion fatigue from always being a listening ear for other people. It's not as if I'm overwhelemd or overburdened, I just... have a difficult time caring like I used to. Where before I'd just be a shoulder to cry on as well as a positive influence, I'm just a shoulder to cry on now. An inert object. Not to them; I can \"fake\" caring (I do genuinely care, I just can't hit the depths of care that I used to even if they're what I feel I could handle) but inside I'm not fully there. I've been pulling back a bit but I think I need to do more until I'm stretched less thin.\n\nIt's not as if I expect my actions to resonate with anyone in a predefined way and I'm not trying to manipulate people into happiness (tried that, surprisingly it doesn't work!) or be a people-pleaser at the expense of myself; I just try to send out what I'd like to receive. \n\nI'm not entirely sure where I'm going with this or if I even have a point. I'll leave it here. Thanks for reading and thanks in advance for any constructive advice. :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9i8u29/how_do_you_not_give_up_on/", "title": "How do you not give up on people/society/relationships/etc.?", "social_network": "reddit", "user": "iama-canadian-ehma", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 23, "down_vote": 0, "creation": 1537713677, "permalink": "/r/DecidingToBeBetter/comments/9i8u29/how_do_you_not_give_up_on/", "nsfw": false, "first_save": 1635435838.0756273, "replies_charged": false}