{"id": "t5_2tand_t3_pfu9nm", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "883794f3-030f-4844-8950-6e28281dfa3f", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I wrote this in another subreddit, but it can be useful for those struggling with substance abuse/gaming addiction/procrastination/... Maybe it can motivate someone to take the leap of faith into recovery.\n\n>I think a lot about the pain of discipline or the pain of regret the last couple of months. I'll rephrase it to the pain of acting brave or the pain of regret. I reflect on how I stole many growth opportunities from myself due to inaction, drinking to get 'courage' to try things, gaming, ...\n>\n>It hurts when I think about how much better my days as a student would've been if I was sober those years. I think about how much better my relationships would've been in the past. I reminisce about how I am now gonna be able to start a PhD years later than if I was sober in the past.\n>\n>All the lost time, lost opportunities are the worst part of alcohol abuse. And you only notice when you step outside of your destructive habits and look at the carnage you left in your past.\n\n>It feels like I lost some of the best years of experimenting etc. due to alcohol abuse. I was there, those years, but not really. I experienced it with a veil between my inner world and the outer world. Like an external observer of some kind. Rarely connecting deeply and constant internal turbulences.\n>\n>Every week I think: Why didn't I learn this sooner? This would've been aweseme if I'd known this when I was 22. Even at almost 29, I still feel like a 20 year old sometimes.\n>\n>I am grateful that I quit at quite a young age, so that the future at least will be lived fully. I am grateful I didn't end up in the hospital, even though I gambled on my health many, many times. I am grateful I didn't ruin my future permanently, only the lost years of growth I have to catch up to. I am regretful about all the lost relationships in the past. I am grateful that recovery and therapy thaught me how to get better emotionally and in relationships.\n>\n>Now some years sober, I see how life can be colourful, it can be rough, it can be beautiful, I make many mistakes. At least now I learn as much as I can from each mystake. Or, let's call them experiences. I give myself room to try out things and learn from them. Especially with regards to social situations this was hard.\n>\n>I was quite a passive teen and early student, so my social skills weren't the best in early adulthood. In the later years of studying it got better due to some important changes: journaling, doing improv theatre, starting to dance. This was major growth, but it pales compared to the effects of recovery (even though I still do all those things).\n>\n>In the end, I'm grateful that I'm learning to choose action over inaction. No matter how the situation turns out (within reason), experience is always valuable.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pfu9nm/reminiscing_about_the_past_almost_45_years_sober/", "title": "Reminiscing about the past, almost 4.5 years sober", "social_network": "reddit", "user": "engineer_whizz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 67, "down_vote": 0, "creation": 1630504125, "permalink": "/r/DecidingToBeBetter/comments/pfu9nm/reminiscing_about_the_past_almost_45_years_sober/", "nsfw": false, "first_save": 1635435347.9893525, "replies_charged": false}