{"id": "t5_2tand_t3_dsh6ix", "request": ["9ad14901-6d2f-44f9-8b16-48a4f40b66ab"], "text": "So I've been on this path to recreate myself as the person I could be at my highest potential. I've done quite a few things that I think I should feel good about. On October 22 of this year I had my one year sober, I wrote a book, over the last 18 or so months I've lost 50+ pounds, I wake up early and listen to motivational stuff to try and control my mind, I work out, I meditate, and this week a good friend of mine went sober and credited me as his \"inspiration.\"\n\nAnd I don't feel good about any of it. But I don't just not feel good, my brain won't fucking leave me alone with nasty, vile, negative thoughts. I can't seem to get them under control. For every thought telling me I should be happy or proud, there's an equally or more powerful thought telling me I shouldn't. \n\nIt's gotten to the point where they come so fast and they're so mean that I often get caught by surprise and have to shake them off, physically. Which leads to me twitching out randomly and without explanation. It's like I'm intercepting someone else's thoughts. Like a radio wave that was meant to land somewhere else accidentally got beamed to my brain. \n\nAnd I'm getting in the shower after a workout and feeling good and then my head lights up, \"you're still a piece of shit and everyone can see it. You aren't fooling anyone. I want to die I want to die I want to die.\"\n\nAnd I guess the reason I'm writing this on decidingtobebetter, is as I write it, I realize that I really need to go to a shrink or something. So that's my pledge for today. I'm gonna go seek professional help and finally get my brain under control.\n\nThanks for giving me a place to vent. The struggle can get pretty real sometimes.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dsh6ix/plagued_by_intrusive_thoughts/", "title": "Plagued by intrusive thoughts", "social_network": "reddit", "user": "PublicDomainMPC", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1573051166, "permalink": "/r/DecidingToBeBetter/comments/dsh6ix/plagued_by_intrusive_thoughts/", "nsfw": false, "first_save": 1635435313.6198802, "replies_charged": false}