{"id": "t5_2tand_t3_8rnow8", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Hey everyone. I never thought I'd ever get to this point but in the last year I've seriously started to fall apart and my depression is getting more and more serious. I'm in the darkest place I've ever been in my life. I feel I already wasted my life up to this point and I'm scared of my future. I need help.\n\nLittle bit about me. I am 27 years old. I live with my dad. I have a seasonal job where I make 12/h. I'm not sure I can even hold a full time job. I feel like the scum of the earth because I don't help with the bills and my dad takes care of me in the summer. It's pathetic. Even if I could somehow interview somewhere I don't think there are very many places I could actually handle working at with the anxiety and stress.\n\nWhen I was 22 I really set out to start improving my life. I was gonna meditate every day, get fit, improve my confidence, conquer my anxiety, move out of my dads house, etc. I was going to change my life. I read all sorts of self help stuff. Mostly Law of Attraction type books. I was in an optimistic place and had high hopes for my future.\n\nLast year I had my 27th birthday. Somehow that night I ended up smoking meth for the first time in my life after I had already taken a bunch of adderall. It suddenly dawned on me that I had made absolutely zero progress in my life over the last several years and here I was smoking meth in some random dudes house. What the fuck happened.\n\nSince then I have been dealing with worse and worse depression. I have never been suicidal in life but I feel I'm getting closer and closer to that reality. I am in so much pain and I can't see the way out. I have been drinking almost daily to cope with the stress and occasionally doing meth, which i did the last few days. I can't keep living like this I honestly won't last much longer. I'm really scared.\n\nThe only good thing to come out of me staying up for almost 3 days was I came across this post on social anxiety https://www.reddit.com/r/IAmA/comments/hiyzl/24_year_old_who_suffered_social_anxiety_his/ This really resonated with me and I don't think i've laughed like that in several months. I totally see it now. I knew social anxiety was always a problem in my life, but only now can I see that's it really is responsible for all my short comings in life.\n\nI've been anxious all my life. My parents just thought I was \"shy\" so I never got help. Going through middle school and high school was awful and I missed out on so many formative experiences during those years because of the anxiety I felt. I just stayed away from people and any uncomfortable situations and so I would just stay home and play video games all the time, that's basically all I did for my entire teenage life.\n\nNo dating for me, no real friends (except 1), no crucial formative social experiences. I just avoided anything painful and even though I knew I had anxiety I think I just told myself people were stupid and I hated everybody. I never told anybody about my anxiety and I think was too afraid to admit it to myself. It was really stupid, I wish i had gotten help. I felt so insecure with myself, was fightened of girls, sometimes even my own friends made me uncomfortable. All I wanted to do was sit at home and play games, and often when my friends were out forming relationships and having new experiences I was at home by myself.\n\nAfter high school things got better. Suddenly I wasn't forced into all these uncomfortable situations with people I didn't like. I had a huge reduction in stress. Life went on, I got a summer job. It's actually the same job I have today. I spray weeds on the county and state roads during the summer. It's mostly pretty easy and very comfortable for me, atleast compared to most jobs. But it's only for a few months out of the year and I can barely handle that. I'm so burned out from work by the end of the summer I can't imagine doing it all year every year non stop.\n\nI only work with one other person and I don't have to deal with alot of social interaction during the day. I can even just listen to my ipod while I work. It's outside, away from people. It's a job I can handle. But it's only a seasonal job so one winter I did get a job on the weekends being a waiter. I managed to get an interview because my friends parents own the place. I had so much anxiety about the interview that I downed a pint of vodka before I went. I only had one other interview for a job before that one and it went so poorly that I wanted to die. I decided this time I just couldn't handle the stress.\n\nStupid I know, but it worked. I was charming witty and fun and the interview went really well. I got the job. Only problem was I working totally sober and I found out I am not a very good waiter. I'm always so on edge I feel I come across as a very tense person, I couldn't be a pleasant smiling waiter like I tried to be. Walking up to a table just gave me painful anxiety. It was just awful. They did not ask me back the next year...\n\nNow things are getting worse. My dad smokes 2 pack of cigs a day and drinks a bunch of beer. I don't have any high hopes for him living alot longer. And my grandma has even less time. 2 years tops.\n\nI have no idea what I'm going to do. I already feel so trapped from this anxiety. I have spent my entire life avoiding everything. My dad or grandma took care of everything for me I feel so unprepared for anything in the world. I feel really stupid and worthless. I will never get those years of my life back.\n\nThat post on social anxiety really gave me hope however. I decided I will seek professional help ASAP. Like first thing Monday I'm going to go fill out the paperwork and get an appointment set up. I'm done fucking around with meth and booze, atleast I hope. I will do my best to quit that fucking shit and try to find other ways to relieve stress in the meantime.\n\nBut I'm still in a shit situation. Sooner or later my dad will die. I make bad money, i have a dog i need to care for, I can't afford to live alone and I'm afraid to seek out another job as there isn't any better jobs in terms of stress or pay that i can find. I am so tired after work that I can barely have time to do anything. I walk my dog, eat, then relax and go to bed. Occasionally I go play disk golf with friends but I have a hard time doing that unless I drink because the anxiety and stress make it hard for me to relax and I am an unfun non talking person.\n\nI am so ready to take steps to get out of my situation but I am lost. I don't know what to do. I feel like I need a schedule or an action plan or something, anything. I am so fucking afraid and stressed out. I don't know if I'm going to make it. I'd appreciate any help or advice.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8rnow8/i_need_your_help_social_anxiety_is_ruining_my_life/", "title": "I need your help, social anxiety is ruining my life.", "social_network": "reddit", "user": "HyperMoonX7", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1529197554, "permalink": "/r/DecidingToBeBetter/comments/8rnow8/i_need_your_help_social_anxiety_is_ruining_my_life/", "nsfw": false, "first_save": 1635435843.4409394, "replies_charged": false}