{"id": "t5_2tand_t3_p19f3s", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "For anyone willing to read. THANK YOU. I need your help if you have been in my shoes.\n\nI have developed a bad coping mechanism to deal with anxiety, with uncertainty and with my depression. I started avoiding things AT ALL costs. While my depression is better now, my behavior  has only gotten worse. What I did for the last to years is avoid life, success, achievements and just straight avoid getting better. \n\nWhat I did/doing: \n\n1. Avoid studying and working on my thesis.: as stupid and as childish as this may sound, I am afraid of graduating college. I am afraid of succeeding but at the same time I'm afraid of failure and of critics, thinking I don't deserve this and I'm not good enough. This led to procrastination and more anxiety and more fear that I now will fail and will NOT graduate on time.\n2. Avoiding people : I stopped using my phone and social media. At first it was because I didn't want to compare but it's not just that, I'm fooling no one. I avoid speaking to my friends to the teacher I'm working with, to family, and to anyone who knows me in real life and would ask about my progress. I know it is shame and fear of being judged by them since I fooled everyone into thinking I'm doing better  after a year and half  of mental health issues that effected my social life and academics. Honestly, I feel like a burden and I know people are fed up with me because this is no one's burden but me.  Mo one can help me unless I take action. \n3. Avoiding myself: I don't look in the mirror because I don't want to see who I became. I don't let myself feel or get it all out as they say. I am numb, and the longer I am like that, the harder it is to let it out since it'll come out stronger and stronger. I don't do drugs or anything, I'm gifted in this naturally as it seems. \n4. Avoid my parents: They mean the word to me and I know how disappointed they will be with me if they find out so I just avoid them and let them think it's all right. \n\nMy self image, my self esteem, my confidence is none existent. I avoid pain at all cost and it's only leading me to more pain and people who care for me. I can't even dream of becoming better because even I don't trust myself doing it. I know I have to if I want to get out but I just don't take action. \n\nI want to take action though. I want to persevere and learn how to face my challenges not run away like I'm doing because I'm a joke right now. \n\nWhat I will do : \n\n1. Contact my teacher: I have been avoiding them since I didn't get things done, thinking that I will get them done then contact them which didn't happen and it got out of hand. I don't know what will happen, maybe they won't want to work with me anymore, maybe they hate me but I need to do that.\n   1. Study: I am not stupid but I damn well feel like I can't do shit and I don't do shit in the process. It doesn't need to be perfect. I just need to get it done. I don't need to be the first. I just need to graduate. No one is after me. No one is judging me. I own it to myself..... I used to love my major for fucks sake! I officially have a month left. logically I can't get it all done, but at least, at the end of the month I can present something and ask for some more time to finish. I will have more confidence asking that is.\n2. Ask for help: Put my shame behind me and ask for fucking help because I need it. I'm not fooling myself. A friend gave up on me. they were here for me but because of my shame I never asked for anything. I can't do it all alone and they may not be willing to help but I at least should reach out and ask. FUCKING ASK.\n3. Talk to friends: If we are still friends that is.\n\nI want to be better. but wanting is not enough. I can't sit on my ass all day THINKING and obsessing about all this but not doing anything about it. I have an avoidance problem and it's  either me or this problem because I can't have a life like this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p19f3s/talking_about_it_acknowledging_it_taking_action/", "title": "Talking about it, acknowledging it, taking action to move past it. [Please read ]", "social_network": "reddit", "user": "Pale-Sheepherder1136", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 87, "down_vote": 0, "creation": 1628539824, "permalink": "/r/DecidingToBeBetter/comments/p19f3s/talking_about_it_acknowledging_it_taking_action/", "nsfw": false, "first_save": 1635436823.513384, "replies_charged": false}