{"id": "t5_2tand_t3_iu4sjb", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I want to share with you a couple of my opinions about this whole no surf thing. Since a couple of months I am slowly realising that extensive usage of social media is really harming my mental health. These services like Facebook, Instagram are designed like a gambling game. Constant refreshing, huge dose of notifications and this dopamine rush after new message is an addiction. For real, try to observe people for ex in the bus. Once, I was observing a lady who was checking her Facebook feed on and on for a couple of minutes. After she finished checking, she was waiting for a 1-2 minutes and the whole action was repeated. It really looked like a zombie activity. This is what extensive usage of social media does to us. Talking about Instagram, this is generally fake, sometimes I think that I really wish some people would have a life as good as their fake life and arranged photos on Instagram. I don't say that social media is devil. Nothing further from the truth, it really enables us to receive important information, stay connected etc but so many people treat social media as a oracle. Try to reduce your screen time on social media, instead of it read books, learn something new from the net but for real, don't spend your whole day browsing Facebook feed. Moreover, don't try to stay connected with your friends all the time, talk for an hour on messenger but later leave it. Talking for 8 hours a day is not beneficial at all, its just shit talking just in order to kill your time and provide dopamine for your brain. I think that's all, feel free to comment :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iu4sjb/lets_take_a_look_on_social_media/", "title": "Let's take a look on social media", "social_network": "reddit", "user": "Nirteh", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1600290517, "permalink": "/r/DecidingToBeBetter/comments/iu4sjb/lets_take_a_look_on_social_media/", "nsfw": false, "first_save": 1635435497.6057825, "replies_charged": false}