{"id": "t5_2tand_t3_lzy86r", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": " \n\n**Quick Disclaimer**: *This might me a long post to explain something quite simple often labelled as \"Toxic Relationships\" or something like that. But I tend to appreciate analyzing things in a deep level and quite frankly, I'm feeling shitty about this situation so i felt the need to speak out about it to strangers.*\n\n*Before you read, I want to apologize if i sound cocky or like I'm bragging about myself, that's not the purpose of this, but in some situations I will compliment my own intelligence as well as my friend's. Maybe I live in a bubble and need to meet more people so i could be a little more humble, who knows. I'm also sorry for my poor English, my native language is Portuguese, but I hope you will bear with me.*\n\nHi there.\n\nI'm Miguel and I'm 22. I spend a lot of time by myself, but in the rare occasions im with friends around, I like to make people laugh, have a good time, and I'm that annoying guy in the room that talks a lot and way too fast.\n\nThis post might have been written a dozen times before, and I bet a lot of people struggle with the same stuff I am struggling with. Maybe I should blame it in the growing levels of individualism and narcissism in the developed society, but it seems too easy to point it as the only cause.\n\nI'm writing to you because quite frankly, I feel lonely and trapped in a cycle I can't seem to get out. And I'm still trying to figure out if I'm the one to blame or not.\n\nFor the past 5 years, my core friend group (all males) has been quite unstable, which led to a certain degree of suspicion and trust issues between us. When we were in our late teens, we used to be kind of an elitist group, even though we were the non-posh group raised in a posh environment. We weren't particularly amazing in any field or subject, and not the best students grade-wise (cause we were rebellious as teens), but I can honestly admit, we were easily labelled of smart-ass, witty, cynical with every single behavior we saw in our age group and society, and we also got a kick of making fun of people that bragged about themselves or behaved like peacocks (never in front of them cause we didn't enjoy hurting others).\n\nYes we were aware of some things other people around us weren't aware, and we did enjoy finding the self-interest in every act we saw around us.\n\nBut the thing my group had that I couldn't find elsewhere, was the fact that we were able to have really long intelligent discussions about anything, we didn't scrap the surface of any topic, we enjoyed going deep, exploring stuff in a cynical way and being thoughtful about the range of possibilities that fuel human behavior.\n\nBut I felt like I was exploring a side of me that made me distant from everyone I met.\n\nUntil I was 19, I was pretty ok with it, but when I realized we were walking down a lonely and \"dark\" road, I felt the need to transform myself and become less prejudiced with everyone. That transformation was also fueled by the fact that I was finding new interests, becoming a different person, and I wanted to do other type of stuff, discuss different subjects, and enjoy a different setting or way of being. But the transformation led me to try to be gentler with everyone (even my group), and use my awareness in a compassionate way and not as a tool to win fights. Well, at least I tried ahaha.\n\nThe problems with our group started emerging when we became really competitive with each other. \"Our thing\" was being smart and aware of stuff. But we were in a bubble and no one was really achieving something where they could show off their IQ or whatever. So in my view, we turned on each other. Every time we were together, I felt like there was this cloud of distrust between us, like we envied each other and we took every discussion as a clash of egos. If someone came up with something cool going on in their lives, we were quick to bring them down on it, make petty jokes and again, see it in a cynical point of view. And then laugh about it and admit that we were only kidding. We have troubles acknowledging we might not be the best ones at something, or the most successful, we were \"meant to be geniuses\", all of us.\n\nI'm not victimizing, maybe I was a big part of it, and that's probably why I feel so left out now. To be fair, something that really annoyed me was when someone in the group was trying to copy me without giving me credit for it. I was always into music, and i wasn’t a musical elitist, if i enjoyed it, it was good. Mainstream or not, i couldn't care. I changed my clothing style and music taste as i grew up and had to deal with all the petty jokes, until they suddenly recognized I was \"cool\" enough to be replicated and did it.\n\nYeah i know, petty petty me. It's all vanity and shit. But it annoyed me because I was reclaiming my identity, enjoying music in a really deep and spiritual way, and suddenly I had friends trying to use music to look cool, talking down on mainstream and non-mainstream genres i enjoyed, and listening to stuff with 1k streams just so they could brag about how different they were. And the annoying part is, I never bragged about it, but suddenly I was feeling the need to tell them everything that I knew, just to prove that I knew it!!!!! The \" i found out about it first\" type of situation.\n\nI felt like a victim of my own ego. I despised the fact they were trying to look cool and being \"fake\", but I also didn't want to be the lame one... So, I gave up and stopped talking about music with them, and I'm never the one picking the music these days. (not like we have many chances anyways)\n\nSorry for this music vanity bit, It's kind of personal to me, it annoyed me how something I loved left me so anxious around them, cause it felt like we were rating each other’s brains or coolness by the music taste.\n\nAfter I became aware of this toxicity, I always tried to be the delicate and the group appeaser in some way. Even though sometimes i flipped when I saw someone being an asshole to win discussions (cause winning was important you see, we had to be the best one, me included). I tried to be honest every time I could, point out when I saw something that made me feel uncomfortable or anxious, but with every single friend i had, i felt like showing deeper parts of myself, only led to them being more anxious around me, or wondering what the fuck I was thinking in that particular moment. So i felt like shit every time i showed some complexity about myself to anyone, because they weren't giving back and I wasn't getting more phone calls to go out after it....\n\nAnd since I am a pretty complex and overthinking guy (this is the bragging part i was talking about), I used to view every of my friend's behavior as lived through my own brain. So it became harder and harder to trust them, to know exactly what they were thinking, the ones that I identified the most with, were the harder ones to trust...\n\nAnd even though i did see some direct competition attempts, like shaming me for something different and innovative i did that revealed some sort of trait about myself and etc, i didn't accept it as such, it led to me seeing myself as the one to blame, for \"seeing it\" as such.\n\nI started wondering if i should stop talking about my achievements, my new interests, my new ideas... I felt like the only thing i could do was talk about the subject on the table otherwise they would despise/envy/copy me for being \"smart\" or for doing something. And in a few discussions where I was winning (bragging part number 2), because i actually had better arguments ahahah, I started to see how they attacked me ad hominem style, calling me arrogant and mr know-it-all, just because they were annoyed with the \"loss”. I didn't argue because I enjoyed winning, ok maybe a bit, but that wasn’t the point, i enjoyed getting to the bottom of things, but they saw it as arm wrestling (in my view). So I began to wonder if i should have arguments with them at all.\n\nAnd before you start judging me.\n\nI am a self-centered, narcistic, \"me me me\", son of a bitch. But I am also aware of that. And I try to fight it the most I can when I'm with friends. I'm not the narcissistic guy who takes over the conversation, likes to disagree, points shit about everyone, entitled... I personally enjoy doing favors and helping out, and i love when they actually ask me to help with something i know.\n\nSo to get to the point. (What? That was only the beginning?)\n\nThis is the most me me me part.\n\nThese days I feel like I mean nothing to them. And they would rather be with each other when I'm not around cause I pose some kind of a threat? I don't know. Maybe this is just me thinking I'm better than I actually am. But I honestly try so hard to be genuine around them, I try so hard to be truthful and good, and when I start \"shining\", either by having good arguments, listening to cool music, being different, i don’t know... I just feel like i get pushed away every time. It's so hard to be friends with them, cause I feel like i have to tone it down a notch. Being less Miguel otherwise I'll be annoying or stressful to be around (cause I have big eyes that stare at stuff and make everyone see how much thinking I’m doing ahahaha).\n\nAs i write this, I'm dealing with some mild dissociation that has been affecting me for the past year, if you don’t know what it is, it doesn’t matter, basically I just lost all sense of identity I had as I lost the ability to appreciate music the way I did, I’m \"deprived\" of emotions and I tend to wonder about who I really am and zone out. Having a group of friends that doesn’t make me feel \"home\" also doesn’t help, cause its not like i can turn to them to lean on my true self.\n\nSo yeah, I’m pretty lonely and my friend group doesn’t quite satisfy me. And the annoying thing is, i still have some nasty habits that make me way too picky about people. (Please don’t judge me on this next sentence) I feel like i need to hang around people with a certain degree of intelligence, they don’t need to be cynical, i learned to despise Cynicism over the years, but i like having long talks and good discussions. And I also despise tribalism... I don't see myself in any group that tends to follow a specific trend or lifestyle, i need impartial criticism. That leaves me in a particularly lonesome situation ahahah\n\nI wish I had one of those groups where people just love each other and are actually good and caring for one another. I wish I had a group of friends where I could be myself and feel like that was appreciated. I wanted to listen to cool music with friends, go to festivals, not just talk all night and have egos clashing until 6am, the thing is, i am generally ok with being lonely, but i also want to live the kind of life i should be living in my 20's....\n\nMaybe those groups don't exist?\n\nMaybe I wasn't cut out to have that due to my erratic personality?\n\nAnd I find it so hard to find a group that I identify with or want to hang around with... And its not like those groups are recruiting new individuals to join in, at least in the environment where I am currently... I don't know, It just feels like I’m condemned to this. I only have 2 or 3 friends in my uni, and they are all the type of students that have a group of friends outside uni... And reaching out for an invitation seems so far off.\n\nWho knows.\n\nI'm not sure what I want from you guys, but it felt good to write about this.\n\nI would love some advice if you have any.\n\nSorry for the long post!!!!!\n\ntl;dr basically i feel trapped by my own thoughts when it comes to socializing with my own friends, makes it hard to have a genuine connection with anyone, and i feel like no one appreciates me cause we are narcistic and shit.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lzy86r/a_narcistic_cry_out/", "title": "A narcistic cry out", "social_network": "reddit", "user": "MBaptista001", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1615146876, "permalink": "/r/DecidingToBeBetter/comments/lzy86r/a_narcistic_cry_out/", "nsfw": false, "first_save": 1635436509.5998576, "replies_charged": false}