{"id": "t5_2tand_t3_ea91pr", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7", "8e5fe1ef-2706-4539-b5ef-34d7e826cdff", "221a05fc-6bbf-424e-808a-6b3e01891c48", "da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "**Purpose and Emotion**\n\nThe most important thing in a man’s life are the purposes he chooses to pursue, and the key to a successful and happy life is choosing your purposes with your rational mind rather than your emotions. If you do not consciously and rationally articulate your purposes to yourself, your subconscious emotions will determine your purposes, and emotion without rational guidance usually leads to ruin. Worse yet, if you do not consciously and rationally determine your purposes yourself, others will determine them for you, often by manipulating your emotions.   \n\nAll human emotions and activity can be conceptualized in terms of purposes. Everything you do is directed to some purpose, whether you realize it or not. If you are watching TV, eating Cheetos, and scratching your balls, your purposes are watching TV, eating Cheetos, and scratching your balls. The question is not whether you have purposes, but what your purposes are.\n\nDiscussions of “purpose” often become abstract and meaningless, so I seek here to link purpose to fundamental biological emotions. Human evolved to feel “pleasure” and positive emotion to motivate us to seek things that help in our survival and reproduction and “pain” and negative emotions to avoid purposes that will lead to us harm. Positive emotions include the desire for food, sex, and affection, while negative emotions include grief, shame, guilt, depression and anxiety. Positive emotions usually fill us with energy and enthusiasm to motivate us to move, while negative emotions cripple us to prevent us from moving. But every emotion serves some purpose, and the key to a healthy and happy life is not to repress or kill your emotions, but to put each emotion in its proper place so that they work in harmony for your overall good.  \n\nOur rational mind is a much weaker than our emotions, and is often overwhelmed, hijacked, and tricked by emotion. The only thing that can defeat an emotion is a stronger emotion, so the primary responsibility of your rational mind is not to conquer your emotions, but to order your emotions properly so that your “higher” emotions predominate over your lower ones.\n\n**Positive emotion**\n\nThe biological systems underlying positive emotion can be summarized using a familiar quote: “life is a journey, not a destination.”\n\nThe primary brain chemical that regulates positive emotion is a neurotransmitter called dopamine. Dopamine is released every time we do something pleasurable: when you eat a tasty meal, snort a line of cocaine, or have sex. You also feel dopamine when you experience “higher” pleasures like acceptance by the tribe, love, affection, and the joy of accomplishing a goal or helping somebody. But strangely, most dopamine is released “on the way” to achieving the pleasurable goal, rather than after we attain the goal itself.\n\nMost people think of pleasure as a destination. You see (or conceptualize) a pleasurable goal, you take steps to achieve that goal, and you feel pleasure AFTER you achieve the goal. I call the pleasure you feel after you achieve some pleasurable goal “destination pleasure.”\n\nBut the journey to the pleasurable thing is stronger than arriving at the destination. When you see (or conceptualize) a pleasurable goal and take steps to achieve that pleasurable goal, you feel pleasure on the journey to the pleasurable goal. I call this feeling “journey pleasure.” As Artie Lange said, “the best part of doing cocaine is going to your dealer to get it.” The excitement and enthusiasm you feel on the way to something your subconscious thinks will be pleasurable is much stronger and longer-lasting than the destination pleasure you feel when you actually consumer that thing. This is why I consider journey pleasure to be a superior and “higher” pleasure.\n\nThe superiority of journey pleasure makes perfect sense from an evolutionary perspective. Humans need to go get food, find shelter, and have sex, but evolution doesn’t care if we feel pleasure after we achieve those things. Evolution is more concerned with getting us to those things in the first place, which is why we are wired to feel most of our pleasure as we move towards the goal rather than after we get it. We did not evolve to rest on our laurels and celebrate after getting something we want. Instead, we evolved to immediately want to go get the next thing.\n\nWe have all experienced this on some level. We have all won some championship, completed some final exam, scored with some hot girl, or achieved some other goal, only to find ourselves underwhelmed and feeling empty after we achieve the thing we thought we wanted. As George Bernard Shaw famously said, “there are two tragedies in life. One is to lose your heart's desire. The other is to gain it.” This is because journey pleasure is much stronger than destination pleasure, and once the journey is over the destination pleasure feels relatively weak and empty.\n\nBut make no mistake: journey pleasure only exists when the journey leads to destination pleasure. If there is no pot of gold at the end of the journey, our subconscious mind will not generate the dopamine necessary to motivate us. Our brain is a pleasure-seeking machine, and if there is no pleasure involved we simply will not pursue something, no matter how noble or important the goal. We are animals, not angels. It is just a happy coincidence that pursuing noble and important goals sometimes brings us pleasure. The brain’s motivation system is somewhat paradoxical: even though we are motivated by destination pleasure, we feel most of our pleasure on the way to that destination pleasure, so we often don’t even care about the destination pleasure once we get to it. Billionaires work 80-hour weeks to make a fortune, only to give the fortune away after they have receive it. They don’t care about the money (they have more than they could ever use) – they love the game. Nevertheless, if there is no fortune or other attractive prize at the end of the journey, billionaires would not be motivated to work 80-hour weeks in the first place.\n\nHuman beings will only do something if we feel like there will be some payoff in the end or if we are afraid of some worse outcome. A child will only do his homework if he fears punishment or if he genuinely believes he will receive some worthwhile reward for doing it, either in the short term or in the long term. Similarly, as you move through life, you will only be motivated to work hard if you believe your work will lead to something. That “something” can be money, developing your skills, creating something new and valuable, or helping people. Ideally, your work will pay off in all of those ways.\n\nThe difference between successful and unsuccessful people is that successful people see their life as leading towards some higher purpose, even when things are going badly. Even when they do something that sucks, they are building towards something higher: they are building their resume, developing skills, saving money, learning lessons, meeting people, etc… Unsuccessful people feel like no matter what they do, they will never get to the promised land, which is why they are not motivated to work hard today. Successful people run towards a goal; unsuccessful people run on a treadmill.\n\n**Journey Pleasure and Emotional Stability**\n\nJourney pleasure is superior to destination pleasure because it is stronger, lasts over a longer period of time, and does not require external “things” to be satisfied. Destination pleasure only lasts for the brief moment while you consume the pleasurable thing: you feel destination pleasure while you eat the cake, have sex, or hug your friend, but the pleasure disappears a short time after and you need some external thing to give you pleasure again. Journey pleasure, on the other hand, lasts for as long as you are working towards your goal, so you can feel it anytime and anywhere because it is primarily mental. If you are building your business, you can feel journey pleasure as you work, as you eat lunch, and even as you have a few beers with your friends to wind down, because all of those activities are taking you towards your goal. \n\nJourney pleasure is required for emotional stability and rationality. Humans are pleasure-seeking creatures, and we cannot think rationality if we are chasing one brief pleasure after another. But journey pleasure satiates our desire for pleasure, and once we have a consistent source of journey pleasure we can make rational, long-term plans. Even people that enjoy journey pleasure need to feed their lower desires occasionally, but because their higher pleasures are satiated all of their thoughts and emotions are not directed towards satisfying their lower pleasures.\n\n**Purpose routines**\n\nYour brain constantly creates maps of the world based on your purposes to determine where pleasure and threat exist, as they are defined by your purposes. Your brain creates a spatial map of your immediate surroundings, coloring what you believe to be indicators of pleasure and threat with emotion so you are drawn or repelled by those indicators. Your brain also creates a more abstract map of your life, marking pleasures and threats that may occur in the future as you pursue your purposes. To see this spatial map right now, just look around – what you see is not necessarily reality but a map of the world that your brain created, with sources of pleasure and threat (as you understand them) emphasized by your brain to draw your attention. Similarly, you can “feel” the abstract map by thinking about your future: if you think about the upcoming week you will feel good about the pleasurable things you think will happen and anxiety about the shitty things you think will happen. Interestingly, your spatial map and your more abstract map are both created by the same part of your brain – the hippocampus.\n\nTo navigate these maps, your brain creates what I call “purpose routines.” A purpose routine is a set of procedures and rules designed to lead you to a certain goal, like a computer program. You can learn purpose routines with your conscious mind, but after you do it a few times it becomes subconscious and executable with little to no conscious thought. A simple purpose routine is walking downstairs to get something from the fridge, tying your shoe, or brushing your teeth. Purpose routines can also be more complicated – drafting a routine letter to a client, repairing an HVAC unit, or driving to work. Experienced doctors can even perform delicate surgery almost on autopilot because they have done it so many times. Sometimes your conscious mind even forgets the instructions to a purpose routine, but your subconscious mind can still do it.\n\nWe need subconscious purpose routines to function because we cannot consciously think about every single little thing we are doing. Our conscious mind can only process around 5 to 7 pieces of information at one time, but our subconscious mind can process much more. Most of our actions at any time are purpose routines running on autopilot. If we learn to do something in the wrong way, our brain might lock that defective purpose routine away in our subconscious, making it difficult for our conscious mind to reprogram it. The subconscious nature of purpose routines helps explain why sometimes very talented people are terrible teachers – their skills are locked away as purpose routines, so they cannot explain to another person what exactly they are doing. Purpose routines also explain why quack pick-up artist instructors often fail to communicate their abilities to their students – much of what we consider to be charm, charisma, and “alpha” behavior is an automatic expression of our purpose routines, and it is very difficult to consciously articulate what exactly those behaviors are.  \n\nYour brain learns to associate purpose routines with pleasure so, for example, if you have enjoyed snorting cocaine a few times, your brain will learn to associate the steps of snorting a line of cocaine with pleasure. Even seeing a line of cocaine or going somewhere you snorted cocaine may cause your brain to release dopamine, because it is anticipating the destination pleasure at the end of the journey it thinks it is on. Purpose routines help explain why addiction is so difficult to overcome – your brain is a pleasure-seeking missile, so whenever it feels bad, bored, or eager to do something (essentially, a lack of pleasure), it will automatically start running purpose routines it knows will lead to its drug of choice without your conscious mind even realizing. This is why addicts often need to consciously and carefully monitor their behavior.\n\nBecause your brain relies on your purpose routines to obtain pleasure, it is all the more important to consciously determine your purposes. Most peoples’ subconscious minds’ are littered with garbage purpose routines they automatically run to whenever they want pleasure: video games, drugs, alcohol, wasting time on the internet, etc… Whether we realize it or not, our brain is constantly seeking pleasure, and if we are not directing what pleasure it seeks, it will probably seek the lowest, cheapest pleasures that will ultimately lead us to ruin.\n\n**Anxiety**\n\nThe key to happiness, therefore, seems simple: pick a few good, positive, emotionally attractive purposes, pursue those purposes, collect journey pleasure along the way, and live happily ever after. Why then, are so many people miserable?\n\nThe main obstacle to journey pleasure is anxiety, which is a subconscious mechanism designed by evolution to help you pick which purpose to pursue. Animals and humans feel anxiety when 1) the subconscious brain believes there is a threat or anomaly on the way to the purpose it is seeking and/or 2) the subconscious brain is faced with multiple purposes that seem equally appealing. When faced with either of these situations, the anxiety circuit 1) floods you with negative emotion to make you freeze and stop progressing along the path you were on and 2) switches your mind into “information gathering” mode so that you can figure out which purpose to pursue. The more important the goal and the bigger the threat, anomaly, or conflict between goals, the stronger the anxiety. To our brains, a threat or an anomaly is anything that makes us feel like we are on the wrong path, either because it will cause us to not achieve the goal, or worse.\n\nAnxiety is the opposite of journey pleasure. We feel journey pleasure only when we see a clear path to the goal, but we feel anxiety when we see obstacles and threats on the way to the goal. Our anxiety decreases when we feel journey pleasure, and our journey pleasure decreases when we feel anxiety. Both emotions are necessary: we need journey pleasure to motivate ourselves to pursue the things we need, but we also need anxiety so that we don’t run into dangerous situations. When our journey pleasure outweighs our anxiety, we go for the goal, but when our anxiety is stronger, we stay frozen. Journey pleasure is the cure to anxiety, but to feel journey pleasure we must feel like we can overcome the threats and obstacles on the way to our purposes.\n\nAnxiety is generally stronger than journey pleasure, and with good reason. If a mouse sees a piece of cheese guarded by a cat, it should not pursue the cheese because the reward for getting the cheese is a little pleasure, but the consequence of getting caught by the cat is death. Therefore, when weighing the journey pleasure and anxiety of a particular course of action, our brain puts much more weight on anxiety. This means that humans are extremely risk-averse and our default answer to any new adventure is “no.”\n\nScientifically speaking, anxiety is different from fear. Fear is the “fight or flight” feeling we get when we are actually in the presence of the threat, whereas anxiety is the feeling of paralysis we get when we think there MIGHT be a threat. A mouse who will not walk into a cage because it smells cat odor feels anxiety, whereas a mouse that actually sees a cat and starts running from it feels fear. Anxiety becomes fear if we feel like the threat has actually arrived, and people with very bad anxiety often have panic attacks, which is a fear response. When most people say “fear” they really mean anxiety, but it is important to understand this distinction, because fear is often an important motivator, whereas anxiety is often a hinderance, as I will explain later.\n\nFinally, many kinds of anxiety exist: social anxiety which views high status members of the tribe as a threat; separation anxiety, which views distance from the tribe as a threat; obsessive/compulsive disorder, which views a lack of order and hygiene as a threat, etc… To simplify this article, I simply use the word “anxiety” to refer to all of these emotions.\n\n**Anxiety and Purpose Routines**\n\nJust as our subconscious mind tags certain purpose routines as “pleasurable” so we pursue them, it also tags others as “threat” or “obstacle” so we avoid them. For example, if you put your hand on a hot stove and burn it, your brain will subconsciously associate “putting your hand on a hot stove” with “threat” and strike you with anxiety if you start to do it again. Even if you consciously decide to put your hand on a hot stove because somebody offered you a million dollars to do it, your subconscious mind will flood you with negative emotion and freeze your muscles so you do not do it. Moving your hand to the stove will feel like swimming through molasses because your underlying biological systems will be doing everything they can to stop you.\n\nOur brain uses anxiety for memory and map building because we need to know where not to go, both spatially in our immediate surroundings and more abstractly in our life. This is partly why drugs that reduce anxiety, like marijuana, alcohol, and Xanax also impair your memory. Anxiety is literally responsible for building the world we experience, but as we will see, anxiety can create a distorted view of the world.\n\nThe brain’s process of painting certain purpose routines as threat is useful because it helps us automatically avoid dangerous situations without even consciously thinking about them. We do this every single day with thousands of potential threats. But anxiety tries to do a thorough job of documenting all of our threats so it often registers false positives. These false positives occur when 1) your brain subconsciously thinks something is a threat or obstacle when it is really not, 2) your brain subconsciously thinks something is a threat or obstacle when in reality you have the ability to overcome it, or 3) your brain associates a purpose routine with a threat or obstacle that will not be there in the future. Sometimes your brain does all of this at once.  \n\nFor example, imagine you go bowling for the first time and get stabbed at the bowling alley. In that case, your brain may associate “bowling” or “going to the bowling alley” with “threat” and make you feel anxiety the next time you consider going bowling, no matter where the bowling alley is or who is there. But getting stabbed is not a regular or inherent part of bowling, so the brain’s association of “bowling alley” with “threat” is wrong and counterproductive.\n\nNow imagine how many false positives your brain has created since your childhood and how many possible paths your brain has subconsciously marked as forbidden without your consent or realization. Most peoples’ subconscious minds are full of paths that have been wrongly labeled as negative, and these paths accumulate to form complex emotional and belief systems that cripple us. This mechanism often operates subconsciously without us even knowing what is happening: we just “feel bad” when we leave our comfort zone, and we don’t know why. Anxiety may manifest itself in many different ways: paralysis, endless rumination that goes nowhere, listlessness, a desire to procrastinate, hesitancy, timidity, laziness, a tendency to become distracted, a “weird” feeling you cannot explain, a feeling of pending doom, “rational” arguments as to why you should do something else, etc… Anxiety will use any trick it can find to make you stop pursuing the goal, including “rational” reasons that you cannot stop thinking about. Sometimes those reasons are laughably stupid, and sometimes they are solid and should be taken into account. It is your job to figure out which is which.\n\nAnxiety does not just try to make us pick a different path than the one we are considering, it often causes us to not consider certain purposes at all. Most people never even consider following their dreams because their brain kills those thoughts before they even make it to their conscious mind. Most people live in a world of invisible walls they create for themselves. Most people never leave their narrow “comfort zone” because their brain subconsciously convinces them they will fail. I strongly suspect this is also partly why people get “stuck in their ways” and more closed minded as they get older: there has simply been more time for negativity to accumulate in their mind.\n\nModern society exacerbates this problem. The anxiety circuit is a primitive circuit designed to react to simple threats in the jungle, not abstract, complex “threats” like an emotionally unstable girlfriend, a shitty job market, or other complex changes and challenges that we face in the modern world. The media and entertainment industry are also constantly trying to scare us into thinking that everything is a threat. Most people know the media and entertainment industry lie and fearmonger, but if this programming only works 10% of the time on us, that is still a ton of irrational anxieties that are now part of our subconscious programming.\n\nTo make matters worse, anxiety often hijacks our “rational” mind and creates false beliefs to match our garbage emotions. The world is infinitely complicated, which means that you can confabulate “facts” to support almost any decision you make or belief you hold, and this is exactly what your mind does when it really wants to pursue a certain purpose (or not pursue a purpose).\n\nFor example, imagine somebody grows up in an environment where their friends, family, and society constantly tell them that it is very hard or impossible for the “little guy” to get ahead. That person’s brain will subconsciously associate the purpose routine of “working hard to make money” with “insurmountable obstacles and threats.” If you asked them if it was possible for the “little guy” to get ahead, they would “rationally” explain to why it was not. This person may even use true facts to make their argument, but they would only do so by ignoring all the other facts that contradicted their argument.\n\nOf course, this person will never become rich because every time they do anything to make progress along that path, their subconscious mind will cause them to feel anxiety and do something else instead. Even his conscious mind will often sabotage him, because it has been subconsciously programmed by his emotions to form a series of false beliefs about the world. In this way, his emotions, actions, and beliefs will form a vicious cycle that will make it impossible for him to become rich. \n\nThe solution to anxiety and negative purpose routines is not always to ignore them and plow ahead. Anxiety serves an evolutionary purpose, and your subconscious mind can store and quickly access much more information about threats than your conscious mind can. Sometimes you get a “bad feeling” because something really is a threat, even though your conscious mind cannot articulate exactly why. Just because anxiety sometimes produces false positives does not mean that all anxiety is a false positive. Ignoring anxiety will deprive you of an extremely rich source of information and potentially expose you to danger.\n\nInstead of just ignoring your anxiety, you should rationally analyze it and determine whether the “threat” you feel is real or not. If I get a bad feeling about something, I try to articulate to myself in words what is causing that bad feeling. For example, if I feel anxiety about a business deal I try to figure out if there is a real threat, or if I am just afraid of the unknown. Unfortunately, for people with lots of purpose routines that have been polluted negatively, it will take a long time to “clean” your purpose routines that have been wrongly polluted.\n\nAnxiety is not the only negative emotion that colors our thoughts: guilt, shame, depression, jealousy, also hijack our purpose routines and beliefs. These other negative emotions mix with anxiety to create a terrible mixture of false beliefs, falsely tainted purpose routines, and constant negative thoughts and emotions. Cleaning this mess is extremely difficult because our false beliefs and purpose routines layer on top of each other over the course of years, so to “fix” ourselves we must unwind each layer with our conscious mind, reprogram our mind to see it as positive, and then move to the next layer. This process can be very difficult and time-consuming, which is part of the reason you should not bother with damaged women.\n\n**The Unknown**\n\nAs our brain builds maps of the world and purpose routines to navigate those maps, it must deal with the fact that much of the world is simply unknown to us. The unknown contains the two main things which cause anxiety: 1) potentially infinite threats and 2) infinite potential paths. Our brain needs to know which path to take, so it runs the regular anxiety program when faced with the unknown: we freeze and slowly try to gather information so we can figure out which path to follow.\n\nThe Bible says that the human desire for knowledge of the universe is a result of anxiety. When Eve was faced with threat for the first time (the snake), she felt anxiety and ate of the tree of knowledge of good and bad (evil is a mistranslation) so she could “become like God.” Eve probably desired to become God because she faced threat for the first time, felt unsafe, and wanted to defeat that threat. She then brought her anxiety to Adam and convinced him to eat the forbidden fruit as well. This was history’s first shit test, which Adam failed. Gaining knowledge of good and bad did not make Adam and Eve gods: instead, they became even more fearful.\n\nAristotle said that the highest and most noble pleasure for man is the desire for knowledge. But the Bible says that knowledge of good and bad (pleasure and threats) is useless if you do not have the courage to actually confront and defeat those threats. Without that courage, gathering more information will cause you to only become more anxious because now you know about more threats. When Adam and Eve gained knowledge of good and bad, they became afraid of everything. And interestingly, the first “threat” that Adam and Eve recognized was their own sexuality.\n\nI think the Bible is correct. It is true that one of our strongest emotions is the desire for knowledge, but that desire is caused by anxiety. We gather information so we can keep ourselves safe from threat and figure out what to do, but information gathering often just makes us more anxious. Anxiety-induced information gathering is a useful tool for animals exploring a physical environment, but it is less useful for humans trying to navigate the abstract map of their life. If we freeze and try to “gather information” to determine what to do next in our life, we may stay frozen forever because the information we need may never come, and even if it does come, we may not have the courage to actually face the threats on our path. Sometimes in life you need to just go for it and leap into the unknown, and sometimes you need to do so without having adequate information. Many people stricken with anxiety endlessly ruminate and never come to a conclusion because they do not have the information to decide what to do next or because they know the right path but ignore it because they see the threats on the way.\n\nAt the same time, the unknown can contain potentially infinite pleasure, so we have a deep and powerful fascination with the unknown and the transcendent.  No animal can survive without venturing into the unknown, so we evolved to want to explore the unknown and figure out what is going on in there. We always want to go beyond what we know, make the unknown “known,” and then go further into the unknown. In fact, the journey pleasure we get from venturing into the unknown is the strongest type of journey pleasure possible, because all the pleasure in the “known” world is finite, but the pleasure in the unknown is potentially infinite.\n\nThe strongest pleasure a human being can feel is the thrill of venturing into the unknown to create a future transcendent reality. Humans evolved to create things to guarantee ourselves and others pleasure in the future. But once our creations give us an easy path to pleasure, instead of enjoying it, we wish to venture into the unknown again. Humans inherently desire transcendence – the burning desire to go “beyond” whatever we have. This emotion is impetus for the human race’s insatiable desire to explore, innovate, and conquer, but as we will see, this desire is also the death knell for many friendships and romantic relationships.\n\nWe must venture into the unknown consciously and voluntarily, so we can create a path through it that reaches the pleasure but keeps us safe. Too much unknown overwhelms and cripples us because we cannot carve paths through it quickly enough to get to our goals. Too much order, we get bored. Humans literally evolved to feel best when exactly on the border of “chaos and order” as Jordan Peterson describes it. Similarly, “flow” occurs when we do something that lies just outside of our ability.\n\nThis desire to make order out of chaos is one of the strongest feelings that human beings can have. Humans love to find patterns in randomness, which is why we love music. When we hear a pattern in a song two times, we get a quick jolt of dopamine if we hear it a third time. However, it is also this desire to find patterns that causes people to become addicted to gambling or make stupid investments in the stock market. When the blackjack table or the stock market changes in a way we feel is a pattern, we feel like that pattern will continue, which causes us to bet on it. But casinos and the stock market are not designed to follow a pattern, so betting on the pattern will cause you to lose money. In fact, I strongly suspect that casinos and the stock market are purposely designed to act randomly or in the opposite of the expected pattern, so that sophisticated investors and casino owners can bilk poor saps that feel like they have found a pattern. \n\nAlthough humans’ strongest desire is to venture into the unknown, most people cannot do so because they are crippled by anxiety. As we will learn later, anxiety is alleviated by the alpha male.\n\n**The Dark Side of the Unknown**\n\nAlthough anxiety is always difficult to contend with, anxiety caused by the unknown is particularly crippling because your rational mind cannot help you. Your rational mind is an information processing machine, and can evaluate known threats or obstacles with information it previously gathered. But with no information our rational mind cannot help, which is why our emotions often take over when faced with the unknown. We also have no purpose routines that we can rely on for pleasure when faced with the unknown, so we are at the mercy of our negative emotions.\n\nMost people that have chronic anxiety are generally anxious of the unknown, not specific, identifiable threats. People with anxiety disorders often have too much unknown coming at them from all sides and cannot create paths through it fast enough. Their boss is an unpredictable asshole, their girlfriend is unstable, their friends are shitty, their own behavior creates more problems for them that it solves, and worst of all, they are simply unprepared for all the problems the world throws at them. The more unknown they face, the more they are crippled with paralysis, so the less progress they make, so the more unknown they are faced with. It becomes a vicious cycle.\n\nNo situation is ever completely unknown. Most situations we contend with are a mix of known and unknown elements, so our anxiety of the unknown can latch onto real “facts” to justify our paralysis. Anxiety never says “don’t move forward because you fear the unknown and you’re a pussy.” Instead, it says “you should not move forward because of reasons X, Y, and  Z,” and those reasons will sound perfectly rational and logical.\n\n**Fear**\n\nIt is important to know the difference between fear and anxiety because fear, if harnessed correctly, can be an extremely powerful motivator.\n\nOur subconscious mind will try to seek the clearest and easiest paths to pleasure, which often lead to things like drugs, pornography, and video games. Almost all higher purposes have at least some threat associated with them, and a purpose tinged with even a little threat may cause our subconscious mind to push us to take an easier path. Negative emotions like anxiety are generally stronger than positive emotions like journey pleasure, so we will give up on a positive reward like journey pleasure if there is even a little anxiety associated with it. This is why most people primarily chase lower pleasures rather than higher ones.\n\nOne way to force yourself to take the right path is to use fear. Fear is one of our strongest emotions, if not THE strongest emotion. Fear is even stronger than anxiety because fear indicates there is a currently present threat that will kill or destroy you if you do not immediately fight or run, whereas you feel anxiety when there is a potential, but yet unrealized threat. We will gladly run down a path littered with potential threats if there is an actual threat chasing us down that path. In ancient times the Roman army would punish disobedient, lazy, and timid soldiers so harshly that it was famously said that Roman troops were more afraid of their commanders than the opposing armies, which is why the Roman army was so courageous and successful on the battlefield.\n\nOur motivation is lowest when we see a threat blocking our way to the goal. It is highest when we see a clear path to the goal, and our fear is behind us, pushing us towards the goal. Therefore, if you are feeling unmotivated, or feeling motivated to do the wrong thing, you should create fear for yourself, either by focusing your thoughts and emotions on the consequences of not doing the right thing or by creating an abstract fear for yourself, like the fear of God. Without fear, you are prone to chase lower, easier pleasures rather than higher, more difficult pleasures.\n\nHumans place disproportionate weight on pleasures and pains that will occur in the short term, and we wrongly discount pleasures and pains that may occur in the long term. If I have strong pleasure available to me now, but the pain associated with consuming that easy pleasure will not occur until much later, my emotions will incline me towards the easy pleasure now. This is all the more prevalent when the later pain is abstract and difficult to conceptualize. For example, if ignore my training to chase easy pleasure now, I will not see the pain of that decision until I lose the championship game, which may not occur until many months from now. To motivate myself to train hard, I bring that future pain to the present.\n\nI am not saying that one should constantly feel the emotion of fear. The flight or fight response that fear produces is incredibly damaging and stressful on your body, and evolved to only be invoked in emergencies and for a brief period of time. If you have ever been genuinely afraid, like in a fight or a car accident, you know you cannot sustain that emotion for a long period of time. The fear that motivates is a rational understanding the short and long-term consequences of not pursuing the correct purpose, not an emotional response. For example, my industry is very competitive, and I know that if I do not work hard some upstart will take the top spot from me, just as I took the top spot in the past from the previous winners that became complacent. This is the same “fear” that causes me to not text and drive at the same time.\n\nArrogance and laziness are the result of too much unhealthy anxiety and not enough healthy fear. Arrogance comes from enjoying the pleasure that high status brings, and laziness comes from fear of the unknown. Arrogant lazy people enjoy feeling high status but fear the unknown, so they lie to themselves and others that their current purpose routines are good enough. But the world is constantly changing and the unknown is constantly encroaching, so you will eventually be defeated if you do not venture into it. A humble person doesn’t enjoy the pleasure of high status – he reaches for a higher pleasure – the pleasure of venturing forth into the unknown, knowing he will have to change his purpose routines to defeat whatever may lay therein.\n\nFear should not be your greatest motivator. Your strongest motivator should be the journey pleasure that comes from pursuing a grand purpose. But everybody is prone to becoming lazy and arrogant at some point, especially after we have accomplished something, so it is beneficial to have the ability to scare yourself to get back on track when necessary. Threat constantly surrounds us, and anxiety makes us reluctant to face that threat, so we sometimes need a stronger fear to force us to fight that threat. \n\nMost people in the modern world are motivated by fear, not by any grand purpose. They may enjoy some aspects of their jobs, but the main thing pushing them to wake up and go to work in the morning is the fear of losing their job, becoming homeless, and being rejected by their tribe, whatever that is. Journey pleasure is a rare and delicate flower that is hard to cultivate, whereas fear is a more solid and consistent motivator, which is why “self-motivated” people are so rare. In earlier times, people feared their father, their priest, their teachers, their society, their king, and their God, and this fear propelled them to pursue higher purposes. Nowadays, people fear dying and being homeless, and whatever their tribe tells them to fear (in LA, people fear being ugly, in SJW circles, people fear being called racist, etc…), so they are content with living a mediocre existence. The modern world makes a devil’s bargain with us: if we become a conformist slave, we will have nothing to fear. But by giving us nothing to fear, the modern world ensures we stay a conformist slave. This comfortable slave, who had no higher purpose, is Nietzsche’s “last man.”", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ea91pr/the_purpose_series_part_1_of_3_purpose_anxiety/", "title": "The Purpose Series (Part 1 of 3) - Purpose, Anxiety, Fear, the Unknown, and the Purposelessness Epidemic in Modern Society", "social_network": "reddit", "user": "Woujo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1576267441, "permalink": "/r/DecidingToBeBetter/comments/ea91pr/the_purpose_series_part_1_of_3_purpose_anxiety/", "nsfw": false, "first_save": 1635435828.7081833, "replies_charged": false}