{"id": "t5_2tand_t3_m7nstd", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Whenever i want to do something like studying or practicing a hobby or whatever, i often feel like i have to do it at \"the perfect moment\" or \"in the perfect order\", which prevents me from getting started.\n\nHowever when i sometimes DO get started, albeit casually (as in i feel like my \"brains not in it\" or \"im not ready rn\") for example reading an article in a foreign language or practicing drawing a certain body part or smth, i feel like i can't actually \"do it properly\" because im not being \"serious\" about it enough.\n\nLike i come across one sentence that i struggle a little with reading in a foreign language? Instead of persevering I'll just give up rn because obviously my brain isn't in \"work mode\" and continuing will just be detrimental to my progress, even though **starting casually can eventually lead me putting more effort and turning it into an actually useful practice session and even if i don't, I'll still make bigger gains in the long run than if i just sit here doing nothing because im apparently \"not ready yet\"  ** as if the stars aren't aligned right at this moment and that makes everything i do at this exact moment null and attempting is futile and ridiculous.\n\nIN ADDITION i also feel this way if i feel like i should have studied/practiced/etc something first and if i do something that feels like \"jumping the shark\" it's also null, completely impossible and might even harm my progress. \n\nBack to the foreign language example, im reading this article, it goes well for a bit, but then i encounter a grammar point i didn't study yet. I should read a quick definiton of how it works, try to understand the sentence to the best of my ability and move on, or even heck, just skip the sentence if its THAT confusing. But no, this is all wrong, im obviously not prepared to continue since i didn't go on a 2-hour research session to find out all the nitty gritty details of this exact grammar point and all the nuances it has and portrays in this specific sentence and all the sentences it will appear in afterwards.\n\nI wanna draw a character i like? Their clothes are baggy and im not good at drawing creases yet and haven't dedicated a full week of 4-hour sessions each day to understanding the intricacies of clothing folds, so i guess i won't draw them.\n\nI should study chapter 4 for a quiz thats literally tomorrow? I didnt properly study and ingrain every word in the first 3 chapters into my memory and even though doing that first would take me 20+ hours probably i absolutely **need** to do that first or im destroying the hierarchy that apparently exists and i can't break at all for some reason.\n\nAnd so on and so forth.\n\nSo basically, i feel like im not ready, im trying to do it anyway, but a thousand sirens are blaring in my brain telling me that *this is all wrong* and i end up freezing and giving up. What's even worse is that the times when \"the stars align\" and \"i have done all the prerequisites\" are so rare and few and far in between that they truly DO end up being basically null because i didn't put in consistent practice, and i usually end up overworking myself when the time \"is right\" anyway which scares me off doing this thing again for like the next 3 months or so.\n\nI know i should just **start before i feel like im ready** and that **motivation comes from action, not from waitng around for it** but even though i tell myself these things its still incredibly difficult to actually....do stuff. Whether it be things i love doing or things i *have* to do either way, since in either case there's also the issue of me wanting to do everything **as perfectly as possible** which is also detrimental, but i just can't stop.\n\nAny words of advice?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m7nstd/how_do_i_do_things_without_feeling_like_my_effort/", "title": "How do i do things without feeling like my effort \"doesn't count\" because im not putting my all into it?", "social_network": "reddit", "user": "Daisukideku", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1616062821, "permalink": "/r/DecidingToBeBetter/comments/m7nstd/how_do_i_do_things_without_feeling_like_my_effort/", "nsfw": false, "first_save": 1635438005.4589005, "replies_charged": false}