{"id": "t5_2tand_t3_lbl9ns", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "Hi, I just saw this subreddit earlier, and I figured aside from a therapist, y'all could help me. I've just started to have a relationship with this girl, but due to some circumstances, we cannot have a romantic relationship just yet. We were sweet to each other, giving gifts, calls that last almost half a day. But because of this \"circumstance\" I'm talking about earlier, we grew apart. We love each other, but we don't talk much anymore. I obviously wanted more, demanding for some quality time with her. I talked to her nicely, but it still feels pretty demanding. I had a problem with it but I try my best to put myself in her shoes. Time passed, and I didn't mind about it too much anymore. Just talking to her at all is enough. \n\nBut my toxicity worsened when she had these new sets of friends where it's all guys (I didn't mind it, as long as she's happy with them). But then I found about about this one guy who definitely is into her. I told her about it and she said that he isn't into her and is in love with somebody. Of course, after that, I tried to understand it, but I can't because she spends time mostly with him than with me. Then my jealousy grew when he used a photo of her as his discord icon. It definitely wasn't a problem if not for the fact that he practically wrote on his custom status that he's into her. I then confronted her about it, and she said that she rejected him, and that's his way of coping up from rejection. I was incredibly suspicious back then and weeks later I told her that I'm hurt seeing them on a call on this certain discord channel every single day, and said that she doesn't have any romantic feelings for her.\n\nShe got pissed. She said that I was controlling, but I didn't get why. I tried to search on google (as I don't have the money for a therapist), and I got some advice, but I know I seriously needed help from a licensed therapist. Days after, I did a stupid thing and asked his brother, who is also my friend, about something, and she got seriously mad at me for overstepping her boundaries. She told me she doesn't love me anymore. And that's when she stopped talking to me.\n\nBut then a week later, she told me she still loved me, and she said that she only said that because I was seriously having a hard time dealing about those problems. Now, I said to her that she still didn't tell the guy to stop using her pics as his discord icon. She completely misunderstood though, maybe because I suck at talking to people properly, and everything I say always tend to get misunderstood. She thought that I asked her to lessen their \"closeness\" and got angry at me, saying that she told me again and again about that thing. I just can't let go about it and that's how I realized I've been controlling.\n\nI realized that I'm jealous when we're not even a couple (yet, maybe never at this rate), and I tend to ask her silly things (like that thing where I want her to talk about the guy to change his discord image of her), and many more. \n\nI am asking for your help because I don't want this relationship to end, and I am seriously very close to doing that. This is my final option (with therapy option unavailable because of financial issues), so I hope you can help me fix or improve this toxic attitude of mine.\n\n&#x200B;\n\ntl;dr: I keep pestering her about petty shits and I am feeling jealous about something and came here with the hopes of improving my personality.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lbl9ns/tips_to_improve_from_being_a_toxic_person/", "title": "Tips to improve from being a toxic person", "social_network": "reddit", "user": "KaitoDaimon21", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1612350383, "permalink": "/r/DecidingToBeBetter/comments/lbl9ns/tips_to_improve_from_being_a_toxic_person/", "nsfw": false, "first_save": 1635436859.2325683, "replies_charged": false}