{"id": "t5_2tand_t3_opvnvq", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "This year I told myself that when I graduate I will earn my first 6-figures.\n\n&#x200B;\n\nI know it is a lofty goal for a senior in college but I have somewhat of a leg-up:\n\n* I have been doing design (self-taught and helping others) since middle school\n* Quick learner when it comes to social media and technology\n* And love developing systems\n\nI had this goal before but the system-creating and work ethic wasn't there. As I am graduating college, I only have until the end of the year or else I will be homeless.\n\nCan't go back to the quiet dorm life to blowing my brains out at the fam's house.\n\n**I am not going back.**\n\nI was temporarily homeless before- it was hard in terms of the cold but the ability to NOT hear my family's nagging gave me a peace of mind.\n\nAs I am graduating some amazing realizations happened:\n\n* I could be comfortable in my body (I'm a guy)\n* Cutting bad/non-communicative friends is part of life\n* Can't rush love/ getting over heartbreak\n* A support system is important (reason I am here)\n\nI believe I can. I am positive and determined about this. Haven't felt like this since last year. 7 months of stagnation wasn't all for nothing. I feel, clear. Not wired. Nor sad. Just clarity and certainty. \n\n&#x200B;\n\nI know my work ethic needs to go through the roof  in addition to my diet but I am grateful to start on the first step of realizing *for myself* I can do it.\n\n&#x200B;\n\nI'm ready!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/opvnvq/switching_things_up/", "title": "Switching things up...", "social_network": "reddit", "user": "LongjumpingNitro0", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1627017785, "permalink": "/r/DecidingToBeBetter/comments/opvnvq/switching_things_up/", "nsfw": false, "first_save": 1635437461.4599261, "replies_charged": false}