{"id": "t5_2tand_t3_c3z1ku", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "Last night a taxi driver refused to take me to my destination before I even entered the vehicle. Out of frustration I said an expletive in the local language before closing the door. He took it personally, went ahead and parked his car and came back to confront me.\n\nKeep in mind, this was a busy street during rush hour. While I'm standing there looking for another ride (4 minutes later) he shows up and attempts to punch me. I initially didn't get why he was making such a big deal of it but then realized he was thinking of what I said in the literal sense and I apologized immediately. But he didn't hear me out; seemed like he really wanted to hit me. He tried twice and got my face the second time, my glasses went flying. The 3rd time I gripped his hand and said \"that's enough, I've apologized for it and I'm just trying to get home.\"\n\nI hope I always stay this calm. I have anger issues, I do punch walls, break things and scream to vent. If this altercation had happened 3 months ago it could have turned really ugly. I am proud of myself for de-escalating the situation (granted he still landed a blow). I'm proud of my reaction, despite getting my glasses knocked off my face. I have, in the past, viewed posts on r/publicfreakout and imagined what I would do if I was being attacked. I'm very surprised that my instinct was not to hit back but apologize and move on. I took another cab ride home and struck up a fun conversation with the new driver. It was all good. I'm going to continue meditating to keep myself mentally strong.\n\nTLDR: I curse at an Uber driver. He confronts me about it 4 minutes later and hits me in the face. I apologise and move on. It wasn't worth my time. I feel proud.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/c3z1ku/i_got_hit_in_the_face_for_the_first_time/", "title": "I got hit in the face for the first time yesterday and I'm surprisingly calm about it.", "social_network": "reddit", "user": "prog-nostic", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1561263352, "permalink": "/r/DecidingToBeBetter/comments/c3z1ku/i_got_hit_in_the_face_for_the_first_time/", "nsfw": false, "first_save": 1635435789.9987876, "replies_charged": false}