{"id": "t5_2tand_t3_q7s52d", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "For context, I am 21 years old, currently in the final year of doing my law degree. I'm about to word vomit my whole life like a poorly written autobiography to explain my problem at the moment.\n\nBack then even in kindergarten, I was an overachiever. Not because I strived to be one but I suppose I just had it in me to excel academically. This went on in primary school where I received award for everything I did, honorary student, school representative for a lot of stuff, student body president. \n\nGoing into secondary school with straight As, I still excelled in in most stuff but had average grades with some subjects. I became less active but that was all fine because my studies were still alright. At that point in time, I didn't have to study hard and I would still be able to do great if not alright in my exams. Sometimes I didn't study at all and would still be able to score As or at least B+, which was fine to me. \n\nMy parents were never really the super strict, must make my children become a doctor/lawyer/engineer etc. type of parents. They are quite supportive and as long as my siblings and I make a rational decision and get our degrees, they'd be fine with it. They're involved and always regularly ask me how I'm doing with my studies but they didn't force me to do my homework in front of them or anything. As long as I get my stuff done, they're alright with whatever I'd be doing.\n\nFast forward, after high school I decided to take up a law foundation course in a good public university, like A-Levels. It was only for a little less than a year but I think it changed my life a lot. Not sure in a positive or negative way. It was the first time I had to live away from my family (albeit not THAT far away considering it was only a 50 minute drive). After being there, I learned that I succumb to peer pressure very, dangerously easily. I'm not talking about alcohol, drugs or anything but just going out a lot, hanging out with friends until the next morning and stuff like that. Resulted in poor or basically absence of time management. I never skipped classes and would pay attention but I realised that I can't go by without studying like I did in school. Which was rather blatantly obvious. When the time from exams came, I did study and scored average grades which I didn't think much about. Just continued to live through the rest of the year that way. I finished the course with a 3 pointer, which was actually not at all bad, BUT did not easily get me into the law school that I wanted. Or any other law schools I had in mind.\n\nWhere I come from, public universities have the best law schools. Once I realised I couldn't get into any one of them (or the ones I actually wanted to go to), my next option was a private uni. Which is the one I'm in right now. It's a great law school but I think the fact that I failed to go to the universities I thought I'd be in, brought my whole perspective of who I was to a different level.\n\nMy whole life before that I had no problem scoring and wherever I thought I'd get into, I would cause my grades allowed it. Until degree time, then it's like I have to cope with whatever options I'm handed which I never needed to do before. I don't know how this is coming across but I do not at all mean to sound privileged or entitled, just that fact that I'm suddenly no longer the overachiever that I was. Heck, my performance in academics were just getting worse until it hit me when it's too late.\n\nNevertheless, I still went to classes, tried my best to digest everything I'm learning. Until the pandemic hit then we had to move to online classes like everyone else. Fast forward, my first finals. I failed one of my papers which I never really have done before (other than add maths but that's a different story).\n\nI had a major breakdown. I didn't know what to do and since then I think I have a resistance to studying where I would sit down and plan to study, but I wouldn't be able to focus and end up doing almost everything else BUT studying. Around this time last year I think? I started to develop some physical symptoms of anxiety, I had trouble breathing, tremors and for some reason I started to get caffeine sensitivity too which was strange because I had no problem drinking coffee back when I had to go to physical classes. Then I got some medicines which helped and since then I just learned to manage the symptoms when it comes and it hasn't been to bad.\n\nHowever I still have a major resistance to studying due to negative feelings I have associated to it and I was wondering if anybody can help me figure out what is wrong with me or if there's anything I could try that would slowly help me rebuild my life so I wouldn't feel like there's no way for me to improve for the better. Please. I'm also very sorry if I'm not making sense or if I blabbered on too much.\n\nI actually have a paper in less than an hour so please pray for me!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q7s52d/i_hate_that_i_am_not_who_or_where_i_thought_i/", "title": "I hate that I am not who or where I thought I would be when I was younger", "social_network": "reddit", "user": "skywalkerwyd", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1634184828, "permalink": "/r/DecidingToBeBetter/comments/q7s52d/i_hate_that_i_am_not_who_or_where_i_thought_i/", "nsfw": false, "first_save": 1635437840.8250024, "replies_charged": false}