{"id": "t5_2tand_t3_e43woq", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290"], "text": "I have been to therapy many times. It began in my early twenties, when I was struggling in college. I have seen about five different therapists in my lifetime, with the longest being in it for a year, others averaging around 3 or 4 months.\n\nIt was one bad experience after the next.\nIn college no one seemed to take me seriously. One recommended that I join Facebook and got irritated at me when I didn't. She also had me doing weird activities like matching emotions and feelings on a door with note cards and Scotch tape and complained I wasn't eager to participate. It didn't make any sense...and the next just sat and listened the whole time, and looked at me like my problems were trivial and didn't really care or offer any advice. The next was half way decent. She helped a bit with anxiety, but left for whatever reason. And a few months afterwards my anxiety went right up and back to what it was. The fourth one looked at me and flat out told me college would be impossible because I couldn't get my act together. Ok, I walked out on her and here I sit with an advanced degree. The last one I saw was nice, offered some words of wisdom,and I liked him, but it never really helped.\n\nFast forward, I thought I have body dysmophic disorder (I know I definitely have anxiety and depression and am suffering from a traumatic childhood) or at least I look at myself and see something totally different than what other people see, as in I think I am very ugly, but not. Just average, maybe slightly above when in shape and with makeup. Anyways, I read a book on body dysmophic disorder that was a workbook with CBT. It helped a lot. I felt good about myself...but I returned to old thinking patterns about a half a year later \n\nI am sitting here because I know I need help. But I don't know what to do. I was looking at Talkspace, but with a 50 percent off coupon it is still 50 dollars a week with unlimited text to a therapist and one live session per week. Which is cheaper than what my copay is... Which is 60 a session. Yikes. Therapy is a small fortune...\n\nIf it is as bad as the last ones I have had, I will waste my money and not get anything out of it. \n\nI thought about doing CBT on my own in a journal with worksheets off the internet as I had good luck with CBT on my own in the past instead of seeing a therapist.\n\nI have also thought about doing EMDR therapy (I have had a traumatic childhood and a lot of problems also stem from this as I seem to keep reliving it) and have found some therapies online that walks one through it at a cheaper cost than seeing a therapist as insurance does not cover it.\n\nAny advice on what to do with regards to therapy? Is it worth it? Has anyone had any luck with it?\n\nAlso, any thoughts on treatments that do not include talk therapy? What have other people found that helped? Here are my thoughts:\n\nI have anxiety which spiraled down into depression right now. I think it is more situational. My doctor gave me an antidepressant, but I also hate those as I gain weight and end up mentally worse off, due to the added weight...as I have self image issues. I have not taken it. I don't think I will.\n\nI thought about CBD oil and edibles, but I don't know if that will help either. I was going to use CBD more for maintence for anxiety and edibles for an acute anxiety attack.\n\nAlso, I have been considering TMS for anxiety and depression. I have read it is now covered by most insurances.\n\nExercise has helped my anxiety in the past. Only not just an hour a day, but I require two hours a day of intensive exercise which includes cardio and weight lifting. I did this for a couple months a few years ago and was a completely different person. No anxiety whatsoever. The only problem is, I don't have time for this. Maybe an hour a day, but somehow 2 seems to be the magic number.\n\nTLDR:\nI am open to any advice.   In conclusion, intensive daily exercise and CBT on my own seems to have only ever helped me. Seeing a psychologist never really had and has been a waste of money. Plus, I am unsure of other treatments for anxiety and depression and how effective they are.  I don't know what to do but know I need help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/e43woq/should_i_seek_counselingtherapy_again_for/", "title": "Should I seek counseling/therapy again for anxiety/depression? And advice needed on other treatment methods...", "social_network": "reddit", "user": "GreenLeavesTurnBrown", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1575149828, "permalink": "/r/DecidingToBeBetter/comments/e43woq/should_i_seek_counselingtherapy_again_for/", "nsfw": false, "first_save": 1635436649.5747576, "replies_charged": false}