{"id": "t5_2tand_t3_mrw63s", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Happiness is not the same for every people. One may derive happiness from a booming career, while others may get it from having a successful family life. But no matter how each person differs in definition, everybody would want to feel this way.\n\nPeople are at their best when they are happy. It radiates out of them like an aura of positive vibes. However, not all people are blessed to be entirely happy. This sadness can be caused by a traumatic incident, a bad news or an emotional crisis. If you are one of those people, remember that the darkest hour is always before the dawn.\n\n## How to be Happy in Life\n\nSo you have admitted that you are sad and in need of some mood boosters. The next thing that you have to do is follow these easy steps to be happy:\n\n**1.    Be thankful** – A grateful heart never hates. You should be grateful for all the blessings you have received. Through this, you will appreciate the beauty of life.\n\n**2.    Do what’s right** – This is one of the timeless ways of how to be happy in life. Though it may seem idealistic for others, the fact remains that doing the right thing brings a sense of happiness and fulfillment. Surely, you would commit mistakes – you are only human. But at least try to do the right thing most of the time. After all, you’re not a rational being for nothing.\n\n**3.    Go out with your family/friends** – Whenever you’re sad, always remember that you have your family and friends to go to. A quality time with them might just be what you need!\n\n**4.    Do some productive activity** – Move around and do some productive stuff! This will make you feel fruitful and help you forget your problems. Exercising is one of the best ways to move around as working out produces endorphins (a hormone that makes you happy). You get to be fit and sexy as a bonus!\n\n**5.    Rest well** – After doing some activities, find the time to rest. This is very important as your body needs rest to be able to function well. Moreover, it gives your mind a break from all the stress.\n\n**6.    Go with the flow** – This is the final step towards being happy! Just keep in mind that there are things that you can’t change. Those things are the ones that you need to accept. Don’t unnecessarily stress yourself with these things. Just accept them as they are and go with the flow!\n\n## Benefits of being happy\n\n**1.    Good for the health** – There is no question about this. Laughter is the best medicine, remember? Happiness reduces stress which is harmful to your health.\n\n**2.    Longer life** – Happy people tend to live longer than unhappy people. This is not only because suicide rates are higher in unhappy people (definitely), but also because happiness leaves your health in superb condition!\n\n**3.    Positive impression** – Being all smiles all the time creates a good impression for people around you.\n\n**4.    Success!** – Happy people are likely to succeed. Other people are drawn to them and as a result, more opportunities become available to them than to those who are unhappy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mrw63s/how_to_be_happy_in_life_some_tips_and_benefits/", "title": "How to be Happy in Life- Some Tips and Benefits", "social_network": "reddit", "user": "Animasur", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1618548917, "permalink": "/r/DecidingToBeBetter/comments/mrw63s/how_to_be_happy_in_life_some_tips_and_benefits/", "nsfw": false, "first_save": 1635435573.5545268, "replies_charged": false}