{"id": "t5_2tand_t3_oz9xgx", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I find myself in a place where I barely feel interested in anything. I'm well-educated, I've got a shot at a very perspective career, I've got interesting hobbies and I'm very good at whatever I do. Yet none of it seems to matter because I'm depressed and just feel burnt out, and probably have been feeling like that for years just forcing myself to do things. I cannot imagine myself not feeling burnt out anymore. I like things that I do on the daily basis, I'm generally satisfied with who I am and how my life is going. But still every day when I wake up I need to force myself to get out of bed because I feel so extremely weak physically and so empty emotionally. I tried to remember what makes me happy, and well... I do all the things that used to make me happy, they just no longer do. I've been playing music for 15 years now, and when I was a teenager, I remember dreaming about writing a full song and showing it to people. Well, I did, I've literally accomplished the dream that I had, and not because I dreamt of it back then but because even 15 years later, I am still passionate about it. I moved from a shithole of a country where I was born to the country that I truly love and where I want to stay. I've got a degree from one of the top universities in the world, got a job where I want to succeed because I feel drawn it.  All's so good on the surface, I'm a step away from the life that I desire yet none of that brings me any joy. \n\nI tried taking a break before, just getting several weeks of rest and clear my mind but that didn't help at all. I want to be active, I want to pursuit what I want and like, and I know I'm totally capable of that. I also know that I'm suffering from a pretty bad depression, and I've been working with a therapist for several years now, and she's great, I think I got very lucky to find a great therapist so fast. She does whatever she can but I can't always rely on her. I want to put in more effort on feeling happy and fulfilled again, and I know I can. I just don't know what to do, so maybe any of you can help me with an advice. \n\nWhat did you do find more meaning in what you do and feel happier?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oz9xgx/how_did_you_overcome_burnout/", "title": "How did you overcome burnout?", "social_network": "reddit", "user": "1acc_torulethemall", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 30, "down_vote": 0, "creation": 1628266678, "permalink": "/r/DecidingToBeBetter/comments/oz9xgx/how_did_you_overcome_burnout/", "nsfw": false, "first_save": 1635436706.9088442, "replies_charged": false}