{"id": "t5_2tand_t3_b7rj4x", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": " \n\nA monk lived near the temple of Shiva. In the house opposite lived a prostitute. Noticing a large number of men who visited her, the monk decided to speak to her. “You are a great sinner,” he said sternly. “You reveal your lack of respect for God every day and every night. Do you never stop to think about what will happen to you after your death?”\n\nThe poor woman was very shaken by what the monk said. She prayed to God out of genuine repentance, begging His forgiveness. She also asked the Almighty to help her to find another means of earning her living.  But she could find no other work and, after going hungry for a week, she returned to prostitution. Each time she gave her body to a stranger, she would pray to the Lord for forgiveness.\n\nAnnoyed that his advice had had no effect, the monk thought to himself: “From now on, I’m going to keep a count of the number of men who go into that house, until the day the sinner dies.” And from that moment on, he did nothing but watch the comings and goings at the prostitute’s house, and for each man who went in, he added a stone to a pile of stones by his side.\n\nAfter some time, the monk again spoke to the prostitute and said: “You see that pile of stones? Each stone represents a mortal sin committed by you, despite all my warnings. I say to you once more: do not sin again!” Seeing how her sins accumulated, the woman began to tremble. Returning home, she wept tears of real repentance and prayed to God: “O Lord, when will Your mercy free me from this wretched life?”\n\nHer prayer was heard. That same day, the angel of death came to her house and carried her off. On God’s orders, the angel crossed the street and took the monk with him too. The prostitute’s soul went straight up to Heaven, while the devils bore the monk down into Hell. They passed each other on the way, and when the monk saw what was happening, he cried out: “Is this Your justice, O Lord? I spent my whole life in devotion and poverty and now I am carried off into Hell, while that prostitute, who lived all her life steeped in sin, is borne aloft up to Heaven!”\n\nHearing this, one of the angels replied: “You thought that God’s love meant judging the behavior of your neighbor. While you filled your heart with the impurity of another’s sin, this woman prayed fervently day and night. Her soul is so light after all the tears she has shed that we can easily bear her up to Paradise. Your soul is so weighed down with stones it is too heavy to lift.”\n\n \n\n**Lessons from this story:**\n\n* What the monk did in the story also some people do in business. We all have or had that one coworker who focuses more on what other people do/did then what they themselves do. They easily see others mistakes (even if they are not) and they make sure to spread the “word” to everyone about it. When leaders let this happen they have lost the battle for a successful and healthy company/team culture.\n* People should first be mindful about themselves and their actions. Even if it’s true spreading gossip or harmful truths about others will let other people know they can’t trust you (if you talk bad about people not in the room, it is only a matter of time when you will talk bad about “me”).\n* Counting mistakes of others mentally ways you down more than it does the ones who are making them.\n\nYou can find more stories at:  [https://purposefocuscommitment.com/category/stories/](https://purposefocuscommitment.com/category/stories/) ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/b7rj4x/counting_the_sins_of_others_while_not_seeing_your/", "title": "Counting the sins of others while not seeing your own - mindset story", "social_network": "reddit", "user": "PrposeFocusCmittment", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1554060036, "permalink": "/r/DecidingToBeBetter/comments/b7rj4x/counting_the_sins_of_others_while_not_seeing_your/", "nsfw": false, "first_save": 1635437185.4396164, "replies_charged": false}