{"id": "t5_2tand_t3_p2idw8", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Day 9 of being a better person. Today I had a hard time getting out of bed. I had a rough night of dwelling on things after reading a reddit post about breakups(see below). I certainly let my emotions get the better of me. Today I spoke with my girlfriend and asked if I could see her tonight. She then told me that her friend had scheduled a therapy appointment for her. This is something we had talked about for her to do for a while now. I was pretty taken back that she did not tell me about this up until the day of. In my mind, it is the glaring realization that I am not that person for her to confide in. Not really her partner, nor the collaborative team I had hoped we'd be at this point in the relationship. I am not really upset about this, nor did I cause a fight over this. Its things like this that make me question why Im in this. \n\nToday I will work out chest/Tri's. I made some vegan eggs, oatmeal, and a greek yogurt for breakfast. I am hoping that I will see my girlfriend later today to talk or maybe not talk at all and just have fun. I received praise at work today, which is a nice thing to escape to. \n\nToday I meditate on the thought that although theories are clean cut, situations rarely are. How to take on situations head on and move past them. Often times I feel that  I spend more time planning than actually executing. While planning is important, without folowthrough, there is no point. There are more factors that can contribute to an outcome that can be accounted for.  What's important is how you respond to the unknown and persevere. Or.. how you respond to a situation that you are not in control of. \n\nThank you for reading.\n\n&#x200B;\n\n&#x200B;\n\n[https://www.reddit.com/r/BreakUps/comments/kcts7l/30\\_things\\_i\\_learned\\_from\\_my\\_last\\_relationship/](https://www.reddit.com/r/BreakUps/comments/kcts7l/30_things_i_learned_from_my_last_relationship/)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p2idw8/day_9_deciding_to_be_better/", "title": "Day 9: Deciding to be better", "social_network": "reddit", "user": "Ohboyburgers", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1628704712, "permalink": "/r/DecidingToBeBetter/comments/p2idw8/day_9_deciding_to_be_better/", "nsfw": false, "first_save": 1635437987.0754387, "replies_charged": false}