{"id": "t5_2tand_t3_kytlpk", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "A vulgar yet authentic book on a different approach to finding acceptance and contentment in life. The best-selling author, Mark Manson, shuns the positivity forced upon us from mass media. He provides some mindset changing and honest advice to stop giving a f\\*\\*\\* so much. Just wanted to share my takeaways. So here are the 10 takeaways: \n\n&#x200B;\n\n* **1. Feedback Loop From Hell:** A cycle where you feel a certain way about something which repeats in a loop. It is often negative feelings such as guilt, anxiety, and fear. We need to accept those feelings rather than ignore it.\n* **2. Life is suffering:** It is in our biology to suffer but adversity makes us stronger. Sadly, most people respond with denial or victim mentality. We need to find acceptance and solve problems we encounter. And then happiness will come.\n* **3. Choose the right values:** Measure yourself based on your own metric rather than comparing yourself to someone else. Refer to the following:\n* Good Values are:\n   * 1) Reality-Based\n   * 2) Socially constructive\n   * 3) Immediate and controllable\n   * Examples: honesty, creativity, innovation, vulnerability, standing up for yourself, curiosity, and humility.\n* Bad Values are:\n   * 1) Superstitious\n   * 2) Socially destructive\n   * 3) Not immediate or controllable\n   * Based on externals\n   * Examples: popularity, dominance, center of attention, being rich, and sacrificing animals.\n* **4. You are not special:** Most people are entitled. Technology makes us think we need to be exceptional. Accept that it is okay to be mundane and normal.\n* **5. Just do something:** Inspiration and motivation comes from taking action. So just do something no matter how small it is.\n* **6. Certainty is the enemy of growth:** Question if you’re wrong and admit it when you are wrong. Let go of your past self in order to learn and grow.\n* **7. Embrace the struggle:** Figure out what pain you are willing to take to achieve the outcome you want. Fall in love with the process, not outcome.\n* **8. Failure is the way forward:** Our upbringing makes us afraid of failure. But it is in failure where we gain resilience and strength.\n* **9. Stop glorifying toxic relationships:** The culture we have today idealizes romance of a victim and saver. We need to take full responsibility, support each other and make sure the relationship is not conditional.\n* **10. Thinking of death will liberate you:** Figure out what mark you want to make on this world. We need to care abut something bigger than ourselves.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kytlpk/10_takeaways_from_the_subtle_art_of_not_giving_a/", "title": "10 Takeaways From “The Subtle Art of Not Giving a F*ck” by Mark Manson", "social_network": "reddit", "user": "improvewithsoo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 35, "down_vote": 0, "creation": 1610838168, "permalink": "/r/DecidingToBeBetter/comments/kytlpk/10_takeaways_from_the_subtle_art_of_not_giving_a/", "nsfw": false, "first_save": 1635437258.5962489, "replies_charged": false}