{"id": "t5_2tand_t3_jvnxgr", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": " Two snakes basked in the sun one day. Suddenly, a round object landed between them. The first snake grinned, believing the object to be a delicious egg. Upon pointing this out to the second snake, the first proceeded to unhinge its jaw and begin the process of ingesting its new meal. The second snake laughed at the first, declaring that it was not an egg, but that it was in fact a stone. The first snake laughed in turn, calling the second snake blind and ignorant, for obviously the object was no stone. The two bickered for a time, insulting one another. Finally, the first snake hissed and defiantly placed its mouth around the object, beginning the long process of swallowing its meal. The second snake scoffed, then sat smugly, intent to watch the first snake choke as a result of its own idiocy. The first snake also sat smugly, watching the second snake with satisfaction, knowing that the other snake was clearly too dumb to be able to provide meals for itself, and that it would be better off going hungry.\n\nYou yourself may be wondering which of the two snakes was right. You may be surprised to know that both were correct. The second snake was correct in that the object was not an egg. The first snake was correct in that the object was not a stone. Both snakes, however, were also incorrect, for the object they had found was a grenade, and both ended up paying the price when it abruptly exploded.\n\n  \nLet us not be so quick to judge others as ignorant merely because they have a different opinion than we do. There is no productivity in petty name-calling and insult. Public discourse ought to help us understand the opinions, dreams, and fears that our fellow humans hold. If we really wish to progress, we should focus more on understanding each other than on outwitting and besting each other. Reaching the best solutions to problems often requires a deeper understanding of all sides of the issues at hand.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jvnxgr/a_fable_about_dealing_kindly_with_those_whose/", "title": "A fable about dealing kindly with those whose opinions differ from ours", "social_network": "reddit", "user": "Ontrox358", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1605593450, "permalink": "/r/DecidingToBeBetter/comments/jvnxgr/a_fable_about_dealing_kindly_with_those_whose/", "nsfw": false, "first_save": 1635438134.2297053, "replies_charged": false}