{"id": "t5_2tand_t3_nq7wom", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "When I get depressed I end up staying in bed all day, and sometimes sleep between 10-14 hours a day. I could never maintain an exercise habit when I lived in my tiny basement apartment.\n\nI moved back home with my parents because at the end of January, I went to court to testify against my rapist. It was hellish. Since then, my PTSD symptoms have relapsed to almost as bad as they were at the time of the assault four years ago.  I could no longer work or basically function, so I sheepishly moved back home with my parents. \n\nIn the past, they were generally been dismissive with attitudes such as “you just need to get over it.”  or “don’t let him take more away from you. Although since I’ve moved back home, they have been woken up by my nightmares, my crying at night, and they’ve also witnessed just how hard I work to combat all my illnesses.\n\nI’ve had a hard time with making exercise a regular habit because of my ptsd. I’ve had panic attacks at the gym, I’ve had rage or panic induced from a hard run on the treadmill, sometimes even something like yoga can trigger feeling discomfort in my body and flashbacks. I never really liked working out from home, for some reason there was strong repulsion to the idea. \n\nIn spite of these challenges, I took it slow. I started off with walking on the treadmill for 10-15 minutes 2-3x a week. Now I’ve got a routine of strength building exercises, cardio, and stretches.\n\nI’ve been tracking my progress on my Fitbit and I am so proud to say I’ve been exercising 2-3 times a week for 6 weeks! I know it doesn’t sound like much, but for me this is huge. I actually like how exercise makes me feel. I jog and run on the treadmill!!! And I hope that in the next while I will be able to feel the antidepressant affects of exercise in the long term!\n\nWhen you are depressed, it’s really easy for your mind to ruminate on what’s wrong with yourself. Today I choose to celebrate a win. Thanks for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nq7wom/i_have_ptsd_and_depression_and_i_set_a_goal_back/", "title": "I have PTSD and Depression and I set a goal back in April to exercise 2-3 times a week. In spite of an month long depressive episode in May, these last 6 weeks I hit my target!", "social_network": "reddit", "user": "shelikesprettythings", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1979, "down_vote": 0, "creation": 1622590789, "permalink": "/r/DecidingToBeBetter/comments/nq7wom/i_have_ptsd_and_depression_and_i_set_a_goal_back/", "nsfw": false, "first_save": 1635436301.4078453, "replies_charged": false}