{"id": "t5_2tand_t3_4j4ih2", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Hi Reddit. I'm in a rut and any input is appreciated. I graduated two years ago with a bachelors in English literature and I'm also at a high intermediate level of Spanish, both speaking and writing. After college I lived in Spain for a year working as a teaching assistant in an elementary school and also as a sort of teacher/consultant for businesses working with British customers and clients. I'm on my 6th month now working as a technical writer for a woodworking machinery company making technical documentation, copywriting, and editing scripts for commercials (well, YouTube commercials). I really, really, really can't stand my job though. I sit in a tiny room with four other people—no windows and in unbearable silence—working on tedious tasks. I get very, very little satisfaction out of my job and want to do something else. I'm not even making that great of money. I've gained a little weight since starting there, but the real health concern is that I'm sitting in silence all day. Oddly enough, I'm just  complacent. The 22-year-old fresh out of college me when punch myself in the nose if she saw this shit.\n\n\nI've always been interested by languages and culture. I'd love to do research for a living (good luck, right?). Either that or shoot for law school (just started studying for the LSAT). I am an ENTP and need some sort of face to face interaction in order to stay sane. I got more satisfaction as a waitress/bartender than my current job because I got to do things with a touch of my own creativity. I had the opportunity to make people feel good and enjoy themselves and took pride in my work. Yes, I get it. Waitressing isn't a career-career but it did make me happy and paid my way through college. ***made me happy.\n\n\nAnyways, I've been escorting on the side. I do that about two days a week and make about 1000 to 1200 dollars. All together this is about double my income as a technical writer (I don't live in a big city). I'm considering moving to the city (I'm about an hour away) and 'starting over' (that's where I escort). I applied to two graduate schools in the UK for African Studies so that I could get my way into the foreign service or just booze around Senegal doing academic shit. Anyways, my question for Reddit follows:\n\nHow to I develop the confidence to chase the real me? How did I become complacent? Does it get easier and easier to give up on dreams as we age?\n\nI added this which was a response to someone's comment about escorting.\n\nI do understand that many people go into sex work for the wrong reasons. I considered it for many years. In fact, I wish I had started earlier. It's incredibly empowering. I've only been doing it for about 3-4 weeks and I've already met the most amazing people. They offer amazing life advice, perspective, and encouragement. And many of them were FANTASTIC lays.\n\nI mentioned it in my post because I want to emphasize that money—for the first time in my entire life—is not a problem. I'm a frugal person by nature so escorting for just a few days one week pays for all of my expenses for the entire month. It's pretty great actually. This cardiologist the other day...\n\noh\n\nmy\n\ngod.\n\nAnyways, I took the job that I have now because of money problems. I settled. It was the first offer so I took it. The job itself is.... okay but the company and lifestyle there is incredibly dreary. So, to recap my original post—I'm trying to find my purpose. Now that I don't have to worry about money, what do I do? How do I remember what I loved as a child? Where did all those dreams go?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/4j4ih2/hate_my_job_escorting_on_the_side_so_i_can_move/", "title": "Hate my job. Escorting on the side so I can move to the city.", "social_network": "reddit", "user": "somatic-static", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 44, "down_vote": 0, "creation": 1463110526, "permalink": "/r/DecidingToBeBetter/comments/4j4ih2/hate_my_job_escorting_on_the_side_so_i_can_move/", "nsfw": false, "first_save": 1635436073.5600119, "replies_charged": false}