{"id": "t5_2tand_t3_jcz7q0", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "For most of my life I’ve been a perfectionist. This basically translates into if I couldn’t be perfect at something, I was utterly disappointed in myself and lost steam when I didn’t see results “quickly” enough. I started and quit a lot of things.\n\nI’ve been feeling kind of low for a bit and I’m finally seeing the light in what was a very big period of darkness. Old regrets were coming to the surface. I was lost in things I couldn’t change. I have been stressed about every little thing. I was down on myself. I was afraid I lost all my momentum that I had a few months ago where I was “doing it all”. I was afraid I had reverted back to old ways just because I’ve been feeling off. \n\nBut my old ways were this: addicted to adderall, chain smoking, numbing myself with food and alcohol, being in toxic relationships, barely working towards any new goal, and identifying extremely strongly with my thoughts and emotions. \n\nMy new low ways look like: meditating daily, celery juice almost daily, running 1-2xs a week, yoga 3x a week, working full time, doing a weekly podcast, working on new projects, being in healthy relationships,  reading a lot & stepping out of my feelings to see what is underneath. \n\nIt’s safe to say, in every sense of the phrase, I’ve come a really long way. \n\nIt’s hard to see that sometimes when you’re stuck in it. When the feelings are overwhelming and you just don’t feel “on”. But life, is ever flowing. We have rhythms and cycles of energy. I’m learning (& both figuring it out and falling short simultaneously) how to balance. How to be kind to myself but also hold myself accountable.  How to improve but also love myself where I am. How to be consistent but leave room for rest. How to rest without becoming lazy or complacent. It’s not easy guys. I think our whole lives are dedicated to figuring out what works for us and what doesn’t. And sometimes this looks different one day to the next. \n\nI just wanted to come here and let you know that wherever you are: you don’t have to be perfect. You just have to be you. And giving your life all you got is way more than enough. I’ve been giving it all I got lately and that’s has been “less than” what that was a few months ago. But letting myself feel whatever is coming up is so important. Not rushing anything, just being. \n\nIt’s so nice to take steps for you that are aligned with who you want to be. I know through consistency of doing that, I’ve transformed my life. It might not feel like everything is going right, right now, but it is immensely better because I’ve dedicated my time to making it better. I’ve chosen to look within and see where my power lies instead of my flaws. I’ve transformed from a once victim mindset into one that is generally excited for life and excited to grow but sometimes feels badly or gets lost in old patterns. But that doesn’t mean I’m failing at all, it’s just more places to learn and go within. \n\nWe are not meant to be perfect. If we keep expecting that we’ll always end up disappointed and discouraged. We’re meant to choose us in anyway we can. We’re meant to experience life: the good, the bad, the grief, the anger, the joy, the love, all of it. And sometimes we have energy, sometimes we’re drained. Sometimes we’re on and sometimes we’re off. It’s just the way of the world. But by being consistent in small practices & choosing to be where we are, we can make our low days better than they used to be, we can make our great days better than they used to be. We can change and grow and evolve and show up entirely differently if we choose to show up and rest when we’re tired instead of burning ourselves out at both ends only to collapse. \n\nWe are capable of so much if we allow life instead of resisting the ebbs and flows. Imagine if we just said we’re resting instead of we’re failing. Imagine if we honored every single step we’ve taking into trying to be a better version of who we once were. Imagine if we said it’s ok to go slow & pause instead of we’re not good enough if we need time to rest. Imagine what a world it would be if we knew the truth: we are meant to be human, we are meant to love, create, and learn. We are worthy as we are. We don’t have to be perfect, because we’ll never be. We just need to show up to life, and watch what unfolds.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jcz7q0/perfectionism_leads_to_burnout_consistency_and/", "title": "Perfectionism leads to burnout, consistency and intentional rest lead to real change.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1602955392, "permalink": "/r/DecidingToBeBetter/comments/jcz7q0/perfectionism_leads_to_burnout_consistency_and/", "nsfw": false, "first_save": 1635436049.286373, "replies_charged": false}