{"id": "t5_2tand_t3_pbe20l", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "Life is full of challenges... You cross one and get ready to face another. But with every successful attempt to overcome the difficulties, one gets sufficient amount of courage to get ready to face another battle. Born in a \nmiddle class family. I had huge dreams to be a good and well educated person. My passion has always been to become a writer but I did not know that the path to become a writer is not easy to achieve. \n\nAlthough life has taken away from me many things, but it has also blessed me with much more gifts than the losses I had incurred. Throughout my student life, I remained a topper in all my classes, having always been a participant and winner in different extra- curricular activities in my school, college and university, at State, National and International levels. My trophies, certificates and medals made my mother proud and that resulted in making me feel that I am walking on the path that my mother had set for me. After having topped my Masters and M.Phil in English, I started working as a Professor in a reputed college.\n\nI have also participated and held workshops to share my skills with the new learners. My love for reading has motivated me to read novels, critiques, translations, short stories, fiction and non- fiction, poetry and as many genres I can lay my hands on. Reading has widened my scope and my perspective towards various things and situations that I have come across in my life. My love for travelling has motivated me to visit distant places, know their cultures, their customs and in gaining experience from my different encounters. I feel blessed that I have developed tastes that helped me greatly in developing my personality.\n\nTherefore, from my experiences I can say that life is not easy to lead. Many ups and downs occur as obstacles in our ways but if we are adamant at leading our lives according to our dreams, then nothing can stop us from living a life of our desires. We feel weak as long as we allow ourselves to feel weak. Nothing is impossible in life because impossible itself means I ‘M POSSIBLE.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pbe20l/you_have_the_power_to_sculpt_yourself_into_what/", "title": "You have the power to sculpt yourself into what you want to become!", "social_network": "reddit", "user": "Spiritual_secrets", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1629906753, "permalink": "/r/DecidingToBeBetter/comments/pbe20l/you_have_the_power_to_sculpt_yourself_into_what/", "nsfw": false, "first_save": 1635435552.533474, "replies_charged": false}