{"id": "t5_2tand_t3_ha8y3l", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "I'm sorry, I know this is a sub about deciding to do better... And I *did* try to do better... But I didn't.\n\nFor years now I've been wanting to write a book. But I'm awful at balancing work, hobbies, and depression. After work, all I want to do is just eat and play video games. During the weekends, all I want to do is drink with my friends and play video games.\n\nBut my book has always been in my mind. If I'm listening to a song while taking a walk, I think \"man if my book ever got turned into a movie this song has to be in it\" and I make up scenes in my head and for the whole duration of my walk I am so fucking pumped and motivated and can't wait to get home and start writing it... Then the moment I get home I think \"urg, it's already 8 pm and I have work in the morning, think I'll just play some video games and do it tomorrow\" and the cycle repeats itself every other day (I like to take walks)\n\nThen the quarantine happened. And it couldn't have been more of a blessing in disguise for me. I hated my job, and now I get this huge \"break\" while also still getting money from the government?? I HAVE to write my book now! There's no excuse. I was so excited.\n\nWell, it's probably been what? 3 months? And I have one page of scribbles down. And now, I'm probably going back to work in 2 weeks. And I fucked it all up.\n\nI'm so... So disappointed in myself. I don't know why I can't just put my phone down, whip out my notebook and start writing. I'm just so lazy, and I make up all these excuses as to why I can't. I think \"oh the apartment is messy, I can't write in a messy apartment.\" so I'll clean the apartment and then be tired after. Or \"it's such a nice day out, maybe I'll bring my notebook outside somewhere to a nice park\" so I'll do that, but by the time I reach the park there are already people there and I feel awkward so I go home...\n\nIt's always something. There's always a million reasons why I can't write my book. I had such an amazing opportunity to write it and I totally blew it.\n\nThis was me not deciding to do better. This was me fantasizing about doing better without actually making the effort. I really let myself down.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ha8y3l/im_so_fucking_lazy_i_wasted_this_whole_quarantine/", "title": "I'm so fucking lazy, I wasted this whole quarantine.", "social_network": "reddit", "user": "Skys3nberg", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 184, "down_vote": 0, "creation": 1592329920, "permalink": "/r/DecidingToBeBetter/comments/ha8y3l/im_so_fucking_lazy_i_wasted_this_whole_quarantine/", "nsfw": false, "first_save": 1635435598.5182097, "replies_charged": false}