{"id": "t5_2tand_t3_i72bnk", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "Today I finally called a GP for a phone consultation to set up a mental health plan so that I can start therapy.\n\nThe last few months have been interesting to say the least. I was finally getting myself to a good place after over a year of self esteem issues and a lot of anxiety about a few situations. I started a new university course for a field I'm passionate about and soon after found myself really connecting with a friend which led to us getting closer and admitting that we like each other. \n\nIt was a weird situation because she had previously dated a close friend and though I tried to talk to him about it he kept blowing me off or not responding. I talked about it with her and agreed that we'd figure it out. Unfortunately it didn't go well when he found out and he said some extremely nasty things about us, then right after she had some serious mental health issues and didn't think a relationship was a good idea at the time. \n\nIt's been a while since then and things seemed to be getting better, however she thinks it's best that we just be friends.\n\nI'm not looking for advice on the situation, more just providing context. Everything that happened there really threw me into a downward spiral but I kept telling myself I was coping and I'll be ok. Others told me how well I was handling things and I believed it. I think I have a habit of acting like things don't bother me and even trick myself into believing it but inside it is just tearing me apart slowly. I haven't been able to focus and I'm falling behind on my uni work because I'm finding it hard to do even the things I love.\n\nThings started to get worse mentally this weekend, especially after getting drunk talking with friends and I realised it might be time to look for some help. I made an appointment for Wednesday and went to work, but not long into my day at work I started having intense waves of anxiety and panic about nothing in particular and was on the verge of breaking down at my desk.\n\nI called the doctor and asked if we could move it up and that worked out so I had the consultation this afternoon. It's incredibly eye opening to explain how I've been feeling to a professional and have them be a little taken aback and sound genuinely worried about me. \n\nI'm set up to go in this week to organise a therapist and other steps including help with my sleep (has probably been 3-4 months where I haven't slept through an entire night).\n\nI'm so glad that I took that step to call them. I'm ready to work towards feeling better and this is going to be extremely beneficial.\n\nI hope that wasn't too much of a read, but thank you to anyone who does! This sub has helped me through some tough times, I just need a little bit more help and that's ok!\n\nTL;DR: recent events caused me to spiral a bit, but I'm moving towards therapy to try and get myself back to a good place!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i72bnk/i_started_the_journey_towards_therapy/", "title": "I started the journey towards therapy", "social_network": "reddit", "user": "thisisforthethings", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1597055207, "permalink": "/r/DecidingToBeBetter/comments/i72bnk/i_started_the_journey_towards_therapy/", "nsfw": false, "first_save": 1635435500.619874, "replies_charged": false}