{"id": "t5_2tand_t3_nvhrs0", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "So I am 29 years old. I work as a Teaching Assistant and have been at this job now for 4 years. I recently received tenure in my position(which is a big deal iykyk) but lately I'm not feeling fulfilled. My pay is not great just enough to pay the bills. I only have a few college credits and I'm thinking about going back to school. This is where I get stuck. I guess I have become complacent which scares me. Honestly I think I'm depressed. The idea of school freaks me out, its been so long and I wasn't doing great when I was attending. I just don't know what to do but I know I can't keep going like this. On a daily basis I am surrounded by people who have 2 or 3 masters degrees, some even PhD's and I just feel so insecure. I just don't know if I'm smart enough to go back to school. I feel like even sharing my feelings with my friends and family is like complaining or sounding like I'm lazy. I feel like I can't step on faith right now, there's no room for failure at this stage of my life. When I was younger I wanted to be a midwife and I still think about it. I just don't know if I have what it takes.  I know that I'm rambling and sound like I'm whining but I can't help but feel these feelings and have these thoughts. I do enjoy my job but I can't imagine myself as a teacher. The amount of work you take home with you just to do your job is insane and the pay doesn't reflect all the hours that go into teaching a class( and I live in NY) I guess I just need to decide on something. I'm afraid of making a move and I'm afraid of not being an active participant in my own life. I'm sure I left out a lot of details, I'm just in my feels today with 30 approaching in November I feel like I have nothing to show for my time spent on this earth. I see people my age who are millionaires and all I want to do is afford a nice condo and live comfortably. In a nutshell I guess I'm a little lost. What to do? Any words of encouragement? Anyone out there feeling the same?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nvhrs0/at_a_crossroadsi_guess/", "title": "At a crossroads......I guess", "social_network": "reddit", "user": "Dry_Spread1875", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1623195127, "permalink": "/r/DecidingToBeBetter/comments/nvhrs0/at_a_crossroadsi_guess/", "nsfw": false, "first_save": 1635436027.3690157, "replies_charged": false}