{"id": "t5_2tand_t3_l9ylfa", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Hey everyone\n\nI tend to lurk around reddit taking in the goings-on.\n\nI've joined and deleted a few times.\n\nI recently missed out on the WSB as a result.\n\nThe WSB incident has shown how wonderful a place the internet can be at taking on the status quo and mobilising the masses to take cohesive action.\n\nThe reason I am posting here is nothing to do with that however.\n\nIt's because I want to get involved in a community of people all pulling in the same direction and harness that energy and support from a feeling of involvement.\n\nFor a long time I have felt a deep feeling of dissatisfaction towards my life.\n\nI have blamed others, blamed circumstance, blamed everything except myself.\n\nThat's not to say its been a bad life. Far from it.\n\nI've been blessed with good health, a safe environment, a loving family, an education and had some fantastic experiences in different fields. Even though I have no really close friends I get on well with a lot of people, which I like.\n\nI've just always had a problem with getting out of my own head and actually enjoying experiences rather than going through the motions.\n\nMuch of it probably comes from my own deep insecurities.\n\nThe main issue is my long term relationship. We've been together since we were 18/19 for almost 10 years now but I don't know how I feel about it.\n\nIt's my own fault for letting it get this far. There were signs along the way.\n\nBeing cowardly in how I approach the situation. I feel like I have wasted so much time in my life.\n\nThere are issues. Probably some of them have stemmed from growing and making mistakes together.\n\nI don't feel the physical attraction is there.\n\nThere are times I haven't felt valued.\n\nI don't blame her. We were both young and needed to grow together.\n\nI have been withdrawn and haven't made enough of an effort because I was sad about the situation.\n\nI have been far from perfect also but I want to be better.\n\nNevertheless, things are where they are and I am trying to figure out the best way to approach things going forward.\n\nIn recent times, she has started making so much more of an effort but I just don't know if the spark is there. \n\nIt kills me inside, I feel very little physical desire in the relationship.\n\nIs my life over already or have I wasted my life...\n\nI crave a feeling of love and mutual attraction.\n\nPorn is a curse in my opinion that definitely hasn't helped my internal issues so I want to stop watching up but I struggle. Every time I watch it I find myself wallowing in pity.\n\nI sometimes think to myself that the only thing I have that I value myself on is my appearance and obviously getting older I worry that that will leave me soon.\n\nI feel I've missed out on so many opportunities financially - like bitcoin, like investing. The thing is I was reading about these things years ago but I was too lazy to act upon them. Too consumed in my own head to take opprtunities. If I had I could help my family financially and at least feel like I have some value in that regard.\n\nI'm in my late 20s and still just about able to look after myself financially. I am getting better and beginning to build some wealth.\n\nI don't actually care about wealth. I just want to have enough that I don't have to worry about not having enough and I want to be able to care for those around me.\n\nI feel sad because I can't help my mom and dad out of debt that they got into in the financial crash.\n\nI would love to have enough to make meaningful philanthropical contributions to society both in terms of time and capital.\n\nWhen I see serious and severe inequality such as homelessness\n\nI spent too much time gaming. I can't help but feel if I didn't play games I would be in a better position.\n\nI squandered money playing poker and gambling. I thought I could beat the system and make money quick. I just lot a decent amount most of the time. If I'd been smarter I would have invested.\n\nI was considered a really good prospect in the sport I play. My attitude probably stunted my development because I was too insecure too accept criticism and setbacks maturely in my early 20s.\n\nI struggle to say no to people. I always try and go out of my way for people, even if I don't want to.\n\nI think social media certainly contributed to my anxiety. The eternal feeling of doom with topics like global warming and and terror attacks. The feeling my friends were always having fun without me. \n\nCertain moments were watersheds in my life that helped me along. \n\nMy first job that I held for a long period of time proved I could be valuable and was good at something other than playing sport and being good looking.\n\nI started to get into stoicism, the perspective of which started to help me put things in perspective. It made me realise how insignificant most of my worries are and I take myself a lot less seriously in terms of ego and status now. I was always obsessed with outcome rather than enjoying the process.\n\nFinally something I always wanted began to slip away from my grasp, it was something I had no control over. As it slipped away it made me realise that maybe it wasn't that worthwhile to me as I thought.\n\nI just really want to be better and I try but sometimes I get dragged into my mind and can't get out. Something will trigger me and remind me I feel like a failure, whether it is something my girlfriend does, a reminder of the past, or anything.\n\nI won't throw in the towel and continue to push on, even if I wish I had started at some things 10 years earlier and never encountered others but that's the benefit of hindsight I suppose. I've come to enjoy the fact I'm on the bounce back and see it as a challenge.\n\nThe best time to plant a tree and that..\n\nI've started investing and built up a few thousand in savings and investments which will hopefully grow. I look after my health and train most days. I am more comfortable with failure and getting more comfortable following my own path and independence and not being guilted. I try to build my skillset in my job. I moved out of home. I journal and write which is great for my mind and I try not avoid uncomfortable thoughts as much as I would have done in the past. I'm trying to dress better for my own feelings of self-appreciation. Not saying I always succeed....\n\nI've come to the conclusion that I was also trying to change my girlfriend instead of focusing on myself at times. I was relying on her to provide a reflection of my worth. Now all I can do is be the best that I can be and allow her to be herself. She isn't a reflection of me and I think it took me a long time to realise I am not responsible for how she acts or decides to act.\n\nThe relationship is still something I have to decide upon.\n\nIs it too late to change my mind?\n\nI don't know if I happy or not.\n\nI don't really know what I want to get out of writing here. Maybe a place to chat with some people that are on a similar path. Maybe a place to vent. Maybe someone will chime in with some advice that will help. I really don't know...\n\nAll I know is I want to continue to be better. To do good. To myself and to others. I'll never get it perfect but I can keep pushing on.\n\nWriting this has helped.\n\nIt's something I've been meaning to do for a while.\n\nWe will all die anyway so all we can do is the best that we were put on this planet to do.\n\nThanks if you read this.\n\nLove to all trying to be better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l9ylfa/im_sad_and_i_want_to_be_better_late20sm/", "title": "I'm sad and I want to be better [Late20s/M]", "social_network": "reddit", "user": "Sad_Organization3682", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1612168543, "permalink": "/r/DecidingToBeBetter/comments/l9ylfa/im_sad_and_i_want_to_be_better_late20sm/", "nsfw": false, "first_save": 1635435602.715358, "replies_charged": false}