{"id": "t5_2tand_t3_p5s6fc", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "b69cf201-6737-4217-b486-9096135546b8"], "text": "\nI don’t know if anyone is even going to read this but I’d like to apologize in advance for the long ass rant, I’ll do a TL;DR at the end of it for those of you who don’t feel like reading all of this.\nAs the title says, I am fucked. I mean, not entirely, but I know I have a serious issue with phone/internet addiction. I’ve known this for a while but today was the day I stopped to think that man, I’m losing so many fucking years of my life to this little shithole. \nFor further context, I am a senior in high school and I’m taking my university entrance exams in a couple of months from now, the university i’m applying for is pretty hard to get into and… I haven’t even started studying yet. And I’ve tried basically everything these last few months. Every single morning I wake up and tell myself that I am finally going to start following a steady routine for my studies and not waste all day mindlessly scrolling through social media, except I never actually manage to follow my schedule and just end up spending the entire day watching useless shit on youtube.\nI’ve already deleted most social media apps from my phone, but my brain is one stubborn fucker so instead of just forgetting this stuff even exists I keep using them through fucking Safari, which is the epitome of ridiculousness. Now, I’d love to delete all my accounts but I’m kinda afraid of doing so because, I mean, I’m a senior in high school who’s possibly about to go to college in another state, and unfortunately the easiest way to make friends and meet new people nowadays is through social media.\nI basically wasted my entire junior year doing fuck all at home because the schools were closed the whole year round where I live due to the pandemic, I learnt absolutely nothing and did nothing of value.\nSo now here I am, four months away from my university entrance exams still trying to get a hold of myself so I can start studying for good. \nI like to think of myself as being, well, fairly intelligent (not above average though, but somewhere in between) and a pretty fast learner, the issue is that I am chronically lazy and can’t force myself to do anything because I know I can just… well, not do it. On the other hand though, unlike most people here on this sub, I have no problems whatsoever with reading, as a matter of fact I absolutely adore it and read an average of 3~4 books a week for funsies.\nI feel lost, you guys. I want to get into this university, move away from my shitty little town and start living for good, but I know I can’t do it unless I force myself to study and to stop spending so much of my precious time on this stupid phone of mine.\nToday, I spent 10 hours on the internet. I don’t want this anymore. I want to get better. How can I start to go on about this?\n\nTL;DR: I have to study for my university entrance exams but I can’t stop wasting my time on social media. How do I start forcing myself to stop being such a lazy bastard?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p5s6fc/im_fucked_and_i_dont_know_what_to_do_anymore/", "title": "I’m fucked and I don’t know what to do anymore.", "social_network": "reddit", "user": "Facelift90", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1629157693, "permalink": "/r/DecidingToBeBetter/comments/p5s6fc/im_fucked_and_i_dont_know_what_to_do_anymore/", "nsfw": false, "first_save": 1635435086.3696048, "replies_charged": false}