{"id": "t5_2tand_t3_mtt9tf", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I have always loved leaning new things. I have several hobbies and I love art, culture, new skills...everything. However, maybe it was cause of higher classes or just crappy people, I have been encouraged to do literally everything that helps my career.\n\nWant to learn a language? How will that help your career?\n\nWant to learn about machines? How will that help your career?\n\nWant to learn swimming? How will that help your career?\n\nWell, news flash people, my career isn't my life. \n\nI'm going to be honest and I have written about it here before that Idk what my passion is yet. I am good at several things and not brilliant at one thing so I am perpetually perplexed by things. However, even I fell for this mentality for quite a while and stopped looking out for myself. Stopped painting, writing, cooking...all the things that were actually keeping my sanity afloat when I was going through crappy places and having a bad time. \n\nBut since highschool, I developed this mentality of \"what's the point of doing something without any benefits?\" Well, due to recent turn of events and discovered cause of which I have started being true to myself, I realized that I also lost all curiosity and happiness cause of that mentality. I turned into a machine...basically my worst nightmare.\n\nSo sorry if my career isnt my life and if I sound utterly unambitious but it seriously isn't. Its an important part of it but not my entire life.\n\nI have heard this crap everytime I try to learn a new language. I was and still am in absolute love with Italian but whenever I would make an effort to learn it, there would be someone who would point out how its not universally useful or I myself would have the self doubt lingering at the back of my mind about whether I should learn it myself.\n\nBut the truth is, its so beautiful, I do want to learn it...may it be basic. I also want to learn Spanish and maybe German or maybe Norwegian. I don't want to fucking learn Japanese cause its the future of the scientific world or blah blah blah. Don't get me wrong...Japanese is beautiful too...but I haven't yet felt the inclination to learn it so why should I?\n\nThe point is, I need to balance my career and my life. I remember not exercising and spending hours on the laptop basically doing nothing fruitful cause exercise is not as important as university. But really, as much as I lost my passions cause of it, I also gained the insight that I was being a dumbass. I need to learn to balance both even if I makes me sound less ambitious or frivolous. I can't have a one track mind and I never have. So no I cannot spend every minute of my life making cautious moves and thinking how that will help my career. I cannot keep constantly thinking about my life \"5 years from now\", I cannot keep hating, comparing, competing with everyone else. \n\nI'm going to try and change that.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mtt9tf/changing_the_mentality_that_i_have_to_learn/", "title": "Changing the mentality that I have to learn something for some monetary or career related benefits only.", "social_network": "reddit", "user": "Early-Department273", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1618807498, "permalink": "/r/DecidingToBeBetter/comments/mtt9tf/changing_the_mentality_that_i_have_to_learn/", "nsfw": false, "first_save": 1635437308.290006, "replies_charged": false}