{"id": "t5_2tand_t3_odgk7n", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I've had 4 sessions with my current psychologist so far, and I've been wondering if she's right for me or not. The first 2 sessions were really good, she shared her opinion and advice while also listening to me. But the third time it was basically only me speaking which didn't give me a conclusion at the end, it also felt like as if I was only venting to a friend or family member. The fourth time it was better again, though still far from the first 2 sessions. She gives me little \"homeworks\" which can be helpful, but we just touch the surface of those during the next time we talk, then go to different topics...\n\nMy problems are that 1) I'm tight on money since I don't have a job yet, so I don't want to invest the little I have in her if the sessions are gonna turn into \"normal\" talks which I can do with my friends and family for free; and 2) my psychologist keeps mentioning a book since our second session which bothers me because one of the authors' surname is the same as hers (rare name), and she keeps recommending that I buy and read it so we can talk about its chapters on our sessions... Idk about you but I prefer a psychologist who can help people by herself/himself, not by making the client read a book and go from there. Especially if that book isn't well-known and her/his surname pops up on the front...\n\nAm I just thinking too much into this? It's not like she _forces_ me to buy and read it, but she mentioned it every single session except for the first one. There are also instances when her advice or opinion is something I've expressed before or something I already know, so lately it often feels like she can't offer me more guidance.\n\nI'm mainly asking people who have been with their therapist/psychologist/psychiatrist for a longer time: did you have these kind of experiences as well? Is it only because I've been feeling better recently (mostly thanks to myself) that the sessions don't seem useful anymore? I wouldn't mind continuing attending talks with her if I had a job, but I have to be mindful with my money now.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/odgk7n/should_i_change_my_psychologist/", "title": "Should I change my psychologist?", "social_network": "reddit", "user": "anxiety___throw", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1625388870, "permalink": "/r/DecidingToBeBetter/comments/odgk7n/should_i_change_my_psychologist/", "nsfw": false, "first_save": 1635437989.1413934, "replies_charged": false}