{"id": "t5_2tand_t3_ldjdt2", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I wrote this while depressed out of my mind. I was trying to come up with a way that is better for communication between individuals. Part of my depression specifically and maybe others I think is that even if you are doing things right people around don't adapt well and that builds negative momentum. Depression is like carrying a weight around your back and the longer you carry it the more tiring and heavier the load feels. I specifically found that I needed social interaction in ways that were healthy but were not getting it. A lot of people talk about setting boundaries, talking things out, and voicing the concern but when some conversations feel like the whole thing is off it is hard to know where to even start. I wrote this piece called a social engagement model which I modeled after my therapists conversation style and a few good friends who I respect. I also tried to model things outside of gendered norms of communication. I personally have found the healthiest communication style to be when gender conversation patterns influence conversations minimally and tried to develop this with that in mind. There are also some parts where I thought of the \"strengths\" of each genders \"stereotyped\" communication style. I also tried to keep it to 2 pages since the marginal value I gain after 2 pages is not worth extending the length unless I tried to make this into some kind of book.   \n\n\nI don't know if this is the right forum but if anyone wants to rate what I have done, give feedback, or use this. I didn't know how to attach a google doc or a the resource so I left it as bullets. \n\n&#x200B;\n\n**Social Engagement Theory**\n\n* **Openers:** A way to quickly establish a conversation framework implicitly if one is not stated and create an atmosphere for engagement. \n   * **Safe:** Icebreakers, Small talk, starters, and opening questions.\n      * It’s great to catch up with you. Would you like anything to drink? You can put all your things in these locations.\n      * How was your day, week, break, trip, work, promotion? \n   * **Observational:** Comments where you pre-emp and direct conversation based on emotional state (yourself, other person, or both) or external objects, external environment.\n      * I noticed you seem a little bit more quiet than usual. Is there anything on your mind? Is everything alright?\n      * I like your new car, backpack, hairstyle. \n      * You look like you have been staying in shape in quarantine. How’s that going?\n      * Did you see the last tournament, sports game, election, news cycle, movie trailer, game trailer?\n   * **Alternatives:** Direct, Initiative, Humor\n      * I’d love to chat but I am crunched for time and need your take on things so we should try to hash things out in 30 mins.\n      * I made some really cool changes to this program, my car, my house you wanna come check it out?\n      * Rocking that pink shirt. Breast cancer awareness I see. Memes, inside jokes. \n* **Listening and Validation**: Hearing out the other person in a non judgemental way which requires taking a 3d person view of the situation.  \n   * **Passive Listening:** High Level of Abstract points of the conversation\n      * My friend Michael talks to me about sports when I don’t know enough about specifics but he is hyped about his team making a comeback or picking up new players. Another example is colleagues talking about the latest game of thrones episode and what happened. \n      * Being in a conversation outside of your field, subject matter, or when you can’t keep up but you still follow along with the overall gist of things.\n   * **Passive Talking:** When someone is going over narratives without a direct solution, subpar solution, sunk cost, extremely long haul solution.  \n      * Micahel wants to talk about how he is frustrated over BLM protests and how it affects cops\n      * My friend wants to open up to me about some issues they are dealing with at work\n      * My relationship partner is telling me about how she is frustrated that something she worked hard on is getting delayed.\n   * **Active Listening:** Framing the conversation also known as keeping track of hierarchies and tabs.\n      * Whiteboard discussions where one allows raw information to be thrown out with no refined solution formulated.\n      * Trained professional or instructor hears specific issues you are facing. \n      * Bridging knowledge gaps between people. I know this but you know this so let’s find the overlap first before moving onto doing anything with it. \n* **Contextualized Solutions**: Solutions that are specific and solve a section of the conversation with a set of options prioritized along with tradeoffs. \n   * **Active Questions:** Asking hyper specific questions to really draw you into the conversation or to help guide you to a refined solution\n      * I like the section you drew in regards to drawing the wing section. You mentioned earlier you used this line technique but on the piece on the right the line technique appears 2d whereas here it appears 3d like a glass shape. How did you manage that?\n      * You said you tried this program but didn’t like it in favor of another program. Were you primarily concerned with cost or was it more the nature of the program itself. How much time did you invest in both programs before making your decision. Would you revisit the old program after trying this one out to and do you see any benefit in doing a second time?\n      * Why do you find it difficult to express this feeling in this genre in this music key vs. in another musical key. Does that have more to do with personal choice, moo during the day, or is there any composition reasons you have chosen to leave it as such. \n      * I like the metallic drum sound you added to the liquid drum and bass set. The echo voice effect is fading in and out along with the floating undercurrent noise in the song. I like how the piano has this reverb added to it which makes it feel like the sound is pulling you in and fading out like waves. What did you do to create that effect? \n      * When designing this outline how many more features were you considering that you omitted. Were there anything you think you could have added which you didn’t and would have needed for instance in the exceptions section \n   * **Active Solutions**: When someone is directly explaining or framing problems with clear intention, clear boundary, or clear outline. \n      * A product manager or developer writing notes and thoughts on why he made the decisions and gave the solutions he did. \n      * A therapist giving dynamic active feedback while performing CBT or DBT live.\n      * Any good tutorial particularly if the tutorial is active for instance personal training with Michael. \n* **Adaptation and Auxiliary Info**\n   * **Rhythm/Tempo:** Manage conversation speed and pacing.\n   * **Empathy/Narrative:** See things from their point of view. Use story or analogy.\n   * **Reframing/Re-contextualizing:** Looking at the conversation from multiple new angles\n   * **Observations:** Make small mental notes every few mins. Bring them up if relevant.\n   * **Annotations:** Like a narrator or an interviewer describing thoughts in the third person. \n   * **Signals/Transitions**: Like driving you use signals in this case gestures or verbal cues.\n   * **Flow**: Conversation has a wave like pattern with an ebb and flow and you ride it like a wave\n   * **Exceptions:** Intuition to discern when exceptions have taken place. Use any tools above plus intuition again to gain info and resolve exceptions\n   * **Devils Advocate & Steel Manning:** tactics to help truth test ideas and or explore them", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ldjdt2/critique_of_something_i_wrote_in_depression_while/", "title": "Critique of something I wrote in depression while trying to improve myself", "social_network": "reddit", "user": "Snoo9063", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1612564961, "permalink": "/r/DecidingToBeBetter/comments/ldjdt2/critique_of_something_i_wrote_in_depression_while/", "nsfw": false, "first_save": 1635436513.8932722, "replies_charged": false}