{"id": "t5_2tand_t3_ppv2b8", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "5 months ago I started my journey. Excluded:\n\n1) Sugar, very fat food, fast food (expecially from big chains like BK or KFC, it is pure poison), caffeine (pepsi was a combo of sugar and caffeine), processed food.\n\n2) Social media. I noticed I feel like shit after browsing through people I know. There is always many more successful people with better lifes. So I deleted my FB and insta. My 3 friends know my number, they can message me through Telegram.\n\n3) Media and news. That was a hell of a drug for me. For 2 week I craved for news and a small dopamine rush. Decided to stay away from news, because there is always something bad: something unfair happened, people died, disasters and other negative things. If something really important happens, everybody will know.\n\n4) Smoking cigarettes. Funny, but it was easy. 3 days of cold turkey withdrawal effect and since then I am tobacco free.\n\n5) Binge watching of series and youtube. Mindless internet surfing.\n\nInstead I:\n\n1) Drink good green tea. 5-7 cups a day.\n\n2) Eat health + fish oil.\n\n3) Watch 1 good movie per week.\n\n4) At least 15-20 minutes of reading every day.\n\n5) Sport. That was a best decision I ever made. I'm a different person after 40 minutes of running with good heartbeats per minute.\n\n6) Wake up at 6 a.m. I sleep 8 hours, it is enough for me.\n\nWhat has changed?\n\n1) Days seems longer now. One year ago days were like moments, now days long like I am 10 years old agains.\n\n2) I feel much more positive.\n\n3) I became stronger, don't feel exhausted after work, ready to do something at weekends.\n\n4) My premature ejaculation is gone.\n\n5) I saved good amount of money, because I don't waste it on useless dopamine triggers.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ppv2b8/150_days_small_story_of_a_person_who_wants_to/", "title": "150 days. Small story of a person who wants to live and feel better.", "social_network": "reddit", "user": "Silversiberia", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 596, "down_vote": 0, "creation": 1631861234, "permalink": "/r/DecidingToBeBetter/comments/ppv2b8/150_days_small_story_of_a_person_who_wants_to/", "nsfw": false, "first_save": 1635436253.4308016, "replies_charged": false}