{"id": "t5_2tand_t3_l11o9s", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "My evening has been interesting - my ex decided he felt ready to apologize to me for his actions.  I initiated NC a while ago His original intent was to apologize on a mental health subreddit pertaining to his condition.  So someone asked him why don't you apologize directly - and I agreed. I said its fine. You need to own this.  \n\nI expected to have enough respect given to me to arrange a time to talk about it so that I'd be able to advocate for myself and the harm caused by him. \n\nBut that's not what happened - he sent me a small paragraph basically repeating his post he made and then didn't allow me the dignity to respond and ask questions for my own clarity and healing. Basically tried to run back into hiding (NC) and I was basically expected to either accept his attempt as \"trying to be better\" (which his post seems to be applauding him for)  or ignore it.\n\nSo I said,  well uhh. I can't just accept a hit and run email when there's so many things I was left dealing with. So many questions,  so many things I needed to say to feel like I could forgive. He said he made a promise to not speak to me.  Understandable, promises are important but it removes my humanity from the situation. I'm treated as an object rather than a person who was harmed. I'm told \"take it or leave it\"  and my power i worked hard to regain is taken from me again. \n\nBut here's the thing.  Apologies are powerful when done correctly.  If you're only willing to apologize to absolve you of guilt and not factor in ALL the people you've hurt. Friends, family, partners - its not real.  Its still only on your terms.  \n\nThat's not progress. Its self preservation. So for the rest of you beautiful people including him.  If you're committed to being better, Its more than just owning your mistakes, your harm and your bullshit. Apologies are abused these days where all people feel they have to do is say I'm sorry, I'm learning and that's it we're supposed to accept it. But you don't.\n\nApologies are powerful when you use them correctly. When you allow them to be an interactive healing process where you treat everyone with respect. Maybe you can't break NC but you find a way to communicate properly in a way that is treating people with respect. Don't just put on a I'm sorry show because that's what you see all the corporations and celebrities do online.\n\nApologies that are sincere are designed to be uncomfortable. Designed to allow you to feel remorse and feelings of seeking forgiveness. This is true growth. You value harm done to all when you were in your darkest moments,  not cherry picking the easier parts.\n\nIf you take anything away from this post - be mindful of your apologies as you work towards being better.  Do them for the right reasons.  Which means releasing yourself from the selfishness of wanting to avoid discomfort.\n\nIf you can do that. You'll be in better shape.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l11o9s/apologies_done_only_on_your_terms_are_not_true/", "title": "Apologies done only on your terms are not true apologies", "social_network": "reddit", "user": "dianerrbanana", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1611116875, "permalink": "/r/DecidingToBeBetter/comments/l11o9s/apologies_done_only_on_your_terms_are_not_true/", "nsfw": false, "first_save": 1635437553.472994, "replies_charged": false}