{"id": "t5_2tand_t3_n8s2ho", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526", "221a05fc-6bbf-424e-808a-6b3e01891c48", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I've been at it for 100 days and have so much to show for it. I'm relieved to be sitting here without the regret of having not followed through.  I'm grateful that I did follow through and excited to continue my journey.\n\nI have categorized my goals into seven sections and here is my progress with each:\n\n\n•self care•\nI wake up every day at 5 am to have an hour to myself to do whatever I want. I also don't work on Fridays and make sure I'm doing something for myself on these days. \n\nI attend therapy regularly.  I enjoy knitting and do that a lot.  I usually listen to audiobooks while I knit (or doing things around the house) but lately I've been listening to The Office Ladies podcast, which has been delightful.\n\nI also enjoy the occasional mani pedi.  I've discovered a foot mask that is really helpful for people, like me, who prefer to always be barefoot.  I've also gotten acquainted with ColorStreet nails which are a godsend.\n\nLastly, I've been reaching out to new friends.  The last two months I've helped to arrange a dinner with work friends to get myself out of the house.\n\n\n•family harmony•\nMy oldest toddler is a big bundle of energy most days.  I've signed him up for gymnastics and been coming up with new ways to help him get his energy out.\n\nI've also been mindful about accepting invitations when we can so the kids can get out and socialize outside of daycare and preschool.  I've also met some other nice parents :)\n\nBeing mindful of my tendency to hold things in; I've been finding new ways to be open with my husband when I have concerns.\n\nNext weekend we are traveling to visit family in Kansas City and I've arranged take the kids to a large petting zoo farm there.\n\n\n•home•\nI'm learning to accept that my house is a mess and it's okay for me to work on it a little at a time.  \n\nOver the last month, I have been working on my yard; planning a hummingbird garden for the front yard and one for butterflies and bees in the backyard.  Today I planted and placed flowers all over my front yard to welcome the hummingbirds.\n\nThere was a vegetable garden in the backyard when we moved here two years ago, my dad tilled it last fall, and I recently planted grass in that spot.  We've also recently replaced the two trees we lost in the derecho (land hurricane) last August.\n\nOnce my dad is finished with spring planting, he is going to build us a shed in the backyard.  I can't wait to have a more organized garage with all the extra storage the shed will provide.\n\n\n•helping others•\nI've recently started volunteering again and next month I will begin co-facilitating a Mental Health Recovery Support Group.\n\nI'm also preparing to make another donation to an organization in my community that helps young parents.  They have a great program and I can't imagine taking my kids stuff anywhere else. \n\n\n•career and education•\nI use to have FMLA for mental health issues and missed a LOT of work.  At my worst, I missed about a week per month.  The pandemic helped get that down to two days per month.  The last time I missed work due to a mental health issue was 101 days ago.\n\nA little over a month ago, I was starting to become burned out from my job.  I mentioned it to my therapist and she suggested maybe seeing what's out there so I could see how I really feel about my job.  Well, I ended up finding a new job and an opportunity I can't pass up.  I start my new job at the end of July.\n\nI'm currently in the process of starting an LLC so I can continue seeing clients who decide to follow me.  I'll be extending that option to a couple of my regular clients who I've been seeing for a while. \n\n\n•health and fitness•\nMost of my focus recently had been on health and fitness since I'm currently in the worst shape I've ever been.  Before babies I was on the low side of overweight but I was muscular, and now I'm on the high end of overweight with very little muscle tone.  I actually worked out during my second pregnancy but the 7 weeks of bed rest due to preeclampsia and then the emergency c-section kind of erased that.  Once it started getting warm enough to be outside and active again, I was diagnosed with covid and dealt with that for six weeks.  I struggled with lingering symptoms until about two months ago.  I've since been diagnosed with diastasis recti and obstructive sleep apnea.\n\nI'm currently on keto and have lost 14 pounds since January.  I plan my meals and track my calories every day.  I've made my own meals every day with the exception of an occasional dinner out.  I was eating a latte and a giant sugar cookie for breakfast every morning before this and now my days consist of zero processed sugar.  I've switched from coffee to tea and have enjoyed tasting samples from the Adagio Tea website.\n\nDuring each of my pregnancies I suffered severe medication resistant Postpartum Depression and Postpartum OCD.  I've undergone two courses of TMS treatment in two years.  My final treatment of my last course was 100 days ago.\n\nI've weaned myself off of my sleep meds and now only take a Melatonin supplement for sleep.  I don't remember the last time I've needed to take my as needed Anxiety med and recently told my doctor I didn't need that or the Ambien anymore.  My doctor also agreed decrease my SNRI to the minimum dose which is where I was before my last pregnancy.\n\n\n•gratitude•\nI'm grateful for the my ability to continue some healthy habits despite all the physical and mental crap I was going through last year.  I stopped drinking soda over a decade ago and have managed that very well.  I quit smoking 11 years ago but when things get bad, I sometimes reach for a pack ... like when I suffered two miscarriages in 2017.  Four years ago was they last time I did that.\n\nI'm grateful to have learned how to manage my money and build savings in the last year.  I received a small inheritance late in 2019, right as I went on bed rest and temporarily lost my income.  My budget became the only thing I felt I had control over and boy did I succeed.  I was living comfortably paycheck to paycheck and now I'm living comfortably with a savings account.\n\nI'm grateful for my perseverance.  I may be my biggest critic sometimes but I'm also my biggest fan.  I know I can do anything I set my mind to and embrace the idea that everything I do is trial and error.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n8s2ho/if_its_important_to_you_you_will_find_a_way_if/", "title": "If it's important to you, you will find a way. If it's not, you'll find an excuse.", "social_network": "reddit", "user": "sunflower_ninja", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 131, "down_vote": 0, "creation": 1620608398, "permalink": "/r/DecidingToBeBetter/comments/n8s2ho/if_its_important_to_you_you_will_find_a_way_if/", "nsfw": false, "first_save": 1635436200.909817, "replies_charged": false}