{"id": "t5_2tand_t3_6r1c1o", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db", "7fde63f7-407d-4821-90f0-161dfc11df39"], "text": "Hello,\n\n35 y/o single childless male working two jobs to pay off debt and who has been fighting addiction and symptoms of depression, anxiety, OCD, low self esteem, codependency for a long time, with a dose of paranoia and intense emotionality. I've thought I had Borderline Personality Disorder for a while but a psych told me they didn't think I did.  Also I've been dealing with alcoholic and narcissistic family members and also lots of bullying at various jobs I've had, including the one I have now. And I'm hypersensitive.\n\nAnyway, I know that laundry list of problems is annoying and many of you have probably judged me as just wanting attention or sympathy. I assure you that is not the case. In fact I kinda writhe when given sympathy (most of the time in most contexts) and I really, truly, want to get the fuck to the point, here, and in my life. \n\nI have been battling the demons in my head for about 20 years, but most of that time I was putting in minimal effort at anything healthy, growth oriented, or productive, and most of my effort in to destructive things like drifting aimlessly, being overhwhelmed by my issues, and drinking/drugging/isolating/resenting. But even the effort I put in to those things was about equal to a bloated couch potato who is sliding off the couch and uncomfortable and too lazy to roll over even though their arm is asleep. Really just spectacular half assing.\n\nBut the thing is, I don't hate myself for this, I've got compassion because I know it's the best I could do with the tools and equipment I had. I was seriously f****ed up, and still am, though I'm changing my language around this stuff because I don't want to live under the spell of that story anymore.\n\nSo, the last 20 years I've been making attempts at solving the puzzle of why I feel so terrible and why my results in life are so terrible. Most of that time I've been slowly gaining momentum, like a nebula as it starts rotating at the beginning of its life. But now enough momentum has developed that I'm starting to see this nebula form in to something with a little more substance and power. (I'm sure that the sum total of energy in a nebula is probably the same as the amount found in the galaxy it eventually creates, but bear with me as I'm not a physicist and am mostly pleased with the efficacy of my analogy). \n\nTo be more specific, in the last 5 or so years I've been to rehab twice, 3 or 4 therapists, psychiatrists, EMDR therapists, taken ayahuascca in Peru, dabbled in yoga and meditation (getting more serious about meditation now), gone to two years of addiction group therapy, had good amounts of sobriety (almost two years was the longest), and spent some time in various addiction support groups (quite a while actually and I was dedicated, though it didn't end up feeling right or useful for me). Also, in the last 8 months I've worked two jobs (had one for about 3 months but had to quit because it was too toxic and having two toxic workplaces was unacceptable). I've now been in the second job for 3.5 months and am really liking it, sometimes I even look forward to going to work. It's a good social outlet and I'm learning a lot. Also, I'm challenging myself to work harder and holding myself to a higher standard than ever before. My goal is to eliminate that nagging feeling that I could have done better, and to be a leader and pillar of any team I'm on, rather than the hanger-on who isn't really contributing more than the bare minimum and isn't really engaged or inspiring. I'm also challenging my self in other areas; spending habits, tracking purchases, maintaining a medium term goal related to paying off debt which has specific dates and amounts, also sharpening my knowledge and performance with my fitness and nutrition regimen. I've even successfully started an intermittent fasting regimen and have been successful in maintaining an 8-9 hour eating window every day except a handful for 3 months. I'm basically being as military as I can about the whole thing, gone pretty much spartan, getting rid of most of my belongings, ditching old friends, places, even family who are toxic and trying to live from the most authentic, inspired, passionate place possible every day.\n\nSo with this hard work I've been doing and with all the clearing away of old crap I've been doing it's becoming more and more clear how there is/are still some major burdens clogging my path.\n\nOne of them is how foggy and frantic my brain feels. I desperately want to start creating and living the life of a creator, but when I sit down to start (clumsily) learning how to sculpt something out of thin air it's like my brain just kinda freezes up. A lot of it is fear of failure, fear of performing, that kind of stuff. It starts a really annoying old pattern of beating myself up, going over all the ways in which I'm failing and the reasons I'll fail at my chosen pursuits.\n\nCurrently I'm attempting to throw myself in to writing and doing something related to comedy. I love comedy and since nothing else in my life means much or feels good, and since I'm alone and likely to remain that way for a while I might as well become a creativity robot. I've given enough of my time and energy to places and people that only abuse and degrade me. wtf. why? I'm done with that. I want to be done with that. I know that I'll probably still struggle to maintain the perfect focus and dedication to consistently make the exact right moves which will result in only forward progress and which will get me out of this hell (i.e- not reverting to any submissive people pleasing behavior when I'm around my workplace bullies, resulting in untold rage, self loathing, and hours spent tossing and turning and balling my fists up and feeling castrated and trapped by these low level demons in my life and my seeming inability to be strong and self loving in the face of such abuse).\n\nI got off on a tangent there...I know I can systematically face these issues in a way that will build my confidence while helping to move me a little closer to my vision, but I need to remove these other parasites from my consciousness first.\n\nSo the first one is this foggy headedness I mentioned. I know depression can cause this, but I don't accept the use of SSRI med's because I've been on several and there were no benefits, only horrible \"side\" effects. Same for SNRIs. Also I still struggle to accept the symptoms of depression as this vague, supposedly biological thing. Maybe it's head injuries, or cell memory (ok, biological), or trauma, or nutritional, or a runaway effect of some bad seeds planted in the mind, or a combination of these, but I know that there is another way. I just struggle to find the focus and purpose needed to consistently trigger that dopamine and feel engaged, strong, purposeful.\n\nI feel like I'm drugged, like I can't focus or think clearly.\n\nEven this post got off the rails.\n\nI really want to live a life of purpose and excitement, knowing full well that any path will be difficult and just peppered with occasional moments of brilliance, but that's what I want, instead of  just grinding so I can wake up and grind some more and never really creating anything and never feeling like I'm even moving in the direction of my dreams.\n\nDammit, I barely even know how to say what I want to say!\n\nI want to start creating but struggle to know where to start, and more importantly, struggle to keep myself accountable in actually spending time working towards something.\n\nCan anyone recommend a good teacher, book, system, school of thought, ANYTHING that can help a person navigate such an obtuse and perplexing void and help them cut through it to find something more invigorating and enriching? (knowing full well that hard work is required; I've got that part down, not expecting it to just happen)\n\nTL;DR\n\nHow can I sharpen my focus and performance in relation to the goals of spending more time creating, and actually feeling engaged in the process of creating and yielding better results while dealing healthily with addiciton, depression, anxiety, OCD, lack of purpose, \"blank\" mindedness and emptiness, bullying, toxic family, debt, terrible self image, and a propensity to get angry and give up or over indulge too often because I 'deserve' it??? \n\nI'm struggling to feel like I'm actually making progress and want to reach the next level in this game...basically I want to upgrade from a wooden club to a shiny sword from the heavens that shoots laser quakes at my enemies.\n\nAnother edit: It feels like I'm trying to do surgery with oven mitts on in a room with dim lighting\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/6r1c1o/some_questions_about_brain_fog_purpose/", "title": "Some questions about brain fog, purpose, procrastination, mental health stuff", "social_network": "reddit", "user": "punchitchewy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 65, "down_vote": 0, "creation": 1501642450, "permalink": "/r/DecidingToBeBetter/comments/6r1c1o/some_questions_about_brain_fog_purpose/", "nsfw": false, "first_save": 1635437178.3771222, "replies_charged": false}