{"id": "t5_2tand_t3_osbnj3", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "If there’s one thing that I can do to make the day successful, it’s setting an intention. An intention, or an object towards which to focus my mind, at the beginning of the day is crucial.\n\n\nToday, I argued with myself about going to the gym. Things are just opening up again, and I simply didn’t feel like it. I had every excuse to not go (or at least that’s what it seemed like at the time). But I decided to make it my intention for the day – whether or not I went, this is what I was focusing on all day (as much as I could keep my mind on one thing). \n\n\nDeveloping the habit of going to the gym was the goal. If I’m not going, the next best thing I can do is think about it. Why am I not going? Why do I want to go in the first place? Can’t I just go tomorrow? Why stress myself out by thinking about it? Shouldn’t I just do X instead, I’m feeling more motivate to do that? I chose to punish my brain and continue arguing with myself throughout the day about not going.\n\n\nWell, as chance would have it, I had to go get my oil changed. My original excuse was that the gym was busy; when I went a few days ago I had to wait twenty minutes just to use the bench. I ended up just doing cardio and leaving. However, where I go to change my oil, there was a new gym (which I have a membership for) that opened up. I checked the app, and it was empty. And it was on my way back. I went in. I worked out. In retrospect, I’m a dweeb for making it so difficult on myself. \n\n\nI’ve made it my goal to live to a higher standard. I don’t want to be writing these and not practice what I preach. How can I strive to make other people’s lives better if I don’t live by my own example? Simply put, I want to practice what I preach. I decided that it was better to kill my own peace of mind rather than ignoring my goal and not going. I could’ve simply come up with an excuse and forgotten about it. It definitely would’ve been easier, and my brain would have thanked me. \n\n\nNo. Not today. Today I chose to kill my own peace of mind. I might have not gone, but sooner or later I would have worn out all the excuses. I would’ve reached a point to decide – Is this what I really want, or not? It’s okay to fail at times, it’s okay to forget, it’s okay to deviate. But, when possible, set one thing for your day that you want to work on. Posture. Socialization skills. Working on a project. Whatever it is that you want to work on. Keep it in your mind. \n\n\nI went, I feel great. I want to go again. Now it’s just a matter of discipline. Discipline and maintaining that inner struggle as long as needed until I can develop it as a habit. Arguing with my own damn self about the kind of person I want to be. \n\n\nThis would have never happened if I didn’t wake up this morning and forced my mind on something very specific and definite. I made it simple for myself. Go to the gym today. Let the brain argue with itself. Try to win. If not, try again tomorrow. If not, revaluate whether or not this is something I really want. Maybe outside help is needed. Get a personal trainer. Find a gym partner. Whatever it is. But the key is not pushing those thoughts away. I decided that I was going to sit with them, even if they bothered me, pissed me off, revealed something about myself that I didn’t like. \n\n\nSet an intention for your day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/osbnj3/arguing_with_myself/", "title": "Arguing With Myself", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1627344576, "permalink": "/r/DecidingToBeBetter/comments/osbnj3/arguing_with_myself/", "nsfw": false, "first_save": 1635437512.6759877, "replies_charged": false}