{"id": "t5_2tand_t3_oq2tal", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "I have been in a relationship for almost 4 years now. I have never been this close to someone, thus my actions and words have never mattered so much and never been criticized so much. My SO and I grew up in very different situations. I grew up in America in a well-off family, thus I grew up pretty dependent on my parents on making decisions and taking care of me. While my SO grew up in Asia in a third world country in a low income family. Thus she grew up in a very independent world. We met in college and fell in love. However, a problem within our relationship has always been my dependence on her to help me better myself, my weak communication skills, and my lack of self-motivation. Paired with being newly long distanced and it been 4 years, she's fustrated with trying to better me, but me not getting better and not having the motivation to. Therefore, this is why I am making this post today.\n\nMy struggles:\nDependence:  I never realized it until I met my SO, but I always let my parents make decisions for me. It made me highly indecisive and dependent on others. I have become more decisive, however I still have a worrying amount of dependence for a 22 year old. I depend on my SO to counsel me (they have a counseling background) and to plan events and dates. It's come to the point where it's been unfair to her and I have taken little to no initiative in anything.\n\nCommunication Skills: Part of this is struggle is cultural and part is my fear. My SO comes from a country where words matter a lot, promises are never broken, and people are truthful, even if it hurts. In America, we lie a lot (or at least how I grew up). People lie about why they cannot make an occasion, parents tell white lies to kids, we lie to hide a painful truth, etc. I constantly tell white lies to hide a painful truth, it's such a habit for me. I also live in fear of the response to the truth, so that further pushes me to lie. \nI am also really poor at communicating clearly. I have trouble separating what I know and what it is going on in my mind with trying to explain things or to be open about myself.\n\nLack of Self-Motivation: When my SO calls me out on these things I get a burst of change for a few days, then I go back to my old bad ways. Then my issues become a reoccurring problem. I genuinely don't know how to motivate myself. I always make up excuses and never completely change myself or at least change for the long-term. I only change for the short-term. Up until graduation, my main motivations in my life became my SO and school. Then I realized that I am graduating and my dependence on my SO to change probably is inhibiting me from my changing. I need to want to change.\nCurrently, I am in a down mood. My SO and I have been long distanced for a week now, I don't know when I'll see her again because of travel restrictions. I am job searching, gotten numb to being denied, still hurts a little though. Just a lot of post-graduation fear and having my social life teared apart. My SO is not near me and has an 11 hour time difference, best friends from college are far away, and I have no close friends back home.\n\nI appreciate any feedback, ways to get better, questions! Thanks in advance!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oq2tal/want_to_get_better_but_lack_of_motivation/", "title": "Want to get better, but lack of motivation", "social_network": "reddit", "user": "BilboSR24", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1627048271, "permalink": "/r/DecidingToBeBetter/comments/oq2tal/want_to_get_better_but_lack_of_motivation/", "nsfw": false, "first_save": 1635435098.8831134, "replies_charged": false}