{"id": "t5_2tand_t3_qgrs1u", "request": ["eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Hi everyone! I’m a 27F looking for advice and encouragement for starting over from nothing. I am realizing I’m at a place in my life where it feels like it’s either the end of the road or a new beginning (being optimistic) for me. I am at one of my lowest points in life. I have no money, no friends, no sense of purpose or motivation, no identity, nothing. I feel like a complete waste of space. I used to be so excited about life, but nearing 30 and having nothing to show for it makes me feel like a failure. I’m drifting. So much time has passed & I honestly couldn’t tell you anything I’ve done worth anything during that time & if I have, I don’t remember. I have gone to college and dropped out a number of times. I’ve had so many interests and ideas that I’ve left incomplete. In fact, I don’t feel like I’ve ever really been able to finish anything in my life. And it’s not at all because I’m stupid or lack talent. It’s quite the opposite. I just can’t commit or follow through. I know that there are several mental health issues I have to deal with; depression, anxiety, quite possibly adhd. But I can’t keep a job, don’t have health insurance, so I can’t afford treatment. I know, if I don’t do something about it soon, I may not make it too much longer. I’m sick and I want these feelings to go away, but i don’t know where to start. Please help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgrs1u/advice_on_starting_over_completely/", "title": "Advice on starting over completely", "social_network": "reddit", "user": "Holiday_Emergency", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1635322782, "permalink": "/r/DecidingToBeBetter/comments/qgrs1u/advice_on_starting_over_completely/", "nsfw": false, "first_save": 1635437489.0754604, "replies_charged": false}