{"id": "t5_2tand_t3_o6j5iq", "request": ["b1a66ef4-3e71-4d03-875c-961dbcef2285"], "text": "But nevertheless there must be something true to that\n\nMy family often tells me that I'm an egoist because...\n\n* not caring about the household (I'm 23M so living with them)\n\n* not caring if someone does something (mowing the lawn) so that I might go help him in something, or at least ask \n\n* not caring if it's night (or someone in our home wants a quite environment due to online learning)\n\n* being impatient, always about \"me me me\" (let's say I write something to dad on Messenger. If he won't answer in 2 minutes I get impatient and will show that I'm mad that he's not answering me, without thinking that he might be busy doing something different. Another situation was when I got out of the bus and wanted to take my luggage, and others became frustrated at me trying to get my luggage)\n\n* ruining friendships by threatening to block people or being rude to them if they write something which can be annoying \n\nIt's not that I don't agree with them. But I fail to see it for myself, and I always need someone else to say this to me\n\nI don't actually try to be actively a jerk. I am literally not aware if I am behaving like a jerk, because (citing my family): \"You only care about yourself\" and \"The world does not revolve around you\".\n\nI might have some sort of an asshole side, like heavily sexualizing women especially colleagues, feeling like a king and star in my own soap opera (I literally believe that I am *the* best - although it's silly, as I know people who're better than me at some subjects and things, but it's about this \"manic euphoria\" I sometimes feel, like I'd be the next prof Hawking. I guess I developed this as a coping mechanism to bullying)\n\nBut I also have a softer and emotional side, sometimes I just want to love everyone, care about everyone, watch the Teletubbies (for real) and try to live the utopia they are living (that love is the most important things in the world - nothing more)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o6j5iq/everyone_is_telling_me_that_im_an_egoist_and_not/", "title": "Everyone is telling me that I'm an egoist and not humble. But I don't see myself as an egoist and arrogant, in fact I think it's quite the opposite", "social_network": "reddit", "user": "hereintransylvaniaaa", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1624473733, "permalink": "/r/DecidingToBeBetter/comments/o6j5iq/everyone_is_telling_me_that_im_an_egoist_and_not/", "nsfw": false, "first_save": 1635436379.6730933, "replies_charged": false}