{"id": "t5_2tand_t3_c1d28q", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Some of you have gone some rough stuff thats why im asking cause i have no clue what i should do. I dont know what i am anymore. But writing about how i feel makes me feel better. This all that came to my mind...\n\nI want to stop being a generic invisible stupid boring r/niceguys and i dont know how to escape it or i will ever.. i have a boring life. Im such a loser with 0 friends. And i failed in school for two years. My yearz all wasted on porn and girls online.. whats my biggest problem? Why im like this\n\nI never had a best friend or a GF.. no one cares about me. Im invisible. No one texts me or messages me first. Or asks questions first. I just dont know what to say, i dont have anything to say to make friends. Im always the one saying more things. Trying to entertain other person. But they never put any effort into me. Im not interesting..\n\nIm fighting a losing battle trying to make people like me cause i hate my self. Or trying to get girls to chase me\n\nWhen i think about life i just think it doesnt make any fucking sense and its weird.. study, get a job, marry, have kids, then die.. my life is super boring. Im afraid of having no experiences or not doing any self improvement but im lazy and i dont know what to do to do better. I just feel empty. Nothingness. \n\nIm tired of masturbation but im addicted to it and im addicted to depression..\nSome say you attract what you are i guess depressed girls will like me... and stupid ones.\n\nBut i think about not making my whole life about masturbation or porn or girls.. i dont know what i want my life to be about.. but i think about being good to others cause life goes fast.. idk im so confused and crying right now. Do i need to be positive and greatful for things i have and stop masturbation ? Things go better?? I feel like killing my self and ending it all so badly. Sometimes i think i should be happy im in this earth and experiencing it.. but still tired of my life.\n\nI think about how i have No love and no one likes me or cares about me or cares to get to know me, how to make friends? How to have a personality?, how to have social skills? How to not run out of things to say or talk about ? Idk what to say to people to be my friend.., how to have a sense of humour?, how do i use my brain?, how to have intelligence? How do i stop wanting pussy or a GF? Its like i need a gf so bad, how to have charisma?, how to not be a loser?. I have nothing and im worthless.. how do i have my own opinions and values and interesting thoughts? How do i be creative ? How do i think outside of the box? How do i be smart? How to be cool? How to be funny? How to make others relate to me? Why i run out of things to say? How to open my mind to say more things? How do i love my self? How to stop chasing pussy? How to stop putting everyfucking one on pedestal? How to not be boring? How to ask open minded questions? How to make people take me seriously? Im tired of getting one word replies. Or im always the one starting convos and i get ignored.. how do i stop wanting likes and rts on twitter? It makes me feel unimportant when i see others getting ton of likes and rts but not me? Its like i want to be famous and get a lot of attention... \n\nI cant even annoy people if i wanted to. Cause i aint hilarious or funny or goofy or have charisma or charm or creativity with jokes. I have banter with no one\n\nI want people to love me and make me feel worthy and give me attention and ask me questions.. but people just reply with blunt one words to me. Every Girl ignores me.. im a boring person. Not fun to be around. Im lost. Is getting a girl really important??\n\nI live in a small boring town only hobby to get is soccer.. dont fucking tell me to get hobbies. Cause i would if i could or had money..\n\nIm just a nice guy i have no other qualities in me.. might be why im invisible and no one likes me, how to stop begging ppl just to be my friend? How to stop living life as a stupid brainless person?\n\nIm dislikeable by everyone..how to make people to like me cause i have no personality?\n\nIm so simple minded, my mind is very small, im absent minded. I dont have crticial thinking or open mindness.. im so simple, and any girl could get me easily, im easy to be fooled, im so stupid and retarded\n\nIm jealous of guys who have all of these. I assume everyone has these. And i beat my self up cause im not like those people and i hate myself.\n\nLike how do i live my life not as a stupid foolish brainless invisible boring guy? \n\nwhats my biggest problem in the posts i do? Do i even have any problems? Or it is porn making me feel depressed ? Should i do self improvement? Im 18/M. What an 18 year old should do? Enjoy life? What is life about? Who i am? Who should i be? Should i focus on making friends?\n\nI dont know what the hell do i have to do to make people like me or give me attention? I always try to make them laugh so they just like me. But they dont care. What do i say that will make people care? How do i start convos? How do i make friends with people i dont know?\n\nI feel very lost. Not happy. Or sad. I dont feel anything but i feel like going back to masturbation. \n\nI ask questions like an interview. Its always a tedious convo. I dont know how to ask open minded questions. \n\nHow do people never run out of questions to ask about other person? Im horrible at starting convos too.\n\nI say ton of things just to get replied by one words.. i care about Rts likes alot. Im jealous of people who get them.. i feel like im stupid and a fool..\n\nI feel like i need people to like me so it makes me think im \"Fine\" and perfect. I cant say im Okay while being stupid and boring and invisible. Its truth.\n\nThese things go through my mind everyday\n\nThe only quality about me is being \"Nice\" and that doesnt mean shit. Being an asshole would be better cause girls would like that. I feel like being \"Nice\" is what i have become cause i stayed home for 2 years. Between 13-15. Im nice cause i have an empty mind nothing else to say.\n\nI feel like everyone is better than me. More amazing than me in anyway and have more friends than me and having a lot of people loving and giving them attention them not me . Im not special or unique. Im not good. Im nothing. Im worthless.. i dont want my entire life to be alone.. i just feel like crying. I feel sorry for my self. I pity my self. I want to end my life.\n\nIm boring cauze i have nothing interesting to talk about. I say 3 sentences girls just ignore me.. they say one words cause they feel bad for me. I want to change this fucking person i am. I hate being invisible. \nI dont have anything to say at all..\n\nI depend on porn and girls to be happy.. but i chase approval and attention from girls \"online\" so they give me attention and i feel like im \"worthy\" but nobody gives me the satisfactipn cauze \n\nim a horrible person. An asshole. A crude. A egotistical stupid young guy that doesnt know what he is doing in his life... i feel purposeless.\n\nI dont feel anything. Happy or sad. Idk what i should feel like... i just feel stupid, foolish, dumb, like a loser.. \n\nI try to use getting attention from girls and porn to escape my problems.. but i cant... most i hate about.my self is i fail at everything and im a naive stupid nice guy that doesnt know how to make friemds and i have no qualities. Its the truth.\n\nAre my posts the same?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/c1d28q/how_do_i_stop_being_a_stupid_boring_invisible/", "title": "How do i stop being a stupid boring invisible r/niceguys? I chase peoples attention and pussy.. but no one likes me or loves me. How do i stop these? I want to get better but im lazy.", "social_network": "reddit", "user": "hamacule55", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1560709267, "permalink": "/r/DecidingToBeBetter/comments/c1d28q/how_do_i_stop_being_a_stupid_boring_invisible/", "nsfw": false, "first_save": 1635435837.2222998, "replies_charged": false}