{"id": "t5_2tand_t3_pgeeb8", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "This is a bit of a weird question. \n\nBut I don't have a lot of direction in my life, don't have a lot of structure or people close to me. \n\nAnd im constantly feeling overwhelmed and like nothing is worth it. \n\n&#x200B;\n\nAnd im thinking that having something with such a strong purpose/structure would be really good for me.\n\nBeing able to believe that everything happens for a reason and is part of \"gods plan\" and that everything is just a test and that i'll eventually end up in a place where everything is amazing (heaven) if i just believe. \n\nBeing able to think that im on a \"crusade\" and fighting \"spiritual warfare\" and that im saving the world and part of this huge collective and im on a really important mission and fighting against this great big enemy (this is what i gathered from a few minutes of looking at qanon btw) \n\n(Sorry if i've misrepresented anything in the 2 above paragraphs, i don't actually know much about either groups im just using them as an example). \n\n&#x200B;\n\nBut yeah groups like these talk in terms of absolutes which for someone whos lost in the world like me, is very appealing and could honestly help a lot. \n\nAnd obviously i don't want to join an actual cult because you will likely suffer the negative effects of alienating the people around you, losing a lot of money and/or losing your life in a physical or mental sense. \n\n(I would also like to avoid organised religions because afaik they're based around worshipping one kingly diety and im not really into that or feel that it would benefit me that much). \n\n&#x200B;\n\nSo is there like a good cult that uses the draw and power and techniques of cults but instead of doing bad things to you, they encourage you to be good? \n\n&#x200B;\n\nI could and have often thought about making one myself but like, half the draw of cults is the other people that are already in it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pgeeb8/is_there_a_cultreligionstrong_ideology_completely/", "title": "Is there a cult/religion/strong ideology completely focused on self improvement?", "social_network": "reddit", "user": "Im_Trying_I_ReallyAm", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1630574954, "permalink": "/r/DecidingToBeBetter/comments/pgeeb8/is_there_a_cultreligionstrong_ideology_completely/", "nsfw": false, "first_save": 1635437157.9901412, "replies_charged": false}