{"id": "t5_2tand_t3_nm3ndp", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Just like everyone else, I have my struggles, demons, insecurities, fears, anxieties, etc etc. But, my best friend challenged me to do one difficult thing a day. Sometimes, that’s calling or reaching out to a friend or a professional. Sometimes, it’s going to the store. Sometimes, it’s going for a short walk. Sometimes, it’s using my voice (selective mutism). Sometimes, it’s using exposure therapy in short increments for noises and lights. Sometimes, it’s doing a chore that’s been waiting for a week.\n\nBasically, change doesn’t happen all at once because I didn’t become this complex person all at once. But, becoming complacent is the true enemy of becoming better. I’ve fallen victim to it too many times in my life and I refuse to do that anymore. \n\nEvery day, I do something difficult and every day, there’s a new challenge that awaits me. Every day, I struggle with the idea of staying in bed vs. doing something. There are a lot of things in my life that I have no control over but there are a lot of things that I do.\n\nMy twin flame died last month and this is the first hard death I’m dealing with sober. Like, 1000% sober. All of the small difficult things I do daily don’t compare to this, but it is something I not only want to do but have to do. \n\nSo, my friends, I extend this challenge to you. Do one difficult thing a day. It doesn’t have to be this huge show. It could be bringing those dirty dishes to the sink or putting your clothes away.\n\nEvery day, we have a choice to make. But, every day we are given an opportunity. Take it. I am rooting for you all.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nm3ndp/my_best_friend_challenged_me_to_do_one_difficult/", "title": "My best friend challenged me to do “one difficult thing a day”.", "social_network": "reddit", "user": "ohhoneyno_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1630, "down_vote": 0, "creation": 1622107868, "permalink": "/r/DecidingToBeBetter/comments/nm3ndp/my_best_friend_challenged_me_to_do_one_difficult/", "nsfw": false, "first_save": 1635436016.8213732, "replies_charged": false}