{"id": "t5_2tand_t3_pbkzg9", "request": ["b69cf201-6737-4217-b486-9096135546b8", "c6df14ee-195b-4e9d-8032-7cca73d46fe8"], "text": "EDIT: TRIGGER WARNING: Suicidal mentions.\n\nHey fellow readers.\n\nSo, my mental health has been awful lately. I suffer from a personality disorder and Aspergers, and on top of that, unbearably high anxiety and paranoia to the point of being at the edge of psychosis. This was mainly due to hanging out with people constantly teasing me. My tolerance for that is limited due to my extreme sensitivity and autism. I take (too many) jokes as personal attacks, which awakens my paranoia, then it spirals uncontrollably from there until I come close to stabbing myself or consider threatening my friends with suicide (or simply consider suicide). This is my 'shadow' trying to manifest itself, however, I know it so well, I voluntarily avoid letting my demon out of its cage. Spending time with them on a day-to-day basis made me paranoid to the point of delusions (the belief of them shit-talking me every time I leave them out of sight), (hearing voices in my head of them plotting against me), and a lot of aggression and urge to throw my coffee after them.\n\nAfter having enough of this shit, I simply left them. I was sick of them not respecting my vulnerability, me being severely ill and unstable, and breaking me down continuously, so I went and confronted them and explained I was fucking done as direct and ice-cold as I could. My last words to them were, \"fuck you, bye, have fun shit-talking me.\"\n\nMy paranoia has decreased tremendously since and so has my stress levels, which has enabled me to be a lot more productive and efficient, however, anxiety is still unbearable. From a personality psychological perspective, I am exceptionally high in neuroticism (98% percentile), which overshadows my conscientiousness. Same with extroversion and enthusiasm. When I manage to keep my neuroticism at reasonable levels, I can actually be very enthusiastic and extroverted, which enables me to improve my social skills rapidly, until I somehow manage to saw off the branch I am sitting on again.\n\nBut I have a plan now.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pbkzg9/i_left_some_asshole_friends_for_good/", "title": "I left some asshole friends for good.", "social_network": "reddit", "user": "uvuvwevwevweugwembe", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 51, "down_vote": 0, "creation": 1629927213, "permalink": "/r/DecidingToBeBetter/comments/pbkzg9/i_left_some_asshole_friends_for_good/", "nsfw": true, "first_save": 1635436452.6448169, "replies_charged": false}