{"id": "t5_2tand_t3_eifgku", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Other people have probably talked about this more eloquently than I am, but I guess I just feel melancholy on the first day of the the year.\n\nI have a great job, within biking distance, doing what I love (it's a dog kennel!). I am finally able to fully support myself with no dependence on people who suck for rides or rent.\n\nI cut off my ex girlfriend, most of my family, and a lot of bad friends this year. I know I deserve to be treated better, and I'm making steps to build better relationships. \n\nI have a great boyfriend, a clean house, more furniture than I've had in years (lol), my dog's back in obedience training, and I'm figuring out my physical health with doctors (turns out I have Grave's Disease haha).\n\nI wake up every day, do the things I need to do, have a pleasant social life, whatever else... but I feel just as bad as I did at the beginning of the year when I had none of these things.\n\nI miss the people I've cut off, I feel exhausted and anxious only working 20 hour weeks, I constantly feel like I'm not good enough for my current relationships, I'm so confused about how to figure out starting school, balancing the 6 specialists I have, and I'm just... sad, frustrated, and lonely all the time. I have psychiatric medication prescriptions but I wanted to figure out my physical health first. I'm in line for a therapist starting on the 10th... I hope that helps me.\n\nI WANT to do better. I truly do. I'm making all the right choices. But I dont feel better. Does this happen to other people? What am I supposed to do? \n\nDo I just keep faking it until I make it, or am I doing something wrong? Thanks guys.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/eifgku/im_doing_everything_better_but_i_dont_feel_better/", "title": "I'm doing everything better, but I don't feel better.", "social_network": "reddit", "user": "neophyteneon", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1577862367, "permalink": "/r/DecidingToBeBetter/comments/eifgku/im_doing_everything_better_but_i_dont_feel_better/", "nsfw": false, "first_save": 1635437687.5301917, "replies_charged": false}