{"id": "t5_2tand_t3_dvyxuf", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I grew up in a fairly working class household. Neither of my parents went to college and got married shortly after high school. My dad was an auto-detailer and my mom was a stay-at-home mom. When I was about 8 my parents got divorced and that's when we became particularly poor. My mom worked the graveyard shift at a convenience store to keep us afloat.\n\nNow, in adulthood, I find myself being weirdly proud of my lower class upbringing while also feeling shame and trying to distance myself as much as I can from it. This causes me to be very judgmental toward wealthier people or people who grew up much more privileged than me. I know that this is unfair of me to do because obviously no one can control how they were brought up and that I should instead be happy for them. But sometimes I can't help it.\n\nAlso, I sometimes feel guilty about complaining about my underprivileged childhood considering it could have been much worse. My parents were still generous enough to spoil me and my sisters as much as they could and there were times when my childhood was pretty comfortable and felt pretty normal. \n\nI really hate blaming my current lot in life on the fact that I may bot have had adequate resources to succeed because I feel like it's shirking responsibility and maybe I'm just lazy (which I kind of am).\n\nSorry, this became a tangent. Please refer back to the title because that's what I really need advice on.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/", "title": "How do I stop being bitter about my underprivileged upbringing and stop resenting people who had those privileges?", "social_network": "reddit", "user": "st-ove", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 732, "down_vote": 0, "creation": 1573681702, "permalink": "/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/", "nsfw": false, "first_save": 1635437841.5528214, "replies_charged": false}