{"id": "t5_2tand_t3_ismrqr", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "The last time I got drunk was in May of 2014, I got drunk off of NyQuil sleeping syrup and cooking wine. At that point that was the first relapse in months. My second to last relapse was on the night I went homeless around mid December of 2013.\n\nMy partner attempted suicide in March 2014, I was working for room and board as a direct care worker and trying to earn the means to fly overseas to get to him.\n\nThe gal he was dating before me back then, well more like she emotionally strung him along for months at a time online with no communication, suddenly got back into contact with him after months of being unavailable and she lashed out on him for me dating him.\n\nI took one break back then, just one to clear my head from the stress of trying to navigate my complicated situation while I worked for room and board. My employer at the time was compulsively ordering up barely legal escorts multiple times a week, had many illegally owned firearms in the house along with hallucinations that were a symptom of his Parkinson's. His mother had early stages of dementia. I was struggling to assist them both while I struggled to detox from the meds I was prescribed then, namely Seroquel and Paxil.\n\nMy thinking far worse then, as was my rationale and general mental health, I took one break to spend the night with a friend-with-benefits I had back in college. I discussed this with my partner prior to doing this, he was ok with this.\n\nOur circumstances were demanding and rough, he understood that I needed to find some kind of comfort to keep my sanity at that time, and sex unfortunately was a maladaptive coping mechanism that helped keep my head glued together. I discussed all of this and he understood, he too had his own sexual dysfunctions that I supported him through as well. But as I was stepping out the door, this gal online suddenly popped back up and lashed out on him online.\n\nI was supporting my partner every day online for hours, except that one day. I took that one break to spend the night with that friend and I came back to messages of him attempting and failing to commit suicide and how his family didn't even notice, he lived with them back then.\n\nI was so distraught that I accidentally dropped a whole 6-pack of coke on my former employer's expensive rug and was nearly let go for that.\n\nI had one night of comfort, and I almost lost my partner for that back then. That ate away at me for months along with everything else, my relatives that I cut contact with sent cops after me twice in May and I was almost let go for this as well. I wasn't able to file a restraining order against them.\n\nIt was pure luck that the cops didn't notice the escorts or illegal firearms. It is pure luck that law enforcement then didn't permanently end my quest to get to my partner overseas. I had a case manager then that helped advocate for me. I am still grateful to her and for that gig I had with that employer despite how nerve-wracking it was.\n\nThat May back in 2014 was horrible and terrifying, and it drove me to drink until I got drunk. A desperate and sad kind of drunk. My partner saw me drunk online, even while I was drunk like that I never wanted to show him that again. His father is the worst drunk I've ever seen, I never wanted to look like his father to him, I never wanted to do that to him again.\n\nSo that May in 2014, I got drunk, a sad and gross kind of drunk, but I never got drunk again. In August of 2014, I made it overseas to my partner, and we began our healing journey together. It was rough and scary, I was terrified for the worst for years while I worked to try to help us both recover.\n\nThis country, my partner's country, is an alcoholic's paradise. His relatives try to get me to drink every holiday, we only go to these holiday occasions because we were obligated. With the combined toll that our traumas and mental health take on us, my partner and I are unable to sustain a regular 9 to 5, so we were more financially dependent on his mother, who is fairly affluent in this country and isn't hurting for money.\n\nHowever, she is an enabler, this scares me, she enabled his father's alcoholism to the point of him crippling himself over booze. I grew up around addicts, many kinds of addicts, but my partner's father is the most debilitated alcoholic I've ever seen. There have been times, many times, where she would offer us alcohol filled chocolate despite me saying multiple times that I cannot drink. His sister one time offered me wine 3 times in a row after I declined. All of his relatives drag out the vodka and many other kinds of liquor for every single occasion.\n\nDuring a funeral dinner, they dragged out a 2-3 liter bottle of vodka and started drinking it shot after shot.\n\nI have to leave these parties early and it irks them. We are obligated to attend and stay for a few hours and I have to meditate to deal with it.\n\nWe however were able to make online courses and content and we built up our own passive income along the way as we juggled our issues and got him to the doctors that he needed to get to. We teach ourselves skills to generate more income online but our major limitation is our shared traumas and mental health issues.\n\nI was feeling low about how slow our progress has been in some ways, how it has taken nearly 7 years to get to this point. But too the fact that we can heal at all is lucky considering where we started.\n\nI took the time to remember the last time I was drunk to remember how bad it was before, so I can give myself the approval I deserve.\n\nI don't have friends in this country because everyone drinks, alcohol is everywhere and sobriety matters that much to me. That and mental illness here comes with a real social stigma, there's also that. So, we are fairly isolated, but we do our best to make the most of things. Plus working online and earning USD is more efficient than sustaining a day job around here anyway.\n\nThis was the first time I celebrated my sobriety from alcohol. I've not really taken the time to pat myself on the back for this. Alcohol, ever since I first got drunk in Japan in college, has destroyed so much. I was not myself when I was drinking, I never want to go back to that, even with the cultural pressure to drink here.\n\nI'd rather go full hermit and remain sober with my best friend than to socialize and relapse.\n\nSo this post is my first sobriety celebration party, thanks for being part of it and celebrating this with me.\n\n**Edit September 15th:** I woke up and saw just this amazing flood of people congratulating me and upvoting this. I didn't expect that, but wow this really energized me. \n\nI was feeling very stressed, fatigued, and a bit alone in the world with trying to help out my partner and pushing through chores. This time of year is especially hard on me, the holidays really wear me down and it gets hard to cope with it all. I get more tired and it gets harder to focus on weightloss/fitness and everything else I am trying to juggle. \n\nThank you all for celebrating this with me, for the awards, for helping me feel heard and valuable. I am grateful that I was able to help out a few of you out there too with this post. \n\nYou all have shown me that my stories and experiences have the power to do some positive good in this world, you all have helped renew my drive and ambitions towards helping others in my lifetime. \n\nThose days where I sobbed alone in a McDonalds as everyone ignored it, those days made me feel like I was better off fading away from this world. Those days made me feel like I was no longer of value when I was no longer able to be a gifted student in university. \n\nHowever, this acknowledgement and encouragement, I've been starved out of this for years as I pressed on, alone with my partner. \n\nThank you all for believing in me this much, for rooting for me as I am now. This helps me to find the strength to keep pushing forward so that my partner and I can heal, so we can then help others with our art and content in the future. \n\nYou all helped me see the merit I have to offer as I am now. Thank you all again for that. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ismrqr/ive_been_sober_from_alcohol_for_over_6_years_now/", "title": "I've been sober from alcohol for over 6 years now.", "social_network": "reddit", "user": "Reisno", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1666, "down_vote": 0, "creation": 1600096428, "permalink": "/r/DecidingToBeBetter/comments/ismrqr/ive_been_sober_from_alcohol_for_over_6_years_now/", "nsfw": false, "first_save": 1635436192.422918, "replies_charged": false}