{"id": "t5_2tand_t3_3bex1f", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Don't worry, I called her first, and she knows I'm coming. What she doesn't know is that I'm bringing Doritos, beer, and chocolate – perfect cheering-up food ;D We're gonna spend the night hanging out and Minecrafting, and I'm going to help her install a Lord of the Rings mod onto her computer (she's a huuuge LotR fan) and I'm so just all-around psyched to see her. \n\nI haven't exactly been putting my best friend first these last bunch of months, because I realized that I was focusing all of my energy on my boyfriend; all my free time I devoted exclusively to him, and often felt like I was pushing my best friend to the side (and I hate making other people feel like that, even though she assured me all the time that it wasn't like that). Me and my best friend always made an effort to see each other at least once a week, but we haven't been having the same kind of chills lately.\n\nIn any case, I'm determined to do better by her now. She's flying out of the country in three weeks for the summer, so I need to make the most of these free days. I'm on the last bus now to her dorm, and I'm so excited. Less than an hour left!\n\nPlus there's the most amazing sunset happening right outside my bus window... Ah, today is great. :D\n\n**TL;DR – Bearing gifts of beer and junk food, I am embarking on a ninety-minute journey by bus to my best friend's college dorm to cheer her up in the midst of finals :)**\n\n-------\n\n**UPDATE: She was so happy! Almost cried when I walked in, so I gave her the biggest hug (and the beer, which made her start laughcrying even harder). Everything went awesome, and we were up till 2am watching Archer :D Thanks for the support, guys! Have a great day!**\n\nEDIT clarification – yes, the LotR mod is indeed a Minecraft mod ;)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3bex1f/my_best_friend_lives_an_hour_and_a_half_away_from/", "title": "My best friend lives an hour and a half away from me. She's been crazy stressed for weeks because of finals, so spur-of-the-moment, I decided I was going to visit and cheer her up :D", "social_network": "reddit", "user": "getyourownthememusic", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 114, "down_vote": 0, "creation": 1435509208, "permalink": "/r/DecidingToBeBetter/comments/3bex1f/my_best_friend_lives_an_hour_and_a_half_away_from/", "nsfw": false, "first_save": 1635435874.0752876, "replies_charged": false}