{"id": "t5_2tand_t3_kc6dxd", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "***Backstory***\n\n**I did it.** I almost can't even believe it, but I actually did it. I wasn't going to share this because i was scared to be judged but fuck that. 2 years ago I was dying, an IV heroin and Benzo addict on the streets. its okay to be vulnerable.\n\nI woke up this morning watching my daughter smile, turning 10 months old, knowing she never has to see her dad high, scared to deat knowing if I ever relapse I could change this little girls life forever. I looked in the mirror turning 28 years old, happy. Something I never thought I'd be. I'm proud of myself today. I believe in myself, my daughter has her daddy, the mother of my daughter has her person back. But what if I can’t do it, I have those thoughts.\n\nDrugs are fun. Drugs are a good time. Be safe, be responsible, and if you need that release once in a while it's absolutely ok. But drugs don't love you, your family and friends do. If you think you need help, start with the asking. Don't let it take over your life. Don't let it kill you. You're not a junkie or a failure. You're just another person with a vice to deal with the shit life throws at us. I hope anyone’s stories maybe or advice can help, **thank you in advance**.\n\n***Connection is the cure for addiction, so feel connected to me. To everyone in this reddit, to everyone facing the same fight in their lives as you. I'm rooting for you. I try just wanted to post one of the biggest accomplishments of my life and hopefully maybe inspire or help someone still struggling.***\n\n\n‼️ EDIT: Wow, thank you all for showing so much love and compassion and help. Sharing your personal stories, showing me it’s okay to get vulnerable. I’ve read every comment and learned so many things, I will slowly try replying to as many as I can, I didn’t expect this post to even get any comments at all let alone 50-100+ so I’m blown away. Thank you to every single person who reached out. You all made my birthday 10x better. Thank you🙏🏼", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kc6dxd/today_121220_i_have_2_years_clean_my_daughter/", "title": "Today, 12/12/20 I have 2 years clean, my daughter turns 10 months old, & I turn 28. I'm absolutely terrified, Her mother and I are just rebuilding our relationship and i have to be a father. I just feel overwhelmed. Advice?", "social_network": "reddit", "user": "DylanTheSagittarius", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1402, "down_vote": 0, "creation": 1607843822, "permalink": "/r/DecidingToBeBetter/comments/kc6dxd/today_121220_i_have_2_years_clean_my_daughter/", "nsfw": false, "first_save": 1635435101.697499, "replies_charged": false}