{"id": "t5_2tand_t3_mq7f06", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Hi everyone, I don't often post on reddit so I apologise if anything is formatted incorrectly.\n\nI'm a 23 year old Cyberpsychology Masters student in the UK and I so badly want to fix myself, and I'm looking for some help on how to get there. I've been struggling on and off with depression and anxiety since I was about 18, having had CBT in the past, and it has reared its ugly head again in the last 6 months. I have no motivation to look after myself, to work on my university assessments (which substantially increases my anxiety because I worry about not doing well), my self confidence is in tatters, I don't work out anymore so I don't feel happy in myself, and my sleep quality is terrible so I'm tired all the time. I often wake up and wish the day could be over, or just play video games to try and cheer myself up, but things that I used to enjoy like gaming and drumming aren't fun to me anymore. My work terrifies me to the point where it paralyses me, I know no-one on my course to chat to about anything because none of us have met because of lockdown, and the smallest of things knocks my confidence completely.\n\nI've been in a good place before, when I was in the second year of my undergraduate degree and I want to be that confident and self assured guy that I know is in there somewhere!! I want to feel happy again and I wondered if the kind strangers of Reddit could give me any advice on how to get there, or perhaps say what has worked for other people in a similar situation. I really appreciate you reading this and offering any advice you can give", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mq7f06/advice_on_being_a_better_me/", "title": "Advice on being a better me", "social_network": "reddit", "user": "DragonrageHT", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1618335792, "permalink": "/r/DecidingToBeBetter/comments/mq7f06/advice_on_being_a_better_me/", "nsfw": false, "first_save": 1635435872.471884, "replies_charged": false}