{"id": "t5_2tand_t3_d9065x", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "A lot of people seem to be afraid of being genuine and expressing themselves openly and honestly. There are a lot of situations where people hide their true colors and instead pretend to be someone they are not. For example, when meeting new people, they want to make a good impression, so they try say what they think that the other person wants to hear, rather than what they are actually thinking. I think we’ve all been there at some point, and in a way, it makes sense. I mean, people are going to judge you based on what you say, so you better say something smart, something that they are going to like. Right?\n\nWrong.\n\nThis is not a good way of getting what you want in life, and ultimately, you are setting yourself up for quite a miserable life. If you live without integrity, not expressing yourself openly and honestly, you will eventually find yourself surrounded by people who don’t really know you. They may like you, however not for who you actually are, but for who they think that you are; who you portray yourself to be. You end up with a job you don’t like, friends you don’t respect and a partner you don’t resonate with. This is not what you want.\n\nNow, if you adopt a life of candour, always expressing yourself openly and honestly, always being genuine with yourself and others, you are going to attract what’s right for you. It may not be what you think that you want, but it is what is right for you, given who you truly are.\n\nFor example, say that you are at an interview for a job that you are interested in. The interviewers are going to evaluate whether you are the right person for this job. If you are genuine and honest and they decide that they don’t want you for the job, then let’s face it: you were probably not the right person for the job. Most importantly, that job was not the right job for you. Don’t beat yourself up for “failing” the interview. You dodged a bullet! The same mindset can be applied to dating, making friends and pretty much anything else in life.\n\nIt’s like the law of attraction. You are sending out a signal to the world and things that resonate with that signal are going to latch onto it. As such, when you are genuine, you attract what is right for you. You will be surrounded by people who like you for who you truly are, people who are inspired by your integrity and encourages you to be yourself. These are the people you want in your life. These are the people who will make you flourish and become the best version of yourself.\n\n**TL;DR:**\n\nEmbrace who you are and be genuine. Express yourself openly and honestly, and trust that this will get you what’s right for you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/d9065x/why_you_should_always_be_genuine/", "title": "Why you should always be genuine", "social_network": "reddit", "user": "RichVince", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 423, "down_vote": 0, "creation": 1569398346, "permalink": "/r/DecidingToBeBetter/comments/d9065x/why_you_should_always_be_genuine/", "nsfw": false, "first_save": 1635436547.6785474, "replies_charged": false}