{"id": "t5_2tand_t3_nk0czb", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Hey fellows. In the second part I want to get you acquainted with a helpful stoic practice on how to eliminate or weaken compulsive desires on the spot. Wish a good read!\n\nMost of us are fully aware that hedonism sets us on the wrong path, however pleasures can be tricky and sometimes do sound very promising in their sweet talks.\n\nQuite often, after the very moment of relapsing into a bad habit or desire, we highly regret doing that and swear to never indulge in it again.\n\nBut unfortuantely we very rarely uphold these promises.\n\n**Make a list of unhealthy desires and habits that bring most problem to your life. Try to not identify yourself with your desires. Rather think about them as voices within you (like sirens in the odyssey). Which voices are the loudest and sweetest?**\n\nSo how do pleasures manage to trick us again and again even though we fully understand that giving ourselves into them excessively becomes a formidable obstacle to our happiness?\n\nThey manage to deceive us by making desired objects appear in extremely tempting way.\n\nIt’s as though feelings of pleasure and strong desires are telling us “This is good!”\n\nThey are also finding their way to convince us that they are less harmful or it isn't really a big deal to act on them just for this time.\n\nTo expose their delusive appearance we have to resort to the central stoic principle: **It’s not things themselves that make us crave them but our underlying value judgements about impressions of those things**\n\nThe impression of a desired object be it curves of an attractive woman, tasty smell of a delicious food is presented to us along with the value judgment, “That is good.”\n\nWe give assent to the value judgement underlying impression and trigger a desire for that attractive person, delicious food. By this point, “That is good” transforms into “I want that.”\n\nAs soon as desires start spiralling out of control, we either begin fantasizing about the things we crave by vividly imagining the affection of that person, the taste of that food or talk about them using emphatic language that inflates our own desires even further\n\n\"I want that\" turns into “I’d die for that roasted meat. It must taste like heaven\"; \"Her body looks so tempting. Can't wait to strip her naked\"\n\nAs a result desires become stronger and blind us so we can’t see that there are other ways of viewing the things we crave.\n\n**What kind of unhealthy desires or habits did you allow to deceive you recently? Describe what kind of fantasies did you have and how did you talk to yourself when desires started overcoming you?**\n\nSince you are the one who ultimately chooses to assign value to things that look inviting, it is in your power to withstand temptation by changing the way of looking at things you crave.\n\nTo neutralize the delusive effect of strong desires, you must get to the heart of the desired object and penetrate through it, so you can see it for what it really is.\n\nStoics called this exercise 'phantasia kataleptike' or objective representation.\n\nJust as talking about the things we crave in a language that excites our desires, describing them as objectively as possible helps us to quite them down.\n\nImagine yourself as a natural scientist exploring and examining properties of an observed phenomenon: with greater objectivity and detachment to understand what this object is really made of.\n\n“I’d die for that roasted meat. It must taste like heaven\" turns into \"\\[Your name\\] wishes a body of dead animal that went through heat treatment\".\n\n\"Her body looks so tempting. Can't wait to strip her naked\" becomes “\\[Your name\\] wishes sexual intercourse, which is just merely the rubbing together of body parts followed by a convulsion and the ejaculation of some mucus.\"\n\nThe things people crave are often nothing to get excited about if viewed from that perspective\n\n**Prepare yourself to resist desires in the future. Write down how you usually describe desired things to yourself and restate them using more objective language.**\n\nThis should be your practice throughout all your life: when things have such a plausible appearance, show them naked, see their shoddiness and strip away their own boastful account of themselves. \n\nP.S. If you liked this exercise, I have written more lessons like that. Just in case you **are curious to explore more**, let me know and I will share the link to **other lessons** in DM.\n\nThe themes I cover are: getting disciplined, reducing anxiety, learning about your life values, decision-making, the art of happiness, and being present in the moment.\n\nThe lessons are based on the primary sources of wisdom from more than 2500 years of history of philosophy: Plato, Aristotle, Lao Tzu, Carl Jung, Stoics, and many others.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nk0czb/how_to_stop_being_the_slave_of_own_desires_use/", "title": "How to stop being the slave of own desires. Use the power of self-talk to build ultimate self-discipline.", "social_network": "reddit", "user": "RevolutionaryGrab113", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1621869525, "permalink": "/r/DecidingToBeBetter/comments/nk0czb/how_to_stop_being_the_slave_of_own_desires_use/", "nsfw": false, "first_save": 1635437160.6679227, "replies_charged": false}