{"id": "t5_2tand_t3_g1j8e8", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff", "67305ca4-ce30-4c37-9a02-05d70fe958db", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": ">*Resume. Cover Letter. Work Experience. Repeat*\n\nLike a lot of us in the world, it’s become the official anthem to my quarantine. A paralyzing melody my trackpad has memorized in the process of my job hunt. But I have to say, it’s been a great alternative to the popular unemployment hit:\n\n>*“Unfortunately, we can’t bring you back, womp, womp, womp”*\n\nI can’t remember the rest of the lyrics because halfway through my former boss laying me off, I was trying to figure out my Linkedin password. For the record, I have seventeen unique passwords.\n\nNot trying to be overly dramatic here, but, it has been a stressful few weeks. Getting laid off during a pandemic is zero levels of fun. I’m not sure what is harder to do at this point, staying positive while trying not to let anxiety overthrow my focus or resisting the urge to eat an entire pepperoni pizza (or two).\n\n# Let’s Get Through This Together.\n\nMaybe someday I’ll write about how disappointed I am about being let go by a company that I poured my heart and soul into. For now, I have only two goals:\n\n1. **Secure a job.** My aim within this goal is to find a job that allows me to do what I love to do: be creative.\n2. **Stay motivated.** How I maintain my creativity is important. It’s easy to get complacent when Netflix just dropped a bonus episode of Tiger King.\n\nI’ve had some time to go through the emotional rollercoaster that is being unemployed. These goals are what’s keeping me sane. I‘ve spent some of my hundreds of hours of free time having conversations with people I trust. My friends, my family and for the purpose of keeping the focus on my goals, my mentors. The good ones will give you their unfiltered opinions & advice. One, in particular, called me out for allowing myself to apply for jobs I’m overqualified for. I get it. Settling for something less is just as bad as being unemployed. But, income is income, especially during these times.\n\nI know from experience, that scrolling through job boards can feel debilitating, and filtering jobs that make sense for you can be paralyzing, which is why I’ve decided to ask the right questions to help you (and me) figure out the next steps.\n\n**What are you** ***actually*** **good at?**\n\nThe world is upside down and with social distancing, you’re the only person who could literally pat yourself on the back. So why not now? What are the awesome skills that got you here? What accomplishments brought you to this point in your career? They don’t have to be mind-blowing, but it’s important that they are realistic. **List three things that define your skillset.** **I’ll go first:**\n\n* **Creativity:** The beautiful thing about creativity is that you could put your own perspective on things. I’ve been lucky to work in content positions that have allowed me to craft my creativity.\n* **Production:** I moved to Los Angeles to be a Director. On route to that, I’ve held jobs as an editor, a videographer and producer. Because of that, I’ve learned the ins & outs of production.\n* **Social Media:** No, I’m not a Tik Tok influencer. But, I’ve managed accounts for Playboy, Bellator MMA and a cannabis brand called ISLAND. The obstacles all three of those brands faced are enough to run an episode of *American Ninja Warrior,* I’ve had the privilege to get to the finish line.\n\n**What are you passionate about? Be honest.**\n\nBack to my first goal.\n\n>*“…find a job that allows me to do what I love to do.”*\n\nDo what you love to do. What is that? I interpret this section as the perfect place to put your interests. **Write ALL of your interests down and narrow them to your top three.** **As for me:**\n\n* **Art:** Specifically film & music. Yeah, I know. Who doesn’t love those things? But, I truly am obsessed. I love the production process all the way to the finished product. Without art, I’m truly lost.\n* **Exercise:** Over the last year, running has been a beacon of light. And shout out to YouTube workouts, they’ve been heaven sent, especially during the quarantine.\n* **Culture:** I know this is a wide net. But sports, food, and podcasts are all tied. What do they have in common? They’re all expressive results of culture.\n\n**What do you want to be known for?**\n\nJump to the future. Yes, I see you floating in Walter White levels of money, too. But *who* are you? What is that today’s version of yourself would be proud of? **Write three things that you want to be remembered for.**\n\n* **Creating meaningful content:** No, I’m not looking to change the world. It would be nice. But, this is more about creating content that doesn’t go away forever. I want to be able to create content that has a lasting effect on at least one person.\n* **Working with great people & brands:** This is important. It seems like a no brainer. But trust me, this isn’t always available. I want to be known for being a part of a brand that has a positive impact. I also want to work alongside people who don’t negative agendas.\n* **Being a good leader:** I truly see myself as a lead by example type of leader. But, sometimes that is harder than it sounds. One of my main career goals is to learn the skills to be able to manage a successful team.\n\n# Now What?\n\nAt this point, we’ve both laid out what we’re good at, what we love and how we want to be remembered. Now picture those three questions in a Venn diagram. What’s at the center?\n\nFor me, I think it’s clear. It’s a scary time, but, I still need to find a career that allows me to flex my creativity. I come from a background where people have said: *“You have to have one job and stick with it.”* Well, that’s not true. That’s why creativity is so important to me. I think that today, people have things that they want to express, and you need to have a wide range of tools. And filmmaking, music, food, all that stuff, they’re all tools. I want to be remembered for using all of these tools for a brand that creates meaningful shit.\n\nYour turn.\n\nI really don’t know how to end an exercise like this. I *do* know a few things though. It’s not going to get you a job overnight. It’s not going to give you all the answers you need. But, I do know, that if you got to this point, you will be thinking about your next moves. *What are you good at? What are you passionate about? What do you want to be known for? Repeat.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g1j8e8/i_was_laid_off_three_weeks_ago_due_to_covid_no/", "title": "I was laid off three weeks ago due to Covid. No more feeling sorry for myself.", "social_network": "reddit", "user": "house_thuggin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 67, "down_vote": 0, "creation": 1586917541, "permalink": "/r/DecidingToBeBetter/comments/g1j8e8/i_was_laid_off_three_weeks_ago_due_to_covid_no/", "nsfw": false, "first_save": 1635436052.0590613, "replies_charged": false}