{"id": "t5_2tand_t3_jpqa1a", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "This year in March I (23F now, 22 then) quit smoking.\nWhen this year started I was in a unfulfilling relationship, struggling to get the last of my undergrad courses completed, trying to work part time. Once I quit smoking, it kick-started a lot of other things, like working out, eating healthier, leaving my relationship, focusing on completing my degree, etc. I gained 3 kgs and hadn't touched any substances or cigarettes for 5 months, and then on the 6th (September) my entire house fell sick. \n\nI remember the time with Corona, I'd feel hopeless and wanting to just die, because there was continuous fever and then even when the fever broke, my parents were both in the hospital. What a scary time, nothing good to hold on to it seemed, constant uncertainty. However, now that it's past, my good energy is back with a vengeance.\n\nIt isn't even all physical or materialistic improvements, I've broken habits and behavioral patterns that I refused to even acknowledge in the past. My friendships are flourishing, I am happy alone and within myself most days, don't feel insecure or as anxious anymore. My spirituality is also guiding me continuously it seems and I feel like a new age hippie with how connected I am to all the positive energy LOL\n\nI had my first date with a girl yesterday (I'm bi, but have never actively pursued femme presenting persons). But during the date, I felt like this person who had arrived, was someone from my past. Someone bad, the he-who-must-not-be-named of my life let's say. I felt my anxiety trying to creep in, and on impulse almost, I began deep breathing exercises while talking to my date. And what do you know, eventually I looked and he was no longer there and I hadn't even noticed him leave. I didn't have a breakdown, I didn't let it ruin my day and as I was driving home after seeing my friends later at night, I felt like everything is changing and life is looking up.\n\nNothing's going to get in my way of getting better, there's still so much that I can't change about my life, but I find myself at peace in my home, in my skin, in my mind. I wish that all the beautiful souls here are able to feel this ease.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jpqa1a/life_is_a_compounded_domino_effect_of_good_energy/", "title": "Life is a compounded domino effect of good energy after 1 good decision succeeding", "social_network": "reddit", "user": "JiminHoe100", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1604753243, "permalink": "/r/DecidingToBeBetter/comments/jpqa1a/life_is_a_compounded_domino_effect_of_good_energy/", "nsfw": false, "first_save": 1635436548.3780215, "replies_charged": false}