{"id": "t5_2tand_t3_bx7o7a", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "To make a long story short about 5 months ago I felt like my life was just too complacent, working hard and drinking/doing drugs with friends kind of destroyed me mentally. So one day i just took off in my car, left my family and friends to live in my car in Colorado 14 hours away, through the winter. It taught me a lot about city life, survival, homelessness, depression. Met a lot of wacky people along the way and just how kind others can be. It honestly restored my faith in humanity. Did a lot of kitchen work, manual labor and volunteering too. Found god and know I'll never give up. Maybe you could sum up the story by the song \"what its like\" by everlast.\n\n\"I've seen a rich man beg I've seen a good man sin\nI've seen a tough man cry\nI've seen a loser win and a sad man grin\nI heard an honest man lie\nI've seen the good side of bad and the downside of up\nAnd everything between\"\n\nAt the same time though, Im still messed up. It all goes back to mind that doesn't see the world the way others do, a lot more in visual pictures than words. And I've read about autism, aspergers, OCD. If you've ever read about temple grandin the Autistic savant with a PHD, id see some similarities. People always described me as slow, foolish and it really drove me insane over many years of my life growing up. Because i never saw myself the ways others did. Ended up being an introverted loner in the end. \n\nFrom here? Who knows, kind of want to take a break from the city and volunteer on a farm to get away from the hustle and bustle, get a bit healthier. Then maybe it's time to get an actual place. Always told myself i wanted to help others, make people laugh and thought about being a therapist someday of sorts. I want to transform my mind into something more charismatic instead of cynical, more of a people person and friendly guy. Id like to think i have a good heart but it's definitely hardened.\n\nI do like to read maybe someone can recommend some books?\n\nTake care!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bx7o7a/sure_was_a_crazy_life_my_story_and_whats_next/", "title": "Sure was a crazy life, my story and what's next?", "social_network": "reddit", "user": "saul51", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1559767497, "permalink": "/r/DecidingToBeBetter/comments/bx7o7a/sure_was_a_crazy_life_my_story_and_whats_next/", "nsfw": false, "first_save": 1635436076.52898, "replies_charged": false}