{"id": "t5_2tand_t3_jvcrch", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "I've been dealing with treatment-resistant depression and anxiety for the last thirteen years. It's been *bad* bad. I've tried a lot of different things. Tons of antidepressants, TMS, ECT, ketamine, ayahuasca, a relocation across the country, martial arts, just to name a few. Nothing really helped. It's been dark for a long time.\n\nThis past summer, a big piece of the puzzle came into popped into place: ADHD. Very few of the mental health professionals I had seen over the last decade+ debacle of of my life had ever looked for it, and those that did never seemed to appreciate how big a role it might be playing in my mental health difficulties. I'll spare you that 10,000 word rant about the whole thing.\n\nI started taking ritalin along with my antidepressant this summer, and while it hasn't been entirely smooth sailing, I am really starting to see my old self reemerge. Hope, joy, positivity, and the *silence* in my head, sweet Jesus, the *silence*. \n\nI had assumed that once the clouds started to part that I would be overflowing with gratitude, which I do experience from time to time, but these days I'm just feeling pretty shook.  I'm waking up from a nightmare, but I'm still having trouble believing its real. I'm terrified it's all going to come crashing down at any moment. When asleep, I am having actual nightmares where I'm back in the abyss. \n\nI'm wondering how many of you have experienced something like this as they've started to get better. I would imagine it's fairly common, but I'm feeling alone in it right now. Did anything help?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jvcrch/so_i_am_getting_better_but_now_im_dealing_with/", "title": "So, I AM getting better, but now I'm dealing with the anxiety of going back to where I was. Has anyone else experienced this, and how do you deal?", "social_network": "reddit", "user": "HMS_StruggleBus", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1605553435, "permalink": "/r/DecidingToBeBetter/comments/jvcrch/so_i_am_getting_better_but_now_im_dealing_with/", "nsfw": false, "first_save": 1635437627.8214045, "replies_charged": false}