{"id": "t5_2tand_t3_9bpkag", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "A little introduction about me: I have been self employed for a little over a year and am currently in college. I have had a lot of attention on self improvement for a while. I was extremely focused on building my business at the cost of enjoying and experiencing life and I want to change. In my English class we had to write a letter to ourselves, and it got me thinking about the areas in life I want to be successful in. These are in no particular order as I just wrote them as I thought of them, I am open to any and all suggestions to improve this list.\n\n**Spiritual**\n\nThis could be going to church, meditation, saying prayers before meals or something along those line. I am not religious so for me \nthis is reading about philosophy. I enjoyed a college course I took on the subject and this seems to fulfill the spiritual role in my life.\n\n**Fitness**\n\nMost people would agree that physical fitness is important, but it often gets neglected in our society. Fitness is necessary for a long and healthy life.\n\n**Health**\n\nThis includes diet, hygiene and taking care of your body with regular dentist and doctor visits.\n\n**Romantic Relationship**\n\nFinding the right person to live your life with is tough. I put this separate from family because it requires much more time and effort for both parties. It is important to keep open communication and to make sure your goals are compatible.\n\n**Family**\n\nIt is important for me to have a good relationship with my relatives. I can easily go a few months without talking to my siblings or parents and I want to improve in this area of my life. I'm sure a lot of you feel the same way.\n\n**Social life**\n\nI've always considered myself an introvert. I have a small, close group of friends and don't go out of my way to talk to other people. Its not that I was uncomfortable talking to new people, I just didn't care to. Once I moved to a new town, my entire social life was online through video games, discord, and texting. \nOnce I stopped playing video games, I became aware that this was something I needed in my life. School started again last week and I am really enjoying the interaction with new people. I plan to do some sort of regular social activity.\n\n**Competitive Outlet**\n\nI grew up with 2 brothers and a sister, everything was a competition. Who could finish their dinner first, who could get farthest on a game, who had the most candy after Halloween, etc. For a long time this was also video games for me. I want to find something else to meet this need. \nFor many people it is their career, but I know I would not want that for myself.  \n\n**Creative Outlet**\n\nI recently rediscovered a site called skribbl.io. \nYou draw pictures and other people guess what you are attempting to draw. Even though my pictures suck, it is still fun to play and made me realize an important aspect of life I was missing out on. I am going to find some other ways to feed that creative urge I have. \n\n**Career**\n\nLike I mentioned before, I am self employed. This is the dream for most people, but I hate it. It allowed me to not have to interact with people regularly and is part of the reason I don't have much of a social life. I think the hyped up idea of working for yourself comes from people who were in the corporate world for a long time and didn't like it. Find something you enjoy and supplement your income in other ways. \n\n**Financial**\n\nI think it is important to have a hobby that creates some sort of income. It is rewarding in a different way than other things listed above and not having any chain of command or worrying about other people's opinions on what you are doing is a nice feeling. \nA financial hobby could be making youtube videos, doing swagbucks or selling things on etsy or eBay. If you already have a lot of money this could be investing in businesses or real estate.\n\n**Recreation**\n\nYou may have something that you like that doesn't fall into any of these categories. Maybe there a podcast, YouTube channel, or TV show you really enjoy. Some people think of these things as a waste of time, but I disagree. If you like it, then do it! just make sure it doesn't consume your whole day. There's a difference between watching a 1 hour TV show and binge watching 5 seasons on Netflix.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9bpkag/key_areas_of_life_to_improve_on_suggestions/", "title": "Key areas of life to improve on (suggestions welcome)", "social_network": "reddit", "user": "Drunk_Klaus", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 90, "down_vote": 0, "creation": 1535680428, "permalink": "/r/DecidingToBeBetter/comments/9bpkag/key_areas_of_life_to_improve_on_suggestions/", "nsfw": false, "first_save": 1635438343.31833, "replies_charged": false}