{"id": "t5_2tand_t3_mxjckz", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "I decided to quit cocaine a month ago! For a bit of context I was never an addict, just very impulsive. I started taking cocaine when I was 19 after a friend offered it to me. I would only ever do it every now and again at first, maybe every couple of months. By 20 it was more common, maybe every couple of weeks but it was never something that I was going out of my way to get, only if someone else offered it. When I turned 21 it was more regular and probably would have continued to get worse if not for the fact that I did a year abroad as part of an exchange program which I went to Germany, in this time I only really drank except for a couple of times where I did MDMA at raves. \n\nAnyway, I returned to the UK at the age of 22 to finish my studies. Cocaine became more of an occurrence, partly because of the lockdown which meant we were always sat in the house and cocaine was always an option. It got to the point where whenever I had a couple of alcoholic drinks I'd have coke on my mind which meant I was doing once or twice a week. Fast forward a month ago, I did cocaine again and I was questioning my life choices and realised I was on a dark path where it could keep getting worse until I was an addict. Since that moment I've not even been tempted to do it, even yesterday when I was celebrating my 23rd and friends were offering me it and I said no every time even when drunk. I just felt good this morning when I woke up fresh and my friends felt grim. I honestly believe I won't do coke again!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mxjckz/quitting_cocaine/", "title": "Quitting cocaine", "social_network": "reddit", "user": "Terence2204", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1484, "down_vote": 0, "creation": 1619268654, "permalink": "/r/DecidingToBeBetter/comments/mxjckz/quitting_cocaine/", "nsfw": false, "first_save": 1635436449.8877037, "replies_charged": false}