{"id": "t5_2tand_t3_hcqi5n", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526", "f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "When I was in my twenties, one thing I often did was promise good intentions and things to others in exchange for a favor, approval, or trust.\n\n\"Thank you so much, I will definitely do X next week.\"\n\n\"No problem. I will handle it tomorrow.\"\n\n\"Sorry about the delay, I will send it by EoD\".\n\nAnd then when I had all of these promises, I found myself too stressed to deliver great work. And I ended up ghosting people, having a lot of delays and screwing up good relationships.\n\nA few years ago, I finally learned the right perspective: nobody was expecting me to deliver things on an unrealistic schedule or quality that is beyond my abilities. But because I wanted to sound or appear competent, trust-worthy, and cooperative, I SET THE WRONG EXPECTATION in their minds. When they heard my promises, they'd be like \"Okay, if you agreed then you must know what you are doing. Let's see.\" After once or twice, they get disappointed and knew they can't trust me anymore. And I'd be even more disappointed by myself because I wanted to be helpful and reliable.\n\nThe key is to under-promise, over deliver.\n\nInstead of telling people \"It will be done by Friday, I promise\" on Monday, it's often (not always if absolutely urgent) better to say \"Here it is\" on Friday and people will feel more delighted.\n\nToday, I refrain myself from wanting to overpromise things and I feel a lot better and am more trustable than before.\n\nWhat's your experience on this lesson?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hcqi5n/i_am_absolutely_going_to_do_it_for_you_is_often_a/", "title": "\"I am absolutely going to do it for you\" is often a sign that it will never be done. Setting the right expectations is much more important than being pleasant.", "social_network": "reddit", "user": "catdaily", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1592675247, "permalink": "/r/DecidingToBeBetter/comments/hcqi5n/i_am_absolutely_going_to_do_it_for_you_is_often_a/", "nsfw": false, "first_save": 1635436204.1120818, "replies_charged": false}