{"id": "t5_2tand_t3_ncwfz7", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "Doing anything you can to take a step forward is all it takes. Taking action acts like this magic fuel that generates motivation and keeps that flame burning hot. It can be literally anything at all. Just as long as you do it with intent. Read something motivational when you wake up then reflect and write on it. Any gesture to get the ball rolling you can worry about the bigger stuff later down the road. For now its doing small things at the same time each day to set an outline for the routine you will be able to plug bigger things into. Start reading a book on the topic of what your trying to achieve. Even if its a few pages before bed. After doing this for a while its a guarantee you will start to get a little more motivated each day. Use that motivation to take the next step to adding more to your routine. Ideas and inspiration will come with the joy of knowing your finally moving toward what you want. Keep sight of the bigger picture but at the beginning its best to pave the road first brick by brick ( just go with it and pretend its a brick road). Every brick is one small task that all add up to one big road. It takes discipline to do these things even when you don't want to, the motivation isn't always going to be there. This is where the discipline is there to carry you until you catch another wave of motivation. and then just keep repeating the process each time moving closer and closer to the target. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ncwfz7/doing_anything_you_can_to_take_a_step_forward_is/", "title": "Doing anything you can to take a step forward is all it takes no matter how small it may be.", "social_network": "reddit", "user": "MindIsMaster", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1621076918, "permalink": "/r/DecidingToBeBetter/comments/ncwfz7/doing_anything_you_can_to_take_a_step_forward_is/", "nsfw": false, "first_save": 1635437322.690381, "replies_charged": false}