{"id": "t5_2tand_t3_hfxhyn", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "### What is an accountability partner?\nTo give some context for this post, an accountability partner is a partnership where you mutually agree to coach each other and provide reciprocal feedback on a regular basis. You and your accountability partner agree to daily or weekly feedback sessions to share wins and talk about your current challenges, come up with strategies to implement before the next conversation, and take **periodic assessments:**\n\n- How are things going?\n- Are interactions positive, supportive, and constructive?\n- Is the feedback mutually useful?\n- Is there good rapport?\n- Would someone with different skills/style/experience work better?\n\nI deeply believe you are the sum of the people you spend the most time with. If you share an enthusiasm for growth, are ambitious, believe in systems/habits, and derive energy from engaging in conversations about productivity, there's a good chance we'll get along. I usually know what I *should* be doing, and have had extended periods of success/discipline with 3.9 GPA semesters (while exercising and maintaining a social life). I however struggle to stay on track long-term, and am seeking a like-minded accountability partner to maximize the time I spend in a day working towards the type of person I want to become.  My immediate goals include developing (and sticking to) a work/study/sleep schedule, and finding more time for my hobbies.\n\n###**About me:** \nI am currently a college student/young professional with a lighthearted and friendly demeanor. I'm generally optimistic and positive with strong ambition and drive, but tend to fall off the wagon if I don't plan ahead. Some of my skills include:\n\n- being well organized (happy to share what has/hasn't worked for me)\n- studying for hard anatomy/physiology courses (have read a fair amount on *how* to learn as I had a 2.5 GPA in high school)\n- studied behavior change, and motivational interviewing (which has largely sparked this whole thing)\n\n###About you: \nHave some kind of discipline/habits track record (*it's fine if you're in a rut right now, I just can't fully support someone from the ground up atm*), have a strong interest in self-improvement, aren't afraid of a little friction (willing to hold/be held accountable) and are generally drawn to the idea of long term habit change in pursuit of mastery/competency in your field. It doesn't really matter *what* you're pursuing so much as *why*.\n\n- **Bonus points if you:**\n\n - have previously considered the potential value in a dynamic like this and are open to exploring it long term\n - study biology/medical content\n - have entrepreneurial interests\n - meditate (or want to)\n - are a morning person (or want to be)\n - think health should be a priority\n\n\n\n### Stuff to start with:\n*This is all new to me, so I'm open to suggestions, as this will likely be an evolving model. But hopefully this can serve as a template to get us going* (now > perfect).\n\t\n- **Scheduled daily/weekly check-ins:** ~5-60min early in the day (leaning towards brief morning check-ins with maybe longer birds-eye-view on Sundays)\n\t\n- **SMART Goal setting:** We both know what we are working towards, and will be specific in how we define our goals (short and long term). \n\t\n- **Accountability statements:** meetings end with setting intentions for the day/week \"I will do [blank] today.\"\n\t\n- **Redemptive narrative:** we all have an illogical pessimist in us, and while it can be helpful to share challenges with each other, it should be through a growth lens. This dynamic doesn't work if one of us is always moping. It's important to be able to vent here, but we should always try to find a silver lining/lesson during challenging times.\n\nSorry for the wall of text, this turned out to be much longer than I anticipated. I've just reached this point where I know this something I want to try and make work again (has worked extremely well in the past). I believe that for the *best* outcome possible, our long term goals (the *why*) should be aligned. I'm interested in creating meaningful relationships. I think having a like-minded professional whose feedback you value and trust is an invaluable investment for any career. We are the sum of the people we spend the most time with, and I will do my best to add value and cultivate a dynamic that benefits us both. If you've made it this far, shoot me an PM, and we can arrange a time to talk about what you liked about this post and what you would like to add/change. \n\n*SMART Goals: Specific (S; describe when, where, how, what), measurable (M; quantifiable), achievable/realistic (AR), and include time frame considerations (T).*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hfxhyn/accountability_seeking_accountability_partner/", "title": "[Accountability] Seeking Accountability Partner. Ideally Long-term.", "social_network": "reddit", "user": "HighlyEffectiveSloth", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1593131022, "permalink": "/r/DecidingToBeBetter/comments/hfxhyn/accountability_seeking_accountability_partner/", "nsfw": false, "first_save": 1635437220.4697883, "replies_charged": false}