{"id": "t5_2tand_t3_mwmf72", "request": ["1a213df6-3f71-466c-9762-ace119e0102e"], "text": "I'm a 30-something who had an on/off boyfriend of well over a decade. He didn't share my values and only after getting pregnant by him at the end of the relationship did I finally realize how much of a sleazeball he was. I was a fool being played for years, and I couldn't see it, even after others tried to warn me. \n\nWe're broken up for good. We recently had a baby. He's gotten back together with the rebound woman with whom he also has a kid (and who he cheated on me with). And now we're in this weird place of being both really close friends  and also co-parents who are struggling with the terms of coparenting, mostly due to me having issues with my kid being expected to be left alone with his girlfriend just because he has a busy lifestyle. \n\nMy question is, are there any women who...\n\n- Remained best friends with an ex mostly because it was comfortable to do so or you possibly still had feelings\n\n- Because of this, it was really challenging to be attracted to anyone else because no one seemed to measure up to your ex (his good qualities of course). Not talking about you won't give other guys a chance; I mean you just didn't like anyone else and couldn't like them if you tried.\n\n- After a long struggle with not liking any guys, someone finally managed to attract you, EVEN after you didn't think anyone would?\n\nIt's especially helpful if, like me, you HAD to be tied to your ex due to kids or some other obligation.\n\nI already know how foolish it is to continue to have any sort of feelings for or attachment to a POS. I'm already beating myself up over it. Please no judgement on this.\n\nEDIT: Wow people are mean in this sub lol. A downvote in a support group where you need encouragement/advice smh...okay I guess lol.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mwmf72/can_i_hear_from_ladies_who_found_it_rely/", "title": "Can I hear from ladies who found it rely difficult to detach from their ex, but you eventually did and found happiness?", "social_network": "reddit", "user": "ughatsocialmedia", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1619149006, "permalink": "/r/DecidingToBeBetter/comments/mwmf72/can_i_hear_from_ladies_who_found_it_rely/", "nsfw": false, "first_save": 1635437061.5406473, "replies_charged": false}