{"id": "t5_2tand_t3_p2om7e", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I'm 17f and have been going through some episodes of anxiety and depression in the recent year. Most of it stems from my feelings of incompetence and uncertainty for the future. Getting into a well-off university has always been the standard expectation for my family, and somehow I've developed n immense stress reaction to anything related to applying for college. This really damaged my grades and progress this year, and I gotta apply in a few months. \n\nI've been trying to climb out of this slump so I can still have a chance, but there are so many issues with me that I don't know what to do.\n\nFor the majors I'm considering, I gotta make an art portfolio, but even the thought of it makes me want to disappear. I've literally developed a repulsive reaction to art itself which makes me sad considering it was once my favorite hobby.\n\nI've developed a fear for assignment deadlines that sometimes makes me too nervous to function and finish the homework. Every deadline looks like a huge heap I have to leap over and if I fail on one, I'm afraid I would never catch up. \n\nI tried meditation, study techniques but when something important comes up, my anxiety and stress go off the roof, and often nothing helps. If I fail at it, I feel ashamed and worthless, which leads to another depressive cycle. \n\nNowadays I constantly feel restless and insecure. I want to stay calm, ignore the stress, and take action but my brain goes nuts.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p2om7e/i_dont_know_how_to_take_a_step_forward/", "title": "I don't know how to take a step forward", "social_network": "reddit", "user": "berryblue333", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1628723633, "permalink": "/r/DecidingToBeBetter/comments/p2om7e/i_dont_know_how_to_take_a_step_forward/", "nsfw": false, "first_save": 1635435788.2957816, "replies_charged": false}