{"id": "t5_2tand_t3_pozs2j", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Hi guys, \n\nSo I'm 23M and for the longest time I've struggled with loving myself and seeing myself as someone who can be loved. I'm disabled and I stammer so I find it hard to make friends and trust that my friends actually like me.  As a result, I get really clingy when they don't text me back and think that they don't like me or they're just hanging out with me out of pity.\n\nLast year, I made friends with this one guy. Let's call him L.   I like him and we're friends but he's really bad and texting me back. Naturally, this makes me feel anxious and afraid that I might have done something wrong and that I'm a bad person.  He always does text back though and we're going for sushi at some point.\n\nRecently, I've been going to therapy and I've realised that I can love myself- that I don't need other people as validation and that if people didn't want to be friends with me, they would have bailed, that if they don't answer my texts, that doesn't reflect on me as a person or say something about my capacity to be loved.\n\nTonight, I was going for walk and checking my Whatsapp and I saw that L hadn't responded to my texts even though he was online. I was sad for a bit but then it hit me: my texts aren't important to him but *I* am- that my texts do not reflect how he sees me.  And then I had a bigger epiphany: \n\nI've gotten a lot from this friendship- it's improved my self confidence, my belief in my ability to make friends and it's made me want to try new things. And I used to think that he didn't benefit from the friendship. But I realised that just because he and my other friends don't verbalize it doesn't mean it isn't true. I could very well be a positive force in his lives, not just the disabled charity case.   For the first time in my life, I'm seeing myself as an equal. I'm literally crying tears of happiness right now.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pozs2j/starting_to_love_myself/", "title": "Starting to Love Myself", "social_network": "reddit", "user": "Mediocre-Condition-8", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1631742441, "permalink": "/r/DecidingToBeBetter/comments/pozs2j/starting_to_love_myself/", "nsfw": false, "first_save": 1635438440.5158882, "replies_charged": false}