{"id": "t5_2tand_t3_crkll3", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I know it's a pretty dark title, but hear me out. Also, warning, this will be a very long post.\n\nThis year has honestly been the best year I have had in an extremely long time, and it just keeps getting better. For once in my life, it feels as if everything is playing into my favor, and even if something does go wrong, it eventually turns out to be a benefit, and not a detriment. I've never had a time in my life where I can honestly say that I am in full control of everything that's going on in my life.\n\nBut.....there is one thing that would make this year perfect, and, truly, the best year of my life: to go on a first date.\n\nI know that sounds corny as hell, but I'm 25 years old, and have yet to even be on my *first date*, let alone have every other first that comes with a relationship. It's the biggest embarrassment of my life, and the one thing I have the most trouble talking about. That said, I know that the biggest factor of that is me.\n\nWhile I was never officially diagnosed, I'm pretty certain that I've been depressed since before I was 10 years old. My stepfather did not treat me well, and the way I've tried to reason his abuse towards me is that he was trying to mold me into his image of a son....which was the exact opposite of the boy I was. He died when I was 10, leaving my newly single mom with 3 kids (including me, being the oldest). With her being the only form of income for our family, her job demanded alot out of her, so, I was left to basically raise my little brother and sister while going through middle school and high school. Long story short, I didn't have a childhood. \n\nAnd all of this certainly did it's damage. I was always a smart kid, but never did any homework. I just couldn't find the motivation to do any of it, or always got distracted. This eventually led to me not graduating high school. I did get a GED eventually, but not graduating is my 2nd largest embarrassment of my life. I don't view my GED as a success, I view it as testament to my failure.\n\nCouple the disappointment from that along with going through a war with myself over a girl I fell so hard for that I broke every moral code I had in order to get her to like me (this in particular left me emotionally scarred to the point to where I still have dreams of her every now and then), along with me leaving home prematurely due to the guy that my mom had started dating (and would eventually marry) having so wildly different views than my own that we have never truly gotten along........I was an utter disaster coming out of highschool. But the worst part of it all was that no one could see it, not even myself. \n\nI obviously didn't go to college, instead I got an apartment with a couple people I knew from highschool who were a couple coming out of highschool. I bet you can already see where this is going. They broke up, and both moved out, leaving me with an apartment I couldn't afford, and this was my very first time living by myself. It was also the time I first got a glance at how bad my mental state was.\n\nIt was an utterly disgusting way of life. Without anyone else there to keep an eye on both me and the apartment, *both* fell into disarray. I didn't take care of myself, and I didn't take care of the apartment. I'll spare you the details, but, I bet you already have a pretty good picture.\n\nNeedless to say, I got evicted 4 months after my roommates left (as to why it wasn't a month, the complex went through a management shift, which gave me a little extra time there). I moved in with my grandparents, and kept......*existing*. I wasn't living, I was just working, and coming home to my laptop. I eventually get fired from my job, but this actually gives me a unique opportunity.\n\nI was just turning 21, and the best job you could get at that age with just a GED, hands down, is a trucking career. I realized this, and eventually got hired and got my CDL through Swift Transportation, the largest trucking company in the nation. Things were looking pretty good for me. But, I should have realized, through the last time I was alone, that what I was doing was a MASSIVE mistake. I was living alone again, and doing the same thing as I had done in the apartment. Only, instead of lasting for 4 months, this lasted *two years*.\n\nWhen the company inspected my truck after a crash I was in (that's a story for another time) I was immediately fired. Again, I'll spare you the details.\n\nI moved back in with my grandparents (having never really gotten a place of my own while driving), and remained jobless for about 7 months. This, I'd say, was the lowest my life had ever been. I was effectively committing suicide through doing nothing.\n\nMy grandparents eventually convince me to get a job as a pizza delivery driver at our local Domino's.......and I couldn't be more happier that I got it. See, the store I work at is unique in all of Domino's in that we have a very welcoming atmosphere. We work as a team, and support each other, and even call ourselves a family instead of a bunch of coworkers. This, along with the job itself (driving to a delivery, and coming back to a busy store, just to go out on another delivery is oddly therapeutic), was a double whammy of unintended therapy for me. Now after almost a year and a half  of this, I'm being promoted, I moved out of my grandparents into an actual house with a couple roommates (two guys who are *not* a couple), and I'm actually digging myself out of this mental hole I was practically buried in by getting out and doing stuff besides sitting at home.\n\nAnd, fortunately for me, I got the biggest scare of my life while doing this job. We....*used*....to have a regular customer who would order from us multiple times a day, at any point of the day. This guy was an old, possibly going senile, lonely, and disgusting human being. And the more food I took to his house, the more I realized that the person this man had become...... was me 40 to 50 years in the future.\n\nEverything that was going on with this man was exactly the thing that was going on with me in the apartment and while driving, just more pronounced. And to top it all off, he just recently died due to congestive heart failure (we found out through public obituaries). I believe he was in his 60's.\n\nI now have the opportunity to change that future of mine. I will NOT end up like this man, decrepit and alone. I am going to find a woman to love, have a child with her, and raise that child to be the best human being they possibly could be. Despite everything going so well in my life right now, the longing to do exactly that only grows stronger and stronger. But to do that, there still needs to be more changes in my life.\n\nI currently weigh 312 pounds, and I'm fairly certain not a single woman on this Earth finds me attractive. Although my mental state has improved in the past year, my body hasn't, and I'm even starting to feel the effects of the weight. Blurred vision, tingles in my hands and feet, and discoloring of my legs. It's as if my body is reminding me that if I don't do something soon, I am bound to end up like that man.\n\nSo....starting this week, I am going to join a gym, start one of their training classes, and aim to lose 100 pounds. I am going to improve my self image, and my self confidence (which has been non-existent my entire life), all while improving my lack of social skills (going out with friends, checking out places in town, etc.). And once I finally feel comfortable in my own skin, I will find someone.\n\nI am not going to die alone.\n\nThank you for reading this to end, if you have. My mental state, even though it's better, still isn't perfect. So, if I may ask, I need all the encouragement I can get. For there is still a ton of digging out I need to do.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/crkll3/i_am_not_going_to_die_alone/", "title": "I am not going to die alone.", "social_network": "reddit", "user": "Electro522", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 47, "down_vote": 0, "creation": 1566038151, "permalink": "/r/DecidingToBeBetter/comments/crkll3/i_am_not_going_to_die_alone/", "nsfw": false, "first_save": 1635436530.3230848, "replies_charged": false}