{"id": "t5_2tand_t3_issyb2", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "If you can make it through this, it may just be worth the read. And it may help you have a little more understanding and compassion toward others. \n\nTrying to keep the unneeded details as short as possible, my ex’s twin brother who is gay (the best friend mentioned in the title) has been in my life for about 7 years. I used to live with them for about 2-3, and I even helped their mom out with bills expecting nothing in return for her to just go next door to her moms house and say I don’t pay for anything and never offer to help pay. (Just for context so you can get an idea around what kind of a person she is.) \n\n*Where the Story Starts:* She was on FaceTime with my best friend and his boyfriend the other night and I’ve grown very close to my best friends boyfriend as well. I feel like he’s someone I can definitely trust. He is the reason why I know about her commenting on how much I weigh now to begin with. He felt so bad telling me, but he said he sees how nice I still am to her every now and then and he felt awful for not saying something when she said it, and he couldn’t keep it from me any longer. I told him that it’s honestly not a surprise, as I know what kind of a person she is. She is always super nice to your face and she’s always talking some shit on someone. If you’re in her life, she’s talking shit. I can’t lie though, it DID hurt hearing that initially even though I still know what kind of a person she is. But the more I thought about it, the more I dove into the expanded mindset I’ve been slowly gaining these past few years through the weight I have gained. The weight that I have put on has softened my heart IN BIG WAYS (No pun intended. Okay, maybe a little lol.) I used to weigh no more than 140 pounds all through high school and my younger 20’s, and while I’m a nice person and could never fathom hurting someone intentionally or on purpose, I still had a lot of judgmental thoughts internally. I’m just being real here. Thoughts like “Wow, I’m glad I’m not that big...” or “Thank God I don’t look like that. Yikes.” Sorry if that sounds shallow, but it’s just the truth. Honesty is what I aim for because that’s where true growth lies. I am definitely not the same person I used to be. Change is possible and it’s only through understanding that I have learned that. But the fact of the matter is, all of that internal judgement (I believe anyway) has surfaced to the forefront and the judgement I’ve casted on others has come to find me. Karma? I don’t know. Because I’m not a malicious person by nature. But I’ve read a lot about the Law of Mirrors lately, and it makes sense. But even I had made comments about mean girls in high school gaining weight after, and feeling great satisfaction in seeing them with the pounds they’ve put on. They were mean, but I still don’t think it’s really any different in that regard as you truly don’t know what others are going through or dealing with. And just knowing that’s how I USED to think, living on both ends of it, being the size I am has had me embarrassed to even go out in public before. I always feared someone seeing me that knows me and seeing how much weight I’ve put on, and seriously getting an ego boost over that or having the same kind of thoughts I used to have. Gaining the weight I have is actually a true blessing in disguise because it’s really shown me who has treated me the exact same, and loved me no less at 230 pounds than they did at  140 pounds. So many people have fallen out of my life simply for that one reason. The way you get treated is absolutely different. Anytime you hear someone commenting on another persons weight who you KNOW you’re bigger than, it’s like “okay so what do you think of ME???” And most importantly it’s helped me gain that understanding that I NEVER would have had if I didn’t gain the weight. I decided that I could look at it one of two ways. I could be sad about it, or I could be thankful for all that it has taught me and continues to teach me. I also used to stress so bad about losing the weight to look good again. I used to have this all or nothing attitude. Like if I ate a donut one day out of the week after eating so good, fuck it all because it doesn’t matter anyways. I don’t think that way as much as I used to. I’m okay and comfortable now with the fact that fuck ups and slip ups happen. We are only human. And also, she only saw me at a stoplight on my way to work. She doesn’t see what I’m doing behind closed doors. She doesn’t see that I’m trying to nourish my body in the way it deserves to be nourished. She only sees what she wants to see. I know I’ll eventually get back down to where I want to be, but when I tell you I’m a changed person, I’m forever grateful for that. I’ll forever have that understanding and it’s taught me to be not only kinder to others when I see them, but to be kinder to myself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/issyb2/my_exs_mom_saw_me_recently_and_told_my_best/", "title": "My ex’s mom saw me recently and told my best friend I blew up like a balloon.", "social_network": "reddit", "user": "XeniaMariaXx", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1600114196, "permalink": "/r/DecidingToBeBetter/comments/issyb2/my_exs_mom_saw_me_recently_and_told_my_best/", "nsfw": false, "first_save": 1635438142.5054479, "replies_charged": false}