{"id": "t5_2tand_t3_nl6xp9", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "802203c7-ca80-4c23-ad08-f571694cfc55", "311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "This is pretty much going to be a personal essay combined with literary analysis, all relevant to acknowledging bad things in a relationship and addressing them. It'll probably be a long read, but I hope you'll stick around, and hope even more that you'll check out Hadestown.\n\n# My experiences, seeing the devil, and then feeling it.\n\nMy mom had a friend who had a husband and two kids that were about the same age as my brother and me. We visited them frequently and knew them pretty well. But the husband was controlling and jealous, and after his wife tried to divorce him, he killed her. The kids went from that nightmare into a different hell, living with their neglectful grandma and abusive uncle. Fortunately, my mom keeps in touch with them, and they're very close with her. My own parents divorced too for similar reasons, and although it was pretty nasty and there were death threats involved, it didn't turn out as bad.  \n\n\nSo I went to college and met a girl who I fell madly in love with. It took me about six months to win her over, and for the first six months of our relationship, it felt like she didn't love me back. That said, there are some things to consider about that. We're both on the autism spectrum, and while I had only newly welcomed the idea of ever being in a relationship after I went to college, she still didn't ever want to be in a relationship or marry until I finally wooed her.  \n\n\nDuring this time, I was horrified to find that I felt the whole spectrum of emotions that I knew to be the devil. I understood that the things I was feeling are what led the man I mentioned earlier to murder. I was jealous, I couldn't stand to let her out of my sight, and I was so afraid she'd walk away that instead of feeling love like I used to, I just felt an overwhelming sense of cosmic injustice. There was a voice in my head that told me I had to hurt her before she hurt me. It was the exact opposite of the feeling I felt the first time I fell in love with her.\n\n# New love, exemplified by Orpheus and Eurydice\n\nThe first thing that happens in the musical Hadestown follows the Greek myth of Orpheus and Eurydice, adapted to fit the new story. Orpheus wins over Eurydice, a poor and hungry girl, by promising her that the song he's working on is going to fix the hard times in the world and give them prosperity. Orpheus is characterized as a poor and naive boy, but he's also described as talented and, despite his idealism, insightful.  \n\n\nIt is evident in the first few songs that the new lovers are deeply in love, but there are certain things they don't understand yet. First, they clearly don't understand how hard it's going to be. Eurydice has Orpheus promise that he'll hold her forever, that the wind won't change on them, and that it will \"always be like this,\" seemingly implying that they will not only love each other forever, but that their intense love will never even mellow, and they'll never come down from the high.  \n\n\nHermes, the god who guides the audience through the story, but also interacts with Orpheus and Eurydice, talks to Orpheus about his song after he wins Eurydice over. He tells Orpheus that the song he's working on is actually an old love song, one that Hermes hadn't heard in a long time. He has Orpheus recall to him the story of Hades and Persephone, and tells him that the song he's working on was their love song too.  \n\n\n# The long winter, above and below: Hades and Persephone\n\n  \nIn Greek mythology and in Hadestown, Hades is king of the underworld. But his wife, Persephone, is the goddess of the harvest. As described in the musical, nothing grows on Earth when she's in the underworld, so Hades agrees to let her return to Earth for half of each year. This is the explanation for the seasons: winter comes when she's in the underworld, and spring comes when she returns to the world above.  \n\n\nHowever, in the world of Hadestown, the seasons are off. Winters are longer and colder, and summers are blazing hot. This is because Hades, who has become jealous of Persephone \"in the arms of the sun,\" comes to take her home earlier each year, and Persephone lashes out at him in return, only fueling his jealousy. It becomes a toxic cycle as Persephone, despite her love and loyalty to Hades, only shows him resentment, and he becomes more jealous and insecure.  \n\n\nThe central conflict of the story comes about at the start of Fall, when Hades comes to take Persephone again. This ruins Orpheus's plan to finish his song as an immense storm comes on. Eurydice and Hermes try to get Orpheus's attention as he desperately works on his song, but Eurydice, looking for food and shelter, is forced to accept a deal from Hades: a ticket to Hadestown, where she won't be hungry anymore.\n\n# Wait for Me\n\n  \nIn the song \"Wait for me,\" Hermes tells Orpheus what happened to Eurydice, and tells him how to get to Hadestown to get her back; all the while, he describes how perilous the journey will be. This does little to shake Orpheus, in part due to his naivety, but more because of his determination.  \n\n\nWhen Orpheus confronts Hades in the underworld, Hades reveals just how much his jealousy has corrupted him. His advice to Orpheus is that if he wants to hold a woman, he must \"hang a chain around her throat,\" \"shackle her from wrist to wrist,\" and \"fill her pockets full of stones.\"  \n\n\nBefore Hades sends Orpheus away, he demands one thing for his amusement: one more song. You can probably guess what happens then. Orpheus sings the song he'd been working on, and the melody unlocks the long-buried feeling of love in Hades' heart.  \n\n\nEven as Hades is moved by the song, he understands that he can't just let Eurydice go. If he does, he'll be a weak king, and there is sure to be a riot. However, if he refuses, then he'll be a heartless man, which might also result in a riot. The Fates give him a suggestion: let them go, but with one condition. So Hades sends them away, but demands that Orpheus must walk in front, and Eurydice must walk in back. And if Orpheus turns around to see if Eurydice is coming too, then she goes back to Hadestown.  \n\n\nFollowing this is the most beautiful song of the whole musical: \"Wait for Me - Reprise\". Hermes tells Orpheus that the meanest dog he'll ever meet is the one inside his own head. In this song, Eurydice assures Orpheus, who can't hear her, that she's right behind him, following him too. Meanwhile, Persephone asks Hades if they're going to try again. Hades, fighting his fear of letting her go, tells her that it's time for Spring. She says \"wait for me.\" He says \"I will.\" Doubt drives Orpheus mad with the possibility that Eurydice isn't coming with him, or that it was all a trick by Hades to make him leave alone.\n\n# Conclusion - Reciprocity\n\n  \nThe two instances of \"Wait for Me\" seem to allude at the reciprocity in a relationship, and the fact that both parties, if they're both in love, will inevitably face jealousy, and they will both need assurance. Several months ago, I sensed that my girlfriend truly was in love with me and my insecurity for the most part went away. However, even though my own love didn't diminish, it did start to mellow, as it always does. In fact, without the burning jealousy making your mind race, you'd be surprised to find that love is patient. When you love someone, you don't really need to be around them all the time. And as such, there were times I needed to be alone, and she started to see the other side of it. It seemed that she was suddenly afraid to let me out of her sight, and I had to assure her like she used to assure me. Having learned the lessons I've learned, I'm glad to help her.  \n\n\nThe modern interpretation of toxicity in a relationship has a tendency to assign blame rapidly and prescribe retaliation. And while I definitely agree that nobody is obligated to remain in a relationship that goes bad, especially when it becomes dangerous, I think it is important to understand that ideally, you're on your partner's side. If they're insecure, you're there to help. You don't owe it to them to stay if they keep getting worse anyway, but you at least owe them a chance. And if you're ever insecure, you should count on their help too.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nl6xp9/overcoming_jealousy_insecurity_and_bad_trust_in/", "title": "Overcoming jealousy, insecurity, and bad trust in relationships, exemplified through my experience and the themes of the wonderful musical \"Hadestown\"", "social_network": "reddit", "user": "thisisfelix_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1621998455, "permalink": "/r/DecidingToBeBetter/comments/nl6xp9/overcoming_jealousy_insecurity_and_bad_trust_in/", "nsfw": false, "first_save": 1635436624.3497248, "replies_charged": false}