{"id": "t5_2tand_t3_ngzccd", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Hi guys. First time here, hope I'm doing things right.\n\nApparently I've decided to write about my problem from the start so I'll begin by giving a little background about myself. My name is Eowyn, I'm a 23-year old enby from France. I've lived all my life in the French countryside, isolated from most of society. At first, it was my parents' choice, but it became mine when I realised that I liked living like that. The outside world was too scary.\n\nWhen I was 18, I started to realise that this was not a constructive attitude and that I would have to pay the price for my life choices one day. It's a bit as if my teenagehood started that year. From that point on, I've had to face some of the issues that I was burying so far: social anxiety, fear of change, lack of attention… I started to become increasingly aware that I was far from being a functional adult and that I would have to fix that over the course of many years.\n\nThe one thing I expected least in that turmoil was to find a significant other. My self esteem was steadily going down and I did not believe that anyone would ever engage in a relationship with an emotional mess spending their life online. Yet, in March of 2020, it happened. I had a *girlfriend*, however hard that was to believe.\n\nAnd I started relying on her too much. I guess that was bound to happen. I had found someone who was able to fix everything for me in just a couple words, and everything was fine as long as she was able to do it for me once in a while. But she did not always do that (she was not supposed to) and, after a few months, I started experiencing withdrawal syndrom. I had no idea that it was emotional dependency at the time and I was completely unable to manage it. It ended up unbearable for both of us, which led to the end of our relationship in November.\n\nBut there were still feelings between us. We took a few months to think back on all of this, and in January we decided to get back together. This time I was ready and determined to fight emotional dependency. I learned not to rely on her for everything and I opened up better about my feelings. Communication between us improved and we stopped pulling one another down. From every point of view, our relationship had become a lot more sane and adult-like.\n\nMy girlfriend is understanding and supportive. I could not dream of a better person to build myself with. But she is also an introvert who needs freedom and alone-time, which… doesn't go well with an emotionally dependent partner. However, we want our relationship to last and we're both communicating a lot on how to take care of it. We both do our best and I'm very proud of us! We've gone through hard times together, so hard in fact that we even had to break up for a while, and after 13 months here we are: feelings are as strong as ever, we've fixed many issues and we're taking great care of each other.\n\nLately, in spite of my progress, emotional dependency has been pretty bad. And it got her concerned about this Summer, since she's going to be busy and a lot less available for me. I was pretty concerned myself since last Summer was similar to this and very hard for me. We talked about it and we figured out how to optimise it for the both of us, but the fact is that there is a big challenge ahead of us and I'm terrified.\n\nIf you guys have ever experienced it, you know emotional dependency is a b\\*tch. The way you *should* feel is obvious to you, it's right there, but you can't make it work. You want to feel grateful but nothing is ever enough for long and you have to spend enormous amounts of energy into just… not wanting more. The limit between your actual needs and what the addiction wants becomes blurry, it gets hard to talk about, and difficult to respect yourself.\n\nAs I'm writing these lines, I actually feel quite happy and I almost want to dump my post like “I was so dumb, it's super easy” but, for all I know, I could have an anxiety attack within an hour because all the reasons I should feel bad will have overwhelmed me. And I know it will happen again, because…\n\nIt's easy to think back on the best times, when the addiction seemed like a dream and withdrawal a myth. When I was feeling very secure and didn't see any reasons why I should decide to be better. It's easy to want it back and tear up thinking “why is it gone”. It's easy, in the end, to indulge all over again, and ruin what you forgot you had and had no idea how much you cherished. You always expect your partner to leave, which is a self-fulfilling prophecy in the worst case. I have been there and I should know better: I know what it is like to lose your partner because you're unable to honour the formidable experience it is to be in love in the first place. And this very feeling that you're not being fair is very strong when it comes to making you feel weak. Emotional dependency is a b\\*tch.\n\nIt helps to sum up what has happened over the last year, focus on the good sides and acknowledge my progression. If I were able to do that all the time, I would be fine. So thank you for reading thus far. I'd really like to know I'm not alone, and if you have anything to say you think might help me (us!) for this Summer, please don't hesitate. Thank you so much.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ngzccd/fighting_emotional_dependency_story_progression/", "title": "Fighting emotional dependency (story / progression / advice welcome)", "social_network": "reddit", "user": "Orikrin1998", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1621515007, "permalink": "/r/DecidingToBeBetter/comments/ngzccd/fighting_emotional_dependency_story_progression/", "nsfw": false, "first_save": 1635438310.6684477, "replies_charged": false}