{"id": "t5_2tand_t3_nwkqeh", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "*Just a warning that there is mention of drugs and suicide in this*\n\nSOOOO how do I begin this - I'm a 26F and currently working full time in a job that I absolutely love and has kicked off my carer. \n\nBut how I got here is a ride. Essentially I've struggled with a lot of mental and physical issues. I was born with an arteriovenous malformation in my lower right back which has caused a multitude of issues because of how rare it is to occur in this location. I have permanent nerve damage in my right thigh which has caused chronic pain, have no reflexes in my knees and feet and other issues. The sad reality that has taken a while for me to accept is that the best doctors and surgeons have not been able to get rid of this arteriovenous malformation even after multiple operations and procedures. My last procedure was when I was 13 - right after this procedure I was told me that they weren't able to get rid of the arteriovenous malformation and that I may need to go back in 10 years time for another procedure. ( My body wants to keep it there for some reason. So keeps having veins and arteries grow towards the area ) However, I may need to consider an open operation because the likelihood of causing paralysis the next time they go in is exceptionally high. As you can imagine, a 13 year old being told this didn't know how to deal with this so became depressed.\n\nI hit rock bottom in 2018 (24 years old) just after uni. I got into drugs, became really really depressed and eventually I attempted to take my life. I couldn't deal with my chronic pain - it gets so bad sometimes it feels like I'm suffocating and no amount of drugs I took could stop it. So I attempted to take my life once at the end of 2018 and again at the beginning on 2019.\n\nAll I can say is that after that second attempt, something changed in me. Like a part of my wanted to live and was pleading with my to keep going... so I did. I managed to get my current job in September 2019.\n\nWhen covid hit, I had a lot of time to reflect and deal with me. I joined a specialised chronic pain group where we had online sessions discussing different ways of dealing with chronic pain mentally. Honestly, these sessions did so much for me - it opened my mind up to passed trauma that I didn't even know was trauma until I let the emotions in that came along with the memory. It also really really changed my view on how to deal with my chronic pain and just life in general. During this time I was also seeing my counsellor to talk through everything as well and eventually advised to me that maybe I should start taking antidepressants as I've been depressed 10 years.\n\nHonestly, I cannot explain how actually happy I am these days. I've been on citalopram for just over 6 months and I actually feel happy. I want to talk to people, I want to socialise and the real me has come out from behind this blanket of depression. \n\nI just wanted to share my journey here because it's been hard. My chronic pain will never go but I actually feel like I'm in the right place to deal with it mentally and physically. You're all amazing and I hope you're all having a great day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nwkqeh/accepted_my_issues/", "title": "Accepted my issues", "social_network": "reddit", "user": "pr0fiting", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1623322730, "permalink": "/r/DecidingToBeBetter/comments/nwkqeh/accepted_my_issues/", "nsfw": false, "first_save": 1635437991.4681482, "replies_charged": false}