{"id": "t5_2tand_t3_kgg1xv", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "In the past few months, there has been moments of ups, moments of downs; moments that made me pause, moments that have made me work hard. In all of those moments I have been forced to realize that with everything day, the best I can do is that in itself. \n\n  \nWhat is this mindset that we have been conditioned to think we always have to be working? Why do we think this way? We must live in this present moment as if this is our only day, but as well as continue to have that mindset that our life is long, difficult, I know, I am right there with you.\n\n  \nEven when we do our best, what will come from that will usually be much different than our expectations. We can create goals, set intentions, but God and the Universe will always guide us to something better. It is all for our best self, all for our highest self. \n\n  \nThe life of being an entrepreneur definitely is bliss but with that, comes many struggles and different things that you have to make sure you make yourself accountable for. Accountability is the only way that we can continue to move forward, in this present moment. \n\n  \nA few things that help me everyday to maintain presence is spending time in nature, meditation, journaling, painting, trying something new, playing video games and reading new context.\n\n  \nToday: Give yourself a hug. Tell Yourself you are **ENOUGH**. \" I Am Enough \". Sending you health and happiness on your journey today. \n\n  \nI love you.\n\n  \nDrey <3", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kgg1xv/doing_best_68/", "title": "Doing Best (68)", "social_network": "reddit", "user": "striclyspoken", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1608411148, "permalink": "/r/DecidingToBeBetter/comments/kgg1xv/doing_best_68/", "nsfw": false, "first_save": 1635435630.8642318, "replies_charged": false}