{"id": "t5_2tand_t3_m78qqu", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I finally made it. This Monday, I got my approval as a working student at one of the largest automobile manufacturers in the world. Why is this a big deal? \n\nI've been suffering from major depression since school. I am currently studying in my 16th semester. Yes, you've read that right. 16 semesters. It's not because I'm too stupid to study or something. It's because ever since, I am my own biggest enemy. I can't focus on studying for too long because at some point, I'm falling into a hole full of depression, where I am always left alone. \n\nI have been working continuously since I was able to work because I can clear my head there. And no matter where, I always delivered the best performance. But when I have to study on my own, my thoughts wander and wander towards stupid senseless thoughts and I start to doubt myself and my future. Every single time I am on my own. \n\nThe highlight of my career was my internship last year at a competing automobile manufacturer, which had been my dream until then. If you had asked me back then, I would never have dreamed of being allowed to work there. But it happened. Then the corona lockdown started and so my depression increased too. I moved back to my parents, who are not pleasant people either and studied remotely since then. After a few months as a postman recently, I'm here now. \n\nActually I thought I hadn't convinced in the interview because I was very insecure and nervous. Not very professional at all. But as usual, I tried to be as natural, honest and human as possible. When they asked me why I‘m studying for that long, I told them the story of my insecurity and the problems with myself. As it turned out, it was the only proper way. It was exactly the answer they wanted to hear. My achievements during my studies?  Didn’t matter at all! \n\nNot only am I allowed to work for my dream company now, they also want to work with me in the long term. That means that I will also do a master’s degree afterwards. They even talked about a permanent position at the end of the journey. So this is the chance of my life, despite all the flaws i have. A major company that wants to accompany me, work with me and that is gifting me the future I always wanted. The future I've always dreamed about. I couldn't be happier right now. I never thought I'd get this far with all my problems. And now it happened.\n\nYes, I am really happy for the moment.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m78qqu/despite_my_terrible_studies_and_major_depressions/", "title": "Despite my terrible studies and major depressions, I finally reached my biggest goal: working at the company of my dreams.", "social_network": "reddit", "user": "nex0rz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 21, "down_vote": 0, "creation": 1616010056, "permalink": "/r/DecidingToBeBetter/comments/m78qqu/despite_my_terrible_studies_and_major_depressions/", "nsfw": false, "first_save": 1635436184.9117675, "replies_charged": false}