{"id": "t5_2tand_t3_px5xsh", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Hi!\n\nLately I saw, that I'm spending too much time on the internet, just browsing mostly social media. I'm currently looking for a job, but I'm finding trouble to really search for job offers also considering, that in my city in Poland there are not many. What I'm struggling with is really getting out of home to search for a job on my own and not just looking for offers on the internet. Simply I don't know how to do that.\n\nI'm 26 now and I'm thinking about starting a college and I also have a business idea, however I was always blocked by the lack of money to move to the other city (in my city I can't get a good degree that I would want) to start my education and I don't have the money to finance the proper PC and equipment to start my business. \n\nAll these things above led to me sitting in front of the computer screen. Right now I know things that I should do, starting from just finding a job, but it seems too hard to find motivation to just go after it. With time I stopped getting pleasure from the things that people normally get pleasure from. Like good movie, games, music, working out, etc. I have a real trouble to generate energy in the gym and I feel that it becomes harder to get a good workout. Also being with people became weird to me and I feel a little stress being outside, however I saw that after a good interaction with someone, just a spontaneous conversation I feel a lot better and I think about more productive things, have more energy. I think I always needed people and I needed social interactions, but my situation led to some kind of isolation.\n\nI'm really seeking change and I want to eliminate few things that was contributing to my current state. these are: sugar and internet browsing. So I want to ask You people questions if this can make me a different person. My biggest problem, I think, was internet browsing for the last 10 years, back when I was starting high school. I was spending my whole free time in front of the screen, so:\n\n1. What difference can I see, while abstaining from the internet?\n2. How long I'm gonna need to limit the internet usage, before seeing results?\n3. Am I going to have more energy and motivation to do all the things I need to progress in life? I just don't know how big of a change this can be.\n4. Am I going to be more peaceful, confident and calm in social interactions, by eliminating internet from my life?\n5. How I should really look for a job besides just applying for the offers from the internet? I'm talking how to look for a job in the real world. \n6. Will my dopamine get better if I'm not gonna be able to completely eliminate internet usage? Because I need internet to look for a job let's say or to communicate with family and friend, so I would still need to spend portion of my time in front of the screen.\n7. Am I gonna start to enjoy more simple things and be able to force myself to study or work more easily, while abstaining from the internet?\n\nI know this is a long post, I might have made many mistakes, since I'm not english native speaker. However I will greatly appreciate every helpful answer. My interest in dopaminergic system might be the most important understanding in my life so far. I'm hoping to get the answers. Thanks for the response guys! ;)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/px5xsh/abstaining_from_high_dopamine_activities_am_i/", "title": "Abstaining from high dopamine activities. Am I gonna see results?", "social_network": "reddit", "user": "Honest_Lemon1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1632834205, "permalink": "/r/DecidingToBeBetter/comments/px5xsh/abstaining_from_high_dopamine_activities_am_i/", "nsfw": false, "first_save": 1635435779.4536695, "replies_charged": false}