{"id": "t5_2tand_t3_qfiv3i", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "18281d65-fa68-4991-a4a1-8f37346818f3", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Like the title says, I feel like although I have made some big progress mentally, I can’t help but look at my life and feel like it is stagnating. It honestly feels disappointing when I’m sure that I’m much better mentally but my physical reality shows little to no change.\n\nSure, I no longer procrastinate, I get whatever needs to be done DONE, I have a healthy routine, etcetera. Although sometimes I just sit and wonder - isn’t there more to life than this? To be fair, I’m still stuck at home most of the time due to the pandemic, but even before the whole event I had wondered the same thing. Isn’t there more to life than this? Nowadays I’ve noticed I feel the desire to do something “exciting”, meaning something unexpected and spontaneous. But it still bothers me that I can’t be content with the mundanity of daily life, or that I have everything I need yet I still feel so dissatisfied with how things are. \n\nI really hate routine. I hate repetitive tasks, not because they’re hard, but because I just don’t feel anything anymore. I’ve been told that it’s a bit weird to want things to change constantly, and I somehow understand why. It’s just that although I’d prefer to love structure, I’m just so drawn to its opposite that it gets frustrating at times. I’m at a point where I SHOULD be content (well, I suppose that point is relative to each person), it just doesn’t make sense how I’m so bored all the time to the point of allowing big changes to happen with little hesitation. \n\nI’ve crossed out depression as a possibility, as I’ve had it in the past but this is certainly not it. I suppose I’m just having a sort of existential crisis, and I’m considering the thought that maybe I just haven’t thought of all the options on what I can possibly do with my time. I’m heavily invested in self-improvement and anything related to it, but I feel as if there’s a certain point where things just feel kind of.. numb? It’s as if even though I’m surely making progress, it doesn’t feel monumental enough for me to get excited about it. At most I’m happy for a single day, then the days after that I’m completely neutral. Not happy, not sad, just in a perpetual state of “eh”. It’s frustrating.\n\nIf anyone here has dealt with something similar and/or has advice regarding this, I’d really appreciate your thoughts. \n\nThe second thing I would really like to hear some different views on (I feel like I’m just too limited in my thinking) is this:\n\nSay you had two years of (pretty much) free time. What would you do with it? How would you make the best out of it, and what goals do you think you can achieve during this timeframe? And in general, how would you make life exciting during this period? What new things would you try, what opportunities are available?\n\nI’d appreciate any input on this, thank you", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qfiv3i/i_feel_like_im_stagnating_in_life_despite_making/", "title": "I feel like I’m stagnating in life despite making big mental progress", "social_network": "reddit", "user": "Amberthms", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 26, "down_vote": 0, "creation": 1635174668, "permalink": "/r/DecidingToBeBetter/comments/qfiv3i/i_feel_like_im_stagnating_in_life_despite_making/", "nsfw": false, "first_save": 1635436694.0950415, "replies_charged": false}