{"id": "t5_2tand_t3_5qgzt3", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "I have a serious problem with the idea of spending massive amounts of money to sit in a conference room listening to some self-help guru or motivational speaker. I am also allergic to church and despise therapy. Call me crazy, but I try to avoid cults as well.\n\nHere's what I think: leaders who are trying to cultivate followers are actually trying to do is cultivate sheep. \n\nWhat is \"self-help?\" Isn't self-help about enabling and empowering you to become the master of your own life? Aren't you meant to align yourself with the higher truth of the universe so that you might flourish? Is there any way that this can happen if you are willing to become a conformist, a follower, a sheep? Gurus want you to follow them only so that they can take your money. Real transformation, on the other hand, is only possible when you find the courage to not to follow anyone.\n\nThe therapist doesn't want to cure the patient because she earns a living from repeat visits. Similarly, the self-help guru, cult leader, or televangelist never delivers the life transformation he promises because he needs followers. Followers = butts in seats = money = the symbols of success = equals more followers and the cycle continues.\n\nIf you attend seminars, if you trust a therapist, or if you put your faith in a church, then you are leaning heavily on a faulty crutch rather than taking real steps. By becoming a follower, you have chosen to ignore your inner voice and to ignore the infinite wisdom already inside you. By putting yourself in that room and worshiping your chosen leader, you are dissolving your greatness into a group of fakers while ignoring your power, your divinity, and your creative potential. You are passively submissive to someone who you believe is better than you and, while their empowering language may make you feel good, you are not walking the walk and you are not becoming a master of your own life. Mastery begins only when you stop this cycle.\n\nI believe that a person who is healed, who has actually undergone a transformation, who is connected with the source of creation and who is enjoying the abundance of the universe--that person is going to have a strong reaction against sitting in a cold, dark conference room being worked into a frenzy by a show, a performance that is led by a snake-oil salesman offering only enough nuggets of wisdom to tease the next dollar from your pocket.\n\nIf a guru or leader is attempting to build a following, then he or she is a fraud. Watch the film Enlighten Us on Netflix. This must-see documentary is about the rise and fall of James Arthur Ray--a dangerous fraud who cares only about his own success. The man is a psychopath who justifies his destruction by honestly believing he is trying to help people.\n\nThe film hits close to home for me because I am something of a self-help author newcomer. But unlike James Arthur Ray and the others, you will never find me in front of an audience giving a performance in order to collect followers. I don't want anybody passively sitting in any audience listening to what I have to say. I want you to read, to step outside of your ego, to open yourself to Love, and then to connect with others who have done the same.\n\nDon't look at any leader for direction or you will become lost. Look inward and then connect with others who are doing the same. You can learn from famous people, but don't follow them. Don't trust me, don't trust anyone--trust truth and know that the best truth sensor is your own intuition. To conform to a group is to kill that intuition, to shut down your inner-voice, and to move away from the possibility of transformation rather than toward it.\n\nDevour books, watch speeches on YouTube, absorb as much wisdom as you possibly can--but evaluate it according to your own, independent, inner-voice and intuition. No supposed leader has the right to ask for your money for the privilege of sitting in a seat, shaking a hand, or becoming a loyal follower. Transformation starts when you begin to respect yourself more than that. I Love you and respect you so much that I wouldn't let you follow me even if you tried to.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5qgzt3/whats_wrong_with_following_a_spiritual_guru/", "title": "What's wrong with following a spiritual guru?", "social_network": "reddit", "user": "MarkManneyAbscondo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1485522443, "permalink": "/r/DecidingToBeBetter/comments/5qgzt3/whats_wrong_with_following_a_spiritual_guru/", "nsfw": false, "first_save": 1635436561.601468, "replies_charged": false}