{"id": "t5_2tand_t3_qczqdp", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "So little background info, 31f, new mom, not financially stable but also not poor. Currently live with my bf mother who luckily takes care of rent. (All of this is relevant I swear)\n\nI am a certified athletic trainer working in an orthopedic office. There isn’t much growth to be had in this line of work so I’m looking to go back to school. I’ve been looking into PA and RN programs but I don’t know what to do. \n\nI also have other interests. Like research (I loved my research capstone for undergrad), obviously healthcare, gymnastics (I was a coach but it doesn’t pay well). \n\nIm trying to find a path that makes sense for me that will be fulfilling and will put me and my family in a better financially situation. But I can be lazy sometimes especially when I’m not interested (ADHD diagnosis). And being a new mom complicates things because I’ll have to work while going back to school if that’s the plan. Many programs especially medical programs frown upon working while doing rotations and rigorous academic work. I already went through this and struggled to get through AT school. So idk what to do. I don’t want to be stuck making max 50k and I want to learn more. I just feel stuck. \n\nTL; DR contemplating going back to school but also have a family, need to financially advance but want something I will love and use my knowledge. Advice welcomed", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qczqdp/searching_for_a_new_path_but_dont_know_what_will/", "title": "Searching for a new path but don’t know what will work best", "social_network": "reddit", "user": "ShawnaR89", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634845368, "permalink": "/r/DecidingToBeBetter/comments/qczqdp/searching_for_a_new_path_but_dont_know_what_will/", "nsfw": false, "first_save": 1635435076.17607, "replies_charged": false}