{"id": "t5_2tand_t3_mneftf", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "# Give, give, give and GIVE\n\nWhatever it may be, be it a client project, be it a speaking gig, even just a conversation with someone, make your sole intention to give, to provide value. You see some people don’t believe they have a lot to give, so they don’t focus on giving a lot, but when you switch your thoughts to focus on giving?! Oh, that is special,\n\nYou’re never short of ideas, never short of changing perspectives because you’re not focusing on the lack of, but abundance you can give.\n\nOVER deliver, give purely without any intention of receiving and your clients will shout about you from the rooftops, trust me.\n\n# Make it a WIN-WIN\n\nThe great Stephen Covey said ‘There is MORE than enough in most situations for everyone's need, but NOT for everyone's greed’. Re-read that and let that ring through your ears. This goes for everything, not just business deals, but relationships, friendships, family situations. ALL of them, approach the situation with a win-win mentality, by being sensitive to their needs and empathetic.\n\nI’d like to bring forth one of my biggest inspirations, the champion Jimmy Iovine and a scene in the documentary - The Defiant Ones (which if you haven’t watched yet, absolutely get on Netflix and soak it all up)... Anyways I’m referring to the scene where Jimmy wants Nine Inch Nails on his record label, however, there is a hold up with Steve Gottlieb, and you see this picture of Jimmy on the phone, every single day, showing persistence and greasing the wheels to bend reality, and eventually in true Jimmy fashion - he gets Steve to agree.\n\nSeveral people were trying to get through to Steve Gottlieb on this deal, but Jimmy was the one to do it, want to know why?... We see Steve back on screen, he pauses, looks a bit lost for words as he processes what happened and then proceeds to say one of the biggest superpowers ever.. ‘Empathy’.\n\nJimmy Iovine’s connection with every person and how he greases the wheels to make sure it's beneficial for everyone involved is all down to his empathy. He’s not just in his shoes, he’s in every person involved in the deal.\n\nWhen presented with a situation in business/life - ask yourself the following questions\n\n* How can this be a win-win?\n* How can both of us benefit?\n\nBecause I guarantee you there is always the case, we just never really think of it like this, we look at it as more how do I win? Rather than both of us win…\n\n# Be compassionate\n\nAs we bring this to a close, I want you to remember this simple piece of advice, in everything you do, be compassionate. Not with everyone around you but with yourself, you are doing amazing things, as an entrepreneur you’ve taken your business (and life) into your own hands, it’s no easy job.\n\nSo be compassionate with yourself, understand that this is not a sprint, it’s a marathon, and every single step no matter how big or small it is, is part of your journey and accumulating to the big picture.\n\nGo out there, crush it and be limitless. You are INCREDIBLE.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mneftf/2_more_things_all_entrepreneurs_should_enforce/", "title": "2 MORE Things ALL Entrepreneurs should enforce!", "social_network": "reddit", "user": "thecampereira", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1617964863, "permalink": "/r/DecidingToBeBetter/comments/mneftf/2_more_things_all_entrepreneurs_should_enforce/", "nsfw": false, "first_save": 1635435464.4706316, "replies_charged": false}