{"id": "t5_2tand_t3_nccz9w", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": " I've always been a lurker and this is my first post, so please forgive me if I make any mistakes haha.\n\nAnyways, I'm 21 female and I am currently living with my mum and sister (25) as well as my sisters boyfriend. I'm also currently unemployed and am activley looking for a job, for financial independence as well as for me and my mum to live comfortably, when my sister moves out. At the moment I'm desperate for a job as my sister says that she wants to move out in 2 years times, and I know that seems like a long time but honestly the idea she's moving out terrifies me. \n\nMe and my sister have always been close, although our bond has somewhat weakened abit In the past year, and I'm okay (kind of), with that, the thing that is making me panic thou, is the responsibility I'll have when my sister leaves, as we can't live with my mums salary alone. I'm the youngest so I've never really had the responsibility to paying the bills or caring for another as I've always been in either High school or college.\n\n I'm kind of anoyed with myself, because I'm so scared to take that responsibility, to the point that I break down crying or have depressive episodes, where, I stay in my room, hating myself and wishing I wasn't alive, which I know is silly. I guess I can't handle fear well or change well and I end up shutting down. I'm so tired of feeling afraid of life, growing up and getting a job and taking responsibility! I just want to feel okay in myself and rely on myself, and be okay with change and be independant.\n\nI think another thing that doesn't help is my social anxiety, I'm so afraid of meeting new people and I have problems with comparing myself to others or not feeling good enough.\n\nSo what I'm asking is, how do I learn to stop feeling afraid of life. How do I learn to be okay with myself  and how do I learn to be okay with being responsible and taking responsibility. I want to grow up already and be a better person.\n\nSorry, this became too long. And sorry if it doesn't make sense. If you do read it thank you for taking the time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nccz9w/how_do_i_become_more_independent_and_comfortable/", "title": "How do I become more independent and comfortable with myself.", "social_network": "reddit", "user": "DatCurlyBetch06", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1621010451, "permalink": "/r/DecidingToBeBetter/comments/nccz9w/how_do_i_become_more_independent_and_comfortable/", "nsfw": false, "first_save": 1635435935.7200894, "replies_charged": false}