{"id": "t5_2tand_t3_k8de15", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "I’m 19 years old and I’m currently struggling in life, like any typical young college student would. I’m unsure what I really want to do. I feel like a failure even though I still have a lot of time ahead. I used to have a good job that paid me extremely well. I started to develop a life style that I couldn’t keep up later on. I no longer have the job sadly, the reason is during winter the amount of construction work we do slows down and we end up having to live off what we made before the winter hits. I really regret the incredibly ignorant decisions I made, I could’ve been way smarter with my money and be set for college and any bills I had. After 1-2 months of not having a job hoping and waiting for any construction work to come up I decided to look for a new job. I went crazy with the applications and I landed a job as a package handler. It’s a really tough job and the pay isn’t the best I come home after my shift extremely sore with bruises all over my body. I lay down upset at night wishing I could go back in time and be smarter about my decisions. Now I’m stacked up with bills and college expenses and I feel stuck and lost. I feel like I went from being on top to spiking down low. Don’t get me wrong I’ve definitely been blessed this year and I appreciate everything that I have. Not to long ago I started to date this really beautiful girl. We were friends for about 2 years before we started dating. I honestly thought she wouldn’t be interested in me, I was quite surprised when she confessed. She makes everything easier honestly she’s so kind and sweet. She motivates me to try my best and to keep going no matter how hard things get. I feel like I’m losing in the short term but winning in the long run. I’m still unsure about what I want to do in life I just don’t want to disappoint my parents and her. I want to give them the best In life and achieve the success I’ve always wanted.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k8de15/the_stock_of_my_life/", "title": "The Stock of my life", "social_network": "reddit", "user": "Blackgravity4", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1607332695, "permalink": "/r/DecidingToBeBetter/comments/k8de15/the_stock_of_my_life/", "nsfw": false, "first_save": 1635435600.9658258, "replies_charged": false}