{"id": "t5_2tand_t3_oygalt", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "Today I’m going for the first time to therapy! Should I tell her everything, even if I am embarrassed? I mean I know I should, but I’m scared. For context, my dad left when I was small, not to send us money or anything. Just disappeared. And he came home once every 1-2 years for 1 week or more. I talk to him once a year on my birthday, but not anymore since I blocked him. One time he fingered my mom next to me and made me smell his hand afterwards, multiple times. Another time he literally had s*x with her next to me. When we were on our only vacation as a “family” they were going at it and I could hear them, and I was very triggered so I shouted, I was around 7 (I really don’t remember my age in any of this). And afterwards he beat me and left me with a blackeye, my mom was watching him while beating me. And other gross things, like leting me sleep in their sweaty sheets. This year he came, wanting again to stay in my house, but I told my mom I don’t want to see him (not to make him not come, but to tell me so I know when I have to move to my grandmother). He’s staying at his mom. I don’t know if he’ll come or not, but (I don’t know if it’s relevant) he gave me some money for my birthday, I literally never received anything from him in 16 years, apart from maybe an icecream or sweets when I was small. I don’t care about them, I didn’t even open the envelope. I receive everything I need and want from my mom. Am I overreacting with going to therapy? Should I tell her everything from the first visit? I’m 16.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oygalt/going_to_therapy_should_i_tell_her_about_my_csa/", "title": "Going to therapy, should I tell her about my CSA?", "social_network": "reddit", "user": "Mindless-Use7597", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 259, "down_vote": 0, "creation": 1628165740, "permalink": "/r/DecidingToBeBetter/comments/oygalt/going_to_therapy_should_i_tell_her_about_my_csa/", "nsfw": true, "first_save": 1635435958.08686, "replies_charged": false}