{"id": "t5_2tand_t3_pszlay", "request": ["b69cf201-6737-4217-b486-9096135546b8", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "TLDR: committing to making lifestyle changes for depression instead of using them as an empty excuse to avoid medication \n\nI’ve been in therapy for a few years now for some sort of depression/anxiety combo and adhd. While things have generally gotten better, the last month has been a really bad depression period. I’ve always been wary of SSRIs due to the side effects and have justified not taking them with the line of reasoning that therapy and lifestyle changes can be just as if not more effective for some people. \n\nExcept then I don’t actually make lifestyle changes.\n\nI know exercise makes me feel better, but I don’t do it. I know I need to get more sleep, but I don’t make a serious effort to stick to a bed time routine. I know I have a better day when I shower, but I skip it for days at a time. Etc etc.\n\nI’m on a wait list to get a new doctor in a few months, and I’m going to actually take steps toward these lifestyle changes each day between now and then (even if they’re small). If I’m still feeling awful by the time I see the doctor, I can try antidepressants knowing that I’ve already done what I can on my own and that they’re probably necessary.\n\nI have a friend whose anxiety is seriously getting in the way of her health (e.g. migraines from stress, not taking medication for a serious health problem because of fear of side effects) and it’s gotten so bad she’s moving back in with her parents. Seeing that play out has been a big wake up call for me — I need to take better care of myself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pszlay/getting_out_of_my_own_way_and_following_through/", "title": "Getting out of my own way and following through on depression strategies", "social_network": "reddit", "user": "Tarsiertree", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1632283718, "permalink": "/r/DecidingToBeBetter/comments/pszlay/getting_out_of_my_own_way_and_following_through/", "nsfw": false, "first_save": 1635436443.1221461, "replies_charged": false}