{"id": "t5_2tand_t3_1xbdn0", "request": ["311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "My niece has worked hard all her life to get ahead despite the hardships presented by dyslexia. She had teachers who just called her stupid. She still suffers from low self esteem because of the abuse. She is now working on her third degree in College. She is a terrific writer as you will see when you read this. We are all so proud of the work she has done.  Her preface and letter follow. Posted with her permission with all the names changed.\n--------------------------------------------------------------------------\n  I was talking to my psychologist and anxiety coach on Skype last night and he suggested that I write a letter to myself as a child as a method of working on my anxiety and low self-esteem. This is the start of said letter written within ten minutes.I have created a small Facebook viewing audience as I wanted to share my letter as a method of therapy and that by sharing my letter it might provide the impetus for you to create a letter. \n\nDear eight year old Cindy\n\n I know that you are a lonely and timid little girl. You feel self-conscious and insecure. You notice the cracks in the sidewalks, the laces on people’s shoes and your neck hurts from constantly looking down. You need to look upwards lovely girl. I know that you feel as if there is no reason to hold your head up high but you need to hang in there. You are painfully aware that you are struggling to read the scrawls on the board and you are wondering why your teacher is unable to value what you have tried to “write” on the page. I know this bothers you. You see your beautiful five year old sister reading and writing and you cannot distinguish one letter from another. You where hoping that this “thing” would disappear and that you would one day wake up being able to comprehend the written language (isn’t that what these dorky glasses are for? you ask yourself every morning)\n\nI know that you are finding every moment at school a struggle, but you need to believe me when I tell you that you will prosper. This will not be your life. In four years you will meet your saviour, your hero and your mentor, a magical and special woman named Sally. Sally will see the intelligence in you. She will teach you, she will help you. She is going to be a very special person in your life. Cherish every moment you have with her.\n\nEight year old Cindy, it gets better. I know that you feel lonely and teased, and you wish to be “like everyone else”. You wish that you had a friend. I am here to tell you that around the time you meet Sally you will also meet your soul mate a wonderful girl named Lucy. You will meet her in the playground one recess morning and you will throw rocks with her. This exquisite and wonderful twelve year old girl will become your best friend. Hug her often, cherish every moment that you spend with her. (And for me, will you tell her that hot glue and plastic don’t mix!).\n\nEight year old Cindy your life will get better. It is going to take some time and the help of others. Sally, Lucy, your family they will all support you. You will learn to read and you will become a good writer. You will gather more friends as you get older, and you will prosper. I need you to know that you are intelligent and that you have lots to offer. I love you.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/1xbdn0/a_letter_from_a_28_year_old_dyslexic_to_her_8/", "title": "A letter from a 28 year old Dyslexic to her 8 year old self.", "social_network": "reddit", "user": "butcher99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1391817482, "permalink": "/r/DecidingToBeBetter/comments/1xbdn0/a_letter_from_a_28_year_old_dyslexic_to_her_8/", "nsfw": false, "first_save": 1635437895.4003448, "replies_charged": false}