{"id": "t5_2tand_t3_nxwk87", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "Backstory: I am a 25M, recently graduated college and moved to a new city. College was a mixed bag for me. There was a lot of depression, anxiety, mistakes, and a few traumatic events. But by the end of I'd joined some clubs, made some friends, and did generally well in school (even got a 4.0 last semester.) There was a lot missing - I struggled to stay consistent in the gym long enough to put on muscle, and I wasn't able to date girls. But things seemed to be trending in a good direction.\n\n&#x200B;\n\nI was getting tired of my small college town and wanted something new. ,I moved into a single-room apartment in a city 10x the size of my previous town and picked up another fast food job as a temporary gig while I looked for a job that used my degree. One month after I made the move, COVID-19 hit. I hadn't been able to make any friends or do much of anything in the city yet since I was recovering financially from the move. Since then, my life has been nothing but emptiness and despair.\n\n&#x200B;\n\nI still work at the same job, it's understaffed and underpaid, and worst of all, I've learned that I don't have the people skills to do the job I planned to go to grad school for. I have no friends. I've hung out with coworkers once or twice in the last year and that's it, and I don't really talk to them now, nor any of my old friends from college, because I have nothing to talk about. The idea of dating a woman has gone from difficult to unfathomable. As I said, I've struggled with strength training but I used to be able to go a month or so without quitting. I haven't even been able to last a week since the gyms reopened. My solo apartment is the one highlight but I haven't furnished it or even hung the pictures up on my wall yet. I started working on a new and very ambitious project right before I moved (making a video game) and though I have it all planned out, the work I've done on it so far is miniscule. I can't cook or drive without having panic attacks. I got a diagnosis for ADHD last year and put on meds for it - they help me focus on my work without falling apart, but they don't make me any more motivated to do the work and plus they have side effects. Without access to my old coping mechanisms (gym, friends, easy access to beautiful hiking), I now drink alcohol almost every night, and my sugar intake is out of control too. I've taken breaks from both but they didn't help address the root cause.\n\n&#x200B;\n\nI have no idea how to turn my mind around. One solid year of this and my mind feels too degraded to make a change. My life is ruled by ADHD, depression, anxiety, and anger, both at myself and the world. Whenever I try to read about self-improvement, my brain just shuts off because everything feels so much more impossible and overwhelming right now than ever before, and I thought I had hit rock bottom 6 years ago. I'm sorry for writing a book but this is the first time I've put my current thoughts into writing. I just don't know what to do or where to start.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nxwk87/i_feel_that_my_mind_has_decayed_significantly/", "title": "I feel that my mind has decayed significantly since the start of the pandemic. I'm not even sure where to begin.", "social_network": "reddit", "user": "kevhiskhan", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1623465366, "permalink": "/r/DecidingToBeBetter/comments/nxwk87/i_feel_that_my_mind_has_decayed_significantly/", "nsfw": false, "first_save": 1635435410.0348308, "replies_charged": false}