{"id": "t5_2tand_t3_plli7q", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I'm a guy with a weird life and many unusual life events so I've gotten pretty good at self analysis trying to make sense of it.  When I broke my back, I tried therapy to prepare me for a life of disability.  I only wanted to talk to women but I went through 7 on BetterHelp without finding any help.  I was on my last few days of the program and connected to a male therapist and asked for book recommendations on the subject then unsubscribed.  The book recommendations were perfect.\n\nMonths go by and my wife asks me to try therapy again as a more general thing.  I go back to the guy that recommended the books.  He's not caring or sensitive.  He says \"You got this wrong.  This is what actually is going on.\" And I am so pissed and happy because changing that one core understanding made every single fucking thing fall into place.  Turns out I have all these attention seeking behaviors because I'm trying to make up for the attention I didn't get as a child.\n\nI mean yeah it's great but every aspect of my life just all changed at once!  I had a bottle of Listerine I had refilled with rum to disguise.  I was spending $50 a day on nonsense.  I was browsing porn in public.  I was eating weird, exotic foods like bugs and eyeballs.  I was trying to get laid every single conversation I had with my wife.  I was exaggerating every story I told.  I was compulsively lying to myself and others.  I was doing crazy dangerous extreme sports.  I was picking fights on the internet for hours a day.  I was getting banned from supermarkets.\n\nAnd now, just like that, in the last month I realize that isn't me.  That was just me trying to get people to pay attention to me because of an emptiness I didn't even know I had.  I really thought that's who I was and I was just awesome and amazing.\n\nAnyway, moving forward, I'm doing positive affirmations like \"I am enough\" and \"I am whole.\" I don't want to do self aggrandizing lies like \"I am special/awesome.\" And I'm supposed to find a hobby.  I haven't figured that out yet.  The disability makes it tough but I'll find something.  TV or books maybe.\n\nAnd my wife has been saying I'm demisexual which is a brand of asexual where you can only be attracted to someone you have an emotional connection to.  I think she might be right.  I think all the sex in my past was just trying to get attention from someone.\n\nSee what I mean?  Yeah, it's good to get the truth but I didn't expect my entire life to change so fast.  It's only been two visits in three weeks.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/plli7q/i_finally_found_a_therapist_with_a_brain_and_my/", "title": "I finally found a therapist with a brain and my whole life changed after just one visit", "social_network": "reddit", "user": "nonuniqueusername", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 155, "down_vote": 0, "creation": 1631282052, "permalink": "/r/DecidingToBeBetter/comments/plli7q/i_finally_found_a_therapist_with_a_brain_and_my/", "nsfw": false, "first_save": 1635437375.0006726, "replies_charged": false}