{"id": "t5_2tand_t3_na3n1b", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "I have pretty bad dental phobia. Once, I didn't go for like 8 years until my teeth got very bad and forced me to go in. I had a lot of work done, root canals, tooth pulled, cavities, the full gamut. I kept going for another two years -- I was so anxious still that I needed nitrous oxide just to get through a dental cleaning, and I'm really glad it worked for me as I can't take valium since I drive myself -- and then I was having tooth pain so, dummy me got scared of more treatment and just stopped going.\n\nNeedless to say, things have not gotten better on this front in four years and now my teeth are in worse shape and I'm really worried about what's going to be needed. I've been putting things off but decided I needed to just woman up and make the appointment. So I did. Basically, the pain finally overcame even my severe phobia. They're seeing me Monday for diagnostics to make a treatment plan.\n\nThe woman on the phone was very nice. It's a dentist office that specializes in dental phobic patients, and I did have good luck with them before, I just got scared and stopped going. She asked me what area was the biggest problem, and I explained my lower left problems. Then she asked me if any other areas hurt and I was like, \"Well, yeah, upper left. And then lower left also. My upper right doesn't hurt right now, though!\" And she was like, \"Yay, no pain on the upper right, you've got that going for you!\" Just the way she said it was all encouraging. Heh.\n\nAnyway, I could use any encouragement you have to offer! This is a huge step for me, just making the appointment. Luckily I have money stored away so that isn't adding to anxiety, because I have enough anxiety without immediate financial worries.\n\n**edit to add:** Thank you all for your kind support and encouragement! I will update when I get back on Monday. This weekend I'm doing a trip flying down to see my dad for Christmas -- we missed it with COVID and now we're both vaccinated -- so maybe that'll distract me some.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/na3n1b/first_dental_appointment_in_four_years_could_use/", "title": "First dental appointment in four years, could use encouragement!", "social_network": "reddit", "user": "rabidstoat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1023, "down_vote": 0, "creation": 1620757063, "permalink": "/r/DecidingToBeBetter/comments/na3n1b/first_dental_appointment_in_four_years_could_use/", "nsfw": false, "first_save": 1635437461.8646145, "replies_charged": false}