{"id": "t5_2tand_t3_os1iw4", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "I understand that this is recurring topic over here and I apologize in advance for that, but I needed help to  a specific problem I am facing.\n\nI can't forgive or pardon myself over a mistake I made a month ago. I wont strech the issue, in summary i accidentally broke a 700$ GPU ( nvidia card, it wasn't done on purpose). This happened on 4th July and since then i have been visiting repair shops all day, none seem to be able to repair the card. Day by day i am filling up myself with guilt and remorse and top of all that regret of breaking the card. Had i known the current state of the card, i would have not even touched my PC. I feel terrible, guilty, miserable and feel like crying all day.  It's too expensive for me and I bought it with my own money and had lovely memories with it. Today i think that the menial stress took a toll on me, i realized i am living in a room with fungus and molds on plates and looking like shit in the mirror. I would trade anything i have for my card to work again . Deep down i know that i really don't have a lot of self confidence and therefore i don't value my mental health and well being. All i think of is fixing the card. I think that this feeling of guilt and regret is quite common with me, anything wrong that happens i tend to blame myself and look for logically valid reasons to justify me being guilty or in some cases unworthy. I wish i could value myself more and take care of myself. \n\nI still am confused at the point of writing this. I don't know how to bring it to myself. I want to let it go and forgive myself . I wish i could hug myself and apologize to my past self.\n\nMy english vocabulary isn't that vast, sorry. Any help please?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/os1iw4/how_do_i_forgive_myself/", "title": "How do I forgive myself", "social_network": "reddit", "user": "sgtwrecker", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1627314603, "permalink": "/r/DecidingToBeBetter/comments/os1iw4/how_do_i_forgive_myself/", "nsfw": false, "first_save": 1635435093.3836777, "replies_charged": false}