{"id": "t5_2tand_t3_ahajia", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I've struggled with my mental health for years by myself, self medicating with alcohol and drugs, using self harm and starvation to help me feel some sort of control over my life. \n\nNow I have 2 small children, I have tried to just \"pull myself together\" which has resulted in my stress levels going through the roof. I've got to the point where I can't eat or sleep. All I do is react and cry. I'm scared my children are going to hate me for being such a pathetic, flawed, excuse for a mother, they are going to grow up and realise what everyone else seems to, they're better off away from me. I love my girls with all my heart and the thought of them resenting me is destroying my head. \n\nThis morning, after trying to get my 3 year old ready for nursery, with her arguing and fighting me every step if the way (you know, being the toddler she is) I lost it. I took her upstairs, placed her in bed, went downstairs and freaked the fuck out. My brain was racing at a million miles an hour and I just couldn't catch my breath. My husband found me in the kitchen literally gasping. I couldn't calm down. I couldn't see sense. I just wanted everything to stop. \n\nHe was brilliant, he was confused as hell by the state of me but he just held me until I eventually calmed and began breathing normally again. Then came the tears. Tears of fear from being scared of my physical reaction, tears of worry that my 3 year old will remember this and hate me, tears of years of built up emotions that shook my entire body with the power of them. And I realised I can't do it alone, and I can't go on like this.  \n\nWhen I had eventually calmed down, and after cuddling and apologising my poor 3 year old who had no idea why she was back in bed at 930am, I called my GP. And for the first time in 30 years I asked for help with my mental health. I cried to the receptionist (who was a very kind lad) and he booked me an appointment this morning. I went and told the doctor EVERYTHING. Stuff I've never even told my husband. Stuff I thought I'd take to the grave. It was like I'd reached my limit on things I could keep to myself and I just needed to be completely honest with someone about the state of me. I couldn't gloss over everything like I have done every time until today. \n\nSo I now have a prescription for anti-depressants, and a number of a mental health service to call (which may take a few months before I can get an appointment, but I WILL call today and get myself on whatever list I need to be on to get professional help) and a follow up appointment in 3 weeks. I never thought this is what would happen today when I woke up this morning. Something has snapped in me, but in a good way. I'm determined to get as mentally healthy as I can for myself and my family. I'm going to do some research into the best foods to be eating and exercises to take to help along the way. I know I need to put in some work, just popping pills isn't going to be a magic cure. And I know it's not going to be easy. There's some fucked up stuff rotting in my head that I need out and it won't be a pleasant finally facing it. But I will. \n\nAnyway, sorry for the long rant. I just felt like I needed to mark the beginning of this journey, and this community is always so supportive of one another. Any advice is also more than welcome. \n\nThanks for reading and I hope you have a great day. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ahajia/after_a_huge_break_down_this_i_have_finally_been/", "title": "After a huge break down this, I have finally been to my GP to start getting help", "social_network": "reddit", "user": "KitchyK", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1547818850, "permalink": "/r/DecidingToBeBetter/comments/ahajia/after_a_huge_break_down_this_i_have_finally_been/", "nsfw": false, "first_save": 1635437701.1801965, "replies_charged": false}