{"id": "t5_2tand_t3_khmqdd", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "**Topic of the post:**\n\nI Don’t know about you but I have often seen/heard people (especially online) say how you should do hard things for an easy life or easy things for a hard life, and a lot of the time I end up thinking what does it actually mean as it often feels like shallow advice with no actual steps on how can you implement it into your life? Well, that was until recently, until the most recent lockdown here in the UK happened and I took up the habit of running and I finally understood the thought process and meaning behind the saying ‘DO hard things for an easy life’.\n\nSo in this post, I'll be discussing the benefits of doing hard things, the mindset shift required, systems you can put in place to keep consistent and why it is essential for anyone who wants to be remotely successful in business, relationships, health and more.\n\n**Self Intro:**\n\nTo anyone taking the time to read this hi 👋 I’m Jack and at the youthful age of 23, I have experienced a variety of careers, from construction to being a personal trainer, from civil engineering to now my current job in digital media. Changing career path many times has involved me having to start at the bottom and learn the different aspects of each job, this can be and has been a daunting experience at times where it feels like a massive uphill battle and it is very easy to get overwhelmed. But throughout my years of searching for a career, I am passionate about one thing I have noticed through my periods of high inspiration, work ethic and output is the fact that during these periods I had a certain mindset and was tackling hard things.\n\n**The value:**\n\nSo, why should you do hard things and how can this benefit your life? Well, what I have found is that doing hard things makes less hard things easier, let me give you an example, I am currently studying in advanced digital media and with that comes a lot of assignments, some of the topics I have to write about are really boring things like metadata and SEO so my motivation to sit down and start these assignments isn't the highest. To make the tasks of writing these assignments seem easier I run. This might sound random and unrelated but let me explain. I normally spend an hour each day between 8-9 in the morning on my assignments, because of this I schedule to go for a run at 6.30. But why a run, what's so special about running? The answer is nothing but for me running is a mentally hard task that takes discipline to do because I don't really enjoy it in the moment. So by doing the act of running, something that for me is hard, makes the act of spending an hour writing assignments seem easy. Also, this is only amplified by the fact that it's winter time here in the UK meaning its still pitch black at 6:30 and normally freezing. So the thought of being inside where it's warm, sitting on a comfortable chair and doing my college assignment doesn't seem all that bad! By using this example we can start to see how doing hard things can help us do the tasks we normally put off. This can then have a big knock-on effect to our life, our goals and other areas, by learning how to do the tasks you don't want to do you remove the obstacles between who you currently are and who you want to be.\n\nSo now we know the benefits of doing hard things and have a rough understanding of how to implement hard tasks to make other tasks seem more doable, I'll now go over the mindset required for this. I know some of you are probably thinking Jack I struggle to brush my teeth twice a day. How do you expect me to intentionally add hard tasks to my life? Well, what I would say to you is first, start brushing your teeth more because no one likes bad breath and second this is where the mindset shift is required. Let's be honest no one likes doing hard things, no one enjoys running in the moment, no one enjoys cold showers at the time, no one looks at broccoli and chicken as an appealing meal, but it's the results, the feelings they bring and how much of an important catalyst these hard actions are on the success of your day that is so beneficial. One of the main differences between someone who is successful and someone who isn't is mindset. You need to start relishing these hard tasks, except that they are going to be difficult in the moment but the results and feelings after are worth it. It's amazing when you actively choose to do difficult things like running, eating well, stretching etc how your mindset changes, you actually take pleasure in the challenge, This can be related to the famous saying 'Embrace the suck', that the US military uses. This refers to accepting the fact they have to do these hard tasks and accepting that it might be raining, it might be cold and it might be difficult, but when you embrace these things it becomes a lot easier.\n\nRight so now we can see why doing hard things is important and the mindset shift you have to adapt to adopt this ethos, now we are going to go over how you can ensure you’re staying consistent with this. First is a schedule, you need to schedule these uncomfortable and hard tasks into your daily life otherwise you will continually put them back and back until you just give in and say to yourself ‘I’ll do it tomorrow’ but we all know that mindset never works. I would highly recommend planning your hard tasks first thing in the morning, this is because we have the most willpower in the morning meaning we are more likely to do these hard tasks. Also not to mention the fact that starting the day completing your hardest task sets you up nicely for the rest of the day as every other task and thing you have to do becomes easier. After the schedule comes habits, now it’s time to create habits for these hard tasks to ensure you're doing them consistently. Do this by identifying which days you are going to do them on. A good rule for this is the two-day rule, never go two days in a row without completing the habit, so if you skip your cold shower on Monday you have to do it Tuesday and so on. This just ensures there is never more than 24 hours without doing your habits which increases the likelihood of them becoming long term habits. Now you have penned in the days you're going to be doing these habits it’s time to schedule a set time to dedicate to these like I mentioned when scheduling probably best to schedule your most difficult habits early on in the day. So now we have our habits which have set days and times that they must be done, we can add a tracking element which allows you to see your progress and helps keep you consistent. For this, you could use a journal or something like google sheets but what I recommend is a habit tracking app. These apps are a great way to track your habits and ensure you're staying consistent. They also add gamification to the tracking process with things like streaks, completion percentage and more. This is just a fun little extra that helps incentives you to keep up with your habits.\n\n**What you can do right now TAKE ACTION**\n\nSo now you understand why doing hard things is imperative to a successful and happy life. You are familiar with the mindset you must adapt to live by this ethos, and you are aware of the importance of scheduling and habits to help you consistently do these difficult and uncomfortable tasks.\n\nI hope you found this insightful and apply this ethos to your own life.\n\n>Remember, do hard things for an easy life or do easy things for a hard life, the choice is up to you!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/khmqdd/why_doing_hard_things_makes_life_easier/", "title": "Why doing hard things makes life easier", "social_network": "reddit", "user": "jckwst", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1608574472, "permalink": "/r/DecidingToBeBetter/comments/khmqdd/why_doing_hard_things_makes_life_easier/", "nsfw": false, "first_save": 1635435485.4677532, "replies_charged": false}