{"id": "t5_2tand_t3_n3g51x", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "I'm going to try to keep this short but like many of us the only friends that I ever really had never were there for me and ended up just taking advantage of me whenever they had the opportunity. I've never really met another person who wasn't mainly interested in themselves. I used to be in a band but that fell apart because my bassist ended up being one of those toxic people.\n\nI utilized COVID for some personal self-development, I've landed myself a pretty cool job but my co-workers are mostly remote.  I am in a much better position in my personal life as opposed to my social. I am basically a quiet monk and nobody ever notices me. I am even involved in 2 volunteering organizations and even that hasn't granted me any friends or relationships either.\n\nEveryone including my therapist just tells me to just wait, and that my time will come. I don't believe that. I think removing myself from my social circles before COVID has doomed me forever.\n\nI'm starting to see a lot of things changing and people getting vaccinated, being excited to party in the summer. What am I doing? I take a step outside and it's just as shitty as it was on the inside. I still don't have friends. I still haven't dated anyone in 2 years. I'm 25 and I only make $15 for now, but I'm busting my ass at my job and trying to be creative.\n\nJust because the vaccines are out doesn't mean we're returning to any semblance of normal anytime soon. The lingering anxiety will remain there for probably the next couple years to come, as I don't want to bother anyone or assume myself in anyone's personal space. I just want good for everybody. But I've only ever gotten taken advantage of. No one has ever had my back or loved me unconditionally besides my mom maybe. My sister is back home from her first year college and she hangs out with friends EVERY DAY while I stay inside. God fuck it's kinda hard to write this.\n\nThis is probably one of the darkest and most depressing periods I've ever experienced in my life. The isolation is actually killing me, and I think I can feel it in my body. Every day I carry death close to me, right by my side. It's always on my mind, and I don't want to die, but I feel like I'm going to die very soon. I'm in a place where it doesn't feel like my life was cut out for this, and that I need to either burn out slowly like a candle or just end it ASAP.\n\nI'm willing to wait if the summer makes things any better, but I'm not expecting anything. Whenever any semblance of an opportunity appears (its never the ideal one) I never allow myself to let it take place in my mind. I'm stuck in the all-too-familiar rock-bottom depression for me to actually feel happy. It feels almost like an oxymoron; I can't possibly feel happy, because the world is full of suffering and misery. I'm probably somewhat sabotaging myself here, but I want to make friends, I just don't know what else to do next. I sob to myself every other night. I seriously just want to be free again.\n\nI just wanted to ask, has anyone ever taken themselves out of this even temporarily and was able to feel happy again? Does it just take time to get used to or is it something that just hits you and then suddenly you're ok again? Why is everyone so excited for things to go back? It'll never ever be the same", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n3g51x/has_anyone_here_ever_seen_the_other_side_from_a/", "title": "Has anyone here ever seen the other side from a very dark and sad place?", "social_network": "reddit", "user": "Rasta-Grandpa", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1619990106, "permalink": "/r/DecidingToBeBetter/comments/n3g51x/has_anyone_here_ever_seen_the_other_side_from_a/", "nsfw": false, "first_save": 1635435157.4632895, "replies_charged": false}