{"id": "t5_2tand_t3_fc5kry", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I’m basically a professional depressed person at this point. It’s been with me for so long - I don’t really know who I am without it.\n\nWhat I do know is that it ebbs and flows, sometimes what works one day doesn’t work the next. Sometimes therapy helps, sometimes it doesn’t. The journey is not a straight line.\n\nI tried something new today, and on this particular day, it worked really really well. I’m hoping it might work tomorrow too. \n\nI woke up feeling awful as I’m 7 months pregnant and have aaaaalllllll the ailments. Who knew growing a whole other person would be so hard!? Work is in a bit of a down swing and being self employed and pregnant is pretty damn stressful.\n\nSo I messaged my husband and said I was going to be depressed and feel sorry for myself for another half an hour - until 10.15am. Then I needed to flip it and look at everything through a positive and optimistic frame of mind and get on with my day. So I did. I complained via text to him and really got into detail about why I was so grumpy. Then 10.15 came, and I read over what I wrote and flipped everything. \n\nMe and baby are healthy, that’s all that matters. I am pretty damn strong and I can do this. I am a great problem solver and work is just a series of small problems to be solved. Downturns happen but we always swing back. 12 years in business - I know this. And so on.....\n\nAnd - it worked pretty much instantly. \n\nCognitive behavioral therapy in the form of a worksheet is one of those things that sometimes helps me, but having the energy to do it can be hard to muster up sometimes. Adding the time limit, and making it less formal, seemed to make a big difference for me. \n\nHoping it might help some of you all here too!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fc5kry/set_a_time_limit_on_your_anxietydepressionbad/", "title": "Set a time limit on your anxiety/depression/bad mood - then get on with your day", "social_network": "reddit", "user": "AvrilAvril", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1055, "down_vote": 0, "creation": 1583118225, "permalink": "/r/DecidingToBeBetter/comments/fc5kry/set_a_time_limit_on_your_anxietydepressionbad/", "nsfw": false, "first_save": 1635437594.1282153, "replies_charged": false}