{"id": "t5_2tand_t3_k8rmza", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I have just been going through a lot and this pandemic/lockdown hasn't been helping me. \n\nSome background:\n\nI come from a home filled with physical, mental, and sexual abuse. When I went away for college, I didn't get the proper help and I was actually depressed, I didn't realize then. This affected my grades a lot ):. Anyways, sophomore year, I decided to make some changes to my life like deleting social media and distancing myself from toxic people. My grades improved slightly. And then in the middle of sophomore year, my mom fell in a coma. She was pretty much in a coma till the end of my junior year. During that whole period, I was still attending college 3 hours away and coming back practically every weekend to see my mother. I was also the main person the doctors would talk to because of issues with my dad. Also my dad and my sister started telling me how I was low and how I wished for my mom to die because I wanted to sign a DNR etc. Anyways, at least I could avoid them by going back to college but then the pandemic happened and I had to move back home. My sister got angry out of nowhere, as she often does, and hurt me to the point where I was bleeding. My dad wouldn't do anything and told me to study in the car so I don't provoke my sister. I did nothing to provoke her. I was in the middle of class when she hurt me. Anyways, at that moment, I chose to move out and live with relatives in another state. It was a sudden decision but I am so glad I did. My mom passed away shortly afterwards. Ever since I moved, I have been getting all As in my classes (:::: \n\nI am in therapy right now and am taking action to change my life for the better. I have been taking care of myself. Granted, I have my moments where I don't feel so good (mostly because of the pandemic), I still keep myself up. \n\nAnyways, I am really happy about my As lol I did this despite all the hardships I went through and I am so proud of myself (:", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k8rmza/after_some_major_life_events_i_still_passed_all/", "title": "After some major life events, I still passed all my classes with As (::::::", "social_network": "reddit", "user": "maymerzu", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 745, "down_vote": 0, "creation": 1607381561, "permalink": "/r/DecidingToBeBetter/comments/k8rmza/after_some_major_life_events_i_still_passed_all/", "nsfw": false, "first_save": 1635436981.7780983, "replies_charged": false}