{"id": "t5_2tand_t3_fxo4k3", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I find myself struggling with envy and feelings of hopelessness a lot, as in, \"I'm never going to cure cancer or have any meaningful impact on the world, so what purpose do I really have? I also feel a deep sense of regret when I see people around my age who seem to be doing meaningful things with their lives, and I wonder what went so wrong with me that I'm so painfully mediocre. My mom showed me this poem to help me snap out of it. It is encouraging in a bitter way, and makes me remember that the image I have of someone isn't necessarily who they really are. I am trying to be better, and this poem helped me on both the interpersonal and emotional parts of my journey. \n\n&#x200B;\n\n**Richard Cory** by Edwin Arlington\n\nWhenever Richard Cory went down town,\n\nWe people on the pavement looked at him:  \nHe was a gentleman from sole to crown,  \nClean favored, and imperially slim.  \n\n\nAnd he was always quietly arrayed,  \nAnd he was always human when he talked;  \nBut still he fluttered pulses when he said,  \n\"Good-morning,\" and he glittered when he walked.  \n\n\nAnd he was rich—yes, richer than a king—  \nAnd admirably schooled in every grace:  \nIn fine, we thought that he was everything  \nTo make us wish that we were in his place.  \n\n\nSo on we worked, and waited for the light,  \nAnd went without the meat, and cursed the bread;  \nAnd Richard Cory, one calm summer night,  \nWent home and put a bullet through his head. \n\n&#x200B;\n\n[Link](https://www.poetryfoundation.org/poems/44982/richard-cory)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fxo4k3/famous_poem_about_beloved_man_describes_how_a_lot/", "title": "Famous poem about beloved man describes how a lot of us view the people who seem to \"have it all\"", "social_network": "reddit", "user": "swolebirder", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1586417821, "permalink": "/r/DecidingToBeBetter/comments/fxo4k3/famous_poem_about_beloved_man_describes_how_a_lot/", "nsfw": false, "first_save": 1635436535.2152286, "replies_charged": false}