{"id": "t5_2tand_t3_igbxxp", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Hi. I’m 25 and I don’t know what to do with my life. Work & Depression & Lifestyle \n\nI was born in Andorra. Is a small place between France and Spain and is where I live now.\n\nI still live with my parents, the only family I have. My father works at a gas station and he's a little bitter and toxic, but he is a good person. My mother works cleaning houses, she is very cheerful, but she doesn't care about anything. I don’t have Friends. I don’t have a boyfriend I’m not able to keep a relationship more than 3 months. \n\nMy dog died almost a year ago, it was old I had it since I was 8 years old. He was one of the few friends I had. Also recently my grandmother died of Alzheimer's and my grandfather of grief. My grandfather went to a mass grave because my family did not want to pay for more burials. They lived in Spain and there funeral homes are a mafia.\n\nAlso I don’t like my body even when I am very ripped & aesthetic. My weight and body composition can vary a lot from year to year. Maybe I'm 56 kg and super aesthetic or 82kg super fat with the same gym weightlifting routine. Cause the problem is that I eat a lot for anxiety.\n\nI left business administration carer cause I don’t liked it, I forgotten all I learn and I didn’t see myself working on it. (Although if I really think about it, I prefer it over working in the places where I have worked) I know there are other careers that catch my attention which I can't study here. They are very expensive outside my country. I went to the psychologist for depression but I left it in the middle without warning because I couldn't afford it. \n\nI've been unemployed for half a year. I have been working in a bad places. The last job I had, I was working between 8 and 14 hours a day as a night security guard 6 days per week. I left it because as soon as they discovered my sexual orientation they began to lose respect for me and I couldn't take it there anymore. \n\nWhat worries me the most is ending up working a bad place bitterly watching life go by. Life is too short and the last 5 years have flown by. I would like to feel useful. I would like to feel like a normal person. I feel the need of having a career I like or at least a nice job.\n\nTo forget everything I live a virtual life in World of Warcraft like a therapy. I can easily spend all day locked in my room playing. But when I leave it, life hits me, reality hits me, And that is why I write this, I know I have to change but I don't know how to start. Any advice would be great.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/igbxxp/im_25_and_i_dont_know_what_to_do_with_my_life/", "title": "I’m 25 and I don’t know what to do with my life. Work & Depression & Lifestyle", "social_network": "reddit", "user": "Gold-of-Warcraft", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1598361235, "permalink": "/r/DecidingToBeBetter/comments/igbxxp/im_25_and_i_dont_know_what_to_do_with_my_life/", "nsfw": false, "first_save": 1635435917.2936668, "replies_charged": false}