{"id": "t5_2tand_t3_m3k4we", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Every time someone tries to say \"You're so nice\"... I learned to correct them and say \"No, I am not. I just choose to be kind.\" I do this because words are powerful and people subconsciously select them. I'm protective of My \"I ams\" and people 's\"You ares\"  We internal this stuff more than we realize.\n\nNice was originally derived from a word that mean not knowing or ignorant. Then it morphed into someone who is good to people because they don't know any better. Today, when applied to person, it means they are lacking in some way shape or form and they're good to other's to make up for it or desperately are trying to get approval.\n\nPeople think they say it to try not to offend people. It is offensive, as soon as someone says \"He's a nice guy\"...The follow up question from others is \"What's wrong with him?\". Women view you as weak and unable to stand up for yourself and men view you as beta male . \"Nice\" guys finish last for three reasons, 1) They stop being a people pleaser, 2) They've slowly figure out themselves, or 3) They're kind and other's finally realize who they actually are.\n\nBeing Kind is a choice. It's done out because someone who accepts & loves themselves. Others realize  It's known or is quickly proven.\n\nFor me, it was a variation of all three. I grew up angry, but always trying to be kind. I just didn't know how to find peace until later in life. when I did I could calmly handling conflict and the manipulation attempts weak people would do. people would try to label me as nice, and think I just was weak internally. I wasn't,  I still do the kind things for people at 190 that I did at 265lb. I never changed, but people respect my physical stature now.\n\nThey didn't know the hard childhood I had because I wouldn't tell them. I've been working since I was 6 or that my dad was a drug addict who put down the needle, but never healed the addict nature that troubled him. He never healed from being a former drug dealer or muscle for \"street lenders\". his emotional instability damaged us all in different ways. I didn't want to be angry and mean in the ways he was.\n\nSome people need to know you can be good to people and not be the \"nice\" guy. I know I did because it always rubbed me the wrong way that I just loved to be kind to people, but I was misunderstood. This was hard for me to type out because I never knew how to express myself better when I tapped into my emotions. I hope this can help those who might struggle in doing good things and not being labeled the pushover \"Nice Guy\".", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m3k4we/decide_to_be_kind_and_not_nice_because_there_is_a/", "title": "Decide to be Kind and Not Nice Because There is a Difference...", "social_network": "reddit", "user": "AfterEcho2021", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1615563623, "permalink": "/r/DecidingToBeBetter/comments/m3k4we/decide_to_be_kind_and_not_nice_because_there_is_a/", "nsfw": false, "first_save": 1635437518.985457, "replies_charged": false}