{"id": "t5_2tand_t3_kqubj6", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "So let me preface this by saying I’m sorry if this is a common thing but I just recently discovered this sub. \n\nI’m a 31 year old man and I spend so much damn time in my bed watching YouTube and Netflix it’s ridiculous. Yes a lot of it is due to me being unemployed due to the covid-19 pandemic but that isn’t an excuse. \n\nI spent my my entire 20s living my life with the “no regrets mentality”. I went to culinary school and became a chef by age 22 and thought that’s what I wanted forever. Turns out that wasn’t the case. \n\nAt age 23 I moved to Australia, as so many young ppl do and busted my ass in several establishments and saved enough money to stay and travel through Asia for over a year. \n\nAt 25, my mom passed away. Shit happens, is what it is, but I end up with a modest amount, Enough to continue my “le se fair” attitude throughout the rest of my 20s. I go through most of Europe, travel South America and boom here I am at 30. I did invest some of it but that isn’t goin so hot and that’s another story. \n\n“Oh boo hoo rough life” \nI agree. It’s been blessed to a certain bitter sweet degree, I can’t deny that. \n\n But what tf do I do now?? I gave up cooking for bartending cuz I felt it better suited what I liked doing. But now I live with two roommates, have just enough money to keep living the most basic life ever and no real career to speak of. \n\nI spent my 20s living my life with no regrets and now I’m a 31 year old with no real career and no prospects. Despite doing what so many people say they want to do, traveling the world, I now feel like I’m in a hopeless rut. I feel like if I’d stayed the course and not gone anywhere I’d be in a far better place now. \n\nCan anyone else relate to this? \n\nTLDR; I spent my 20s traveling and now I’m in my 30s with no real career prospects and feel lost af.\n\nEdit: reading it over it sounds like some first world problem shit. But I can’t imagine I’m the only one goin through something like this, even if That is what it is.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kqubj6/regretting_a_no_regrets_life/", "title": "Regretting a “no regrets” life", "social_network": "reddit", "user": "Trufflehunter89", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1609836156, "permalink": "/r/DecidingToBeBetter/comments/kqubj6/regretting_a_no_regrets_life/", "nsfw": false, "first_save": 1635435579.7762687, "replies_charged": false}