{"id": "t5_2tand_t3_qdfgwt", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": "I know I have insecurities and other related issues. It brings me lots of trouble to my relationship, especially romantic relationships.\n\nI used to think I got insecurities because of this easy modern society, people around me who cheat on their partners or just not faithful in general. I observe all those things and pin them up in my head. \n\nI have been trying to work on my insecurities as things got quite messy when I decided to try to date after 3 years being single. I thought I have dealt with the problem but no I have not. It’s still there, maybe even worse. I decided not to be a toxic, controlling person but struggling with a big question, “how?”. I asked my partner to cooperate and he agreed. He tried to be honest and as an open book as much as possible. But it doesn’t work as I feel it’s ridiculous myself and I have put a lot pressure on him. \n\nOne day, I was talking to a friend who just told me she got scammed by a guy. He claimed that he was single but actually got married and had a child. My friend told me that, she was not mad at that bastard, but was angry at herself instead. She always thought she was good at understanding people and was confident about not falling in that kind of trap but then she did. She was disappointed at herself. \n\nHave to say that me and my friend have the same traits of characteristics. I am also a perfectionist, set high standards and always harsh on myself.\n\nIt was a bingo moment which made me understand where my insecurities came from. It’s nothing do to with my partner, nothing to do with people who cheated on their partners that I have witnessed, nothing to do with this society. It’s from me. \n\nI was afraid that I would pick a wrong person, that my intuition and judgment about the one I have chosen was incorrect, then I would be miserable if that person would ever cheated on me. My pride and ego are just way too high to accept it even though it’s imaginary.\n\nSince then, I decided to trust myself aside of learning how to trust people, still. And feel much better. Even though I have to admit that it kicks me sometimes, but just for one moment. Learning to be better takes time and I know I deserve a better self and a better life without living in fear all the times.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qdfgwt/understand_your_insecurities/", "title": "Understand your insecurities", "social_network": "reddit", "user": "dramaqueen2408", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634904336, "permalink": "/r/DecidingToBeBetter/comments/qdfgwt/understand_your_insecurities/", "nsfw": false, "first_save": 1635436278.476844, "replies_charged": false}