{"id": "t5_2tand_t3_eqnlbp", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I used to be an artist when I was younger, and then I got really depressed for many years and fell out of it. Recently I've been getting back into it and I've discovered the most motivating factor in creative endeavours is the joy in just...making something.\n\nIt's something I had when I was little. I'd draw pictures not so they looked good but because I had an idea and wanted to put it to paper. There is a pure enjoyment of having an idea and making it, no matter how it turns out. \n\nI used to fall into the pitfall of 'this is such a good idea I should wait until I'm better' or just thinking I could wait in general. But then time flies and you've got new ideas, or you no longer like the old ideas. Really, you should have just made them when you had them because then now in the present, you'd have more things to look back on and enjoy.\n\nAnd it doesn't have to be art. Physical notes for studying, a database, a terrible video-game, a shelf, a song, a pond in the garden, a story. \n\nIt's very powerful to have tangible proof of your work. (I often think this is why retail and number crunching jobs are so draining while manual labour has a bit of an allure to it). \n\nSo yeah doing stuff is really good for motivation and happiness. I wanted to note down these ramblings and look - I made a post! Making things! Not just time lost, not stuff trapped in my head to be forgotten.\n\nIf anyone has made anything recently I'd love to hear about it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/eqnlbp/the_joy_of_making_something/", "title": "The joy of making something", "social_network": "reddit", "user": "ImproveOrEnjoy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1579387079, "permalink": "/r/DecidingToBeBetter/comments/eqnlbp/the_joy_of_making_something/", "nsfw": false, "first_save": 1635437314.5753462, "replies_charged": false}