{"id": "t5_2tand_t3_g6vzsj", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Within the same month. \nI’ve never been closer to my true friends and family. \nEvery day I wake up grateful, happy, and energized. I went through pure HELL at the hands of someone who said they loved me, but it’s all good he will get what’s coming to him in due time. \nAs for me, I’m just helping out in any way I can !\nI’m doing volunteer work 3 days out of the week with one of my best friends/cousins (she had community service to get done asap and I finagled a situation for her by going to church with my family the last week before social distancing, and asking someone who runs an amazing program for the youth/community) so far it’s just been gardening and raking lol but it feels good to get that bit of human connection. \nI’ve also lost about ten pounds so far!! \nMy appetite was cut in HALF from getting clean and I’m active 90% of the day (taking my dogs outside for walks, organizing so many different things at my house, and working out. \nI started getting into yoga! I also drink green tea daily, which I had never been interested in before. \n\n\nI’m SOOO happy and just grateful for what I feel is another chance at life man. \nIt feels good. \n\n\nI love every one of you who is a decent human being !! Who doesn’t use/abuse others for their sick twisted pleasure and doesn’t ruin people’s mood because they’re upset with their own bullshit . \n\n\nHave a good fuggin dayyy aka have the day you deserve   c:", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g6vzsj/dropped_my_narcissist_bf_my_drug_habit/", "title": "Dropped my narcissist bf & my drug habit.", "social_network": "reddit", "user": "babyimabadfish2", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 503, "down_vote": 0, "creation": 1587679458, "permalink": "/r/DecidingToBeBetter/comments/g6vzsj/dropped_my_narcissist_bf_my_drug_habit/", "nsfw": false, "first_save": 1635437778.2624843, "replies_charged": false}