{"id": "t5_2tand_t3_ib03q5", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": " \n\nIn society, we are all about mental and the physical but rarely do we focus on the soul.\n\n1. Through the mental people tell you to meditate.\n2. Through the physical they tell you to exercise\n3. What about the soul? how do we heal our soul ?\n\nWhat about all the negativity and emotional baggage inside? What about the psychological abuse, trauma, and the negative self image that we have of our self because that affects our quality of life.\n\nWe forget that life has its ups and downs and that we have been through a lot mentally emotionally and spiritually\n\nI know many people who\n\n\\- have been told that they are unworthy, incapable of achieving their dreams.\n\n\\- have been called names and put down severely\n\n\\- have been psychologically damaged and hurt, abused and sexually abused\n\nAnd we go through life hiding all of that under a mask. We smile at people when deep down inside we are hurting in pain.\n\nWe say we are okay when in reality we are not. We care for our others deeply because we know what pain feels like.\n\nThen we try to lead a disciplined life, set new habits so we can be better but we cant because we have all this trauma inside that is eating our soul and we are dying for self-expression and for someone to hear us but we do not express so we bottle it up inside.\n\nWe try to improve by setting new disciplines and maybe we succeed for a few months with our new habits but then after we relapse because deep down inside we tell ourselves what’s the use “ I am worthless anyways” why try to improve. these thoughts of unworthiness keep lurking right back to our conscious mind\n\nWe also judge our self based on our past mistakes and faults and wonder if we are really worth anything due to all the negativity and psychological and emotional trauma that has been experienced in our direction from childhood and up to adulthood. I am talking about trauma in general. 90% of the population has some form of trauma, psychological or emotional unless you grew up perfect and got everything handed you may still have trauma as well due to the fact that you have no desire to be anything because u have everything.\n\nTo live is to suffer, to suffer is to find meaning in the suffering - netizche\n\nCarrying all this emotional trauma in your soul without addressing it will hinder your capability to advance and grow as a human being and remain disciplined. You can’t be disciplined if you hate yourself and if you think you are unworthy, how do you expect to attract a partner when you have all this emotional baggage, all this trauma lurking in your soul. you simply cannot.\n\nLook within you, you probably have emotional trauma from the past, feelings of unworthiness, feelings of not being good enough, smart enough, pretty enough and you carry all of that with you every waking hour and you hide it behind a mask and how do you expect to grow and evolve as a Human if you do not accept the past for what it is and let go.\n\nHere is what has worked for me, advice I have given to people I have treated and what could work for you as well. I started writing down my thoughts and what is hindering my ability to advance. Once you write down your thoughts you can easily see what is happening in your deeper mind.\n\nThose thoughts that you get during the day and you wonder why you are thinking about it. That’s your deeper mind\n\nFor an example let’s say you put on a dress suit and automatically you feel a sense of fear if people are going to judge you at the wedding that you are going to or they are going to accept you and love you for who you are\n\n1. That feeling stems from lack of self esteem\n2. Ok then you ask yourself why do I have lack of self esteem , you are not sure of who you are and yourself\n3. I have it because during childhood my parents told I’m not good enough , my friend told me that I lack beauty and I am too tall for any man to want me\n4. This is just an example, I am not trying to disrespect anyone. I am simply giving an example of a situation of a lady that I was treating.\n\nOkay so you know that program is impregnated in your deeper mind. You need to address it and forgive your friend and parents to heal and move forward, they hurt you emotionally and psychologically and sure at first it was nothing but that thought keeps reappearing as you move forward in life.\n\nIf you have animosity towards anyone, you should write it down on a sheet of paper and then go and burn the paper, burning the paper symbolizes letting go, if you think \"lol what a joke\" , try it and you will see.. or you can message them and express your thoughts and let it out. If it stays occupying your mind you need to address it instead of bottling it all up because if you do there will be a time where you will explode in emotional rage.\n\nNow I don’t mean express it with negativity I mean express and release any animosity you have towards anyone and let them know that you wish them all the best in their life and you wish them happiness, success. What you wish for yourself you should wish for others after all we are all connected\n\nPretty much to summarize this. The reason why you need to heal your soul is because the emotional baggage , trauma and psychological pain that you have within you will hinder your ability to grow and evolve as a human being. You Will lack discipline. You will not care about your health, your looks, your purpose, doing something worthwhile in your life because deep down inside you believe you are worthless. It’s all connected because you have low self image even if u show ur confident and fake it. Its fake and you know its fake.\n\nYou may think no it doesn’t , I do a good job of hiding it and I dont care what people think, ok sure... You must understand that humans are emotional creatures . We feel through our gut when someone is carrying emotional baggage, has animosity towards themselves and towards others, it is not an attractive trait and we usually avoid these people. Misery loves company\n\nTo advance and move foreword is to accept and let go. You must heal your soul and all the trauma and negativity that is bottled up in there. Write down your thoughts, write down your insecurities and seek to heal and forgive everyone. especially YOURSELF.\n\nBecause if you don’t , you will be stuck in your mind and this will hinder your ability to love yourself and lead a disciplined life as you carry on this journey we call life. How can you be disciplined if you hate yourself and think you are worthless. It doesn’t work. You will sabotage yourself with your thoughts and it will show on your face. You are what you think about.\n\n*The truth is, unless you let go, unless you forgive yourself, unless you forgive the situation, unless you realize that the situation is over, you cannot move forward.*\n\nmini- animation [https://www.youtube.com/watch?v=48b1MHT2frk&t=12s](https://www.youtube.com/watch?v=48b1MHT2frk&t=12s)\n\nBe real with yourself.\n\nThank for reading , I hope this post gave you insight.\n\n\\----------------------", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ib03q5/why_you_must_heal_your_soul_in_order_to_advance/", "title": "Why you must heal your soul in order to advance and grow as a human being", "social_network": "reddit", "user": "SnooCalculations9588", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1597610892, "permalink": "/r/DecidingToBeBetter/comments/ib03q5/why_you_must_heal_your_soul_in_order_to_advance/", "nsfw": false, "first_save": 1635435089.6660283, "replies_charged": false}