{"id": "t5_2tand_t3_q3imxa", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "Today I posted a story on social media about completing a terribly long hike up a whole mountain and almost plummeting to my death. I saw it as an achievement and something that I was really proud to have achieved because I was very scared most of the way. Anyway… I said that I thought I was pretty cool because I overcame a fear and made it out unharmed. \nOne of my work old work colleagues comments on the post about how she did a 5 day hike and had it so bad and I might be cool but she’s much cooler than me. She does this thing quite often and normally, I ignore it but this just got my blood boiling. I started thinking of all the sassy comebacks I could make. I thought about sending her a ‘that’s nice dear’ or even putting up a link to an article on how to not make things about yourself. \nBut I took a deep breath and asked myself what I was trying to achieve. \nI acknowledged that I was annoyed because I wanted this post to be about me and she had hijacked it to make it about herself. I acknowledged that by sending her a link to an article about how not everything was about her, I was making everything about me. I thought about her history as an alcoholic serial dieter who blew up her first career and had to restart her whole life away from everyone she knew because she embarrassed herself so much. And then I felt a little sorry for her. She’s going through some stuff and might not be getting the attention she wants. \nWith that in mind, I managed to step away from my anger and see that we are both a little damaged and in need of healing. \nI chose to block her because she does this to my posts often and I don’t need that energy tainting my energy. I am choosing to be better. I don’t always succeed, but at least I’m trying.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q3imxa/i_thought_about_my_action_instead_of_being/", "title": "I thought about my action instead of being impulsive", "social_network": "reddit", "user": "BeccaWella9494", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 47, "down_vote": 0, "creation": 1633640654, "permalink": "/r/DecidingToBeBetter/comments/q3imxa/i_thought_about_my_action_instead_of_being/", "nsfw": false, "first_save": 1635437934.12645, "replies_charged": false}