{"id": "t5_2tand_t3_oi6izt", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "It isn’t easy. I never chose to be born, and when I came to an age of understanding, I realize I will die. This thinking thing came out of nowhere and is possibly bound to nothingness at the end.\n\nAnd yet… I have this deep desire to grow, to progress, to continue and succeed. To win. Something within me strives to improve despite there being an end to it all. No matter what heights of achievements I gain, it will all eventually fade. Even if what I leave doesn’t, I will – I won’t be there to enjoy it.\n\nBut time flies, and I have to constantly remind myself to enjoy the present. Enjoy what I have around me and be grateful. This gratitude recharges me and leaves me feeling blessed even though I know I can always get more, and someday it will all end.\n\nSeems futile, doesn’t it? Came into being without my choosing, work and toil endlessly to grow knowing it will all fade, but still reflect and try to be thankful.\n\nHow can you blame the people who only chase pleasure? We don’t even know how long we’re here for. We don’t know what will happen to us, when our end will come; the healthy die young, the corrupt rule, the deceivers flourish and become wealthy, and the lovers get their hearts broken. So, how can you tell people to keep growing, to enjoy, and work and flourish knowing they will end possibly before they can accomplish their goals? You can’t blame people for wanting different things, we’re all trying to make peace with these realizations in our own way.\n\nEven the way we are raised is largely due to luck or chance (or fate or destiny if you choose). Never chose to be born, never chose the family, location, we just never got to choose any major part of it, yet we must always act in it.\n\nIf despite all this you still strive, even if you fail, to push yourself, to win *knowing* all the while it will end – you are strong. Remember to make allowances for your failures, for delays, and changes. The hardest thing is already being done – living with the knowledge that it could all be meaningless.\n\nWith love, I hope you will continue believing there is purpose, and work to flourish despite the absurdity of it all. If we choose this path, we must fight every day to have it make sense. Renew the passions and take charge of what we can. Continue striving to improve in this absurdity. Yet be compassionate and understanding when we stagnate or lose focus. I hope you continue to fight. We are truly something else - something absurdly extraordinary.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oi6izt/its_all_meaningless/", "title": "It's all meaningless...", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1626017356, "permalink": "/r/DecidingToBeBetter/comments/oi6izt/its_all_meaningless/", "nsfw": false, "first_save": 1635435548.6553586, "replies_charged": false}