{"id": "t5_2tand_t3_pm77dj", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "f48bf32c-05af-4e9d-b00f-8b45a75af78f", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Hi, hope everyone is well, throwaway here :)\n\nBasically I just want any advice and tips on how to not be mean and cold. \n\nI’m 21F and not really doing well at the moment, I haven’t really been for basically most of my life. I haven’t had any friends (only 2 short term when I was younger in primary) and didn’t make any in secondary or uni. I was bullied badly in school for the way I look (I’m basically a horror as many people like to put it). It hurt me in school till I was about 16 but then I just became so cold and unemotional towards people, especially in sixth form and uni.\n\nI basically endeavoured the mindset of not giving a f*** about people, what they thought and how I acted. My motto was “Well if I’m ugly on the outside, might as well be ugly on the inside”. Cringe, I know, but that is how I felt for many years and I felt it was valid.\n\nWithin that time, I was literally something else. People still attacked me for my exterior, but the things that I said back to some of them and others who didn’t even provoke me was disgusting (proper cold an just terrible).and no amount of hurt within myself can excuse that. I got known as the angel of hell in my class and no one wanted to associate themselves with me. Before I felt sorry for myself, but now I just want to be better.\n\nI have no friends, only my mum and I want to make a fresh start. Get a good job, get plastic surgery and just be a nicer person. If anyone has any advice I would greatly appreciate it :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pm77dj/i_want_to_stop_being_a_mean_cold_btch/", "title": "I want to stop being a mean cold btch", "social_network": "reddit", "user": "throwawaygirlt19", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 107, "down_vote": 0, "creation": 1631365990, "permalink": "/r/DecidingToBeBetter/comments/pm77dj/i_want_to_stop_being_a_mean_cold_btch/", "nsfw": false, "first_save": 1635435340.462587, "replies_charged": false}