{"id": "t5_2tand_t3_okxpz6", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "...and I think that’s an improvement for me. I’ve been trying to fight for a better life for a while already. Maybe it’s my shit luck, or something is against me, but it blows up in my face every time. Venting to my friends and hoping they’d help made them leave me. Trying to match up with my friends in terms of achievements just made me waste my time and burn out. I tried to end my life and stop the suffering, but it only landed me in the hospital and put me in a worse situation than before. \n\nI’ve realized that every time I try to improve my situation, everything just goes ass backwards after that. So, i am choosing to give up on trying and just to exist. \n\nWhen I was lying in the hospital bed, i realized how calming it was to just... not do anything at all. Nobody expected much of me anymore either. No need to fight for a job, no need to constantly improve on myself, no need to perform tricks like a circus monkey just to justify my existence to myself. I was just there, and I felt like a wreck of a human being like always, but at least, I broke my physical self so much that I didn’t expect a lot from myself at all. \n\nMy friends stopped coming after a while, and it felt really good to not have to pretend i’m alright at all. I realized that connections to people just brings about expectations, which always leads to disappointment. \n\nSo, i’ve decided that i’m not planning to do anything at all, and i’m going to cut myself off from my family and friends. In an odd way, it feels like i’m better off like this. Has anybody else been in the same shoes as me? Any other way I can facilitate this feeling?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/okxpz6/i_have_decided_to_give_up_on_being_better/", "title": "I have decided to give up on being better", "social_network": "reddit", "user": "throwaway56475674", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 61, "down_vote": 0, "creation": 1626370509, "permalink": "/r/DecidingToBeBetter/comments/okxpz6/i_have_decided_to_give_up_on_being_better/", "nsfw": false, "first_save": 1635435782.288918, "replies_charged": false}