{"id": "t5_2tand_t3_bgtlkt", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "I want to share my story here in case it helps anyone else out. It's a bit of a long one, I'll try to keep it somewhat simple...here goes.\n3 years ago, I moved up to VT from MA onto my friends' farm, they are a husband and wife. I was working at Rite Aid in MA and it wasn't too hard to transfer to another store nearby where they lived. I was working for my keep on their farm. I got to experience some aspects of farm life that had always fascinated me. It was hard work, I worked nearly all hours of the day that I could physically move...it was tough, but I made a vow to myself that I would not live with my parents, I was 31 years old at the time. My mindset was, \"I may still be broke, and I may not have any leisure time, but at least I got out from under their roof.\" It honestly felt like a big upward move, my friends. It empowered me. It felt like I was taking control of my destiny. \nMy friends asked me to move out when they became pregnant. It was something of a bummer but also a relief, as I could not really work so hard every day without something of a break, I was feeling fatigue which may have been related to Lyme disease, etc. It was a turning point.\nRight around that time, a dear old friend of mine, something of a mentor to me, he was like an uncle or surrogate father in some ways, he asked me to move in with him. He lived in the same area I had moved away from in MA. It was a move that made sense, I was still going to be broke at the end of every month paying him rent...but it felt like a good move and I took him up on it. At that point, I was back in the area I was in before, no longer farming, just working and renting a room from my mentor/friend.\nThat didn't last long under those circumstances, 2 months into that arrangement, he fell terminally ill with liver cancer. I'll never forget the day he walked into the kitchen and told me. 15 minutes later, he presented me with a bargain which felt like destiny.\nHe said, \"You take care of me until I die, I'll ask you to take care of my dogs (he had 3) and then I'll leave all of this to you.\"\nMy friends, I did not hesitate, it felt like my destiny. And all of the hard work I had done up to that point made sense, it was all in preparation for the caregiving during the illness.\nI had kept up such a wicked pace for the previous year (before moving in with my mentor/friend) that it was rather natural for me to continue on in that way...it was hellish and difficult but I made it through. I had a lot of time with him before the end. We even laughed, we even tried to create a heaven inside of that hellish experience. I know that I did my best for him, and I've been rewarded handsomely.\nMy friends, I just want to encourage you to invest in yourselves, whether it be though diligent work, education, volunteering, whatever it is, you are worth it. It wasn't long ago, a little over 3 years ago, that I was languishing in my parents' house. I have truly climbed a bit of a mountain here, and while my work is far from over, it feels much better being in this position. I know that all of you are capable of making great strides in whatever direction is best for you, and I'm here to say, \"Go for it, you deserve it, what have you to lose anyway?\"", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bgtlkt/3_years_ago_i_made_a_decision_to_move_out_of_my/", "title": "3 years ago, I made a decision to move out of my parents' house. I was depressed and broke, even though I was working full-time. Now, I own a house and land of my own. I have a story to share, my friends. Take a 'gamble' on yourself, you have nothing to lose. Please read if you're interested.", "social_network": "reddit", "user": "blackmer2010", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 679, "down_vote": 0, "creation": 1556106345, "permalink": "/r/DecidingToBeBetter/comments/bgtlkt/3_years_ago_i_made_a_decision_to_move_out_of_my/", "nsfw": false, "first_save": 1635437168.432121, "replies_charged": false}