{"id": "t5_2tand_t3_oowh1y", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I'm an animation student, but when you live in California you have to have either 3 jobs or a warehouse job to pay the bills. During the pandemic I burnt myself out really badly - I worked 40+ hours weekend night shifts as a forklift operator, and flipped my sleeping schedule every Monday just to make it to class/my work-study job as a mentor for freshmen. And that consisted largely of just comforting and trying to motivate depressed freshmen who were dropping out of school like flies. I even had a few kids tell me about the people they lost. I even lost some people. I know I'm in a position of privilege, as not everyone has access to employment and education but- I don't know. I don't think I realized how depressed I got till I let it get this bad.\n\nI dropped out this spring, and in April I just. Quit. It was a really good position and I was making great money but. I don't know. I woke up one morning and told them I quit.\n\nI have been living off my savings, but I have no more money. I cannot continue this pattern of just rotting away at home, and I cannot just tell my landloard/roommate I'm too depressed to work. I've been poor/semi homeless before, and that's really the only thing driving me to work again. I really wish I had a better reason. I don't think I know anyone who goes to work, for nothing if not out of fear of being poor again.\nToday, I reapplied to several warehouses. And I'm going to try to reenroll in school.\n\nI'm scared I'm going to burn myself out again, and that I'll end up like my family members who waste away in dusty warehouses. but I don't think there's anywhere else to go from here, and I am telling myself, I got this. I did it before and I can do it again.\nand if I'm being honest, this little community here on reddit makes me feel like it's possible.\n\nthat it really is just waking up everyday and deciding, today I am going to be better.\n\nI guess this post is me trying to will this,, this decision to try again, into fruition. sorry for the rambling and thank you for anyone who read this - may we all get better together", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oowh1y/deciding_to_try_again/", "title": "Deciding to Try Again", "social_network": "reddit", "user": "MrGayAgenda", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1626893840, "permalink": "/r/DecidingToBeBetter/comments/oowh1y/deciding_to_try_again/", "nsfw": false, "first_save": 1635437845.3571746, "replies_charged": false}