{"id": "t5_2tand_t3_n3oukr", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "b6268088-7e96-402f-b095-10310f65dbaa", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": " \n\nSo, where to begin? I don't want to reveal too much about myself, I'm 19 and like the title states I am failing school right now. I am currently enrolled at a state university and the semester is about to end, and I'm going to be failing two out of 4 classes at the end of it, I already checked the grading page and mathematically there is no way I can avoid failing these classes. The reasons I am failing are pretty simple and I don't really deserve any sympathy, I play too much video games with my friends, waste too much time watching youtube videos and entertainment on Netflix, I occasionally skip assignments I don't want to do, and I don't properly manage my time. To add some more context, this is my second semester at this university, the first one went very similar to this one and I had to reenroll in the school to take more classes because of my low GPA, and now I'm about to fail yet again, and I deserve it, I know that.\n\nI have nobody to blame but my self, it was all on me and for the second time I have flopped. The worst part though? Its my family, I am a single child, I was born to a loving mother and father who work very hard every single day of their lives to try to give me a better future. My parents built their own business when I was barely born, and have dedicated their lives to expanding it and one day handing it over to me. I was blessed to have been born into such a decent family, with a very comfortable lifestyle, never worrying about money, and having my future basically handed to me on a silver platter.\n\nLooking back at my life, I seemed to have started out on the right track. All through my public schooling years, from elementary to middle school and junior-high, I was always an A-Grade student, I had a love of reading and was always at the top of my classes. I remember every year we'd have parent-teacher conferences and my teachers would always tell my parents I was one of their best students and they could barely ever come up with anything I needed to work on, it made my parents so very proud of me. I played soccer and was fairly decent, made good friends that stayed with me all the way to high school, I had such an easy and pretty sheltered life.\n\nI guess the troubles began in high school, freshman year to be specific, I failed my first class. It was English, which most people don't believe when I tell them, because everyone who knows me will say that they never see me without a book in my hand. Back then I would grind through books in a week, I loved dystopian, action, and drama novels, along with alot of history books. My issue with the English class that year though was simply because I stopped putting so much effort into my homework, I started turning in alot of late writing assignments and it hurt my grade alot. Mostly I would say this was due to me getting way more into gaming at that time, me and my friends had all gotten Xbox's and pc's so we were always at each other's houses or at home online playing video games. As freshman year went on my other classes also took a grade hit, going from all A-Bs to B-Cs, which at the time didn't seem like a big deal.\n\nAs my freshman year ended and my sophomore year began, my life was changed substantially when my parents decided we were moving out of town permanently, our family business had grow and it was time to relocate several hours away to the town where our newest and biggest store was gonna be opening. I was told several months in advance that we would be moving to the new town during winter break, so the last months I had at my old school I tried less and less at school work, I got mostly C and a D grade, and I was spending more and more time with my friends, since I figured I would be losing them soon. The move happened, and I started at a new high school with no friends and at the time I was a pretty lonely and sad guy. I failed a math class my first term at the new school, and things weren't looking good if I didn't shape up. The next year actually went abit better though, I made some new friends at last and my grades improved slightly, (back to B and C grades.) however I was still spending way too much time playing video games online. I'd always stay up late to play video games, it was great because I could play with my old friends from my hometown, I could stay connected and in touch with my best friends even though I had moved away. This trend continued to end of high school, I just met my graduation requirements and was able to walk with moderate grades and a very average GPA.\n\nMy parents were fine with this and very excited for me to start attending college, they wanted me to study business like my dad did so I could be prepped to take the business's reins down the line. My father had loved college and easily excelled there, he often said that I would have the time of my life in college, and I believed him, I thought it would be a piece of cake compared to high school. I soon enrolled to the state university that had their campus in town, so I could still live in my parents house and they were very happy with that. My application was accepted within a week and off I went, into disaster. The first month was easy, in fact easier than high school had been, so I started slacking off, falling into old habits again. I started skipping classes and studied less, my parents had such faith and trust in me that they never checked on how my grades or classes were doing, so I was flying way under the radar. I did poorly that first semester, I failed classes and got put on academic suspension because of my low performance, when my family found out it was terrible, my mother was disappointed but still very optimistic that I would do better next semester, however my father was very upset with me and we fought abit. The things he said with the worst look of disappointment in his eyes hurt me very VERY deeply and I can never forget it.\n\nAs the next semester started covid was exploding on the news and the school shut down that semester, so I got pretty much a year before returning to the university. I filed the paperwork and went through the process of reenrollment, and in the meantime I started working full time at my family business, but when I wasn't working I was still wasting my time online, joking around with friends (old and new), playing games, watching youtube, viewing streams, and also some occasional underaged drinking. Then at last time came for me to return to school, and this post is already way too long to go in-depth with excuses or specific details. Basically I was lazy and somehow did not learn any lessons from the past and fell into the same goddamned bad habits as before. It was so much easier to skip classes and miss due dates when classes were all virtual. Now here I am, facing the end, and once again I've let my family and myself down.\n\nI see the path ahead of me getting closer and closer, I will fail, and if I tell my parents I have no idea how they will react. I'm afraid, and I regret so much, I wasted all that time, I had every advantage growing up and yet I still failed. I don't know what to do, I don't know if the university will kick me out or if I'll get another chance, and how the hell am I going to be able to face my family? There are probably a hell of alot more people with bigger and deeper life problems that deserve some good advice more than I, but if you want to send some my way, I'll gratefully take it. Either way thank you so much for taking the time to read this.\n\n(Apologies for the long length of the post, I felt I needed to write it all out for my own good.)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n3oukr/19_im_failing_school_and_even_worst_failing_my/", "title": "(19) I'm failing school and even worst, failing my family. I feel terrible, but I do want to do better, could use some advice.", "social_network": "reddit", "user": "Alex_in_Unknown", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1620020190, "permalink": "/r/DecidingToBeBetter/comments/n3oukr/19_im_failing_school_and_even_worst_failing_my/", "nsfw": false, "first_save": 1635435182.3452556, "replies_charged": false}