{"id": "t5_2tand_t3_abfzb3", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "My friend has had a rough time the last few years, he has been dealing with physical problems and has been spending most of his time at home. He is clinically depressed. He is a writer and has just finished a book he has been working on for over 18 months, its literally been his life and the process has been difficult for him. His drive to write is intense and although often times he struggles to put pen to paper, he always jumps back in the saddle and has through blood, sweat and tears, finally finished the book.\n\nThe problem is that he's chasing his happiness through writing. But the process is painful for him, only about 10% of the process is satisfying and this is when he is self medicating with alcohol and weed. Now he's got to the end, it's not at all satisfying. He's confused by the lack of joy or satisfaction. He's seeking the gold which he thinks is at the end of a written book, but he's not finding it. Of course, he's just started writing the next book.\n\n I was thinking maybe he could try meditating on gratitude or something,  because this cycle of writing  and feeling no better for it is self destructive. The ideal is that he would have a healthy relationship with the process and enjoy it more without relying on self destructive behaviour.\n\nI'm kinda at a loss and I know my friend is. Thanks for reading. \n\nTDLR; \nFriend is depressed and spent a long time writing a book, it is his life. The process was difficult and he self medicated to get it written. Now it is written, he feels no joy and I'm concerned it is a dangerous cycle. I think he has the same concern.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/abfzb3/my_friend_is_struggling_to_appreciate_and_feel/", "title": "My friend is struggling to appreciate and feel any satisfaction after achieving goals. He wants to though.", "social_network": "reddit", "user": "BoomshankChrist", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1546325379, "permalink": "/r/DecidingToBeBetter/comments/abfzb3/my_friend_is_struggling_to_appreciate_and_feel/", "nsfw": false, "first_save": 1635438109.1484196, "replies_charged": false}