{"id": "t5_2tand_t3_o7ha0o", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "As someone who had a rough childhood and lived with being on the Autism Spectrum and had ADHD both of which caused me to doubt myself, fall behind, and become terribly depressed because I was undiagnosed with it until last summer when I was already 21, life has been hard. It took me until I was 19 years old to come up to my mom and say \"I need a doctor\", I just couldn't do it before I couldn't talk about it at all. I only feel for those who don't have the ability to get help like I did and figure out \"Hey I am not like everyone else, I need extra things to function right\".\n\nFiguring it out was only one step, before that I made many mistakes, I paid for sex and became addicted to it always chasing the feeling of being loved and wanted which I never really got.  I did poor in school my last year and didn't end up going to college, I didn't have the ability to be responsible for anything like brushing my teeth, cleaning after myself, taking care of my pets, cleaning my room, folding my laundry. I was a mess and I thought it was me, I thought this is just how I am, I am a failure who can't do anything.\n\nI was wrong, that was not really me, that was me unmedicated, unhelped, unsupported. My catalyst to change was getting into a relationship I at the end didn't want to be in but when it ended I felt it was the only way, the only saving grace, and I was destroyed on the inside for a couple weeks. It was just after starting a few new college courses after two years of no school, I wanted to give up, I curled up in my bed I cried, I called the suicide hotline because I had nobody to go to, nobody to really talk to that I was comfortable with. Everyone in my life I pushed away due to my anti-social behavior and I suffered greatly in that moment. I spent a good week cuddling with stuffed animals and watching tv shows with my mom who I was never close with but none-the-less these were desperate times. Nobody else was going to be there for me.\n\nI realized like everything else in my life, that relationship was just another hiding spot for me from all my problems, just like paying for sex, just like video games, just like netflix, or shopping for crap I don't need but I do because of that dopamine hit, I didn't care about the relationship, I cared about the escape it gave me from my life. I was listening to this album I hadn't listened to for a while and at one point the singer said \"The tension is rising and rising and the world is at stake, so take back what belongs to you, my god before it's to late\" and then he yelled \"TAKE IT BACK!\" I listened before to this album and I thought \"Yeah I should do that, I should take my life back, I am only getting older\" but I didn't but this time I was at such a crisis point I was behind on homework and I said I need to do this now, because if I don't do it now I sure as hell won't do it later. I was going to wait an hour play video games and then do homework but ended up spending the next 6 hours doing just homework before going to sleep.\n\nI saw my therapist again, and this time I decided to be more open than I have ever been with him after not seeing him for 6 months. I also got my prescription changed, and got prescribed Dextroamphetamine for my ADHD and FINALLY I felt something, for once I felt medicine work for me! It took a bit I realized I can't take stimulants while lying in bed and waiting for it to work for me, I have to get up brush my teeth and get moving, and I did this every day and took all my medicine on time, brushed my teeth morning and night, finally did my skin care routine diligently every day without skipping. I did all my school work early, the stimulants definitely helped push me and give me the energy but it was still a lot of mental work to get myself to do all of this and keep the habits. I gained good habits before and kept them for a few days, a week, a fortnight a most, but then gave up. It has been almost 1.5 Months and I have still kept up, passed my classes with 2 A's and 1 B+. I also got a great diet now, instead of eating junk food and chips and sometimes 1 meal a day, I began eating 2-3 healthy meals a day with fruits and vegetables in between as snacks. I don't even feel the need to eat junk food anymore!\n\nNot only that but I finally hit up the gym again with a new membership after over 1 year of being sedentary and have been going every single day. I even hired a personal trainer to help me initially as I am not confident in my form using that money I would previously use on escorts on someone who can actually help me feels amazing and it's actually helping me which is so great! I also sought out a therapist for sex addiction specifically and he's been helping me out with that and it was such a huge step. I never thought I'd talk about that and share that part of my life with anyone it's such a relief. I also got into contact with some of my old friends and began rebuilding some kind of a social circle.\n\nTLDR: For the first time in my life I am not giving up and building good habits, I don't want to quit I want to build me up and I want to be better from now on", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o7ha0o/im_proud_of_me/", "title": "I'm proud of me", "social_network": "reddit", "user": "Lolothelion", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1624599059, "permalink": "/r/DecidingToBeBetter/comments/o7ha0o/im_proud_of_me/", "nsfw": false, "first_save": 1635437928.462604, "replies_charged": false}