{"id": "t5_2tand_t3_o8msxy", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I turn 22 in a week (male) and let's just say I hung around the wrong people and am not very well liked. After being sexually assaulted in June of last year, I became an alcoholic and made an ass of myself (nothing crazy, just a depressed, annoying, lame cunt). I also performed some vigilante justice by outing a 30 year old guy that beat my 19 y/o female friend and a rapist that showed up as a cook at my old work. I don't have many friends, and with the knowledge I have I felt that it was the right and selfless thing to do to keep my peers safe. Regardless, being on the radar of two woman-abusing psychopaths is enough for me, someone else can take out the trash next time. I did my part. \n\nI also had a sexually, physically, and emotionally abusive relationship with a girl for a really long time. After speaking to a few friends about the abuse, she got mad (Borderline Personality Disorder, she goes into blind rages) and falsely accused me of rape. So I'm super paranoid and don't feel like leaving the house. \n\nWhat are some things, as a person who recently attempted $uicide, has dropped out of college and wants to pursue it, is depressed, lazy, paranoid, friendless, disliked and now sober can do at home/in safe places to better myself? I am a little more nervous now, because the rapist approached me at a restaurant on Wednesday I've been going to for 7 years and threatened to murder me and I told him I was calling the police, and he threatened to murder law enforcement as well. I filed a report and am getting a restraining order on him soon. Both these guys are way older than me, the woman beater is 33 with 3 kids, so it's really lame of them.\n\nIf you guessed I live in a shitty hick town in the South/Midwest, you'd be correct. There's degenerates like this at every turn; women aren't safe here and abusers are defended. Lots of meth and violence. \n\nWhat can I do at home/safe places to improve myself this Summer? I'm a cellphone addict that doesn't sleep (insomnia) and doesn't do much. I have a private gym membership where I'm surrounded by esteemable people, and I'm lifting heavy weights now. What else can I do?\n\nI'm a really intelligent person, just had an abusive childhood full of death (only 3 surviving direct family members), bullying, sexual abuse, etc. and substance abuse issues as of late. I'm troubled but want to get better and be like my mom before she got on drugs and passed away of an overdose. I'd like to take advantage of the mature and intelligent side of me, not the troubled, paranoid, resentful side.\n\nThanks.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o8msxy/how_to_improve_myself_over_the_summer_without/", "title": "How to improve myself over the summer without being social and leaving the house/my side of town much", "social_network": "reddit", "user": "rrtfdfgtrry", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1624754866, "permalink": "/r/DecidingToBeBetter/comments/o8msxy/how_to_improve_myself_over_the_summer_without/", "nsfw": false, "first_save": 1635435141.484212, "replies_charged": false}