{"id": "t5_2tand_t3_ix04db", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I want to change so many things about my life and I've written many lists like this one in the past.\n\nThis time, I decided to share it with you guys, to put a little bit more pressure on myself and just to change things up a bit.\n\nThe most important things I need to adress, imo, are my several addictions that I keep getting back to.\n\n\\- Internet/Video Games/PC: I'm 35 years old and since I was maybe 11 or 12 years old, I've spent most of my free time staring at a screen. Be it to play games, surf the internet, watch Netflix or Youtube or look at porn (which is a whole other issue by itself). I want to severely limit my screen time and only use my PC for productive stuff like learning skills or organize my dates and finances.\n\n\\- Nicotine: I've been smoking cigarettes for about 16 years. I have tried to quit many times. A few months ago I listened to Allan Carr's Easy Way to Stop Smoking and it really convinced me. I still went back to smoking after 2 weeks or so. BUT I think I realize now what kind of mindset I have to have to make it last and I feel like I am not far away from actually quitting for good.\n\n\\- Alcohol: Almost every Friday I end up drinking and smoking. I always tell myself that I want to use the weekend to be productive/work out/clean but I hardly ever do any of that. I don't drink much, but I do it regularly. Sometimes even on Thursdays, telling myself it's fine because I have to get up 30 minutes later on Fridays and only work 4 hours. I've regreted it so many times. I'm pretty sure it's a major factor in my weight gain over the past few years. My skin has also been suffering from drinking and smoking. Plus I just don't like the drunk me.\n\n\\- Porn: I masturbated daily to porn for roughly 20 years. I learned about NoFap maybe two years ago, had a few good streaks of semen retention but I never really quit porn during those. Right now I jerk off to porn about once a week. I think that's a lot better than what I used to do, but my goal is still to practice real NoFap, focus on getting in shape and get back into dating, which I haven't done in ages.\n\n&#x200B;\n\nI think I covered the main things I want to quit/reduce. Now on to the things I want to implement in my life:\n\n\\- Daily Exercise\n\n\\- Daily Cleaning of my apartment\n\n\\- Daily Meditation\n\n\\- Healthy Diet\n\n\\- some sort of Skin Care Routine\n\n\\- improve my skills in my hobbies on a regular basis (I have tons of different hobbies that I am passionate about, but have always been super complacent when it comes to improving the skills involved with them\n\n\\- stay more up to date with daily news and politics\n\n\\- read more in general\n\nI'm sure there is tons more, I just can't think of anything right now. I'll propably update this list later since I am at work right now.\n\nOf course any advice on any of these topics is more than welcome. Mostly I made this post to get it off my chest and try a different approach than my usual to-do-lists in a handwritten journal.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ix04db/just_some_thoughts_on_what_i_want_to_accomplish/", "title": "Just some thoughts on what I want to accomplish starting today", "social_network": "reddit", "user": "seiesos", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1600693844, "permalink": "/r/DecidingToBeBetter/comments/ix04db/just_some_thoughts_on_what_i_want_to_accomplish/", "nsfw": false, "first_save": 1635436052.878185, "replies_charged": false}