{"id": "t5_2tand_t3_ngjdag", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I have thoughts that I am not competent at my job (engineering) and that there are other people that do the job better than I do. Particularly my close colleague.\n\n&#x200B;\n\nWhen assessing the accuracy of these thoughts, they are not accurate. He is very skilled in a lot of areas of the job, but I am also skilled in my own ways. His skills just seem to be more prominent and easy to see by others.\n\n&#x200B;\n\nThe evidence is that this co-worker is a PE, and I am not, although we are only 1 year apart. Although he is a PE and is very knowledgeable in engineering topics that I may not be, I have better app development and computer programming skills that also can be used as an advantage in my job.\n\n&#x200B;\n\nThinking objectively, I am consumed because he may be better than me at certain things and allow my ego to take control. My ego is not allowing me to accept the fact that I do not have to be better at everyone at everything and that I should not compete against everyone at everything, especially since it has likely been a strong contributor to my depression and anxiety.\n\n&#x200B;\n\nIf I had a friend who was dealing with this, I would tell them that I should accept the fact that everyone has skills that they are better at than others and that trying to compete in an area that they don't even want to compete in is an area of stress that is unwarranted. Accept your strengths while developing your weaknesses.\n\n&#x200B;\n\nGiven my increased awareness around these thoughts of not being enough, I will create an education plan for myself that works on my weaknesses and while using my strengths to excel at my job.\n\nWhat do you think of my proposed path forward?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ngjdag/feelings_of_not_being_enough/", "title": "Feelings of not being enough", "social_network": "reddit", "user": "titus-adams", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1621463849, "permalink": "/r/DecidingToBeBetter/comments/ngjdag/feelings_of_not_being_enough/", "nsfw": false, "first_save": 1635435174.2563562, "replies_charged": false}