{"id": "t5_2tand_t3_q0cr35", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "For as long as I have been alive I have been isolated by 60% of people my age. It's always been like that, even when I was younger. I just wasn't aware of it at the time because I was too busy playing with dolls and drawing with crappy art supplies. It hit me in middle school finally that the kids my age I'm supposed to grow up with are actually awful. Most are. \n\nThe issue I have with these teens are that they act like my friend and only find me entertaining. They are never there for my mental health. If I was right in front of them, maybe they would comfort me. But no, no they are not in front of me anymore because I had a breakdown and left high school this past March and got my GED. I was going to be a junior for this current fall, but suddenly the school work just felt like too much even though it was very little, and I felt so isolated by peers. No, not feelings, I *was* ostracized by them. They rarely chose me for anything. I avoided sitting in the lunch room because I didn't want to bother them. I rarely ever had someone to tell me to sit down. I've only had 2 serious relationships, one lasted 5 months while the other lasted 2 weeks. The other \"relationships\" I've had were all jokes and nothing ever actually happened between us.\n\nI did not have a fabulous time in school. I can't go over it all because it would be like the fucking Odessy. But what I will tell you is that all this time I was (and still am) autistic. I interpret things differently. Once middle school hit and I went through mental tourture for 3 years (how festive!), my definition of friendship changed from what people my age would consider a friend. These assholes think a friend is someone who is nice to you and you talk a little or a lot. Maybe you might hang out, it's whatever. Not me. No. Not at all, I know for damn sure that is not a friend. \n\n**A friend is someone who genuinely cares about you and will be reminded of you by randims things and they call you on their own and you make plans together and you both emotionally support each other but can also have fun and maybe have a nice drink with them(apple juice obviously).**\n\nFor awhile after being out of high school I was still seeking approval from my peers.  Over and over again I have pleaded and begged for them to hang out with me and make plans and they are always too busy for me. Whatever. I started getting tired of this. And by tired I mean a fun mixture of anger and depression, the two lovers of course. Another thing is that at one point on my snap I had around 60 \"friends\". Then it went down to 20 after a mental breakdown and some cleaning. Once I left school the problem felt like it got worse. Feels like the universe wanted me to see the truth that these kids don't respect me. They never hung out with me in school, so why the hell would they even bother now that I'm not there anymore? They don't. \n\nFor a while I've been scared to redefine what a friend is to me but I've reached my boiling point. I'm so sick and tired of breaking down over these freaks. I say freaks because they all seem like such a joke to me and I never really liked being around them in the hallways because it felt like they were looking at me and judging me. That's just paranoia, but I digress. What I was trying to say is I deserve to be treated with an ounce of dignity and respect. My emotions matter. I matter. Those punks don't deserve me at all. I would defend and support them with every fiber of my being. The only thing they did for me was refer to me as a man(trans), and they use my name correctly, which I appreciate. But it's the bare minimum. I respect their gender and name without even thinking. \n\nI am allowed to set standards for my friends and I won't listen to anyone who says my standards are too high because you haven't lived my life. If my standards are too high, we ain't friends. It's as simple as that. Do these people text me on their own? Nope. Maybe they would respond to my story or whatever but never just sent me a meme or asked for supper or just wanted to have a conversation. I'm the one who always starts the conversation or makes plans, which 90% fall through.\n\nI'm trying to let go of school and my childhood and all the awful memories so that when I think of them that I don't start the emotions of that moment again. These kids are the past and I need to say goodbye to them. With every rejected plan and unopened chat and not attending to my emotional help, I have just lost feelings for them. I wanted so badly for them to be my friends. I'm just not fit for these teens and I need to just stop with them. I put my number on my story and then I deleted the app. If they love me they'll keep my number. If not, well... I don't give a shit. There's no point to continue letting them bog me down.\n\nThanks for reading this far I guess.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q0cr35/i_deleted_my_snapchat/", "title": "I deleted my Snapchat", "social_network": "reddit", "user": "yolkofficial", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1633244846, "permalink": "/r/DecidingToBeBetter/comments/q0cr35/i_deleted_my_snapchat/", "nsfw": false, "first_save": 1635436801.4349995, "replies_charged": false}