{"id": "t5_2tand_t3_2mmmx2", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I just realized this about myself and figured I would share.\n\nI used to be a heavy consumer of soft drinks and fast food, but interestingly enough, I only cut them out when they became absolutely readily available in my life. Let me explain.\n\nI used to eat a lot of fast food (high school days). When I moved into a college dorm, we had a Wendy's right in the building, so fast food was available any time I wanted it. I got to a point where I was going down for a 2am snack 3-4 times per week. Eventually I made a conscious decision to cut out 100% of it. Haven't had fast food since* (I'm 25 now, almost 6 years later).\n\nAs for sodas, I still loved them. I bought them regularly at the grocery store and drank 1-3 canned sodas per day. Then I got a job where there is a free all-you-can-drink soda fridge, and without thinking about it I could go through 5 Cokes in a day. This called for another conscious decision to cut it out. At first I limited myself to one per day, during lunch. Now they're almost 100% cut (I have maybe one per month).\n\nI don't know if this will particularly help anyone do the same since both of those situations are somewhat unique. But maybe telling yourself that these choices of food and drink are the \"easy choices\" but not the \"right choices\" is enough. It *will* take a conscious effort to get out of the habit!\n\n*For my purposes, \"fast food\" is just burger and fried chicken restaurants that typically have a drive thru, and a few others (like Arby's and Taco Bell). I've made a couple exceptions, but not regularly. In fact, I stopped eating at Subway at the beginning of this year.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/2mmmx2/my_experience_cutting_out_soft_drinks_and_fast/", "title": "My experience cutting out soft drinks and fast food", "social_network": "reddit", "user": "trevorsg", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1416280609, "permalink": "/r/DecidingToBeBetter/comments/2mmmx2/my_experience_cutting_out_soft_drinks_and_fast/", "nsfw": false, "first_save": 1635438254.8526871, "replies_charged": false}