{"id": "t5_2tand_t3_m80i1c", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "e234981c-b061-4d83-8134-70d441847f74"], "text": "It’s not just another copy-paste collection of advice we’ve all read a million times on the Internet. It’s personal. And despite the cliche title of this post — each of the following advice is based on my own experience, good or bad. I hope to inspire you to remember the basics and remind you of the importance of being in sync with yourself and with life. I believe we all can be better versions of ourselves and these are little steps that can be taken now.\n\n* **Write everything down.**\n\nThis is the basic principle of the world-famous [GTD](https://todoist.com/productivity-methods/getting-things-done) methodology. There is just no point in keeping everything in your head. Instead of spending energy on remembering your daily to-do list, use it to complete the tasks at hand. Take a sheet of paper, download a productivity app or buy a whiteboard — and write things down! They will do the memorising for you and you’ll focus on the things that matter.\n\n* **Plan your day ahead.**\n\nThis really helps to clearly see what needs to be done and what you should stay away from. I prefer writing to-do lists in the evening, straight after finishing my workday. This way I can clearly see which tasks are urgent or unfinished and which tasks can be postponed or maybe even neglected. Productivity is all about prioritising. And let’s face it, the only priority you have in the morning is to pee.\n\n* **Do important tasks first.**\n\nIt sounds simple, but in reality, we tend to procrastinate and postpone getting sh\\*t done. A simple way of doing so is to prioritise not only in your head but also visually. What I learnt doing is either highlighting my main tasks of the day with a marker or using a bigger font to make them stand out. I also promise myself a nice cup of coffee after finishing bigger assignments, so I usually tend to accomplish them ASAP. You can try this trick with any other treat of your choice and don’t give up if this doesn’t work straight away. Everybody has their bad days.\n\n* **Strive for single-tasking.**\n\nIf you are unfamiliar with this term, *single-tasking* means doing one task at a time with as little distraction and interruption as possible. Some people recommend starting by turning Telegram and Youtube notifications off or only checking your emails twice a day. I personally love putting my phone in Do Not Disturb Mode. This accidentally happened once and has been my favourite since. Simple, and yet very effective.\n\n* **Eliminate any ‘*****rubbish*****’ from your to-do list.**\n\nA lot of people confuse actions with ideas. Sending an important email, feeding your cat or swiping the floor are actions. While working on the [case study](https://casestudywritingservice.com) really isn’t. It’s an ambiguous idea with no specifications. Do you need to email a professor about your exam results or collect some data for your project? Do you need to review university literature or create a survey for peers? It is unclear what task to start with and it will be quite challenging to focus on either of them, without thinking of the rest. When writing a to-do list, write it wisely and be specific.\n\n* **Save documents** ***where*** **they truly belong.**\n\nAnother fundamental idea that so many of us continue to ignore. You don’t even need a special storage system to get you started. Just make sure there is a ‘Work’ folder on your desktop where you’ll be saving work-related documents and files. If there is a specific project or a meeting that you are preparing for, enclose all necessary materials there. This won’t only save your time when searching for something but will also reduce clutter and save up some space on your computer. Windows users probably don’t even care, but guys with Mac will sure notice the difference.\n\nAnother piece of advice is actually naming your documents. Chances that you’ll remember what *ejoijeioweowmjm.docx* means are actually pretty low. And as we learnt at the very beginning of this post, there is no point in memorising everything. This just prevents us from being productive.\n\n&#x200B;\n\nP.S. I had to make a few changes to the original post to make sure that backlinks aren't making it spamy. I've posted it on a different website earlier today but also felt like sharing here. Hope that my tips and tricks will help you in boosting your productivity and remember, you don't have to change overnight! Building progress day by day is amazing and you can do it! We all can.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m80i1c/easy_steps_to_boost_your_productivity/", "title": "Easy Steps to Boost Your Productivity", "social_network": "reddit", "user": "just-eatthatrice", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1616100962, "permalink": "/r/DecidingToBeBetter/comments/m80i1c/easy_steps_to_boost_your_productivity/", "nsfw": false, "first_save": 1635436282.4604483, "replies_charged": false}