{"id": "t5_2tand_t3_ny6wwz", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Hi, I was hoping to get some advice on how to change the lifestyle I've been living for the last couple of months. Nothing serious, it's just that I am not able to accomplish anything and I really want to change. \n\nEverything started last year when I graduated highschool. I was happy with my decision to pursue a career in mathematics and as the summer started (not from USA, so summer for me is from December to February) I had nothing to worry about. \n\nI had a wonderful summer, did nothing but hang out with friends, went a couple of weeks to the beach with them and came back with covid (with no symptoms what so ever) and was isolated for two weeks. I took advantage of that and prepared for the cae (English level exam). February was pretty much going out and playing football with friends. Things started to go wrong when I started university in April. I was a bit stressed because I had more classes than I should have and thought I was going to fail but it got resolved. \n\nAs all my friends and I started studying, we hung out a lot less so life became going to online classes and doing homework. And ever since I started I spend the days watching series and going to class.\n\nApril, may and June were the same, every hour I am not in class I am watching a TV show (in that time I watched himym, tbbt, suits, two and a half men) because i rarely go out. And now I just want to do that all day and can't motivate myself to do homework. Things got worse when my brother and father got the virus at the same time a friend's father got it but he is now in the hospital so I am really worried about my father (he's fine). My parents got into a fight and that worried me too. I started having respiratory problems due to anxiety because of everything I just wrote and the fact that I started having doubts about my career and I am now considering changing my major to physics.\n\nHow can I start wanting to do things? I want to feel motivated to do the homework I supposedly enjoy and working out and stuff? I picked up the habit to wake up at 7 am every day and to read 40 mins afterwards, but after that I just barely listen in class and spend the whole afternoon watching tv. I even lost the habit to shower so every 2/3 days I see myself in the mirror and notice that need to do it. \n\nI want to get rid of everything that distracts me from dedicating my days to studying math. I already uninstalled Instagram, Twitter, Netflix and prime video from my phone, had several nofap streaks. \n\nDuring highschool the situation was similar but I used to go out so much more and do more things (there was no pandemic) outside so i wasn't so noticeable\n\nAny tip to finally make university my main focus would help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ny6wwz/i_could_use_some_advice/", "title": "I could use some advice", "social_network": "reddit", "user": "avrmb", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1623504968, "permalink": "/r/DecidingToBeBetter/comments/ny6wwz/i_could_use_some_advice/", "nsfw": false, "first_save": 1635435164.6811655, "replies_charged": false}