{"id": "t5_2tand_t3_ggt8dp", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "Hello reddit I hope everything is fine for you and your loved ones in these times.\n\nI would like to ask you one question that I have had a hard time with lately, I have been going through a really hard depression even before the quarantine started and it's only getting worst but I believe there is always light at the end of the tunnel.\n\nSo I'm trying to get back but every single time I try to do something to help myself improve in someway it's so hard & stressful to get even near it, even if I used to do it easily the moment I put the label on it that I should do this will help me it changes to being really hard to even approach it I believe that's because the countless failures I have had with things that I should have done that weigh me down so heavily, and even when I'm able to start the it still feels so hard to do it which make it hard to concentrate on what I'm doing and when even the smallest inconvenience that show up will just complete destroy me and I stop and run away which then re-enforces the weigh of the failures and it will be even harder next time for me to start.\n\nI have tried to fix this by making for my self a heaven to run for and a hell to run away from  so I have motivation and some willpower to power through that pressure to do the tasks needed, and also I have used a reward system in the short term that I would gain if I did what I planned to, but I didn't work past the first 2 days because I think the long  exposure to depression had me numbed to rewards as I see my heaven more of a hope and a fantasy than a possibility (as I could make that happen and it would be good but I would have to suffer alot to make that happen and form my previous attempts I will just end up failing so the harder I work for it it will just end up as more suffering).\n\nand I really don't know how to get through this wall, is it a willpower problem? is it something else? maybe I just don't want to get better enough? but then what is the solution, I don't like how my last 4 years have been a downward spiral to hell and I don't won't it to continue but I don't seem to be able to stop it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ggt8dp/failure_and_willpower/", "title": "Failure and willpower", "social_network": "reddit", "user": "liihlep", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1589078189, "permalink": "/r/DecidingToBeBetter/comments/ggt8dp/failure_and_willpower/", "nsfw": false, "first_save": 1635437176.1228616, "replies_charged": false}