{"id": "t5_2tand_t3_p4acpi", "request": ["18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "My best friend goes into periods of no/little contact sometimes and I have been battling with taking it personally, with a quiet part of me knowing better. He didn't contact me on my Birthday yesterday and it hurt. I got stuck in a tunnel of sadness and frustration that I wanted to work my way out of. I've been learning a little more about the power of gratitude recently, so I made a page-long list of all the things I'm grateful for about him and our friendship. Honestly, I feel so much better, like I successfully shifted my focus toward the positive. The sadness and frustration is now just a a low and manageable rumble that isn't clouding my thoughts anymore.\n\nUPDATE: I told him how I felt about the Birthday situation and he apologized. I didn't mean for this post to come across as if I was suppressing the negative feelings and leaving it at that. I wanted to see the whole picture of our friendship when at first I was only seeing the negative parts. I still find my hurt to be valid, but I also did not want that pain to cloud my senses when I did communicate.\n\nAlso, I'd like to say I don't really see him as a \"shitty friend.\" Over the last 10 years he has been a very good friend to me and I see a whole lot more in this person than this mistake. I apologize for not mentioning that he has been struggling with depression and can tend to isolate because of it at times. I still struggle to remember what that is like since I've been there, so I'm trying to do this kind of work to help reach my genuine empathy for that.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p4acpi/i_got_past_negativity_toward_my_best_friend_with/", "title": "I got past negativity toward my best friend with a gratitude list.", "social_network": "reddit", "user": "Bink_Plinklinkly", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 300, "down_vote": 0, "creation": 1628955840, "permalink": "/r/DecidingToBeBetter/comments/p4acpi/i_got_past_negativity_toward_my_best_friend_with/", "nsfw": false, "first_save": 1635437109.0184681, "replies_charged": false}