{"id": "t5_2tand_t3_l3bdsk", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I have people in my home that I have to take care of and part of that involves me staying until at least 12. Most nights, especially during this pandemic, I have stayed up until at least 5, and during these stints, I really tap into my worst habits, and I’ve known this about myself for a while. The later I stay up, the more likely I am to do things that I will regret or feel crappy about in the morning. Whether that is feeding into my sexting habit, or going into a server and getting into a conversation where I say things I don’t mean, it often correlates with me staying up super late. Also, getting so little sleep is not doing any favors for my body, nor my mental state. \n\nTwo nights ago, I decided that I was going to treat myself well, just as a test. I would take care of what I had to do, then after a bit of leisure, I’d go to bed at one o’ clock. I did exactly that, and i woke up the next morning feeling so rejuvenated. Now, I just want to seek more nights like that. Where I get to sleep as quickly as I can, and I can wake up the next day not feeling like crap. Hopefully, in the process and I can shake down a portion of my bad habits through this small change in my routine, and maybe, it will even improve my mental state. Either way, I just want to treat myself better and really take care of myself, because for the last few years, I haven’t really been doing that and it’s been a weight on many of my relationships. There’s a ton of people in my life that I love, including myself, and I want to make sure that I can give them something good.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l3bdsk/moving_forward_i_will_be_going_to_bed_in_a_more/", "title": "Moving forward, I will be going to bed in a more timely manner...", "social_network": "reddit", "user": "landfliquids", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 21, "down_vote": 0, "creation": 1611405506, "permalink": "/r/DecidingToBeBetter/comments/l3bdsk/moving_forward_i_will_be_going_to_bed_in_a_more/", "nsfw": false, "first_save": 1635436513.2629082, "replies_charged": false}