{"id": "t5_2tand_t3_iy4dv4", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I posted on here around two to three months ago that I realized that at that point, I realized that I was a huge part of my problem and needed to pull my act together and stop blaming others for all of my problems. \n\nIn august I decided to go back and pursue that physics or engineering degree that I eschewed in favor of doing other programs because the classes seemed too difficult. Had a huge wake up call the first couple of weeks of the semester, and while my grades aren’t perfect, I feel like I am relearning how to learn, if that makes any sense. I am so passionate about this subject (electrical engineering) and finally feel like some sort of “switch” has gone off in my brain where I’ve gone from wanting to do the bare minimum for myself and my life and in my coursework to actively trying to better myself. \n\nThis past weekend I spent probably 30-40 hours studying differential equations for a test today which I honest to god feel like I actually did okay on. This after giving up on differential equations two years ago because it seemed too hard. I almost cried sitting there looking at differential equations, and seeing how it can be used to model circuits for electrical engineering. I haven’t been so interested in something since high school physics. \n\nMy depression has largely cleared up. I still have very bad anxiety and some intrusive thoughts, but I’m working to manage those too. I realize now the anxiety will always be with me, and it’s useless to try and fight it and make it go away. So now, I’m trying to accept it in my head while sitting with it until it passes. It is really hard, but at least I’m trying. \n\nTo get to the title of this post, I actually somehow managed to land an interview in a few days for a summer internship after taking the initiative to put my resume together and go to my uni’s engineering job fair a couple days ago. I will actually be interviewing for a position with a large semiconductor processing company. \n\nWhile it might not seem like much, I feel like I’m finally taking (baby) steps in the right direction. Perhaps the best part is, I realized while writing this that I hadn’t thought of my ex girlfriend who destroyed my mental health in probably three or four days. \n\nIt may seem ridiculous, but it’s not too late to take that step. I might not be making perfect grades, but I have found something I am willing to work 13-14 hours a day on. Nothing will stop me now I hope. I am at least extremely motivated. \n\nFor anyone who feels stuck, take an honest look at your life and ask what can change and if there are any steps you can take. If I can do it, you can too, I promise. For me, the first step was looking back and realizing that I used to love math and physics. Then, it was, well, I actually really like programming too. That turned into circuits and digital systems, and suddenly, I don’t feel as bad about myself as before. \n\nI don’t know what your process will look like, but I hope that it brings nothing but joy and success to your life. \n\nTLDR: two months ago I felt like a complete loser. In a few days I have an internship with a major company in a field that I love. If I take these steps, you can too, I promise :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iy4dv4/posted_on_here_two_or_three_months_ago_that_i_was/", "title": "Posted on here two or three months ago that I was going to try to be better. On Thursday I have my first internship interview.", "social_network": "reddit", "user": "cody_d_baker", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1600839505, "permalink": "/r/DecidingToBeBetter/comments/iy4dv4/posted_on_here_two_or_three_months_ago_that_i_was/", "nsfw": false, "first_save": 1635436521.5620008, "replies_charged": false}