{"id": "t5_2tand_t3_oyc3xf", "request": ["b69cf201-6737-4217-b486-9096135546b8", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "This is a bit long so please bare with me I’ve never posted on reddit before, but I want somewhere to share my little victory & someone said this might be a good place to get it off my chest. I’m extremely superstitious (to the point of being completely unable to function sometimes lol) & one of my superstitions is that if I tell too many people the good things in my life, I’ll lose the good things. Horrid. But for some reason my stupid little brain is telling me this is okay. I’m not verbally speaking it & I don’t know any of you, so it cancels out the superstition I guess. (TW: drugs, alcohol, suicidal thoughts)\n\nWhen COVID started & the lockdown happened, I was furloughed from my job. Wouldn’t have been a big deal, except I was moving to a different state in a few months, so being furloughed meant I lost my job. Luckily I had plenty saved up, so I was fine to not get a job immediately after moving to one of the COVID hotspots in the US at the time. The problem, however, is that I’d isolated myself for a literal year. Didn’t leave the house. I was (& still am) TERRIFIED of COVID. Almost everyone I know has had it. Only saw my fiancé & my roommates for a whole year. I’m introverted as hell & have terrible social anxiety as it is, so all that did was exasperate those issues. You can definitely say I became pretty agoraphobic. \n\nIt’s been a year and a half now. A year and a half of doing literally nothing bc I couldn’t leave my house. I couldn’t get a job bc I’ve been too scared to speak to people. I couldn’t make friends in my new town. Honestly, I can’t even drive because I’m terrified of driving (for non-COVID related reasons lol). I’ve been 100% dependent on my fiancé. I’ve slowly been working on it, leaving the house more, socializing with my fiancé & roommates’ friends. \n\nToday I signed up for a gym membership (honestly, not for physical reasons. For mental health reasons). Next week I start a class to become a certified recovery coach (I’m 3 years in recovery from alcohol and cocaine…. MAN did quarantine make that hard. I might not be able to make friends or get a job, but if there’s one thing I can do, it’s find a liquor store & a dealer). The following week I start college (again, for the third time. My first two times I was still an addict, so you can imagine how that ended). Next month I start a job as a recovery coach. I get to help people through their addictions the same way I helped myself through my own.\n\nI was ready to off myself this time last year. This is going to be a really long, really hard journey. I’m already insanely anxious about everything I’m doing. But for today…. I feel like I’m finally getting my life back.\n\nEdit to add: \nTL/DR: COVID made me agoraphobic. Have been unemployed & holed up in my house for at least a year. I decided enough is enough and joined a gym, am becoming a recovery coach, & going back to college. I am happy to be alive.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oyc3xf/finally_getting_my_life_together/", "title": "Finally Getting My Life Together", "social_network": "reddit", "user": "PoemTraditional289", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 28, "down_vote": 0, "creation": 1628146543, "permalink": "/r/DecidingToBeBetter/comments/oyc3xf/finally_getting_my_life_together/", "nsfw": false, "first_save": 1635436453.5717392, "replies_charged": false}