{"id": "t5_2tand_t3_ot6gqi", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I’ve fucked up my life and my husband’s life by being selfish and avoiding the truth to ‘save his feelings’.\n\nAfter 11 years of feeling unappreciated and taken for granted, I was resentful. But I didn’t address it talk about why, I indulged it. \n\nI ended up breaking his heart so I could run off and feel appreciated by someone else. I didn’t tell him that was why though. I avoided telling him much at all because I ‘didn’t want to hurt him’. I am a coward.\n\nBut I couldn’t stick to it because actually I did love him. So I tried stayed attached to him and ended up messing his feelings around while I tried to understand my own. \n\nI built a huge and messy web of lies because the truth seemed impossible and so dangerous. I hid so much, but found private ways to try and process it, like talking to my friends about half truths and fleeting feelings. \n\nAll he wanted was my commitment. He was willing to forgive me for all of it if I could just show him I was serious about dedicating everything to him again. I couldn’t do that. \n\nAnd as irony goes, I am now in place where I feel like I can, where I’ve processed so much of the darkness and realised what is actually important. Yet he’s accessed my phone and read everything I’ve shared and confessed to with my friends. The half truths, the really painful truths, more lies. \n\nHe knows the darkness in me that I wanted to hide from everyone. He knows my deepest secrets, all my doubts, all the shameful things I’ve thought and felt towards him throughout this time. I can’t imagine the pain he must be feeling right now.\n\nI throw myself into other people’s problems as a way of avoiding my own. I talk up such a good game about being a fair and understanding person. I am full of shit. My imposter has been revealed to the person I was trying most to hide it from and I am facing my retribution. \n\nI deserve every moment of this pain.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ot6gqi/i_thought_i_was_good_but_im_so_selfish_and_i_have/", "title": "I thought I was good but I’m so selfish and I have to change", "social_network": "reddit", "user": "allthecolouredgrass", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1627464487, "permalink": "/r/DecidingToBeBetter/comments/ot6gqi/i_thought_i_was_good_but_im_so_selfish_and_i_have/", "nsfw": false, "first_save": 1635436979.0413544, "replies_charged": false}