{"id": "t5_2tand_t3_pnlwwm", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "This time last year, I was in one of the best positions of my life - until I royally fucked it all up. I had it all. A nice car, a beautiful house by the beach, an amazing dog, relationship, career opportunities, a good body. But the problem was, I didn't earn everything I had. It was mostly given to me by my father, who has incredible wealth. I've definitely had a leg up in life. But that has come with its own set of problems. Earlier this year, I lost almost everything I loved because of my own shitty life choices. \n\nI started using drugs heavily (predominantly psychedelics) which caused me to go into a drug induced psychosis. I considered myself a psychonaut, but was too naive about the potential for harm. I was in the psych ward for a month. As a result, my father took away everything he had previously given me. The house, car, and regular income I had been so accustomed to. The deterioration of my relationship was both a cause and consequence of my increased drug usage. \n\nNow here is where i'm really struggling. I've never had to work /really/ hard for the things I wanted in life. I've always been provided for, and lived a pretty lavish lifestyle for someone my age (M/25). But i'm now in a situation that most people probably go through early on in life. The realisation that if I don't start running as fast as I can, I may never get anywhere in life. My dad has been generous enough to give me a second chance in the form of a career opportunity. He says if I'm willing to put in the work to take over an important role in his business, I can have everything I had and more. And that it is time I grow up. But I am struggling with discipline here. I'm struggling with the concept of suffering now so that I can have a better future later. I used to run a business in a creative industry, and did what I was passionate about. Working hard when I needed to wasnt difficult to do. I chose the hours I worked, the projects I took on, and where I was able to work from. Whenever I had no projects on, I didn't have to stress as I was given a weekly allowance that covered all living expenses. I was talented at what I did.  But like with everything else, I eventually get bored and moved on to something new. I struggle to do things I find boring. Yes, I have ADHD and am on medication for it. But it dosen't help this aspect of it. \n\nThe work that my dad is offering me is incredibly boring in comparison, and requires me to be in the office 9-5, five days a week. But it offers a stable income and massive potential for growth. I'm finding it really difficult to stay motivated and disciplined. To adjust to 'normal' life, and I don't look forward to anything anymore. All I want is to have my old life back, particularly my home, but I am struggling now that I have to work 10x harder than I did previously, while being 10x worse off than I was. I moved countries for this job, and don't have many friends around me anymore. I've completely let go of my fitness and lost all progress I had built up in the previous years. \n\nI know the smart thing to do is to earn back everything I had, but I just find it so hard to commit to this job that I'm not passionate about - especially because there is no instant gratification in any of the things I do. No matter what, it's going to take time to rebuild my life. I'm such a changed person from my experience with psychosis. I've lost nearly all of my self-esteem, and am experiecing a loss in identitiy. I'm carrying around a lot of shame from it. I also never realised how much of my self worth was wrapped up in the things I had and the creative work I did. \n\nI know how much I sound like a spoiled brat, and I imagine it'd be hard to feel sympathy for someone who has had it all (materially speaking) - but how can adjust to this dramatic shift in lifestyle? How do I stop viewing work in such a negative light? I want to have a good work ethic - I just don't know how to develop one. I don't know how to stop comparing my life now to what it used to be. I can't stop thinking about everything I've lost. I feel like such a massive failure. And it feels almost easier to just give up on myself than to do the work that is required to grow from this experience and become a more well-rounded individual. \n\nI want to be the kind of person who makes the most of the opportunties given to him, and is able to let go of the past and re-adjust to a completely new way of living. I want to do well in my dads company, I just don't believe in my ability to do so. I want to be better so bad, I just don't know how to get there. It often feels as though it would have been easier if I never experienced the priivellege I had in the first place. \n\nI'm the king of self-sabotage, and I don't want to ruin yet another opportunity life has offered me. How can get my shit together and re-build my life from scratch after hitting rock-bottom? How do I take charge of how this story goes, so that it dosen't become the defining point of my life. And instead becomes just another bump on the road that helped me grow into a better person. \n\nHonest advice would be greatly appreciated. Thanks for your time! \n\nTLDR; Rich kid who lost everything to drugs, struggling to adjust to 'normal' life, and lacking the will to rebuild from scratch. How do I accept my new reality?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pnlwwm/what_advice_can_you_give_to_a_spoiled_brat_who/", "title": "What advice can you give to a spoiled brat who has been smacked in the face by reality?", "social_network": "reddit", "user": "throeaweighhh", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 62, "down_vote": 0, "creation": 1631559509, "permalink": "/r/DecidingToBeBetter/comments/pnlwwm/what_advice_can_you_give_to_a_spoiled_brat_who/", "nsfw": false, "first_save": 1635435342.132236, "replies_charged": false}