{"id": "t5_2tand_t3_n0ea5g", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "We all need meditation to get us through the rough times. You sit in quiet place and you simultaneously focus on your breath and broaden your awareness. Most of the stress in life comes from narrow focus. Yes, things may seem bad *now* but they were not *always* bad and they will not be bad *forever*.When it comes to meditation you often hear how meditation helps millions of people each day (or the end-result). You can easily find guides that instruct you to practice, practice, practice (the mid-term goals). And you can even find a lot of details about how to start - *one mindful breath* a day or *one minute of following the sensation in your mouth when you breathe* (the short-term goals). In this article, I will deep dive into the *how* aspect which will allow you to keep exploring and inventing your meditation practice. I will share five very specific meditation techniques that you can use to get from your short-term goals to the end-benefits of mindfulness.\n\n## Time to read\n\nTime to read: **10 minutes** (based on 150 works per minute).\n\n## Introduction\n\nTranscendental Meditation (TM) seems specific but I never understood it. It seems that you need to be *initiated*, while I am a firm believer in do-it-yourself approaches. But if we exclude TM for a second, it always seemed to me that there are a million different ways to meditate. Every author who writes about meditation has their own way of doing it and teaching it.I am probably far behind on reading meditation books than most of the *gurus* our there. But nevertheless, I wanted to share with you some of my own practices. I usually do most of them in a week, depending on what I need.\n\n## Problem\n\nThe problem that I want to solve with this article is the idea that *you* need to *follow* somebody else's practice. No! The word \"meditation\" comes from the Latin verb meaning \"to think, contemplate, devise, ponder\" (source: Wikipedia). And, as you probably know, there is no blueprint for *thinking*. To paraphrase Haruki Murakami's quote:\n\n>**If you** meditate like **everyone else is meditating**, **you can** only think what **everyone else** is thinking\n\nI want to show the techniques that I am using to meditate, but also to encourage you to experiment and find what works for you. After all, no two minds are alike.\n\n## When do you meditate?\n\nAgain, this is very personal. I meditate in the morning. As soon as I wake up, I do a breath exercise (2 minutes), tracking it on my watch. I can tell pretty much what mood I am in just by my heart rate after I wake up. Then, I do a quick gratitude journal exercise: three things I am grateful for and one challenge ahead of me for the day. After that, I read several pages (2-10) from a philosophy book, to put myself into contemplative mood.Finally, I set twenty minutes (using my watch) for meditation. I have a notification as half time (to swap my legs in the sorry resemblance of a lotus pose that I meditate in). And another notification at the end. This way I don't need to check my watch every 47 seconds (which was my biggest obstacle when I started to meditate).\n\n## How do you start your meditation?\n\nI start my meditation with a list of affirmations. This is important part of my practice, because it sets my conscious mind as the *master*. If only for a while ... I affirm to myself things like I am healthy (even if I am sick). I set my priorities (self > family > career > fun). Then, I remind myself about the things I am grateful. Finally, I remind myself what my goals are.\n\n## What are your meditation practices?\n\nOnce again, my meditation practices are my own. So, please adapt them to your own needs, values, and understanding.\n\n### 1. Zero-inbox\n\nI just let my mind wander wherever it needs to wander. I let my subconscious pick the topics and I let my conscious mind work on on it. After some time passes (I am not usually able to solve the problem), I let the thought go (deliberately). And then, I wait for the next topic to come.This is particularly useful when I feel stuck (in any type of situation). I do this over and over again, every morning, trying to get to a *zero-inbox* mind (as in there are no *emails* between the subconscious and the conscious minds).\n\n### 2. The void\n\nI concentrate into an imaginary *point* in space (with my eyes closes) and I keep my concentration on it. I imagine a glass sphere around it where all *thoughts* bounce off and leave. With practice, I have been able to keep my concentration for minutes (four to five). If it breaks and I *catch* myself thinking, I go back to the void.This is useful when I feel overwhelmed. When I have a particularly intrusive problem to solve, which keeps popping up in any type of meditation that I try, I go to the void. If this also does not help, I try to go out for a walk and get in the void while I am walking. If this fails too, I do a *zero-inbox* on the next day to try to make my two minds talk to each other.\n\n### 3. Detachment\n\nI imagine that I am sitting (standing, lying, etc.) next to a river. It flows gently from left to right (or the other way around). As I watch the river and get into a calm state, other thoughts start emerging. I get every thought, turn it into a poster, and throw it into the river. I watch the poster dissolve in the water and float away. Then, I do the same with the next thought. If I am in a good mood, I try to make funny posters (e.g., I am screaming and there is a huge sign \"DID I LEAVE THE OVER ON\").This meditation is useful to learn detachment. It helps you realize that your thoughts are just thoughts (not reality). And it helps you practice detaching from these thoughts. I do this meditation at least several times a month, ideally, every week.\n\n### 4. Breath monitoring\n\nThis is probably the most basic technique, which you find in almost every meditation book. You just monitor your breath and the sensation of the air passing through your mouth. I started to truly appreciate this practice when I started doing yoga. One of the concepts in yoga is to picture your breath as an anemone - you expand when you inhale (literally of course, but also metaphorically) and you shrink when you exhale. When a thought squeezes in, I acknowledge it and I let it go, getting back to my breath.I do breath monitoring almost every day. It helps calm me down, it helps me relax. It was one of the main tools that I used to cope with the pandemic, the lock-downs, the stress, and the uncertainly, which we need to face in 2020 and 2021.\n\n### 5. Awareness\n\nOnce again, a very popular technique. Instead of retracting into the void, or keeping my focus on my breath, I expand my awareness around me. I notice the birds singing out the windows. I listen to my spouse and my kid's breaths. There is a car speeding in the distance or a river flowing. There are these noises which each home makes (i.e., the refrigerator, the floor). I listen to the neighbors waking up.I am a very visual person and I normally over-index on my vision throughout the day. The awareness meditation makes me appreciate my other senses (my eyes are closed). And it rally helps me expand my world view. I might be facing big obstacles and challenges, but somewhere out there, there are other people whose challenges I cannot even comprehend.\n\n## How do you finish the meditation?\n\nWhen my watch notifies me that twenty minutes are over, I do a *namaste* \\- a traditional Indian greeting of respect. I do not remember how I started, but I use this to *pat myself on the back*. After all, meditation is hard work and you deserve a praise at the end.\n\n## Summary\n\nMeditation is a deeply personal. You need to find your own way to do it and you need to find what works best for you in any (or most) given situation. In this article, I only listed a few of the techniques that work for me.\n\nTin Mayer\n\nAuthor", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n0ea5g/five_meditation_practices_for_every_week/", "title": "Five Meditation Practices for Every Week", "social_network": "reddit", "user": "tinmmayer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1619614868, "permalink": "/r/DecidingToBeBetter/comments/n0ea5g/five_meditation_practices_for_every_week/", "nsfw": false, "first_save": 1635437266.2363412, "replies_charged": false}