{"id": "t5_2tand_t3_o99xxo", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "I feel like my whole life has been a constant battle with myself.\n\nOne side of me is the nice side, the cool side, the side that gets along great with people, the side that makes rational decisions. The other side is the monster, the side that wants to scream, punch, kick, and sometimes curse, and refuses to make rational decisions. I have realized that I cannot become too carried away in myself, because the monster inside will control me if I do.\n\nNormally the positive side of me shows. But when I'm around certain environments or people and something goes wrong, or if I let my guard down too soon, the monster will conquer me and take control.\n\nMy middle school years sucked. I was annoying as hell, chasing girls who didn't like me back, and was blocked on Instagram left and right. I barely had any good friends.The monster was controlling me. When I got to high school I realized what I had done and thus was committed to learning from my mistakes. I even had my first relatively successful crush on a girl at the time. I thought I had killed the monster. But I let my guard down too soon, because I then had a crush on another girl who blocked me on Instagram. Since then I had gone on a second self-improvement spree involving learning from my mistakes.\n\nI thought I had killed the monster. I thought I had killed the thing that was causing me to have monstrously excessive crushes on girls. But about a year later I let my guard down too soon. I had a crush on a girl, became unstable over her, and then had another crush on a girl. It was bad. I was breaking things constantly, pushing people away who disagreed with my crush on her, and then exploded when she blocked me on Snapchat. The monster had taken full control of me.\n\nIt has been over a year since, and don't get me wrong, I have come a long way since. I learned how to drive and got a license, got a job, and started committing to improving my social skills and friendships in my classes. But I'm still wary of the monster. Every once in a while I become angry or frustrated over something, and I'm wary that that might awake the monster. It sucks that I even have a monster to begin with, but I don't think I can defeat it all together. So, I must keep my guard up. I will continue to fight the monster, and I will continue to fight it till the day I die. I don't even know if I can achieve complete emotional stability, or at least achieve that for an extended period of time. The monster is there, and it could come at any time, so I must always be wary of whenever the monster chooses to arise.\n\nThis is making me wonder if I deserve to have friends in the first place, or even a girlfriend. Because if the monster chooses to show itself one time, then it could show itself anytime - and sometimes in the wrong times at the wrong places. I don't want the monster to push away the people who I'm close with, so I must keep it at bay at all times.\n\nYou might suggest therapy, which I agree with. I already have a therapist, but we don't meet frequently enough since I only meet him one hour a week. Not enough to help me.\n\nI wish I could live freely and not worry about a monster. But, if I relax too much, the monster is always there, so I'm always on the watch.\n\nAnyone else feel like this? Anyone else feel like there's always some monster inside of them that they have to fight off? I really hope I'm not alone.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o99xxo/life_feels_like_a_constant_battle_with_myself/", "title": "Life feels like a constant battle with myself", "social_network": "reddit", "user": "CEO_Of_Rejection_99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1624842955, "permalink": "/r/DecidingToBeBetter/comments/o99xxo/life_feels_like_a_constant_battle_with_myself/", "nsfw": false, "first_save": 1635438058.0025105, "replies_charged": false}