{"id": "t5_2tand_t3_ntx75q", "request": ["eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "So I don't want to make this too long but I find myself at the end of my 20s not knowing what to do next. I'm 29 years old, to be 30 in 3 months. For the past 8 years since I graduated college, I have pretty much wasted that time. I first got into self-help/self-improvement when I was 22 or 23 and I started reading books to help me optimize my life. At this point, I've probably read about 300+ or so books on various topics all helping me optimize my productivity and progress. Unfortunately, that hasn't really helped me.\n\nMy 20s have been marked by extreme financial difficulty, I stayed in a job where I was getting underpaid for about 2 years, making around 40k/year. At that time, I was intending to save up money to move out of my mom's house and I thought I would be able to do it when I was 25, in 2017. Unfortunately, I ended up getting laid off and tried to go full-tilt with a company I started part time. That venture unfortunately failed and left me in severe debt. I was in dire financial straits all of 2018. I then got hired at a place beginning of 2019, making 55k/year. \n\nI planned on moving out that year but again, I had so much debt so I intended to pay it down and move out in 2020. 2020 came and so did COVID. My mom got furloughed and I stepped up to help with the mortgage on the house. In June of that year, I got laid off (again). I spent a few months learning some skills to make me dangerous at my next job. I then just got hired in April, making 65k/year. I'm optimistic that this place will help me get on a firm financial foundation - but my 20s are over. \n\nThroughout all this time, I virtually didn't do much of what the 20s are about. I never dated/fell in love (partially because I lived at home), I never lived in a different city, I never really traveled, I spent most of it in deep financial scarcity, which lead to lifestyle scarcity. I also had crippling social anxiety and self-doubt which made everything worse. In contrast, I see most of my friends are married or engaged, they have homes, and they had 20something experiences. Sure, I might be debt free in like 5 years or so if I really buckle down but I feel so far behind my friends. \n\nSo I have all this stuff I need to do (date, move out, travel, learn skills, etc.) and limited time to do it in. \n\nI want to be better than this but I don't know where I start. I feel like I'm trapped in a jungle and I'm just driving myself mad trying to find the exit. \n\nDoes anyone have any advice?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ntx75q/i_feel_like_ive_missed_out_on_my_youth_and_i_dont/", "title": "I feel like I've missed out on my youth and I don't know what to do next (29M)", "social_network": "reddit", "user": "mjsprezza", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 29, "down_vote": 0, "creation": 1623017919, "permalink": "/r/DecidingToBeBetter/comments/ntx75q/i_feel_like_ive_missed_out_on_my_youth_and_i_dont/", "nsfw": false, "first_save": 1635437495.628594, "replies_charged": false}