{"id": "t5_2tand_t3_oqag6z", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "1. Planning my diet & fasting schedule - To get enough of all the nutrients, vitamins & electrolytes - supplements if needed. High fibre content. Need to plan meals according to the fasting schedule. Whole foods. Home cooked. High quality balanced diet. Teach yourself nutrition if you have to, it's worth it. Also, TMI : Keep track of how often you poop, it'll help initially to figure out what works for you. \n2. Regular exercise - At least 5 days a week, though mostly 6. Balance of Cardio + Weightlifting. Giving my best, everyday. Also, remember to stretch regularly. \n3. Regular sleep cycle - Sleeping at the same time & waking up at the same time every day.  Usually sleeping between 10pm - 11pm & waking up between 6am - 7am every day. \n4. Positive self concept. No negative self talk - Remember, your inner conviction, dominant belief ALWAYS manifests. Keep it positive. Build positive beliefs. \n6. Personal hygiene - Keep your house & surroundings clean. Shower at least once a day & remember - cleanliness is next to Godliness. \n7. Practice gratitude regularly. Make it a habit. A grateful heart is a magnet for miracles. \n8. Every day, set a time aside just to check in with yourself on the road to your dreams. Ask yourself, are you on the way? If an opportunity was offered to you today, would you be ready enough to take it? If the answer is no, then decide on what specifics you need to improve &  work on 'em till the answer is yes. If the answer is yes, then keep doing what you're doing, and KNOW that anytime now, a golden opportunity is gonna come your way. Be smart enough to work for it, alert enough to identify it & wise enough to take it. \n9. Be well hydrated always. 8 to 10 glasses of water, daily. Drink a glass of water first thing in the morning once you're awake and last thing at night as you're about to sleep. \n10. Oral hygiene routine - brushing, flossing, mouthwash - whatever works well for you : twice a day. \n11. Read every single day. Grow your mind & apply the teachings to your life. That's a phenomenal way to grow. Reading someone's entire life's philosophy & lessons in a week/month's time and actually applying it to your life is literally life changing and one of the most underrated things you can do for yourself. \n12. Get off social media. Comparison is not only pointless but also toxic to your mental health. Get rid of any kind of negativity now, life is only as good as the quality of your thoughts, work on improving them. \n13. Posture is very important. Back straight, always. It'll be difficult initially but keep at it & soon enough it'll be natural. \n14. Be kind. Always. Everyone you see is going through a battle you know nothing of. Kindness is the key. We're all better when we're compassionate. If anything, it'll make you feel better about yourself. Be confident in who you are. \n15. Have a productive morning routine that includes meditation. And a night routine to wind down peacefully before you sleep. \n16. Journal regularly. It's a healthy outlet for your emotions and a great tool for self reflection. \n17. No news. Mind your own business. Not everything needs to have your opinion. Don't let anything that doesn't bother you, become a bother to you. \n18. Be mindful & present in the moment, specially when you eat. \n19. Water (metaphorically speaking, of course) your hobbies, like they're plants. Give them time & attention knowing full well that they'll grow into skills (if that's what you're going for, otherwise it's just time well spent)\n20. Learn to stop and take a moment to just look up at the sky/stars & realize that we live on a planet floating in an endless universe sustained by a burning ball of fire balanced out by a rock who's reflected light is shone on every single living being in history. To be alive is magnificent and the universe is abudant with opportunities and you have the potential for greatness. Whatever you're worrying about is insignificant in the grand scheme of things and have faith that it'll all be taken care of.\n20. Remember that you are infinitely loved and infinitely worthy. It's up to you to manifest that glory within you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oqag6z/i_turn_21_in_exactly_25_months_so_i_made_a_list/", "title": "I turn 21 in exactly 2.5 months so I made a list to transform my life! Just sharing in case it helps anyone! This is strictly made by keeping me in mind so if you disagree then just ignore! Everyone is different. Here are the 20 pointers :", "social_network": "reddit", "user": "1stJune2021", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1627071057, "permalink": "/r/DecidingToBeBetter/comments/oqag6z/i_turn_21_in_exactly_25_months_so_i_made_a_list/", "nsfw": false, "first_save": 1635435247.1571362, "replies_charged": false}