{"id": "t5_2tand_t3_owccpi", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "This is in no way shape or form an attempt to pretend that pain and suffering doesn’t exist. Neither am I saying that being strong in times of darkness is an easy thing to do, specially given the reality of all the suffering in the world. My point though, is that being drawn down the hole that is self pity, constant crying and blaming the world just makes things worse. \n\nIn my opinion we live way too self centered lives, our minds always create the illusion that whatever hole we're in right now probably is the deepest one out there; we don't really think that way, but we most certainly often act out that belief. The problem with that is that we never realize that there is always a deeper level of suffering waiting just under the one we're currently on. So instead of making sure we don't fall into that deeper hole, we fall into despair instead; feeling sorry for our situation, blaming others for their wrongdoings and even the world for it's fundamental flaws. But that is always just bound to make things worse, because it takes you away from actually trying to make things better. And if you think you can do both at the same time, yes you can, but you're then just not putting as good as an effort into actually making things better. This thus makes the situation worse by extending your suffering, and also even by potentially creating new ways for you to suffer.\n\nAs I said before, I understand that people live difficult lives, which is a fundamental part of being human. And I do understand that some people live worse lives than others. But self pity, crying and blaming the world, just makes things worse, no matter your situation. So why don't we all decide to bear our own burden of suffering with our heads held up high? Why don't we all decide to strive after acting out the best in ourselves, despite all the flaws of the world, and despite all the darkness in other people's hearts? Why don't we instead turn our attention to our own selves and our own flaws? Not so that we can be reminded of our own insufficiencies and fall deeper into despair, but with the purpose of honestly asking ourselves what it is that we can do to make things better. In my opinion, there is no better way for each of us to light our own candle amidst the inevitable darkness that is existence. A wise man once told me that a light in utter darkness, no matter how small, is the best way foward.\n\nSo, to all of you currently in a dark place, please do not give in to despair. Stand up with me and light your own candle instead. Let us light up the world together.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/owccpi/self_pity_constant_crying_and_blaming_the_world/", "title": "Self pity, constant crying and blaming the world just makes everything worse.", "social_network": "reddit", "user": "Araknhak", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 395, "down_vote": 0, "creation": 1627902842, "permalink": "/r/DecidingToBeBetter/comments/owccpi/self_pity_constant_crying_and_blaming_the_world/", "nsfw": false, "first_save": 1635436271.5081835, "replies_charged": false}