{"id": "t5_2tand_t3_jzwhqb", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "A couple of years ago a coworker convinced me to try fasting. I’ve never done a fast before and it didn’t make any sense to me that not eating would do any good, but I was in an exploratory state of mind and this coworker left a powerful impression on me so I thought I’d try it.\n\nI decided to do a 48-hour fast to start with. I packed a bit of food for afterwards, a meditation cushion and a nice fuzzy blanket, drove to a tiny village not far from here and checked into a small hotel. It was the middle of winter, everything was covered with soft snow and the quiet was deafening.\n\nTo keep me entertained, I brought a copy of The Sedona Method, a book I’ve been meaning to read for a while but felt like I needed some space away from work and family to actually get into.\n\nAbout an hour after I got to the hotel and set up my nest I felt the first pangs of hunger. “This is going to be interesting,” I thought. The book presented a method that promised to help me release my emotions. The idea seemed absurd. I didn’t know there was anything to release about emotions – I just felt them. What was this “release” business about? Nevertheless, I decided to give it a try.\n\nSo what was I feeling? I was hungry, that was obvious. But under the hunger, there was something else. Fear. It was hard to notice at first, but the hunger was mixed with an incredible amount of fear of being even more hungry. Looking out the window at the beautiful white vista I suddenly understood.\n\nYou see, my grandparents lived through the Siege of Leningrad in 1941-1944. It’s estimated that 1.5 million people died from hunger during that time. Throughout my childhood I heard repeated stories of extreme cold combined with extreme hunger (they’d boil shoes to get a bit of nutrients out of the leather). This stuck way deeper than I could have imagined, and even though they have both died quite a few years ago, I apparently still carried the scars.\n\nWith the snow outside and the hunger inside the images of that war came rushing in. I found myself howling, crying, shaking in agony. It seemed like it would never end. But it did. It took about 20 minutes for my body to process enough of that trauma to return to the book – and the method.\n\n“Could you let the fear go?” the book asked.\n\n– Yes.\n– Would you?\n– Yes.\n– When?\n– Now!\n\nI took a deep breath in. My breathing slowed down, the knot in my belly loosened and I felt some tingling in my feet. I looked around inside my mind. The fear was gone, but there was something else. Deep grief. Grief for my grandparents and what they had to live through, for all the people who suffered and died in Leningrad and most of all for myself, the child that I was, listening to those stories, the emotions I denied myself, the loneliness I felt so many times in my life even when I was surrounded by people.\n\n– Could you let the grief go?\n– Yes.\n– Would you?\n– Yes.\n– When?\n– Now.\n\nI didn’t feel that hungry anymore. I could feel the emptiness in my stomach but without the fear and the grief, it didn’t have as much power over me. My mind was blown. If it was possible to release hunger, a profoundly physical experience, what else was possible?\n\nI kept releasing emotions as they came up using the same technique throughout the whole 48 hours. I drank plenty of water and slept a lot, but otherwise felt clear and deeply connected to my core. After coming back from my little retreat I started practicing The Sedona Method multiple times a day, with every negative emotion that came up. A few months later I decided it would be easier for me if I built an app to help me with the process.\n\nThe app has evolved quite a bit since then and so has my understanding of emotions and how to work with them well. But the basic truth still blows my mind to this day – we don’t just feel emotions, we hold on to them. And if we allow ourselves to feel them, and then let them go – they do.\n\n(PS: If you like this, follow me on Twitter @finereli - I'm building the app in public and write about emotions and productivity)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jzwhqb/how_learning_to_let_go_of_my_emotions_changed_my/", "title": "How learning to let go of my emotions changed my life", "social_network": "reddit", "user": "zoozla", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 18, "down_vote": 0, "creation": 1606185742, "permalink": "/r/DecidingToBeBetter/comments/jzwhqb/how_learning_to_let_go_of_my_emotions_changed_my/", "nsfw": false, "first_save": 1635438254.4349263, "replies_charged": false}