{"id": "t5_2tand_t3_ghvv1s", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "Attention! I went a *little* overboard with this post. Use the table of contents to get what you need!\n#Contents:\n\n1. The biggest benefit of tracking time\n2. My video story about time tracking\n3. A list of time tracking benefits and use cases\n4. Two methods of time tracking explained\n5. A quick starting guide for you\n6. What I learned from time tracking\n\nFeel free to skip around!\n\n## 1. The biggest benefit of tracking time:\nSince the holidays are cancelled, I decided to be as productive as possible and track my time. I thought it would be a little tedious (and it was), BUT it has benefits way beyond what I was expecting. The most important:\n&nbsp;\n\n * MINDFULNESS\n&nbsp;\n\nI was so much more mindful of what I’m doing. If you’re focusing on a task, you are no longer thinking about focusing, you are thinking about the task. That’s the main reason why distractions can come in. We are unprepared. Tracking makes you mindful of the passage of time and what you’re doing and just for that alone, it helped me immensely. \n\n## 2. My video story about time tracking\nI made a video about time tracking where I show all my entries and talk a little bit more about why I found it so useful. The info there and here is a little different, so if you're curious, it might be worth a look.\n&nbsp;\n\n * https://youtu.be/CtyJR2e1Fco\n\nThanks for supporting :).\n\n## 3. A list of time tracking benefits and use cases\nIf you would like to read, let’s start with the other benefits of time tracking (TT) and what you can do with it. Time tracking helps you get immersed in the moment. 100%, if you leave your tracker or your note with what you’re doing and  since when around you - you will feel like your boss is in the room and his coffee cup is on your desk. Fire. But here’s what else it can do:\n&nbsp;\n\n* Plan more accurately, as in:\n  * Planning your day based on how long you know tasks take you\n  * Improving your To-Do Lists (more do-able)\n  * Doing accurate weekly planning\n\n* Plan your work vs. rest time - See how many hours you are working and resting so that\n  * You make sure you don’t burn out\n  * You make sure you put in the work\n\n* Plan your batching - Find synergies between tasks \n  * Group tasks that work well together\n  * Postpone tasks that don’t\n\n* Manage your productivity \n  * Define the priority of your goals\n  * Ensure you spend most of your time completing high-value tasks.\n  * From your time tracking statistics you can see.\n      * How long are the most important tasks taking (High Value / All Time) % of your day\n      * How long are the least important tasks taking (Low Value / All Time) % of your day\n      * Bottlenecks (blocking other work? )\n      * Hard to plan downtime e.g. trips, phone-calls etc.\n\n* Manage your distractions - you can use your statistics to identify distractions such as: \n  * Interruptions\n  * Time spent dealing with technical issues and setup \n  * Procrastination\n  * Unplanned tasks\n     * Work related\n     * Non-work related (How often do you give in?)\n\nIf you are sold - awesome! Welcome! Let’s continue with the methods.\n\n## 4. Two methods of time tracking explained\nFor this challenge, I tested two different methods - tracking time on paper, and tracking time with an app. If this is your first try with time tracking, I recommend you start with whatever causes the least friction for you. It has to be something that you can do easily, otherwise you will not stick to it. For me, it was paper.\n&nbsp;\n\n\n* The benefit of the paper method is the agility with which you can get set up and start. \n   * (+) It gives you the benefit of mindfulness, because you have to enter any distraction that comes up on the paper. Nobody wants to write “Checking my farmville” five times. \nYou can easily see when you should take a break or get back to work, to make sure you are getting both sufficient work and rest times. \n\n   * (-) However, it is more challenging to analyze your statistics. If you are not meticulous about perfect handwriting and notebook creation it might get increasingly hard to go through your notes. Make sure you structure things very well from the beginning.\n\n* Statistics are the strong point of software. It takes a little longer to set up the app that you are going to use for time tracking, but it is easier to analyze your data when it is digitized. **I used an app called Toggl for this**\n\n   * (+) You have the benefit of mindfulness, supplemented with alerts and notifications to help you stay on track.\n\n   * (+) You can analyze your data in many different ways and get some automatic calculations. \n\nWhich method is better? It depends on the benefits you want to get and what you are actually going to use. You can try both and see what you prefer. Or you can try a mix of both like writing things down on paper and entering them in your software at a given time after your work is done.\n\n## 5. A quick starting guide for you\nIf you have your materials ready, it’s time to set up. We will talk about - What will you track, how will you remember, how you will do it, in what detail, and how will you analyze your data.\n\n* Consider what exactly you will want to track - I tracked my whole days and I think that is a very useful beginning.\n  * You may want to optimize your rest time as well\n      * Make sure you have enough time for certain hobbies\n      * Or make sure you have enough time to take care of yourself\n      * Ultimately dedicate your time to things you love most\n&nbsp;\nOnce you get a good feeling about how you spend your free time, you can consider leaving it out\n\n\n* Make sure you set up some kind of reminder to stick to your habit every day\n  * Leave the notebook or the app in a place that you will see it\n  * Set up an alarm \n  * Integrate it into your starting routine\n\n* If you are going to use the paper method, set up is going to be a breeze. You need to write your task and when you started it for each task you do. \n\n* For digital time tracking, I tested a few apps, but my favourite one was Toggl.In my video I show you what projects and tags I have on there. There's a great review functionality there!\n  * Platform options - phone, browser, desktop\n  * If you need some ideas for tags or projects that you can book your time in \"the bliss bean\" blog made some. Google it, they're good! \n\n* Try out different levels of detail to find out the perfect one for most valuable information and least loss of time.\n\n  * I started with very detailed, and this degree of detail made me much more aware of distractions and interruptions. I would recommend taking up this practice for at least a few weeks before leaving things out.\n\n* Finally, set up regular review times to analyze your data. I already offered some examples of what you can analyze, but there is much more you can do.\n\n\n## 6. What I learned from time tracking\nFinally I want to review my data with you real quick and tell you what I’ve learned. In the video version of this you can see my digital and analog entries. I had a look at them and could deduce a few things, maybe you can relate: \n\n* My most productive hours are early in the morning and later in the day\n* If I don’t do dedicated rest time, I usually don’t do dedicated work\n* I have an unusual amount of interruptions when I am working on the hardest tasks\n* It takes me a long time to refocus after an interruption. Studies say refocus takes about 20 minutes and my data confirms that.\n\nHere are my personal takeaways from this week. You might discover something similar in your time tracking reviews:\n\n* I should avoid distractions for my hard tasks at any cost\n* Move the hard tasks to the mornings and evenings, leaving quality relaxation time in between\n* Browsing time is almost as much as my proper leisure time, except I did not plan browsing\n* So I need to be extra mindful of distracting myself by browsing\n&nbsp;\n\nAnd that’s everything. I know it’s a lot of text, but whoever is looking for value here should be able to find it. And you rock, whoever you are!\n&nbsp;\n\nIf you’ve come this far, please comment something about persian cats. Thank you for reading!\n&nbsp;\n\nAsk me any questions in the comments :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ghvv1s/a_few_weeks_into_quarantine_every_day_felt_the/", "title": "A few weeks into quarantine, every day felt the same and I was feeling down and less productive. I decided to track my time and find my motivation again. It actually works! This post contains everything I learned - the benefits, the use cases, the tools and even set up guide. Very detailed.", "social_network": "reddit", "user": "Mindfuldesigns", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 140, "down_vote": 0, "creation": 1589229101, "permalink": "/r/DecidingToBeBetter/comments/ghvv1s/a_few_weeks_into_quarantine_every_day_felt_the/", "nsfw": false, "first_save": 1635435623.6568208, "replies_charged": false}