{"id": "t5_2tand_t3_mn7dpg", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": " \n\nHi Reddit,  \nI'm  a 30 year old male, and after over 12 years of daily marijuana use I  finally decided to quit.   It will be 3 weeks on Monday. I expected this to be a challenge, but I've found that the  emotions/ challenges I've had/am having seem to differ from what to  expect and it's making me very anxious. If anyone has been in a similar  situation, I'd greatly appreciate any details on what you went through  and/or any advice.  \nFirst  off, I have no concerns that I'm going to relapse. In fact, I received  news yesterday that my family is about to put our dog down and as sad as  I was/am about that I didn't and continue not to have any desire to  \"numb\" the pain through smoking (haven't lived at my parents for years  but grew up with the dog and love him dearly).  \nThe  main concern I have right now is whether quitting is going to actually  help address my depression. To back up a little, the main reason I  decided to stop was because I was becoming very apathetic to life in  general.  I didn't care about my career, I never felt like going out to  see friends/do things, and I even lost my sex drive (couldn't get it up with women or when looking at porn).  The only thing I did look forward to was taking bong rips, which is why I knew I needed to change something.  After stopping I did have  some trouble sleeping, which was expected, although within a week I found that I was able to fall asleep very quickly (granted I'm often getting up in the middle of the night and having trouble going back to bed but this was always the case even during/before smoking). What was odd though is that in every other way my  life seemed to greatly improve. By day 2 of quitting, despite my lack of sleep, my overall mood was much better, I felt sharper than ever, I  wanted to see friends/go out to places, and my libido was back (I felt  as horny as I did in my teens!). I even signed back up for a dating  site.  However, this new \"high\" only seemed to last a week and a half.  At the end of last week I noticed my sex drive seemed to die down a bit,  which initially didn't worry me since I figured I can't have an up day  every day, but it's now been a full week and all those good vibes I  described befo you seem to be going away. My sex drive is lacking again,  I'm feeling a full/foggy feeling, and while I'm still working out daily  and socializing I'm finding that I'm kinda forcing myself to do so  (whereas at the initial stages I truly wanted to do that stuff).    \nI  thought it was supposed to be the opposite in the sense that I'd be  feeling shitty withdrawal symptoms for a few weeks and would then feel  good.  The fact that I feel my depressive symptoms returning has me  concerned and is causing some feelings of hopelessness. I know  withdrawal can effect everyone differently, but from what I've read this  seems counter to what many other MJ quitters have described. If anyone  has ever felt this before or knows someone who has, I'd greatly  appreciate anything you have to share.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mn7dpg/recently_quit_marijuana_and_seemingly_reverse/", "title": "Recently Quit Marijuana and (Seemingly) Reverse Withdraw Symptoms - Any Help Appreciated", "social_network": "reddit", "user": "Ex_MJ_Guy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1617934595, "permalink": "/r/DecidingToBeBetter/comments/mn7dpg/recently_quit_marijuana_and_seemingly_reverse/", "nsfw": false, "first_save": 1635436993.4346986, "replies_charged": false}