{"id": "t5_2tand_t3_f2pij5", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "I've gotten myself into the groupie game and I really want to stop. I know it's not good and healthy for me, I can't just let loose and party and pretend like sleeping with this singer means nothing to me. I have feelings. It's hopeless and stupid and can never be because he's a celebrity. He doesn't know my name and doesn't care about, he probably already forgot about the one time we had sex. Still I can't help but dream and hope instead of just letting go and focusing on myself and my real life.\n\nI bought train tickets for the show tonight. The train leaves in 2 hours. I have 2 hours to talk myself out of going. I'm already missing the pre-party so what's the point? He will already have chosen the girls he wants to take to the hotel by the time I arrive.\n\nIt's a city I've never been to, I'm all by myself and I have no place to stay. I should stay home. I must decide not to go, not to be weak or impulsive. It's so hard... He fucked me over so bad.\n\nEdit:\nI didn’t go. I stood at the terminal and waited for the train. Then I turned my back and left. I’m crying but I’m so relieved. I’m going to tell them to cross my name from all the guest lists. I made the right decision.\n\nEdit 2:\nIt’s been a rough day and evening but I still don’t regret my decision. Whenever I see the new music video in my YouTube notifications or hear his music on the radio, my heart stings a little and I feel like I’m out of breath. But I know that it won’t last and maybe I’ll be able to just forget what happened and pretend he’s still this larger than life character that’s out of my reach. maybe then I can listen to his music again one day without tearing up\n\nThank you everyone for cheering for me and congratulating me, it actually helped a lot to reassure myself I made the right decision", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/f2pij5/i_need_to_talk_myself_out_of_going_to_his_show/", "title": "I need to talk myself out of going to his show tonight.", "social_network": "reddit", "user": "sleeparalyzis", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 664, "down_vote": 0, "creation": 1581504982, "permalink": "/r/DecidingToBeBetter/comments/f2pij5/i_need_to_talk_myself_out_of_going_to_his_show/", "nsfw": false, "first_save": 1635435906.4346416, "replies_charged": false}