{"id": "t5_2tand_t3_iryab0", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "It's as if 20 years of living a misdirected life finally came to a head in the wee hours of September 13th, 2020. \n\nI'm not sure why \\*this\\* morning was the morning that the world chose to reveal this epiphany to me, but here I sit. \n\nGobsmacked. Flummoxed. Piteous. Broken. \n\nLife has decided that it has had enough of me living for myself. \n\nAnd, life has made this perfectly clear by stuffing a bag full of bricks and launching it at me such that the force of it is enough to send me out of my own skin in revelation. \n\nOn each of these bricks is the same inscription. And, as I survey the wanton mess of masonry around me, equal parts shocked and grateful for the message, I weep for my prior ignorance. \n\nOn these bricks are the words: \n\n\"You ache not because you're depressed. You ache because you lack community.\"\n\nIt's all so clear now. I mean, it's sad...but at least it's clear. \n\nAll my life I've been ultra-proud of embodying the Lone Wolf moniker. I've been driven by the consummately Western ideals of self-reliance, discipline, and assertion. \n\nBut now, finally, the gas tank is on E. \n\nI no longer have the capacity to live solely for myself. And god, is it painful to realize this. \n\nPainful, yet enlightening.\n\nIt only took me 41 years to realize this. 41 years of being awash in a sea of indecision. Oh the \\*arrogance\\* in thinking that living for myself alone would somehow scratch the existential itch we're all born with. \n\nI'm obviously not too proud to admit this: I am completely bereft of deep, intimate connections with others. Sure, there are superficial ones...clicking 'like' on other people's Facebook posts and offering a casual \"G'morning\" to neighbors during my morning walks with Frida. \n\nPerhaps there's a fear of losing those connections that stops me from developing them in the first place. Or maybe there's a much richer tapestry of psychological factors at play here. \n\nLook at me using all these big words to convey such a simple idea. \n\nThe fact I can't ignore anymore is that I'm an island and always have been. I've avoided real intimacy at all costs throughout my life, and I'm ashamed of myself for it. \n\nTo be clear, there are no victims here but me. I'm the one who suffers on account of my own self-centeredness. \n\nBut (and here's where the magic is, I feel), that changes starting today. \n\nI've finally had enough of walling myself off from forming deep bonds with others. \n\nMy soul is screaming at me using no uncertain terms. \n\nIt's bellowing in plain English: \n\n\"Serve others, you FOOL! And not just by playing your guitar on the side of the #&$%ing road. Your heart is immense, and you're WASTING IT on yourself alone. Lay down your intellect and live to lift others up without fear of losing something in the process. Twenty-plus years of arrogance and 'hard work', and what do you have to show for it? Where is the community? Where are the friendships? Where is the love?\n\nNo more excuses. Stop crying. The Bret that was is dead. Don't mourn him. \n\nBe the new Bret the world needs.\"\n\n...ok, ok ok. I get it. Jesus. I get it. \n\nFirst, I'll wash all of this dried snot and tears off my face. Then, I'll have coffee on the coffin of the man I once was. \n\nChange has come. \n\nWhat happens next won't be easy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iryab0/i_woke_up_this_morning_in_a_fit_of_slobbering/", "title": "I woke up this morning in a fit of slobbering tears.", "social_network": "reddit", "user": "Agnostix", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 663, "down_vote": 0, "creation": 1600003735, "permalink": "/r/DecidingToBeBetter/comments/iryab0/i_woke_up_this_morning_in_a_fit_of_slobbering/", "nsfw": false, "first_save": 1635437251.078002, "replies_charged": false}