{"id": "t5_2tand_t3_kbzy1t", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "A not so quick history lesson on me...I've always known I had some issues growing up, but it took me almost 20 years to realize the extent of said issues. I always convinced myself that my problems could be a lot worse so a lot of guilt came with that kind of thinking. Recently, though,  I've discovered so much about myself and I must say it's validating. I thought maybe I was overreacting? But it took finally hearing my diagnosis to really BEGIN to understand myself more. I always knew my depression wasn't just depression or anxiety, and it turned out to be several things working in combination to fuck my head up. As a kid, I was sexually abused. I cannot remember every detail about it, but I was old enough to know something strange was going on in my very own home. So with that came PTSD, which I never considered could be me, as I was in denial of how severely this affected me and continues to affect me today. And even more recently, I was told I'm bipolar by doctors, psychiatrists, and my therapist. I knew I had ADHD and OCD as well, but didn't think much of it. So I've realized a lot within the past month I'd say. \n\nIn high school, I started having pretty bad social anxiety and immediately decided for myself that I was not going to school anymore. So I did an outpatient program which had school first for like 2 hours and the rest of the day was intense group and individual therapies. I finished my program, and I could tell the people working there, who I had made wonderful connections with, were proud of me. So I really wanted to use the skills I learned there and make them permanent in my life. But, the accomplished happy me didn't stick around too long. I switched schools the next year, which was a huge mistake. Going from a large, carefree public school to a strict, religious private school with only 20 girls per grade (who had known each other forever) was simply not for me. Once I realized how much I hated it there, I decided to stop going to school again, thus leading me back to the same outpatient program. This time, I met my therapist who I've been seeing for five years now, and I've never wanted to tell someone my very personal details until I met him. He's changed my life and pushed me to do things I find uncomfortable, but it's always made me a little bit better. So I completed the program again, pushed through the last few months of school and decided to return to my previous school. I was dating an asshole for my entire senior year, but other than him, I was generally happy as I had gotten back what I lost, like my friends and more independence in school. \n\nFast forward to the end of that year, I was anorexic by the time of graduation. I was drinking a large Starbucks coffee and juuling my ass off to force hunger away if it decided to make an appearance. I started working on it, as my parents threatened to not let me go to college like a week before I was supposed to move across the country. I convinced them it was fine, and I went off on my merry way. Freshman year developed a drinking problem, went to the bar every single night, fucked a bunch of randos in places I'd rather not say. It was just so greasy...but again, I couldn't make it to class or keep up with my work, so I went home to my parents and worked my old job until I made it back to school the next semester. That's when I started smoking weed again, as I did in high school pretty heavily for a year until I started getting drug tested. It started out fine and I was enjoying my life. I made so many new friends that I never thought I'd be lucky enough to meet. Two of those friends I moved in with that summer, and we were having fun. Like too much fun with our newfound independence. I was smoking all day every day, but I realized my friends weren't as much as me. We lived out our days in our basement apartment until we decided we needed some sunlight coming through our windows. Moved into my dream apartment, but I had an underlying feeling that something was off with me and it was gonna explode soon. Went through with it although I had some problems with my roommates, I was clean, they were messy, I like my alone time, they always wanted me to drive them places, and I hated people coming over all the time. Just wasn't for me, but I'm the least confrontational person I know so I just kinda dealt with it. That's especially when pot came in handy, though I was too generously smoking everyone out those days. \n\nI started spending absurd amounts of money that was supposed to go towards rent and school. I spent around $25,000 in less than 3 months on God knows what. Mainly weed, food delivery, and clothes I would never wear. Realized I may have a porn addiction, but I'm weird about sex and being touched. Also started dating my current boyfriend as I moved in there, who has been nothing but an angel in my life. At this point, I'm almost out of money, I sit in my room all day making excuses as to why I can't see my friends who I started to resent for whatever reason, and just letting my destructive thoughts take over all day. Started self harming again and was going on and off my medications. My boyfriend came to visit and we were gonna drive back home where I'd drop him off and I'd visit my family for like a week. Well, I quickly found out that I wouldn't be returning to school, as I failed all of my classes and had zero dollars to my name. I didn't know why I went to school in the first place, was never really too interested in anything or any majors. I just had no direction in school, and I had no idea who I was, and I was scared but also too numb to everything.\n\nMy parents have saved me in every financial situation I've gotten myself into, and I'd rarely apologize or say thank you. Now I feel horrible about all of it, but it's definitely had a huge impact on our relationship. Additionally, I pretty much completely stopped talking to my friends, and they were only trying to reach out when they realized something was seriously wrong. I have gotten pretty good at hiding that from most people though. So here I am now, living at home again, without a job for the time being, about to enter my third outpatient program. It has to be permanent this time. I can't halfass the process of healing anymore. I need and finally want to dedicate everything in me to get better and do better because my life has become so unfulfilling. The program has asked me to stop smoking, so I will do my best to give it up while I'm there, and hopefully find a way to enjoy in moderation instead of using it as an escape. Big believer that pot can be beneficial if you don't abuse it, although I know some will say people with mental illness and weed don't mix well. I am going to be less selfish, and contribute more to the lives of the people I care about. I will eventually find a job, and it may not be the dream job, but I don't even have one of those so I'll take what I can get. I'm starting to build somewhat of a relationship with my alcoholic dad, though it may always be kinda surface level, it's still something. Most importantly I think, I want to love myself. I want to get to know myself again, and in doing so I'm sure I'll figure out what I like, things I want to do, and be able to forgive/accept myself. I don't know if anyone will read this but it just feels good to say. I don't want to suffer anymore, and I'm finally doing something about it, foreal this time.\n\nP.S. though people may tell you \"it could always be worse\" in an effort to comfort you, it's more of belittling someone's issues if that makes sense. it brought me a lot of guilt and shame. it made it near impossible to tell anyone how I felt or about my experiences because I was so convinced it wasn't as bad as it could be. in reality, no one can say anything about your experiences because they haven't lived it first hand. they are not you and they cannot possibly feel what you feel. even if someone's been in a similar place or had similar experiences, it's still different. that is what is so beautiful about being an individual and accepting that while we are the same, we will never live a life like anyone else on the planet. that's just you. life is too short to beat yourself up all the time.\n\nI love you and don't forget it", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kbzy1t/i_cannot_wait_to_meet_myself_soon/", "title": "I cannot WAIT to meet myself soon", "social_network": "reddit", "user": "ruinedbythematrix", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1607817370, "permalink": "/r/DecidingToBeBetter/comments/kbzy1t/i_cannot_wait_to_meet_myself_soon/", "nsfw": false, "first_save": 1635435489.3507538, "replies_charged": false}