{"id": "t5_2tand_t3_pt8n5v", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I'm sorry that I tripped you back in grade school. Even though you were making fun of me and I thought you deserved it, I felt bad for what I did.\n\n\nI'm sorry that I helped other people bully you by teasing you so that I could have a day wherein I wasn't the \"school joke.\"\n\n\nI'm sorry that my best friend and I still visited you even though you told us not to. I understood your unspoken reasons when I saw your house under the bridge. I wish we didn't go.\n\n\nI'm sorry that I never told you anything about my personal life. I wasn't ready at the time. If only I could go back in time and tell you everything, maybe you'd still be in my life.\n\n\nI'm sorry that I laughed at you when we were in the office. I thought it was a funny joke. I regretted doing it right after I saw the pain and shame in your eyes.\n\n\nI'm sorry that I am not the smart person you want me to be. I am grateful for the plans you have for me but I feel like an impostor whenever you call me intelligent and the best.\n\n\nI'm sorry that I always talk to you in an irritable way. I got used to it and I hate myself whenever I do it.\n\n\nI'm sorry that you had to stop your studies so that I could graduate. I knew it hurt you so badly but still you did it for me.\n\n\nI'm sorry for all the times I didn't answer your message immediately. I know there's no pressure but I realized that I was taking you for granted.\n\n\nI'm sorry that I made you feel unhappy when we were together. I thought I was doing the right things but it's clear now that I wasn't. I hope you find the right one for you.\n\n\nI'm sorry for all these things, most of which I cannot ever tell to my friends and family. My shame and guilt will surmount and crash the little dignity I have left inside of me. I have made so many horrible mistakes that changed people, that changed me. Oh, what I would give to undo all those mistakes. Although I cannot remember the number of goodbyes I have received because of my wrong deeds, I am still hoping that the hi/hellos I'll receive will have better chances of staying because now, unlike before, I know better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pt8n5v/apologies_apologies/", "title": "Apologies, apologies...", "social_network": "reddit", "user": "Eros_M_Novan", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1632320747, "permalink": "/r/DecidingToBeBetter/comments/pt8n5v/apologies_apologies/", "nsfw": false, "first_save": 1635436977.162616, "replies_charged": false}