{"id": "t5_2tand_t3_p6qojo", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "I am a 34F in a developed Western country. I've lived here for the past 10 years of my life, having emigrated from a poorer part of Europe. \nFor a while, I thought I was doing quite well in terms of \"living\" and \"adulting\" - handled and completed higher degrees, found jobs, got through several moves across and between countries, handled getting married and divorced and still done kinda okay..\n\nFor a while now, at least a couple of years, I haven't felt like I am doing too great...  I thought that by setting goals to advance beyond my starting baseline would help me feel better about myself, feel pride in my achievements and make life feel like its worth living. But I haven't felt that in ages. If anything, most aspects of my life look horrid from where I am standing and even though I have advanced from my starting baseline, I am still pretty much.... losing at the game called life.\n\nI once had a passion - my work and education. I've lost that about 4 years after I got my PhD in a field I was truly passionate about. \n\nI am lucky to have had a job ever since I finished my PhD, but now the energy that kept me going in face of academic and office politics, energy which stemmed from curiosity and desire to find out new things and also teach people, has dissappeared. If anything I think it's all a sham and even within this \"masquarade\" I am not good, intelligent, knowleadgeable enough, nor do i feel like I have a voice. I do not feel like I can make good service to the values that once drove my energy for my work and I no longer believe in it. \n Also I do not have great relationships with my co-workers. I always thought that by being nice and smiling, saying good things to people, would win me kudos. But actually, perhaps I just come across as aloof and strange to my colleagus in each of my jobs that I've held in the past 6 years (many, many short term contracts!). \nI have no idea if people generally dislike me, feel indifferent to me etc... the only advice I keep getting is that I shouldn't care but... I also cannot live in a bubble not knowing whether I offend people or push them away unwillingly. And maybe I don't but I still fail terribly at making any meaningful connections.\n\nI thought that by diversifiying my social networks I'd feel more enriched by people's stories, experiences and would provide both a source of potential friendships and new, diverse activities. But after multiple tries, I gave up searching and trying....I only have my partner's friends to rely on (which I do regard as primarily his!), I haven't kept proper contact with my old friends (due to having to focus a lot on work for me to still have a job, when I still believed in it!) and I don't think they actually ever liked me or were ever more than indifferent to my existence. \n\nI tried rekindling old relationships frequently, but 90% I only speak to people if I initiate... And then I get forgotten.  Also, so much time has passed that I've lost touch with people's lifes and them with mine. So interactions are simply polite and out of politeness, when anyone has a bit of a free pocket of time to fill it (i.e. I would not have the courage to ask any of my friends to actively help with a house move or anything too onerous because that sort of closeness has never been there and it is less so nowadays). I cherish the times I do see them, but they are very few and I do tend to not be great at having a voice during get togethers. \n\nMy family life is not great either. I take comfort and I am grateful for my fiance's family for accepting me. I have 2 family members close by - my mother doesn't really like me and I have felt rather comfortable on the Nparents threads on reddit. I am still trying to please her to feel accepted and despite that plus LC, things are not getting better so I am working actively on helping myself accept the bad situation for what it is. I also try to continuously see her point of view so that if I am criticised or yelled at, I feel better equipped to forgive those situations. \n\nMy only other family member who I cherish highly is understandibly too busy with their own family and worries, hence too tired for connection. I haven't seen this person in at least 10months and last time we spoke on a videochat was around March. Again, just like with the friends situation - we kinda lost touch with each others lifes. And frankly, I think they are too tired, busy and have enough of their own stuff to deal with than to listed to me whine.\n\nI havent enjoyed many things in many months, but I am constantly trying to \"do better\" and drag myself towards some goal. I continue to take medication for anx and depression. I have 2 therapists (one for past trauma and one for potential, self-diagnosed ASD). Drink alcohol socially once, max twice a week, without going overboard (given it could screw up my mood even more).  I have put on a lot of weight so I am trying to calorie count and get myself back into an exercise routine. But it all feels bleak. Ill do it, expend my entire energy/spoons for a day and then just want to go to bed at 9 and be on my own. If I could just not have to get out of bed at all and speak to no one at all that would be great... but also sad. I am a bit lucky that I am currently on holiday - so waking up later than 6-8 and trying to \"allow myself\", give myself permission to hide under the duvet in bed is okay. But once  go back to work - I wonder if i will still have any spoons for the new exercise routine and calorie count?\nWhere is my energy and will to \"live\"? My motivation for anything at all. I know I should be doing a host of things - but I dont want to - too difficult, and for what? As I won't feel happy about any of these efforts anyway and reaching goals wont make me happier, as my history has taught me.\nAnd I feel ashamed of it all. What a spiral of \"meh\"!\n\nI feel lucky to have a partner who loves and cherishes me and who still wants to marry me. It feels like the sole comfort I currently have in what seems otherwise like a void life. I cannot really see a happy or at least content future, with my having kids, a nice house etc. I feel like these outcomes are highly unlikely. I hate the thought that the way I feel right now might drive him away too, which would leave me utterly alone, as I have been before. And I would lose even the last good thing that is going for me... But I am almost willing to accept that too, Id rather he were happy than miserable like myself.\n\nSorry for the long post, but I am not sure tbh what my problem is or even where to start to make it better. But I do want to do better - surely, not everyone feels like this. Where to I start? Does anyone have any good advice for me? \n\nIn short: All aspects of my life feel bleak and void despite efforts. I dont know why my life feels so broken and I don't know how to fix the parts that are indeed broken. I have 1 good thing going for me and I fear that my current mood, low energy and lack of motivation will drive this 1 good thing away also. In dire need of advice. Or maybe it's me having stupid first-world problems?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p6qojo/wanting_to_do_better_but_feeling_lost_any_advice/", "title": "Wanting to do better. But feeling lost. Any advice?", "social_network": "reddit", "user": "Alecto276", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1629291643, "permalink": "/r/DecidingToBeBetter/comments/p6qojo/wanting_to_do_better_but_feeling_lost_any_advice/", "nsfw": false, "first_save": 1635435078.0094042, "replies_charged": false}