{"id": "t5_2tand_t3_q5qad5", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "The other day at work, one of my coworkers was ranting about how she didn't want to do something for work. She had a fairly valid excuse, but her words and negativity were over the top and just got to me. I later told my other coworker, we'll call her Jane, that maybe I would like my job more if people weren't so negative all the time. (I do like my job, but it is mentally and physically draining and people get burnt out fast.) I casually mentioned to Jane that we should make a pact to just be positive on the days we work together, even if it comes out in the form of sarcasm (for example, saying \"I am the definition of brilliant\" instead of \"Ugh, I'm such an idiot.\") She agreed to this and even mentioned it the next day (in the form of a meme, so idk if that really counts lol), so I really want to do something to enforce the pact and not just let it get forgotten. Jane and I do have a tendency to talk about deep topics like the state of the world right now and HR issues and stuff. I don't really want to give those conversations up because I really value Jane's opinions and insight. I feel like I can learn a lot from her. (And I guess in a way, I want to be positive as a way to give back to her.)\n\nI was wondering what I can do to just make the mood more light. What kind of little things can we say or do to just get ourselves in a positive mind set and prevent burn out? Just between the 2 of us for now, but would love to spread throughout the workplace once we find something that works.\n\nI'm not entirely sure what I'm looking for from you all, but something did just come to mind that I could try. Kinda silly, but I know there are studies that show that scents like vanilla and lavender are calming and relaxing. I can't light a candle, but I'm sure I could figure something out. Jane is also really into things like crystals and stones for anxiety etc. I don't really believe in that kind of thing, but even a placebo effect could be nice.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5qad5/how_to_be_more_positive_at_work/", "title": "How to be more positive at work?", "social_network": "reddit", "user": "NotISaidTheCat9", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1633935727, "permalink": "/r/DecidingToBeBetter/comments/q5qad5/how_to_be_more_positive_at_work/", "nsfw": false, "first_save": 1635435780.17645, "replies_charged": false}