{"id": "t5_2tand_t3_5xzk7b", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "It seems like it was only last year when I was quitting smoking while stuck in debt, bad eating habits, a procrastinator and sedentary\n\nWhy quit cigarettes or all those sweets you’ve been eating? Isn’t life short and meant to be enjoyed? Don’t you deserve a treat?\n\n**Yes, these are the justifications I gave myself too. And they’re full of crap.**\n\nLife is short, so why waste it on pure junk? Those things don’t make you happy — if anything, they made me unhappier and unhappier about myself. I’ve been happier once I gave up those habits, and learned to be healthy and trustworthy to myself.\n\n>*Eating healthy food is a treat. Living smoke-free is pure bliss.\nIt fucking sucks to be attached and dependant to something and not being free of it even though you objectively know it’s bad for you and you know how to stop. That’s the worst part.*\n\n**Understand your triggers.**\n\nEvery habit is triggered by some event. For me, I would smoke after stress, eating, drinking coffee, a meeting, drinking alcohol, or being around other smokers. I found this out by carrying around a notebook and pencil and making a tally mark in the notebook each time I smoked, for a couple of days. Then I wrote down the triggers in the notebook for a day or two — if I smoked, I’d look at what happened just before the urge to smoke. This helped me to be more aware of the triggers, some of which you don’t realize you have. The same applies to eating junk, shopping, chewing your nails, playing video games, watching videos or TV, etc. … each of these habits is triggered by something else. Write those down in a document titled, “Quit Plan”. Put the date of your quit, your accountability system, your Why, and the triggers on this document.\n\n**Surround yourself with people who live the way you want to live.**\n\nYou don't need to ditch your old friends, but don't underestimate the power of finding some new ones.\n\n**Use the word “but” to overcome negative self–talk.**\n\nOne thing about battling bad habits is that it's easy to judge yourself for not acting better. Every time you slip up or make a mistake, it's easy to tell yourself how much you suck.\n\nWhenever that happens, finish the sentence with “but”…\n\n        “I’m fat and out of shape, but I could be in shape a few months from now.”\n        “I’m stupid and nobody respects me, but I'm working to develop a valuable skill.”\n        “I'm a failure, but everybody fails sometimes.”\n\n* **Plan for failure. We all slip up every now and then.**\n\nNow for the most important tip that you can start with right now.\n\n#Know the difference between I can’t and I don’t.\n\n#I made a [video](https://www.youtube.com/watch?v=DmJ0qyCPEiU&t) exploring this idea here.\n\nThis is probably the most important thing you can do because you’re actively seeking to change the paradigm you are identifying yourself with. I can’t takes effort and reinforces it’s a struggle for you. I don’t on the contrary redefines you and each time you successfully say it pulls you further away from attachment to cigarettes, sugar, or whatever the dependency may be.\n\n**Understand that once you quit one thing, everything else becomes so incredibly easy to stop.**\n\nThe last step is to remember to: NEVER count days. Now you may disagree, but if you are counting days you are still staying in the same identity, every day you count you are a \"smoker who went 40 days without it\" or a gamer who went 24 days without gaming\".\n\nGood luck people, I wish you nothing but the best with your goals and success.\n\nPeace.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5xzk7b/we_are_addicted_to_our_thoughts_we_cannot_change/", "title": "We are addicted to our thoughts. We cannot change anything if we cannot change our thinking.” - How To ELIMINATE Any Bad Habit Forever.", "social_network": "reddit", "user": "avacadotreelmao", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1488880951, "permalink": "/r/DecidingToBeBetter/comments/5xzk7b/we_are_addicted_to_our_thoughts_we_cannot_change/", "nsfw": false, "first_save": 1635435656.3633006, "replies_charged": false}