{"id": "t5_2tand_t3_ln9es0", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": " \n\nSo I'm having a case where I moved to a new place for a new job pursuing better career opportunities and I got some inner values conflict, that starts with...\n\n\\- too low salary (but I'm entry-level 2nd month yet), high working hours (startup) & screen time\n\n\\- Distrust in myself. (career-wise I'm not sure how many years I have to dedicated to becoming a manager to get paid. + I feeling pressured at work to deliver doesn't help)\n\n\\- relationship with GF (there's sometimes doubts so we conflict)\n\n\\- household sharing with unknown people and life in a new place in general\n\n\\- friends and family that want attention (I don't get pressure), but still I get offers and calls (that costs time), and working long hours and having bad time managing skills requires to cut that attention. It's sad.\n\n\\- some BIG rumination on my insecurities, being pity about myself, having unhealthy ego battles about comparing to other people, and more...\n\nLike, you get it there's a lot of going on my mind. IT'S ALWAYS ARE.\n\nI'm not even sure what could be a dealbreaker here.\n\nEven now I'm writing before work because I was snapped out of a dream and reflected 2 hours. 6hours of sleep instead of 8.30 will definitely affect my performance. BUT I wouldn't have time (due to work, travel & household) to share if It wasn't for this.\n\nSO despite my work performance will go down. THERE's a good thing - that reflection on a dream symbolism gave me some guidelines on the relationship puzzle to solve. And this reflection gives me some confidence that I'm: getting answers, know what I'm doing, have control in my life. When I'm not doing that and only working I feel down and I still procrastinate work and think about some of my life aspects that I'm worried about.\n\nThe thing is WHEN I focus on my feelings, inner reflection, and build the whole life picture I LOSE energy that is time and that affects my work results. When it affects my results I'm being pressured and micromanaged more. AND this is a natural consequence as I'm getting paid to deliver and concentrate on work as it's said \"It's not personal, it's just business\" so no feelings in work.\n\nThis whole situation is a big deal for me and its deal to live with it, somehow it's too damn hard.\n\n**tl;dr**\n\n**HOW do you find inner balance when choosing: WORK vs. other responsibilities vs. You & your mental health?**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ln9es0/how_do_you_find_inner_balance_when_choosing_work/", "title": "HOW do you find inner balance when choosing: WORK vs. other responsibilities vs. You & your mental health?", "social_network": "reddit", "user": "rewsn", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1613717777, "permalink": "/r/DecidingToBeBetter/comments/ln9es0/how_do_you_find_inner_balance_when_choosing_work/", "nsfw": false, "first_save": 1635435232.5236285, "replies_charged": false}