{"id": "t5_2tand_t3_q0dc9a", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": "This is a part of myself that I hate. I never learned how to comfort people and I lack empathy. I feel like a psycho.\n\nBut when I hurt someone's feelings or they misunderstand me and it makes them feel bad, I can't help but become very distant from that person and sometimes even come off as angry to them because I'm frustrated with how I'm unable to process what needs to be done. \n\nIt feels like brain gymnastics but it's really not. Oh you're sad, do you need a hug? Oh you think I sounded rude, I want to let you know that I didn't mean to sound that way! BUT THESE ACTIONS OR WORDS WONT COME OUT. As I grew up, there were multiple times I've seen family members cry around me and I would cry too but I would just leave the room. I have a hard time comforting people and so it's just been very easy for me to exit quietly when things become somber.\n\nIt does not help that my family's way of dealing with trauma is by sleeping on it and forgetting that it happened the next day. Mom & dad fighting at 3am and mom pushed dad down the stairs, now I'm afraid and crying but no one says or does anything. Were just expected to go to bed, sleep and eat breakfast the next day without uttering what had happened last night.\n\nAnd this method has carried into my adulthood and is affecting my relationship bad. I need to learn how to let go of whatever this anger is I feel when I make people sad.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q0dc9a/i_am_having_a_very_hard_time_setting_my_ego_aside/", "title": "I am having a very hard time setting my ego aside to be apologetic.", "social_network": "reddit", "user": "UNiCORN_onACiD", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1633247692, "permalink": "/r/DecidingToBeBetter/comments/q0dc9a/i_am_having_a_very_hard_time_setting_my_ego_aside/", "nsfw": false, "first_save": 1635436294.7542286, "replies_charged": false}