{"id": "t5_2tand_t3_j3norx", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "This is going to be a long read and I'm not sure if it's the right place to post it but I'm new to this so please bear with me. \n\nI always browsed reddit to pass time and found the articles so informative and hilarious. But after seeing subreddits like r/DecidingToBeBetter , r/LoseIt and \nr/GetMotivated , the inspiration I read was infectious and I wanted to join these communities in hopes of being a better me. \n\nI've let myself go in my eyes- physically, mentally and emotionally. \nI feel like I was in such a good place that I became complacent. I put my guard down, relaxed and kicked my feet up too long that I forgot how to get back up. It's like I became an old boulder of a rock covered in moss.\n\nI don't know when it happened- I thought I had a proper hold on everything and was managing those negative thoughts that I thought I conquered while a teen. But I suppose those tiny thoughts- over a period of several years- slowly ate their way into huge garbage piles in my mind and became habits that have made me melancholy. I feel like I've lost my spark for life- where everything now feels so 'meh'.\n\nI recently read a post of a woman who saw herself going down the same health path as her Mom who passed and it alerted me. I am always saying I do not want to end up down that same path but- currently being at the highest weight of my life- I see that I've been lying to myself. Telling myself \"I'm fine, I'm fine.\" while sinking deeper to the bottom.\n\nI'm looking at myself and while I see that I'm not fine- I've now realized that I've been looking to others for answers and forgetting the strength that I used to hold. The strength I have to stand up and fight for myself, for my life, for bettering my state of mind and body. I want to change that- I need to change.\n\nSo- I went for a jog today and while it's not the first time- the previous times were with no effort. But today I pushed myself- sprinted twice in the way I used to when I was healthier. And while it was tough- it felt damn good. Like breaking out of a shell and being able to stretch again. \n\nI hope I can find that person that's been buried for so long and let their light shine in this world once more. \n\nI'm sorry this is so long. I hope journalling my thoughts here will get my engine started and inspire someone else to do the same. \n\nIf anyone has suggestions for other subreddits I should follow for inspiration and guidance I would love it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j3norx/this_is_my_first_post_after_officially_joining/", "title": "This is my first post after officially joining reddit 4 days ago. 🤗", "social_network": "reddit", "user": "mars_0004", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1601611154, "permalink": "/r/DecidingToBeBetter/comments/j3norx/this_is_my_first_post_after_officially_joining/", "nsfw": false, "first_save": 1635436048.4500089, "replies_charged": false}