{"id": "t5_2tand_t3_jcfrww", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I broke up with my gf of 7 months recently. It was hard. I cried and I never cry. I fell behind in school because the breakup happened near midterm week of all weeks. Just my luck right?\n\nI began the process of what I've done in past relationships, wallowed in pity and fell into depression. However, my grades updated today and they didn't update in a good way. It snapped me back to reality. I'm a Junior and my grades are important to me. I'm almost out, I can't fail now.\n\nWhat I've done since then:\nDid the assignments and turned them in even though I got late points. Even though I panicked I picked myself back up because I still have time to turn things around.\n\nStarted calling my sister during her lunch hours to just talk, I'm very social so talking to people energizes me.\n\nPlanned a trip with friends to go to a nearby big city for a night, booking the hotel soon. Also told those friends what's going on and they've been very supportive and it proved that I wasn't alone.\n\nHave a therapist appointment scheduled. I've been to therapy before and it's helped, I just haven't had an appointment since last year.\n\nGetting back into guitar and art. I'm making an art piece for a friend who's really helped me through this.\n\nI have so much to look forward to in my life and I can't let one person take that away. I'm moving states after college, I'm about to get my degree in Computer Science, I'm applying for internships, looking for a new job... I have to keep moving. \nTo others in my situation, I am a optimistic person by nature so this may have come to me more easily than others. But I believe in you and hope things will get better. It's hard but please hang in there. I wish you the best.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jcfrww/going_through_a_break_up_but_instead_of_wallowing/", "title": "Going through a break up, but instead of wallowing in self pity I've decided to improve myself", "social_network": "reddit", "user": "Barista_Kitten_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 36, "down_vote": 0, "creation": 1602874256, "permalink": "/r/DecidingToBeBetter/comments/jcfrww/going_through_a_break_up_but_instead_of_wallowing/", "nsfw": false, "first_save": 1635437601.3004758, "replies_charged": false}