{"id": "t5_2tand_t3_qe1v31", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "Life was never easy but the period between June 2020 and June 2021 was the toughest—I won't call it worst because it actually brought the best out in me. My dearest person died and I got divorced plus fell into legal complications plus health deteriorated. But you know what, I have recovered from it all through sheer mental perseverance. Since then I have done wonderful things I'd not have done before, I did adventure sports, got into a surgery I was afraid of and fought my chronic depression without any medicine or psychiatric help. I did listen to some motivational lectures and read stuff on self improvement. What pushed me through it all was the thought of not letting myself down and the will to show them all how they cannot defeat me to the abyss they wanted me to fall into.\n    I'm 35 now and feel like my life is beginning now. I was never sure what I should do but now I know what direction i have to take and what goals I have to work towards. I'm not sure where life will take me but I'm focused on the things I have decided to achieve. This world cannot defeat me, I will not let myself deteriorate to that low level again. I'm working and they'll see how I rise up.\n     Thank you for reading. It was for those who are thinking of giving up. You don't have to live for anyone, you must live for yourself and keep pushing forward because you can and you must. You have got a gift, you just need to use it, it's called Life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qe1v31/rise_up_use_your_gift/", "title": "Rise up, use your gift", "social_network": "reddit", "user": "maxliebe99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1634982556, "permalink": "/r/DecidingToBeBetter/comments/qe1v31/rise_up_use_your_gift/", "nsfw": false, "first_save": 1635436279.2785804, "replies_charged": false}