{"id": "t5_2tand_t3_q2tzp3", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "c67213dc-0eed-4cac-a781-9bc082742908", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Physically, mentally, emotionally exhausted. \n\nThis week was a breaking point for me and I'm looking up, but there's so much work to do. I hope you don't mind if I feel sorry for myself for a moment here.\n\nI was diagnosed with celiac a year ago now-- that means I can't have gluten anymore, ever, for the rest of my life. It's much easier at this point than it was when I first started, but I've also hit a point where I'm really missing certain comfort foods and really missing the social aspect of being able to have a snack with friends. Thankfully, the people close to me in my life go the extra mile for me; but I'm only a year in and am realizing that the rest of my life is a very long time.\n\n>*I can't fix my disease, but at least I'm no longer in pain. I love to cook and have been trying to do so more often as it lifts my mood. Good food always makes me feel better.*\n\nI'm very overweight and have officially weighed in at the heaviest I've ever been. Before the pandemic, I was down 25-ish pounds and making great progress, but I've gained it all back and more. I don't have a lot of energy or strength, and my self-esteem has taken a huge nosedive.\n\n>*I joined a gym this week and actually went yesterday for a short period of time. I am sore today, but seeing my workout logged on my phone makes me proud of myself. I am getting married next October and am excited to have a goal. I want to look good in my dress, even though the idea of shopping terrifies me right now.*\n\nI have trich and pull at my hair constantly. It looks like a hot mess and it really can't be tamed regardless of what I do to it. Increased stress means I've been picking more which leads to more mess, which leads to more stress, and so it goes.\n\n>*I have been fighting this problem since middle school. There isn't an easy fix, but I finally got over my anxiety and called my salon. I have an appointment tomorrow to chop it all off; this middle length wouldn't be flattering on me even if my hair was perfect!*\n\nI've been anxious most of my life, but have fallen into depression lately. \n\n>*I contacted a local therapy group today. I am hoping to set up an appointment soon. I also started doing yoga again; it used to be a favorite, mindful activity of mine and it's time to bring it back.*\n\nI have two dogs who I love dearly-- one just turned 11 today. She has hip problems and has started having accidents in the house overnight and refuses to use the puppy pads I lay out for her. The other dog is a rescue with no manners and resource guarding issues. \n\n>*We are going to the vet Friday, and I have booked some sessions with a local trainer. It will take time, but is a step in the right direction.* \n\nWork is a nightmare. I work in a pretty high-stress job anyhow due to the nature of my work, but recently I had my team lead take almost a month for parental leave. All of my projects turned upside-down while he was out and we are nearly a month past deadline for several. \n\n>*My team lead is back and we had a talk about it this week. No blame is put on me or my teammates for the blockers as they are clearly out of our control. I was commended on my communication skills and doing all that I can while waiting on the other parties. Now that he is back, I feel like I have more help to cross things off the list.*\n\nThat was a lot. Thanks for getting to this point if you have. I've had a couple breakdowns over the last couple weeks, have lost sleep for a number of reasons, and just overall been in a really pissy mood at the smallest thing that goes wrong. Likely because I feel like a lot of things have gone wrong!! \n\nBut like I said, this week I finally decided that I'm tired of being frustrated and annoyed and feeling out of control and while none of these solutions will magically fix everything, it's at least a start.\n\nThis all being said... if anyone has short term serotonin boosts they would like to share, I certainly won't say no :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q2tzp3/im_very_tired/", "title": "I'm very tired.", "social_network": "reddit", "user": "max_mercury", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 31, "down_vote": 0, "creation": 1633555805, "permalink": "/r/DecidingToBeBetter/comments/q2tzp3/im_very_tired/", "nsfw": false, "first_save": 1635435973.894182, "replies_charged": false}