{"id": "t5_2tand_t3_bcp3yl", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "To start off, I wasn't encouraged to take risks as a kid, I've always been shy and timid, somewhat awkward at times. Never had friends, so social situations weren't easy. Never had a girlfriend, just stupid hookups in my adult years that left me shattered.\n\nThat's behind me, I'm already addressing my personal flaws.\n\nBut now I'm 23 (M), closing in on 24 late summer. I have a comfortable job with 2 colleagues that have been absolutely amazing at breaking me out of my shell. But I've lived this way for 2 years now and I feel like my life is on repeat.\n\n7am, wake up, off to work.\n\n6pm, come home, eat, waste time for 3 hours, sleep, repeat.\n\nFriday - we drink the 3 of us at work, we might go to our usual bar, we might crash. I take the 2h commute back home on saturday. \n\nI live rurally (with my dad) and commute to the city. I guess this is the most draining. \n\nI have no hobbies because I can't make myself do anything in the evening. I used to play video games but now I just mindlessly watch YouTube videos until I collapse on my bed. Sometimes I go to the gym.\n\nMy dad also makes me very self concious about everything I do without being a very good motivator. He's not an asshole, but he's a busybody. I always have to make excuses when going out and if I just say \"I'm going out\" he'll keep a grudge and start shit when I'm back home. Makes me want to not leave the house.\n\nAt the same time we use each other for emotional support, because he's the only person who's there when I come home. I have no friends in my hometown.\n\nI haven't felt love. Likely because of all of the above. All I get is maybe one hookup every year. Just got stood up by one who I invited on a date for next Thursday, but she said that she's also talking to her ex.\n\nI've grown complacent to it all. I'm afraid of change, I'm afraid of being judged by my dad but I'm also afraid of being alone if I move. I feel so desperate for love and closedness in my soul crushing, monotonous life. Help pls, or just a word of encouragement?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bcp3yl/my_life_is_stagnant_how_do_i_change/", "title": "My life is stagnant. How do I change?", "social_network": "reddit", "user": "em_ta1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1555150606, "permalink": "/r/DecidingToBeBetter/comments/bcp3yl/my_life_is_stagnant_how_do_i_change/", "nsfw": false, "first_save": 1635436072.2415216, "replies_charged": false}