{"id": "t5_2tand_t3_pcdig2", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7", "18281d65-fa68-4991-a4a1-8f37346818f3", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I am a 31-year-old man. The other day, my partner caught me in a lie that I have been keeping, to varying degrees, for the entirety of our relationship (will get into details as we go). The lie is about my porn habits.\n\nNow, I'm not here to kink shame. I'm also not here to tell you that pornography is *always* bad. But there are two things that are bad: 1) LYING TO YOUR PARTNER 2) Watching porn of escalating extremes.\n\nIf we start this story right from the beginning, we're looking at when I was about 10-years-old (roughly). Being a child of the 90s, the internet was a wild west of porn. Somehow, one of my friends happened to find porn of the...fecal kind. To shock us, he showed it to all of us.\n\nOkay, that was weird! Fast forward a couple of years and I discover porn games on a certain popular flash game site. These unfiltered, bizarre games include all sorts of weirdness. I don't get turned on by it all, but I'm fascinated by it as I try to find my way around puberty and figure out what \"grown-ups\" do. It doesn't help that I start making friends with young adult men that are probably being a bit inappropriate (nothing malicious, but making jokes and not realizing how my brain will interpret it all).\n\nI drop porn around 14 completely. I don't pick it up again until I'm about 17/18. I buy some porn mags, I go to some porn sites. I date a woman who is into being \"brutalized\", and so I explore porn around that. It kinda scares me, I worry for the safety of these women. I constantly look up interviews with them, etc to see if they are okay, but decide it is best to just not watch this kind of porn.\n\nOne genre I do get into is joi and femdom stuff. Partially because it seems the safest genre: big burly porn produces getting done by women? Yeah, all seems pretty safe. And JOI stuff is literally just someone and a camera (maybe their boyfriend?). Mind you, some of the mommy stuff is...weird. Some of it is great! Some of it is too much for me - kinda creepy, ya know? I'm sure anyone who has looked at this stuff knows what I'm talking about, especially because it is now a big part of mainstream porn it seems. Well, I avoid this stuff (and the stars in it - I'm of the attitude that if you make one video I find gross, I don't want to consume your content at all. Again, I'm not kink shaming but...that shit ain't for me, homes).\n\nI then start dating the love of my life. I am open to her about my porn consumption. At some point, however, she tells me it makes her feel a bit funny that I watch porn, and I do the dumbest thing ever. I tell her I'll stop completely. She tells me I don't have to. But I think it's the best move, and tell her I'll stop.\n\nI manage to for awhile! In fact, for a LONG while. Then one day I check out some again. And then some more. And some more. I cycle through BDSM-related, femdom-based fetishes.\n\nAt this point you think: why are you telling us about your fetishes? Because I started applying them to my partner. I started asking her to delve further into these kind of \"mommydom\" stories. Which she didn't mind - she's extremely liberal sexually, something that really united us in the early days. But it became way too much of an obsession for me. Something I needed to bring into the bedroom. She didn't really express it, but she started feeling distant and isolated. No, fuck that, she DID express it - I just took it for granted.\n\nNow, here is where I descend into hell. I start trying to find something \"heavier\" and more extreme. My tastes aren't working out anymore. I start trying to find stuff involving...well, fecal matter. Looking back, I wonder if that exposure to a website early on caused this. And I do find it, because Reddit and Pornhub both have gross stuff on them (again, I'm not kink shaming anyone, but this is something that was always a hard limit for me). I search it up a few times, tried to get off to it and (from memory) each time I found it disappointing. Kinda thinking \"why am I looking at this?\". I am still repulsed at myself for looking at this stuff and for trying to get off to it. I've always been into the darker, grosser side of things, but this is a bit beyond.\n\nAfter this point, I really cut back on my porn use. Heavily. As I did, my mind started to \"clear\". I started to realise I'd looked at some pretty messed up stuff. Now, I was always concerned about consent. I personally had a little bit of a fantasy about being \"taken by force\" (based I think on trauma of being sexual assaulted by my ex). However, even very obviously stagedstuff on mainstream pornsites that play around with consent were a big big no no to me (Brazzers seemed to play with that for awhile. Although to be honest I'm always surprised how gross they get for a mainstream site, honestly the scenarios they set up now make my skin crawl).\n\nBut can I HONESTLY say I never saw anything, especially when getting into that heavier stuff, where the women involved were super happy to be there? That no one was ever in a position where they felt like shit? That every single amateur video featured women who knew it was being uploaded, and that the fact it got out there wasn't a violation of trust?\n\nThe fact is I can't. And by lying to my partner, I have contributed to her own inability to fully consent to our relationship. By saying insane stuff in bed to her about her fucking other men, about bodily fluids/matter (yeep....yep...god she was patient), I took away her ability to fully be part of sex. I used her, just like I used the women (and perhaps men) in the videos.\n\nI dealt with this shame by acting like a weasel. I drip-fed info to my partner, downplaying how much I'd used porn. She caught me in the lie. It all came out. ALL OF IT. Oh my fucking god. What an insane weekend. The darkest of my life, and of hers too I bet.\n\nI am disgusted in myself. I have contemplated suicide a few times in the last few days - fleeting thoughts, but definitely there. My partner even said to me \"I don't hate you, I hate that you lied to me and to be honest the poop stuff...yeah, I'm judging you a bit.\". That's pretty fucking reasonable, right?\n\nI'm seeking therapy - not just for the porn, but for the lying. I installed a porn app blocker on my phone, but I am (at least so far) not tempted to look at anything. I'm too ashamed. When I close my eyes, some of those videos pop into my head and I feel queasy as fuck. Sick with myself. Same with some of the bizarre thoughts that would run through my head sometimes. Intrusive thoughts to be sure, but intrusive thoughts I wouldn't even be able to put together if I hadn't been consuming porn (and then becoming anxious about the wellbeing of everyone involved).\n\nThis is my story. This is where I am. A broken man who has wasted love, passion, energy and time on pixels. A man who stared into the depths of hell with twisted desires.\n\nYou might judge me, that's ok. You might think I am scum who deserves to finish my life in a hole with no light. I sometimes feel like that, too. And if you feel like that, I won't downvote you for telling me. \n\nI don't know if it is too late for me. I don't know if my partner is going to turn around and say to me \"I can't do this anymore, it hurts too much\" - the other day she did come to me after being in the bathroom and told me she couldn't deal with what I'd done in there.\n\nBut each day is a new day. I am going to do my best to repair who I am. I am trembling with fear. But I have a cat on my lap reminding me that I am here in this moment, and my partner not far sending me messages that she loves me. I will not take a single one of these messages for granted **ever again**.\n\nSo, whoever you are - if you read this and thought \"maybe I have a problem with porn\". You do. Our brains aren't set-up for this shit, and we don't have the data on it yet. Don't be part of the experiment. Cut-back, talk to your partner about your desires and wants sexually. I AM NOT KINK SHAMING YOU, AS LONG AS YOU DO STUFF SAFELY WITH CONSENTING PEOPLE ALL IS GOOD. Practice positive sexuality, not shame and creepiness.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pcdig2/porn_addiction_unloading_accepting_accountability/", "title": "Porn addiction: Unloading, accepting accountability, and dedicated to grow (this is a heavy one). Please read this if you think you might have a problem with porn, or feel shame after watching it.", "social_network": "reddit", "user": "AmIAwful222", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 525, "down_vote": 0, "creation": 1630028792, "permalink": "/r/DecidingToBeBetter/comments/pcdig2/porn_addiction_unloading_accepting_accountability/", "nsfw": true, "first_save": 1635436974.6845388, "replies_charged": false}