{"id": "t5_2tand_t3_kbdozu", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hi there,\n\nI hope you are doing well and keeping safe in these unprecedented times. \n\nI’ve been thinking a lot about this and decided\nTo make a post because I can’t stop thinking about it.\n\nPlease excuse the religious bit! It’s become the framework for my life:\n\nWe absolutely all desire to know the purpose for our lives. I wake up every morning saying to myself that there has to be more than this. I began my walk with Christ recently, and, He has really changed my perspective on life. Which has been great. There are still areas I’m trying to improve. I strive to be Christlike in everything I do. I’m trying but it’s hard. I still struggle with unforgiveness at times and I get so caught up in the world. Jesus thought nothing of His reputation, and, tells us to store our treasures in Heaven. We are told in 1 John 2, “not to love this world nor the things it offers us. The things of this world offer a craving for physical pleasure, for everything we see, and pride in our achievements and possessions.” I always go back to this scripture to keep myself in check and to keep my eyes and heart focused on Christ. \n\nAnd for a long time now, and even on my walk with Christ, I long to be renowned globally and have access to a really privileged life. I know, you probably think I’m very superficial. I get it, it is very superficial thinking. \n\nI often think about someone like Meghan Markle, whose destiny (ordained by the Lord) was to marry a Prince and become a Duchess. I ALWAYS find myself thinking if I had a position like hers, how much I could do with her platform within the institution (instead of leaving and taking her husband with her). I’d love to be able to do meet and greets, be very involved in charitable events close to my heart. It’s an amazing platform for diplomacy, to have round table discussions, and being a global style icon! There were absolute struggles with that, I get it. But gosh, I often think, how privileged she is. I feel sad at times realizing that I will never have an opportunity like that. I’m trying to overcome this desire and sometimes covetousness.\n\nI honestly have no idea what I’m asking, but, I just wanted to vent about what’s been on my heart. This has been on my heart for a long time.  The desire has not diminished. It’s in my mind a lot. Is that wrong?\n\nI’m in a season of struggle with my career. Single, unemployed and living with my folks. I’ve fallen behind academically while all my peers are out on the front lines fighting this pandemic. They all are between the ages of 26-29 and have prestigious jobs, are married, and some even have kids. \n\nI want to do something incredible with my life. I’ve always wanted to be a role model to many people someday.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kbdozu/i_have_a_lot_of_anxiety_about_my_dreams_coming_to/", "title": "I have a lot of anxiety about my dreams coming to pass.", "social_network": "reddit", "user": "Outrageous-Reveal-21", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1607728449, "permalink": "/r/DecidingToBeBetter/comments/kbdozu/i_have_a_lot_of_anxiety_about_my_dreams_coming_to/", "nsfw": false, "first_save": 1635437164.138424, "replies_charged": false}