{"id": "t5_2tand_t3_kkb7cj", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I've been emotionally and physically abused by my father for years, and that has affected my interactions when I left home for college. I'd be groveling for attention and affection, putting up with being mistreated and even harassed along the way. all because I was afraid of having no one, of being alone. \n\nI've dated a guy who was cheating on me all the while with his gf of 7 years, when he was done with me he broke up saying that he could no longer date a trans man. this was why I clung to so many people. I thought few would 'put up' with a trans person and I ought to be 'grateful'. I've had multiple partners keep me around for their validation, never live upto their words and leave when they were bored. simply cause they knew I wouldn't leave. \n\nfuck that. fuck all of that. \n\nI want to overcome this, learn to love myself and be comfortable alone. I don't know how but I'm going to do it. I want to be feared, respected. I want to be someone others are scared of losing, instead of being taken for granted. I'm so fucking done with being taken for granted. \n\nI want to find out who I am, build my skills and outdo my potential. I want to do justice to and live upto this post, not just make them empty words after a few days. \n\nI don't know how, but I'm making a start somewhere.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kkb7cj/ive_built_my_entire_life_on_the_validation_of/", "title": "I've built my entire life on the validation of others. I don't know where to start but I'm going to take that power back.", "social_network": "reddit", "user": "closetedandconfused", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1608951373, "permalink": "/r/DecidingToBeBetter/comments/kkb7cj/ive_built_my_entire_life_on_the_validation_of/", "nsfw": false, "first_save": 1635436996.5655851, "replies_charged": false}