{"id": "t5_2tand_t3_miclmc", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I find this topic very troubling to me.\n\nJust like any other kid, I was relatively normal. Happy and playing around.\n\nThen my emotions started getting out of control. During elementary and middle school my emotions were interfering with rational decision making. In middle school I started having huge crushes on girls for the first time. In hindsight, my behaviors were very creepy and obsessive. All of them were driven away. People blocking me on social media became a regular occurance. It was crazy shit. I was saying things I shouldn't have and done things that I still regret to this day. Those feelings of extreme happiness, obsession, and confidence easily led to extreme anger and hatred when I didn't get what I wanted. (Example: rejected/blocked on social media by a friend/crush)\n\nSo when I got to high school I realized that I was pushing people away by these behaviors. I felt like I didn't deserve to belong in the world anymore. So I went in the opposite direction and tried to destroy all emotions. In fact I had been scared of smiling and laughing and generally being funny for years, and this particular time (2017) was when all these fears came to peak. I believed that any happiness would make me feel worse if it was taken away from me. Everything from happiness to anger to sadness. I even believed that happiness was bad for me.\n\nIt worked. At least, partially. Even after I changed my mindset I was unable to feel happy/joyful and smile/laugh, at least not as much as I previously did. It even became extremely hard to have natural crushes on girls, so I basically had to force myself into having crushes (which, obviously, came with deadly ramifications). For years I have basically tried to force myself to have fun during social interactions and even tried artificially them in the hopes that I would appreciate them more when they do come.\n\nMy senior year was the worst as I had basically descended into a big ball of negativity. By the time quarantine started I was an extremely toxic, angry, negative, and ungrateful person because I had crushes on girls and they rejected me. I was breaking things around the house constantly because she didn't like me back. When quarantine started, the girl I liked blocked me, and the majority of my social life was taken away from me, I was basically a negative ball full of toxicity and anger. Barely felt confident ever since. The consequences still haunt me to this day.\n\nNow I'm in college and have a completely new social life. I'm using that as an opportunity to reshape myself and rebuild myself from the traumatic events of the past, and for the purpose of this post, being able to recover my emotions. Here's the steps I have already taken to recover my emotions:\n\n* Sought therapy\n\n* Went to more social events outside class time\n\n* Really paid attention to the world around me, even things that I would take for granted. Like the trees, shrubs, blue sky, wind, grass, birds, passing cars on the road, etc.\n\n* Acted as natural as I could when talking to friends and letting confidence take over, as well as paying attention to what the other person is saying. Also stopped forcing myself from having fun\n\n* Meditation and being honest with my feelings\n\nAnd for not letting emotions interfere with rational decision making/randomly switch to other extreme emotions when I don't get what I want:\n\n* Learning/reflecting from past experiences\n\n* Stopped relying on other people for my happiness and started doing things that make me happy, so I can give myself credit for happiness instead of outsourcing it to other people who could make random decisions at any moment\n\n* Lowered my expectations so I have nothing to lose\n\n* Thinking about how the other person feels, so both me and other people benefit, instead of me benefitting off of someone else's expense\n\nNow I'm feeling the best that I have ever have in a looong time. Yesterday I had a fucking awesome day and I can only see things go up from there. However, I feel like I can do better. For years, social interaction to me has felt more like a chore than valuable experiences and it feels easier to just slump back into my chair and play video games, miss social events, and pull away from my friendships. When I did have emotions I have done and said things I regretted, and then thought that not feeling them was the only answer. I'm tired of having the best day of my life, then someone says or does something I don't like and then I end up feeling like shit for the rest of the day. Honestly I feel held back by the pain that I have inflicted on myself my senior year. Hell I may still have toxic qualities to this day, albeit to a lesser extent. I may not be perfect, but I want to let go of all negativity and pain and move on. I see everyone else laughing, smiling, and feeling joy and I want to do the same. I don't even know how on earth those people can hold together whilst still feeling happy. I just want to truly experience everything again, and laugh, smile, cry, and truly enjoy the life that I have been given.\n\nWhat are some further steps I can take to truly experience happiness and laugh again like in the good ol' days, without them interfering with rational decision making?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/miclmc/how_do_i_become_able_to_fully_feel_and_express/", "title": "How do I become able to fully feel and express emotions without interfering with rational decision making?", "social_network": "reddit", "user": "CEO_Of_Rejection_99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1617336665, "permalink": "/r/DecidingToBeBetter/comments/miclmc/how_do_i_become_able_to_fully_feel_and_express/", "nsfw": false, "first_save": 1635436988.85696, "replies_charged": false}