{"id": "t5_2tand_t3_k0c2c8", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Hi guys, first time posting here!\n\nGot inspired by some of your posts and decided to improve my life and be more productive. For example, today I left subs on reddit that gave me no value(inspired by a previous post here). This lead me to look at my subscriptions on other platforms. Left 30+ subs on YouTube, 15+ on Gmail plus started organizing it better with labels. 10+ subs on snapchat plus hide the things I don't want to see. I immediately felt relief regarding those things as I will spend hours scrolling and not really looking at them. There's probably more to do, but it's a start.\n\nLately I have been more productive instead of procrastinating which is odd for me. Don't know if this is cuz I'm unconsciously tired of never getting stuff done. However, this has been like a routine for me now. \n\nA normal day for me:\n- Wake up around 7 in the morning or when my body feels like waking up,\n- Walk around my neighborhood,\n- Do my skincare routine(face, body, feet)\n- Soft stretching (usually during my skincare routine)\n- Make breakfast + brush my teeth afterwards,\n- School + doing all of my homework for the day (9-16),\n- Socializing with my family + plus me-time (16 - 18)\n- Make dinner for the family plus cleaning the kitchen afterwards,\n- Tidy up/clean another room while I'm in the zone,\n- Take out trash if needed,\n- Around 21, getting ready for bed, flossing, shower, skincare routine.\n\nThings I want to add are exercising and reading. Gonna look into where it can fit in during my day, probably in the morning at least exercising.\n\nMight sound silly to some, but I feel proud of myself since I'm the type of person that will procrastinate for DAYS or put in minimal effort.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k0c2c8/i_have_finally_formed_somewhat_of_a_routine_and/", "title": "I have finally formed somewhat of a routine and organized my life", "social_network": "reddit", "user": "fair_ginger", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 35, "down_vote": 0, "creation": 1606246634, "permalink": "/r/DecidingToBeBetter/comments/k0c2c8/i_have_finally_formed_somewhat_of_a_routine_and/", "nsfw": false, "first_save": 1635438252.2846737, "replies_charged": false}