{"id": "t5_2tand_t3_mje2bz", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "Every year my college ask alumni to write letter of encouragement to graduating seniors. I thought I would share what I wrote:\n\n \n\nDear Graduating Senior,\n\nHow’s it going? This may be kind of a scary time at least it was for me. Graduating college has been the most stressful time of my life so far. Up until now, your life has been pretty structured and it's all been about making it to the next year or grade level. Even when you graduate high school, you probably knew you were going to college. But now, you have to worry about finding a job, a new place to live, and paying off student loans if you had to borrow money like I did. You may not even know what city or part of the country you’ll be living in a couple months from now. You may have to decide between grad school or going straight into the workforce and you envy those that seemingly have it all together, but I’m here to tell you, almost no one has it all together when they first graduate school.\n\nI’m going to be honest with you, the first couple of months after you graduate may be kind of difficult. I don’t say that to scare you, I’m just trying to let you know it’s okay not to have everything figured out when you're in your early twenties. You may have to move back in with your parents for a couple of months. You may have to work a job for a while that is not your dream job because believe me, no one is hiring entry level CEOs and that’s okay. You may even struggle to find work at all, I know people who worked temp jobs or did not work at all for a year or two when they graduate college and they’re doing fine now. And by some stroke of luck you land your dream job you may find out it’s not what you thought it was. I know a guy who graduated before me with a degree in electrical engineering who said he wanted to go back to school to be a music teacher. \n\nI know right is stressful but, take advantage of this time even if you don’t know what your next move is going to be. Take time to celebrate this huge accomplishment with your friends and classmates, you may not see them for a while after you graduate. If you are not working full time after you graduate, volunteer or reconnect with friends from high school. Above all, do not worry about the future at this point in your life and always keep your eye open for the next opportunity. It will amaze you how everything has a way of falling into place.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mje2bz/letter_to_a_recent_college_graduate/", "title": "Letter to a Recent College Graduate", "social_network": "reddit", "user": "Think_Tie8025", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1617473985, "permalink": "/r/DecidingToBeBetter/comments/mje2bz/letter_to_a_recent_college_graduate/", "nsfw": false, "first_save": 1635435189.3095927, "replies_charged": false}