{"id": "t5_2tand_t3_jo5tuq", "request": ["947d9c8c-f6f8-421d-ba73-f657e7e11fc4"], "text": "No matter who you are, where you're from, what you look like, what religion you follow, or the colour of your skin, we all live in this world, or at the very least rely on it in some way. It is irrefutable that many places in the world are in an unsteady place currently. With global pandemic, riots in multiple countries, suicide and abuse rates rising, and the US election, things may seem a little grim, and even though life goes on, the truth is, it doesn't, and deep down everyone knows this. No matter if you believe in an \"end time\" like The Rapture or if nothing at all, it is fact that nothing material lasts forever, and at any moment we could be gone, due to natural or supernatural depending on beliefs. But doomsdays and death are not the topic of this post, nor is it to push my beliefs on you. I post this because while there is good in the world, it is currently in shambles, due to stresses, lockdowns, sadness, fear. It is real, and it is undeniable. I have full faith in humanity, i have hope that we can get better, but we have to try. It isn't a matter of who is wrong and who is right, who is good or who is bad. It is a matter of person, of care, of will, of humanity. And so i ask you to begin, i ask you to spread peace, and be a source of positivity and kindness to those around you, i ask you to help others, to make people laugh, to not respond to hatred and toxicity with hatred and toxicity, but kindness, i ask you to forgive and move on, but never to forget, to be better than you were yesterday, to help others be better than they were yesterday, to encourage others, and to spread this message, read it, post it, recited it, it does not matter to me. Credit or no credit, i do not care, just spread it. Spark change in the world for the better, if not for me, then for you, if not for you, then for someone else. Please. Don't wait to do so. Remember that change happen over night, but dont let that discourage you. Keep in mind that change doesn't start tomorrow, change starts today. Everyone, no matter who, has the capacity to change, everything has the ability to get better, but there must be change. And Unless someone like you, some extraordinary, or amazing, or talented, or average, or even below average person, Unless someone like you, cares a whole awful lot, nothing is going to get better... Its just not.\n\nAnd though I do not know if this will actually spread, i hope it does, i truly have faith in humanity.\n#Unless", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jo5tuq/unless/", "title": "Unless.", "social_network": "reddit", "user": "speedysnel", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1604526724, "permalink": "/r/DecidingToBeBetter/comments/jo5tuq/unless/", "nsfw": false, "first_save": 1635437971.0695055, "replies_charged": false}