{"id": "t5_2tand_t3_ket93f", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I see a lot of people— teenagers; adults; and so forth— who just easily give up on their dreams. I ask myself, how do I make an impact on this world? How will I inspired others? And I realized, I must prove myself and stay resilience and persevere, despite the odds are not in my favor. I see some teenagers who's posting that they're \"hopeless\" and some is \"depress.\"  Yes, pursuing your dreams maybe a long narrow road... You can be poor,  you can have uneducated parents, you can have broken family, you can be a late bloomer, and so forth... But what's the point? Don't give up, your life, yes your life is your only message on this world... Make sure its inspiring, that can inspired thousands of people, or perhaps, millions. And, to quote Prof. Stephen Hawking, there should be no boundaries to human endeavor. We are all different. However bad life may seem, there is always something you can do, and succeed at. While there's life, there is hope. We aren't here on this world for \"success\" and \"triumph\" We're here to make our own legacy— to make something that will live on after you died— and that's your life... The story on how you overcome and conquer all of the odds and obstacles you have. Me, I was bullied for almost 5 years during my grade school— they called me gay, and sometimes they beat me up— and besides from that, I was also mediocre student who failed on different subjects, even my favorite subject, science, I don't know how to perform basic mathematics... In short, im late bloomer... I don't see any point on my life when I was on fifth grade. And when the expectation reduce to zero, I decided to do major leap that radically changed my life... And that's when I was in sixth grade, where I wanna prove to my classmate that they're wrong and I can be smart, through resilience and perseverance... And I entered first year high school, and putt a lot of efforts in my fascinated field— and that's cosmology, my passion ever since I was young— and now excelled academically... And I wanna inspired others, I wanna be a glimmering light in the midst of darkness, I want to give hope to those people who's victim of bullying... And that's why I keep striving and deal with my imperfections/ failures to thrive... Yes, it might seems impossible, but by breaking the limits of human imagination, you'll change the world and inspired millions of people. And your name will be engraved throughout history... It might seems impossible until someone did it, and that's you, be the first, be brave, overcome the odds, it can be done.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ket93f/those_people_whos_giving_up_on_their_dreams/", "title": "Those people who's giving up on their dreams because of their failures and imperfections", "social_network": "reddit", "user": "Matrix_DJ_RJS", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1608191911, "permalink": "/r/DecidingToBeBetter/comments/ket93f/those_people_whos_giving_up_on_their_dreams/", "nsfw": false, "first_save": 1635436518.804676, "replies_charged": false}