{"id": "t5_2tand_t3_dr1xd7", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "The other day I was sitting next to a guy at the hotel lobby. He was talking to his partner on FaceTime.\n\nThe conversation went on for 2 hours. And in that two hours he must have asked at least a hundred \"why\" questions. It sounded HORRIBLE!\nIf I was at the receiving end of the questions, I would have wanted to hang up from the 5th why, if not, then earlier.\n\nThe reason it perked my interest is that I love to ask why. And until now, I never thought there was anything wrong with it, even though I've been told before that my why questions were uncomfortable. People received them as accusatory, when the reason I was asking was to genuinely understand because I was genuinely interested. \n\nAnyway, since that enlightenment at the lobby, I've gone on Google to understand why \"we\" don't like the question why. \nIt was an eye opener. But what's more shocking is that I have actually done a similar research online after realizing my SO's difficulty answering my whys. The information I gained.at the time is the same as the one I regained on this recent research. Only difference is, now I really want to change, vs before the information was in one ear and out the other, so to say.\n\nI guess the reason for that is, now I \"feel\" what is wrong, whereas before I genuinely thought there was nothing wrong with it, and that people felt the way they did because they didn't know how to communicate.\n\nI've had a similar enlightenment several years ago when I was listening to a casual, brief phone conversation I'd had on the phone with a friend. It was a conversation that was inadvertently video recorded. \n\nListening to the conversation, I hated myself! I couldn't belive that was me. I didn't sound pleasant, although during the conversation, I was genuinely feeling pleasant, and the person I was speaking with was a really good friend. And there was nothing serious about the conversation. It's how I usually speak. \nListening to myself, I come across (to myself) as sort of pompous, which I definitely am not.\n\nHad I not happened upon the recording, I would have never known. \n\nSo now I realize, how I am being perceived can be the exact opposite of how I intend to be - how I actually think I'm being.\nIt's dreadful because I don't even know it.\n\nSo now I am burdened with two things - how to know, and how to change.\n\nThoughts?\n\nThanks for reading!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dr1xd7/how_can_i_see_myself_from_outside_myself/", "title": "How can I see myself from outside myself?", "social_network": "reddit", "user": "Jaymclee", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1572795121, "permalink": "/r/DecidingToBeBetter/comments/dr1xd7/how_can_i_see_myself_from_outside_myself/", "nsfw": false, "first_save": 1635437697.3549132, "replies_charged": false}