{"id": "t5_2tand_t3_p67blm", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "b69cf201-6737-4217-b486-9096135546b8", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": " The world now is so variable that it\\`s complicated to stay certain and calm. I can\\`t even read the news without the risk of getting down. I found out how to calm down during my Eastern philosophy course at university. Today I would like to share my finds on behalf of a Chinese hero and thinker - King Wen of Zhou.  \n\n\nHello! My name is King Wen of Zhou, so-called “The Civilizing King”. I spent a decade of my life imprisoned by my enemy. However, I didn't drown in fear and anxiety. This experience helped me to create the Philosophy of Changes (Yijing).\n\nThe years of guessing - \"will I be executed tomorrow or not\" - helped me to train the ability to confront uncertainty.\n\nAccording to the Philosophy of Changes, human exists between heaven and earth, in the area of changes, which are stages on the way to perfection, to the Truth, which in the Eastern philosophy named Dao\n\nThere is a key to deal with uncertainty in this teaching that you can try - being conscious. Cherish the past, plan the future, but focus on the present.  \n\n\nHow to apply it to your life?  \n\n\n**- Be conscious about every second**  \n\n\nDon\\`t mix up awareness with productivity or broad control. Being conscious means honestly asking yourself and honestly answering to yourself.  \n\n\nWhat and why am I thinking of just now?\n\nWhat and why am I feeling just now?\n\nWhat and why am I doing just now?  \n\n\nIf you skipped those questions, I encourage you to return and answer all three right now. Don't wait for an ‘appropriate’ moment.\n\nDon't be shy or embarrassed about your inner or outer state - there is no one here except you. You feel awkward because of the side glance from the stranger in the metro? It's okay. You overthink the misprints you did in the formal letter to your client? It's fine. You're laying on the sofa and read this lesson? Amazing.\n\nThe first step on the path of change is accepting. And you just made this step.\n\nStay connected with the world. And the world starts with your surrounding.  \n\n\n**- Connect with nature**  \n\n\nCome to the window, open it, and sense - the wind, the heat, the sounds, the colors.\n\nNotice the changes around, watch and see the movement. The Philosophy of Changes says: “Look around - nature renews, seasons change, but there is no place for uncertainty or rupture.”  \n\n\n**- Connect with people**  \n\n\nRemember, how often did you take people around you for granted? And how often did you regret it later? The Philosophy of Changes teaches us: “Manifest the Dao in kindness to mankind, maintain it in your actions.”\n\nMake a call.  \nShare something helpful.  \n\n\nNow, as you did these three exercises, you made a great step toward a better version of yourself. You had a chance to increase awareness, connect with nature and people.\n\nYou can't imagine how it may change your life in the future.\n\nThe Philosophy of Changes teaches us that uncertainty is an essential part of the Universe, which comes from changes. Try to practice the exercises every time it recalls, and become more and more conscious about your life. Once it becomes a habit, you will ask yourself automatically, your awareness will be your armour, your sieves of truth.\n\nChanges are irreversible so deciding how to live with them and learn from them is necessary.  \n\n\nStay strong! \n\n&#x200B;\n\nP.S. If you liked this exercise, I have written more lessons like that. Just in case you **are curious to explore more**, let me know and I will share **the** **other lessons** in DM.\n\nThe themes I cover are: getting disciplined, reducing anxiety, learning about your life values, decision-making, the art of happiness, and being present in the moment.\n\nThe lessons are based on the primary sources of wisdom from more than 2500 years of history of philosophy: Plato, Aristotle, Lao Tzu, Carl Jung, Stoics, and many others.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p67blm/i_was_tired_of_being_anxious_so_i_found_a_way_to/", "title": "I was tired of being anxious, so I found a way to beat it. I got comfortable with my anxiety", "social_network": "reddit", "user": "RevolutionaryGrab113", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1629217744, "permalink": "/r/DecidingToBeBetter/comments/p67blm/i_was_tired_of_being_anxious_so_i_found_a_way_to/", "nsfw": false, "first_save": 1635435786.9416287, "replies_charged": false}