{"id": "t5_2tand_t3_mw7qz5", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "802203c7-ca80-4c23-ad08-f571694cfc55", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Hey fellows,\n\nWe've all been there. Pursuing someone who didn't seem to share the same feelings. Looking forward to the precise moment of achieving our long desired goals, only to realise that the very process of achieving them was much more satisfactory than the achievment itself. Saving money to buy a new fancy cloth just to find out that it lost its shine as soon as you got accustomed to it. Imaginative power of strong desires creates an illusion that their fulfillment is all we need.\n\nStoicism views most of self-inflicted sufferings as driven by those illusions of our mind. Stoics acknowledged and examined such irrational, destructive tendencies of the mind that each of us has observed in ourselves and others. Lust or exessive desire is one of them.\n\nLust is an irrational desire or pursuit of an expected good. The Stoics divided rational and irrational desires based on their \"natural\" or \"unnatural\" character. We, as human beings, have two kinds of needs. Some of them have natural limits. These desires are finite and can be fully satisfied with relative ease. They can recur, so the satisfaction isn't permanent. But the measure of them is transparent and sustainable. We desire to eat until we aren't hungry, desire to drink until we aren't thirsty. The same thing that satisfied us yesterday can do it today too.\n\nOther needs, such as the wish for status, wealth, or fame, are the product of our social environment that stimulates the desire for things that we don't actually need. Remember the last time you bought that sexy pair of sneakers because you thought it would make you look fabulous. Desires of this artificial kind are never quite satisfying. Because they aren't linked to a particular need, they have no natural limits. Their fulfillment isn't as pleasing as we imagined, and we must always pursue newer and bigger objects.\n\n**There are mainly five ways in which unnatural desires give us empty promises:**\n\n1. **We're never satisfied with what we have and always want more.** The Stoics observed that getting what we want never feels as good as we imagined it. This only makes us want more. New desires appear and replace those that are already fulfilled. Our minds seem to have a desire for desire itself and buy into the illusion that fulfilling a desire will bring us to an endpoint. However, the end never arrives, and this cycle starts all over again.\n2. **We most desire what we do not or cannot have.** By some perverse force within us, the more distant and unattainable the object is, the greater is our desire to have it. We've all been there. As soon as someone we liked started pulling away, it only made us want them stronger.\n3. **Pursuit of a thing is more pleasing than the possession of it.** Another deception identified by the Stoics: when we work toward a goal, we imagine the happiness that its attainment will bring. But the pursuit itself turns out to be more enjoyable than the capture of the thing pursued.\n4. **Possession of a thing and familiarity with it tend to produce indifference or disgust.** By nature, we humans are not easily contented with our circumstances. By nature, the moment we possess something or get what we want, our minds begin to drift toward something new and different, to imagine we can have better. Possessing a thing tends to bring about indifference towards it.\n5. **We mismeasure the value of what we have or don't have by comparing it to our expectations or others' possessions.** Fulfillment of our desires fails to satisfy in part because we measure our satisfaction with what we have by comparing it to what others have. It is always possible to find some who seem to be ahead of us or to have more than us, and those tend to be the only comparisons we care about. Everyone can be envious of somebody – if not of one who is achieving more, then of one who is achieving something else.\n\n**Being aware of these biases, always ask yourself whether the object of pursuit is really worth it? Is it useful for your long-term goals? Imagine already having it. Does it bring the real value to your life besides the very pleasure of attainment?**\n\n&#x200B;\n\nP.S. If you liked this exercise, I have written more lessons like that. Just in case you **are curious to explore more**, let me know and I will share the link to **other lessons** in DM.\n\nThe themes I cover are: getting disciplined, reducing anxiety, learning about your life values, decision-making, the art of happiness, and being present in the moment.\n\nThe lessons are based on the primary sources of wisdom from more than 2500 years of history of philosophy: Plato, Aristotle, Lao Tzu, Carl Jung, Stoics, and many others.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mw7qz5/how_to_stop_being_the_slave_of_own_desires_use/", "title": "How to stop being the slave of own desires. Use these 5 laws to finally see how your desires fuck you over", "social_network": "reddit", "user": "Sviat-Hni", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1256, "down_vote": 0, "creation": 1619106577, "permalink": "/r/DecidingToBeBetter/comments/mw7qz5/how_to_stop_being_the_slave_of_own_desires_use/", "nsfw": false, "first_save": 1635436705.886277, "replies_charged": false}