{"id": "t5_2tand_t3_cn6vq6", "request": ["311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "In fact, for the sake of organization, I would say that *anxiety* and *stress* are TYPES of fear. So for now I'm just going to talk about fear, but you'll know what I mean. Replace the word in your head with whatever makes sense.\n\nI have a way to reduce and release fear! I've been working on this for a little while, it's incredibly effective for me and people that I work with - I hope this also serves you.\n\n# How to Release Fear\n\nFirst off, *it doesn't have to be complicated, or take a long time*.\n\nWould you be willing to allow that? There's a chance that you're reading this now, and you're committed to this idea that you need lots and lots of time, skill, focus, and help in order to release fear to a satisfactory level. I honestly beg to differ, and I'll tell you why.\n\nAs said in my title, at it's core, fear is simply being faced with an unacceptable potential outcome. In other words, we experience fear if we believe that something bad might happen to us. Period. What's funny is that in all moments, including this one, there is absolutely a risk of bad things happening! For example we could be hit with asteroid RIGHT NOW. Or at any moment. Any one of us could get robbed or attacked on any given day. We could get eaten by a tiger that escaped the local zoo.\n\nFor any bad thing that could happen to us, there's a range of likelihood. For example, getting eaten by that tiger is 0.000001% percent. A little bit higher for something like cancer or heart disease.\n\nBut when we're *afraid* of something, it's seeming probability is magnified! It goes from being unlikely to likely to near-about guaranteed.\n\n**On some level what we're afraid of represents the end of the road; it represents death.**\n\n... And I'm talking about everything, the fear of failure, the fear of awkwardness, the fear of judgement, fear of abandonment, fear of loneliness, and anything else. Whatever it is that we're afraid of, on a deep level, is unacceptable. Not okay. Simply cannot be allowed.\n\n# The key is to do everything in your power to make yourself safe, stable, well and prosperous... and then to allow whatever wants to happen, to happen.\n\nIn other words, let all the unacceptable outcomes be acceptable! Let them be okay. If you're going to go ice-skating, you don't want to fall down, you'll do your best not to fall down... nevertheless there's risk that you will fall down. Let it be okay. If it happens, it's fundamentally alright.\n\nAs soon as you bring acceptance to potential outcomes that are NOT acceptable... **then there's nothing left to be afraid of**.\n\nTruly, the experience of fear is several times worse than the actual feared event itself. The event has a start and a finish. The fear, however, goes on and on and on. It takes over your mind, it hypnotizes you, causes you to think and think and think about it. As if thinking about it makes you safe from it! As if it gives you even the slightest bit of protection from that asteroid!\n\n# Accept that which is unacceptable, this is the key to ending fear.\n\nAnd with the fear gone, the anxiety and stress now gone, you're so much more *sober* and clear to grapple with your present situation in the most intelligent possible way.\n\nRemember, this is an easy and quick method. The only thing that is seemingly difficult is that you are required to face your fears fully and completely *without attacking them or retreating from them... simply standing right there to experience it completely.* This is the way out.\n\nThat's all!\n\nBrent Huras Coach  \n(Did this make sense? I'm around for any questions or clarifications.)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cn6vq6/anxiety_stress_fear_are_all_what_happens_when/", "title": "Anxiety, stress, fear are all what happens when faced with an unacceptable potential outcome.", "social_network": "reddit", "user": "brenthuras", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1565190046, "permalink": "/r/DecidingToBeBetter/comments/cn6vq6/anxiety_stress_fear_are_all_what_happens_when/", "nsfw": false, "first_save": 1635437885.7736723, "replies_charged": false}