{"id": "t5_2tand_t3_n8dxds", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I have had a lifetime of trauma, and the suppression methods to “get by”.\n\nFor too long, it was glorified by me internally until a huge wake up call yesterday morning. 2 hours before my shift, I did an IV mix of morphine and heroine. I am inexperienced with using such drugs. My friend’s text to me while I was in the ER, who was there at the scene, was awful to read. If he didn’t have Narcan on him, I wouldn’t be able to communicate to this to y’all now. The paramedics arrived 8-10 minutes after I went cold. 16MG altogether was needed before I got to the hospital.\n\nI have struggled with addiction since my biological mother passed when I turned 15. I have no relationship with anyone I am related to for various reasons, but it all boils down to my safety. My best friend’s family took me in, but LGBT community is not accepted for them. Grateful nonetheless. We are close in our own ways, but it is hard. After a tempestuous 3 years, the love of my life kicked me out of our home and she is moving across the country to get a doctorate. I’ll never see her again. \n\nI think deep down I knew why I started experimenting with these drugs. I told myself I wasn’t capable of love or being loved. I was no one. Despite the brutality of these things and others — enough was enough.\n\nI have a 3rd poetry book coming out in fall. I will begin graduate school for library science then, too. However, and read this closely: you don’t need these seemingly “outstanding” goals to know you are worth fighting for, for yourself. What interests you? What excites? Who could you use a hug from? Which sights calm?  What things could use improvement? As for me, I can learn how to live for myself and those who care for me.\n\nI beg you — please use great caution when using these drugs, or just seek help. “Terrified” is truly minimizing to describe waking out from being a corpse.\n\nDecide to be better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n8dxds/yesterday_morning_my_body_turned_cold_from_a/", "title": "Yesterday morning, my body turned cold from a heroine overdose. I was discharged today. I will be doing NA, continued therapy, and finally learning to live.", "social_network": "reddit", "user": "therottenfruit", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 282, "down_vote": 0, "creation": 1620565752, "permalink": "/r/DecidingToBeBetter/comments/n8dxds/yesterday_morning_my_body_turned_cold_from_a/", "nsfw": false, "first_save": 1635435787.7730267, "replies_charged": false}