{"id": "t5_2tand_t3_cens3d", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Just for starters, I was never bullied or excluded in high school, which was 1 year ago (I just finished freshman year in college). Its just that I had this whole plan of how I wanted my high school experience to be grand and memorable, with lots of friends, and I blew it. Before I was resentful at others and the situation, but now that I had time away from high school, I cleared my mind enough to realize that I was the problem. I was quiet all the time and my interactions with people were friendly, but nothing more than that. I was never really part of a friend group, because I didn't find myself being able to tolerate anyone - everyone annoyed me somehow. Now I realize that if I gave them a chance and didn't get so annoyed, I would have actually made better friends. I also did not try that hard with my grades and with my Cross Country running. My grades were good (barely) and I wasn't able to catch up with the other runners my grade - while they got faster, I didn't improve that much. I also didn't really do that many extracurriculars, and overall did not really do that much. Didn't feel like going out on friday nights or hanging out with people. I now know the problem, and hopefully I can find the motivation to fix my problems going forward.\n\nBut just now I was looking through some old pictures of high school - and I simply feel angry and frustrated at what could have been. I saw people I was friendly with hanging out with their close friends and having fun, and people taking part in several school events. It resurfaced a lot of my frustration I had at the end of senior year, which is when all these feelings began. \n\nI need help. How do I stop being salty about this? How do I just learn from it and move on?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cens3d/how_do_i_stop_being_so_goddamn_salty_over_my_high/", "title": "How do I stop being so goddamn salty over my high school experience?", "social_network": "reddit", "user": "XxItsNowOrNever99xX", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1563424228, "permalink": "/r/DecidingToBeBetter/comments/cens3d/how_do_i_stop_being_so_goddamn_salty_over_my_high/", "nsfw": false, "first_save": 1635437679.6393101, "replies_charged": false}