{"id": "t5_2tand_t3_kvcxxu", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "So I have this app which allows me to set daily recurring tasks (it's called Todoist but I'm sure there are others like it). You can also set up projects. In mid December I started working on my '2021' project with all my goals for the new year. One of the things I have been struggling with for quite a while now is negative thinking. I get highly affected by stressful events at work and in my life, often becoming anxious. In particular, in the second half of last year each Sunday I'd feel this rising wave of anxiety, not wanting to go back to work on Monday (even though objectively my current job is really decent), thoughts spiraling around things that could go wrong.\n\nTo combat the above, I wanted to include something actionable in my '2021' project that would help me work towards the goal of developing healthier, more positive thinking patterns. This was largely encouraged by the format of the app which makes adding recurring tasks really easy. So I set myself a daily task: re-frame a current challenge or worry in a positive way.\n\nI use the app for lots of other stuff too, so I check it daily, and I'm highly intrinsically motivated to cross off all the tasks each day (perfectionism helps in this instance). For about 3 weeks now I have spent about a 2 minutes each day thinking about the things that are stressing me out, then analysing them in a more objective way and saying to myself, like I would to a friend, why it's not really that bad. Going to work? It's how I get money to pay for things I want, and continuous employment is better for my CV. Plus it's really not a bad job. Ridiculous problems with returning something I bought? It's entirely insignificant, and makes for a funny story to tell. I try to turn obstacles into challenges - opportunities to improve, but in some cases simply seeing the problem from a more distant perspective is enough.\n\nWhat I've noticed so far:\n\n1. I feel less stressed. Note that this could be due to having had a Christmas break away from work, but it may be that identifying and addressing my worries each day has actually stopped the all-encompassing and vague feeling of 'stress'.\n2. I'm starting to run out of things to 'address' each day. Some days I have to think long and hard about whether there's even anything I'm currently worried about or anything that I find challenging. Before, things seemed stressful or bad continuously.\n3. If a new worry arises on its own, with that feeling of tightening in my chest & belly, my initial reaction is to analyse it to see how it's not so bad. I think this is because each day I've been 'summoning' these anxious feelings and then immediately trying to re-frame them in a positive light, and it's starting to become my mind's knee-jerk reaction to this kind of emotional state.\n\nI'm not sure this would work for everyone, or whether it will work for me long term. I'll add that I used to be naturally much more mentally resilient years ago, then I guess that being an adult happened and I lost a lot of the grit. But this seems to be beneficial. I also added a daily tasks where I identify something to be grateful about each day which has been helpful, too. Just wanted to share it in case it might help somebody - or perhaps you can share some related tips!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kvcxxu/a_daily_recurring_todo_list_task_is_helping_me/", "title": "A daily recurring to-do list task is helping me change my thinking patterns", "social_network": "reddit", "user": "OutdoorHedgehog", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1610401494, "permalink": "/r/DecidingToBeBetter/comments/kvcxxu/a_daily_recurring_todo_list_task_is_helping_me/", "nsfw": false, "first_save": 1635435476.2395062, "replies_charged": false}