{"id": "t5_2tand_t3_kgpics", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I think I'm starting to get sick of my procrastinating life. I'm kidding, I'm sick of my procrastinating life. Some backstory: I'm a lazy, procrastinating teenager who can't even follow any help that I beg for, I don't even follow the advice people on Reddit give me. I also got banned from a discord server for posting suicide threats over the past, 12/17/2020 was when I was banned from Finding Yourself Again for trolling and mocking mental health, even though I wanted to end it and I think I still do but idk. Anyway, I have failed my parents and my sister, I have no girlfriend, I have no friends. I'm ugly and I'm skinny, Idk what to do. I do my homework but I don't study for AP Human Geography and the ACT/SAT. I've said out loud many times that I want to end it, but I don't do it.\n\nOk, done with backstory. Now, I need to stop doing these things because it's really starting to eat away at my dreams. I want to get a lot of things done during high school, so I can be prepared for college and beyond. I'm wanting to get physically fit, I'm wanting to get back into martial arts and also just exercise in general, do bodybuilding. I've been wanting to get into the marines, but I want to do a marine lifestyle sort of thing at home since I'll be useless in the marines, but I want to be capable of fighting and be like a bodybuilder. I did karate for 7 years but I want to do martial arts to learn how to fight, not get promoted. Knowledge is also important. I've been wanting to get a really good score in the ACT and the SAT so I can get a good score and get into a good college. Same for AP Human Geography. I was originally wanting to become a doctor, but game development and art really sparked my interest as I've been a creative person in general. I'm wanting to become a smart person so I can help educate myself and my kids when I'm older, become a good person. I'm wanting to learn good habits and good morals in general so I can become a good person and a good father and husband to my wife and children. I've been wanting to do game development, art, and animation for a long time, I've wanted to get awards and get recognized for my work. I'm going to become these things no matter what, I need to know things that will save my life.\n\nAnyway, I think that's pretty much it, one more thing is that I also want to get a 5 on AP Human Geography. I want to become a better person and I'm sick of sitting my lazy butt while opportunity and change pass me. I'm 15 years old (male) and I'm wanting to get friends and a girlfriend (someone who loves and cares for me). I will do it, no matter what. I will achieve my dreams and achieve a new, better self. Anyway, I'm going to bed. It's 12:11 AM (now 12:12 AM, actually now it's 12:31 AM 12/20/2020) and I'm tired. Goodnight!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kgpics/how_do_i_get_disciplined_i_need_help/", "title": "How do I get disciplined, I need help.", "social_network": "reddit", "user": "Drblackcobra", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1608447250, "permalink": "/r/DecidingToBeBetter/comments/kgpics/how_do_i_get_disciplined_i_need_help/", "nsfw": false, "first_save": 1635437558.4010344, "replies_charged": false}