{"id": "t5_2tand_t3_n4xdlk", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I was born in 2002. Most of childhood and adolescence, I spent my time on video games and youtube. I was a pretty artistic and smart kid looking back. I liked acting, singing, and drawing cartoons, so I got an arts-focused education. But early on, I discovered video games, and later, youtube. It became a fixation. It was all I cared about doing. \n\nMy parents paid for all kinds of lessons and classes in the arts over like 5-6 years but I would never practice. I just wanted to play Mario Kart or watch top ten facts videos. Everything else was too challenging and pointless in my little mind. I cringe thinking back. All of that time wasted on shit that I quite literally couldn’t care less about now. All of that talent I could have had. Tech can be so addictive for kids, but my parents just liked to see me having fun, I guess. I wish they’d disciplined me more, being perfectly honest, but I love them to death and can’t possibly blame them, so I don’t. \n\nI am now 18. I have been diagnosed with ADHD. I’ve grown out of video games, which I’m happy about, but now it seems like getting dopamine from an Apple Device is all I know. Everything else is too difficult and under-stimulating, so I never leave my comfort zone. I get exhausted from mental effort so easily. I feel so underdeveloped and passionless.\n\nI want to read books, and find new music. I want to expand on my skills like writing and music production. I want to practice things. I want to be curious about life’s mysteries. I want to be able to do homework without giving up or procrastinating. I have so much I want to do but it feels like it isn’t wired into my brain to enjoy or attempt those things. I don’t even watch movies for fuck’s sakes! Too much of a commitment. Back to youtube, reddit, and instagram. Quick, snappy gratification. \n\nI seriously just want to replace my iPhone with a flip-phone and block sites on my MacBook but massive, sweeping changes and “dopamine detoxes” can cause mental health issues apparently, and don’t often work. I also kinda like being up to date on pop culture and news. Maybe this is all just rationalization, idk.\n\nIs there anyone here who overcame this kind of technology addiction? How in God’s name did you do it?\n\nIs there a kind of therapy that could help phase out a deep-rooted fixation like this, and get joy from other aspects of life? \n\nIs this an unrealistic goal? Like am I being true to myself with this?\n\nThanks for reading. I’d really like to get you guys’ thoughts on this. I feel so unsure of my next steps.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n4xdlk/i_have_been_addicted_to_technology_from_an/", "title": "I have been addicted to technology from an extremely young age and I need to undo this damage.", "social_network": "reddit", "user": "MinionIsVeryFunny", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 35, "down_vote": 0, "creation": 1620160155, "permalink": "/r/DecidingToBeBetter/comments/n4xdlk/i_have_been_addicted_to_technology_from_an/", "nsfw": false, "first_save": 1635437309.8056638, "replies_charged": false}