{"id": "t5_2tand_t3_qexkq5", "request": ["f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "My sister and mum today were crapping on me for increasing my calories by adding in fairlife milk and eating more. They were condescending and rude, claiming I was eating way too much fat (I'm eating literally 60g of fat a day or less) even though they know I was super underweight and it's been a massive struggle for me to gain weight and I've been depressed for years because of it. My mom is straight up obese, and my sister is underweight in a similar way to how I used to be. I hate how they act like they know better than me, those two have never even tracked their diets, they don't understand micronutrients or macronutrients, CLEARLY because they eat literal garbage, and they're both sedentary. Also, even if I drank an eintire carton (1.5L) of fairlife, if you plug it into chronometer, it's very clearly still well within my macros, and calories. Like bruh. People suck, they don't understand, and they'll crap on you for doing something different. Best part is, I'm better. I'm so much better. I used to be 118 pounds like four years ago, and now I'm almost 160, I have energy, I'm productive af, I've been getting stronger in the gym, and I'm genuinely convinced that they're just jealous. My dad was supporting me, telling me my muscles have grown and even saying once his current overtime grind at work he'd start going to the gym with me because he's seen me get stronger and stronger.\n\nLong story short. People will hat on you when you start improving, while they can't get out of bed before 12am and cry about how weak they feel.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qexkq5/some_people_will_try_to_stop_you_and_you_cant_let/", "title": "Some people will try to stop you, and YOU CANT LET THEM WIN", "social_network": "reddit", "user": "Fastpas123", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1635098881, "permalink": "/r/DecidingToBeBetter/comments/qexkq5/some_people_will_try_to_stop_you_and_you_cant_let/", "nsfw": false, "first_save": 1635438388.1870463, "replies_charged": false}