{"id": "t5_2tand_t3_q5fvqi", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "English’s not my main language, so apologies if anything is wrongly expressed. It’s the first time I’m getting all this out. \n\n\nI’ve been taught I never had to share my burdens, but honestly this past few months it’s just too much to carry without my head blowing up. \n\nEver since I started high school I’ve struggled with very high social anxiety and depression. I couldn’t approach a girl, couldn’t face any socially charged environments so I’d prefer to be home. My anxiety manifests in weird social interactions, shaking hands, sweat? And inability to speak at times. Naturally I was made fun of, time passed and somehow a video of me blew up on the internet, I was getting so much social attention I started pretending I was someone else to please the newly added social interactions. Truth is I became a version of me I didn’t recognize. After that... I started struggling with alcohol, women, drugs and it all went down hill. Now for some reason I’m battling a dopamine addiction with social networking, it’s like checking every 5 minutes craving for attention. I feel worthless, yet, there are people that look up to me. I don’t understand. I feel numb to everything, don’t have friends at all and now that I feel my family needs me, well I’m just the kid that lost 2 semesters of his college career cause he can’t figure out what’s missing. It’s to a point where nothing has a deep meaning, i don’t feel attachment, no sense of care for someone that I should", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5fvqi/my_strange_addiction/", "title": "My strange addiction...", "social_network": "reddit", "user": "ricepreme", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1633897190, "permalink": "/r/DecidingToBeBetter/comments/q5fvqi/my_strange_addiction/", "nsfw": false, "first_save": 1635436780.4363382, "replies_charged": false}