{"id": "t5_2tand_t3_gqpwuu", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Well folks, last night the anxiety was so high. I was scared I was gonna get institutionalized and get cut off from my daughter, I was scared the doctor was going to say there’s nothing wrong with me, I was scared to go by myself.\n\nExcept, I wasn’t by myself. I felt like I had a line of 25000 strangers, giving me a pat on the back, encouraging me forward. I had to delete the post, it had gotten so popular that I kept getting DM’s of people telling me to kill myself, calling me a karma whore, you know usual reddit stuff. I also have RL friends on reddit that I really didn’t want seeing that. I knew it was just the depression doing this to me, telling me to look at the negative. How could I let a few bad apples ruin it for the 25k people that were showing support? I wasn’t allowing those negative feelings to take over again. Couldn’t sleep last night because of the whole thing being a little too much attention for me, but I did it. No sleep, I walked my ass 40 minutes to go to the hospital. I can do this.\n\nI spoke with my doctor, I told her how I was feeling. It was maybe a 5 minute, brief to the point conversation that ended in her telling me I need to be on anti depressants ASAP. Turns out all my worries and anxieties were just making it out to be so much harder than it ended up being.\n\nWhile I can’t come here and say ‘I’m cured’ and everything is fine and dandy now, just making those steps helped so much. Finally deciding to do something for ME. Just the fact that I could now face my problems and get some help is a huge confidence boost, and I have Reddit behind me so I’m not alone anymore.\n\nMy doctor says my meds may take a week or two before I notice anything. My war with depression is only starting, and I know I have a long way to go but I’m not giving up until this is over, my daughter deserves a dad who loves himself and cares about himself just as much as her.\n\nFrom the bottom of my heart, thank you reddit strangers, and you guys didn’t even see all the DM’s I got full of people offering their support, their ears, and their hearts to me if I wanted to talk about anything.\n\nAs a final note, if you guys are feeling depressed or suicidal, see a doctor. Don’t let anxiety and depression stop you or make you scared, it’s all a show. Depression and anxiety lie all the time, and it can be hard to see through it sometimes but you just need to pull that curtain back, see it for what it is, I get better.\n\nCheers", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gqpwuu/update_one_upvote_and_ill_admit_myself_to_the/", "title": "(UPDATE) one upvote and I’ll admit myself to the hospital for my depression", "social_network": "reddit", "user": "Yoshistrider", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3542, "down_vote": 0, "creation": 1590465876, "permalink": "/r/DecidingToBeBetter/comments/gqpwuu/update_one_upvote_and_ill_admit_myself_to_the/", "nsfw": false, "first_save": 1635435886.4740913, "replies_charged": false}