{"id": "t5_2tand_t3_mu86sy", "request": ["e234981c-b061-4d83-8134-70d441847f74", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Original post https://www.reddit.com/r/DecidingToBeBetter/comments/mq02sk/i_need_to_change_i_want_to_be_a_light_to_everyone/\n\nDisclaimer: this post is for my personal use  and record, However comments, advice and encouragement are welcome\n\nI definitely got ahead of myself, it is very easy to change my mentality and say things that sound good but it’s hard to put it into practice when i have spent so much time not being the person I want to become now.\n\n\nMy Anti-social personality is definitely working against me HARD. I went to Florida with my family and I tried really hard to socialize with them, but I just stay quiet. It’s very frustrating.\n\n\nI think most of it was because of my family’s religion(Christianity) mainly my older sister. I won’t go into detail, but I get extremely tired and discouraged of hearing them talk about Jesus and I don’t want to argue with them about what I’m feeling because I know I would get backlash from my sister. (Just to be clear, I  believe I’m god but it’s hard for me to respect him and that is the reason why I’m not a Christian).\n\nSaw a lot of comments suggesting  I work on myself(among other things) before I do anything else, so I think that’s what I’m going to do first\n\nMy plans for this week are too\n\n1. Start a diet and begin eating healthier\n\n2. Get back into the gym\n\n3. Look into volunteering\n\n4. Talk to more people at my job\n\nI think one plan for the entire month is too seriously think about where I’m going with religion, if I just keep putting it off and flip flopping on what I’m doing, it will screw me over in the long run.\n\nThe fact that I want to give up so soon really worries me. Was my resolve really  that weak? I’m not completely beat yet so I’m still trying for it. I don’t think my feelings about being a light to others were fake, but it’s like I’m going in blind and it’s discouraging. \n\nI’m hoping this week will be different", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mu86sy/becoming_a_light_i_already_want_to_give_up_week_1/", "title": "Becoming a light: I already want to give up (week 1 progress)", "social_network": "reddit", "user": "Diggydog323", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1618859870, "permalink": "/r/DecidingToBeBetter/comments/mu86sy/becoming_a_light_i_already_want_to_give_up_week_1/", "nsfw": false, "first_save": 1635437529.3082063, "replies_charged": false}