{"id": "t5_2tand_t3_pupcph", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "It was posted by an anonymous user on 4chan and then it was reposted to Reddit. Here we go —\n\nMany are afraid of taking action because it is painful. Washing the dishes in the sink isn't fun. Waking up early and going for a run sucks. The discomfort of constructive action often paralyzes people from doing anything, so they choose to sleep in. The choose to get lost in the rabbit hole of YouTube, Reddit, Instagram — letting the algorithm dictate their next action while their life deteriorates around them. They subscribe to inaction as a solution to avoid the pain of action, subconsciously aware of the fact that their stagnation breeds destruction. By avoiding the pain of action we breed a new pain — the pain of watching our relationships grow cold, our bills stack up, our families grow old. \n\nIt's sobering when you find out that in this life, nobody gets to escape pain. Pain is as much a part of life as death itself. Pain is more common than happiness, as not everyone experiences true happiness but everyone experiences true pain. While this may drive many into nihilism and despair; not everyone realizes that there is a solution: pain can be bargained with. Pain takes from us, but it can also give back — we have to choose the right kind of pain. There are only two kinds of pain: the pain of action, and the pain of inaction.\n\nThe pain of action is blunt, in your face, and forces you to grow. This is the pain that gives back. For every hour we suffer through sharpening our skills, saving our money, cleaning our house, building our body — we don't reduce the amount of pain we face, but rather, gain strength to shoulder it. By embracing the pain of action, we are simultaneously transformed by it — we become someone we are proud of, someone that others can depend upon, which in turn brings meaning to the suffering.\n\nThe pain of inaction, however, is slow-burning. It softens you, and decays your soul. By \"letting things be\", they disintegrate. By \"letting ourselves go\", we lose self-respect. By vegging out on the couch for days on end, things slowly become disordered, weakened, and deteriorated. Inaction is the holiday of fools, who trade temporary comfort for long-term, all encompassing, existential suffering.\n\nWhile nobody can escape pain altogether, we can use it to our advantage if we choose its healthier variant.\n\nAction is a life-giving breath; inaction is a slow death.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pupcph/this_post_by_a_random_internet_stranger_has_been/", "title": "This post by a random internet stranger has been embedded inside me. I read it every morning.", "social_network": "reddit", "user": "upsalaa", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2181, "down_vote": 0, "creation": 1632507055, "permalink": "/r/DecidingToBeBetter/comments/pupcph/this_post_by_a_random_internet_stranger_has_been/", "nsfw": false, "first_save": 1635435121.5120182, "replies_charged": false}