{"id": "t5_2tand_t3_ag1txb", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I always strive to be the greatest I can be, and for a long time I was really really confident, and I know I'll get back to that place but I think it would be cool to get some opinions on my situation currently.\n\n&#x200B;\n\nI've had a very fun, amazing life.  With as much privilege, happiness, beauty, and love as possible.  But at the moment, I can't seem to forgive myself for everything I do.  I think I've found someone I want to be with for a very long time.  We have the most open communication ever, about anything and everything.  It was all so easy and beautiful in the beginning too.  I met her at the beginning of the semester and we were both very sociable and had a fun little connection.  Then we started hooking up and it was so fun and I would sleep with her almost every night.  Before we were together I told her about a threesome I had, which is what made me realize I loved her because of how scared I was to lose what we had together.  It made me nervous, uncertain of my own feelings, and threw me into the craziest spiraling bout of anxiety i've ever had.  I had done something similar before and it ruined everything but this time I told her straight to her face because of the guilt, and she was completely okay with it.  Since then I've totally annoyed her a ton with the amount of anxiety i've been feeling about us and our relationship and everything in my life.  But she still stayed strong and stayed with me.  She thinks the world of me and I think the world of her, were very open about everything sexually, she has bi curious thoughts about hooking up with a girls and I'm totally okay with it because of how solid our relationship is. Things are really really beautiful between us.\n\nHere's the problem:  Whenever I think of her I get an anxious feeling and it makes me feel like I'm not being myself around her sometimes. Not because of anything but the fear and guilt of everything.  Or maybe not even that, but it's a tightness in my chest that I hate.  And I think about her all the time, every spare second of every day I think about her and it had overcome me at times, and now I can be productive and live my life (which I need to do considering I'm studying abroad in Prague for 3 months in a few days.)  I was down and out, brought myself back up, and learned a ton of new things about relationships with my family and friends.  I have closer relationships than ever before, and everything seem to be going my way.  But I still get this feeling when I think of her and I obsess over it.  And then once I do that I start thinking like I shouldn't be thinking about it so much, and I feel bad for not thinking about my art, friends, and family.  Then when I think of other things I think I'm not thinking about her enough.  And then I think that I've soiled the beginning of our beautiful and fulfilling relationship with anxiety.  And we've had such good memories together and I just judge myself for not being completely elated at the thought of them.  But it's not like I'm completely elated by every other one of my beautiful memories, I just think of them fondly and know that I was happy then.  So why is this so different? Why am I putting so much pressure on myself?  Why can't I just think how I think, feel how I feel, and be happy where I am?  That's how i've been for my entire life and I just feel so weird right now.\n\nI've been working really hard to fix all this, and thinking so hard about everything.  I've started meditating, talking about my feelings with every single person I'm close to including my girlfriend who has been there for me through it all.  I've recently had a big revelation about confidence, and how I should just trust my gut on all this and just stop worrying.  I've started to be productive again, make more art, get the things that I need to get done done.  But I'm still so hard on myself just for the way I think.  There's so much pressure I'm putting on myself to just be completely happy and normal and thinking about the right things and exactly what I need to be thinking about at all times.\n\nI just want everything to go back to normal and level out and I believe it will.  I'm just scared, and I want to see if this all adds up to everyone.  I feel like I've lost myself, and I'm slowly getting it back, but I just want to be able to think what I want, feel what I want, especially now that I'm embarking on what of the greatest journeys of my entire life.  Things are definitely getting better, but I'd love to hear what everyone thinks.\n\n&#x200B;\n\nThank you, and I love you all", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ag1txb/hey_everyone_im_just_wondering_if_im_doing_okay/", "title": "Hey everyone. I'm just wondering if I'm doing okay.", "social_network": "reddit", "user": "straightdoinks", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1547508117, "permalink": "/r/DecidingToBeBetter/comments/ag1txb/hey_everyone_im_just_wondering_if_im_doing_okay/", "nsfw": false, "first_save": 1635437871.4368672, "replies_charged": false}