{"id": "t5_2tand_t3_mn6zf4", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Flashback to last year, the beginning of 2020. I had just started my coaching business, as in officially launching and taking the first steps to reach out to potential clients. I had found a coach that I had resonated with and joined her program for learning how to launch in a pleasurable and less \"hussle-y\" way.\n\nShe speaks a lot about mindset work. Enough to the point where I started to roll my eyes but I gave it a go nonetheless. I was writing down affirmations in my journal. For a while there, even when I didn't know what to write in my journal, I would continue on anyway and would just repeat what I had written the day before to keep with the daily habit. I also did a service trade with another coach who took the program, but ultimately that coach wasn't the best fit for me and her solution to every challenge I had was to \"work on my mindset.\" I believe this is where I started to really get numb to that phrase.\n\nI fell off and on with my journaling practice over the course of 2020. It just didn't excite me like it had when I first picked up the practice. I didn't really know what to write some days. I remember hearing from a couple of mentors of mine that when you work on your mindset by journaling, what you write down will usually have a 90 day catch-up time. As in, if I write down a desire, and hold to the belief that I will one day get that desire, around 90 days is a nice time to reflect and see if that desire manifested. \n\nLooking back, there were definitely some things I wrote down that did come true, and others that did not. It's not that I believe journaling is a 100% catch-all and foolproof for anything that I want in my life. But it did show me that it was a great place to start somewhere.\n\nFast forward to today, April 2021. I had been a sporadic journaler from Summer of 2020 until now, as in averaging about once a week. Most of my \"mindset work\" came from listening to inspirational podcasts and reading books, which I do on the daily because I love those forms of media. At the same time, I'm an avid YouTube watcher. And I began to notice myself starting my mornings watching hours of YouTube, often staying in my robe watching on the couch until 2pm each day! I mean these videos I watched were just entertainment, they didn't do anything to inspire me to work on my business. I decided something needed to change...\n\nSo, I am into my third day now of starting my mornings with my cacao mushroom coffee elixir, listening to a peaceful lo-fi playlist on YouTube, and journaling down things that include: what I am grateful for, my current desires, my current fears of getting those desires, lists of things I give myself permission to do, business ideas, and anything else that comes up in that hour of inspiration. \n\nThree consecutive days may not sound like much, especially to you avid journalers and writers out there, but it feels like a huge milestone for me after the long haul of dipping my toes in and out of the waters of mindset work via journaling.\n\nAnd I can honestly say that these three days after journaling  have been absolutely transformational in the ways that matter most. I feel inspired again to keep on this entrepreneurial path. I have noticed myself release judgment of myself, let go of shame, and even minimize comparison which I so deeply struggle with due to being constantly on social media for my business. I feel alive and invigorated again.\n\nI'd love to know your tips for staying on this consistent path if you are a journaler, I'm always looking to connect with fellow writers and look forward to your comments and your own experiences. Thanks for reading ❤️", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mn6zf4/the_words_you_have_to_work_on_your_mindset_used/", "title": "The words \"You have to work on your mindset!\" used to irk the sh** out of me. But for the first time in a long time, I'm seeing why this is so often said...", "social_network": "reddit", "user": "sultryshadows", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1617933243, "permalink": "/r/DecidingToBeBetter/comments/mn6zf4/the_words_you_have_to_work_on_your_mindset_used/", "nsfw": false, "first_save": 1635437765.706231, "replies_charged": false}