{"id": "t5_2tand_t3_l6kvp3", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": " I'm M23, and I currently live with my parents. I went to several different universities after a series of major changes and poor mental health, my last semester i didn't attend finals and flunked. My GPA is barely above 1. I don't have a job. I attempted to conclude myself, however i ended up having to stay in the hospital for a week while they tried to figure out what i needed. I had therapist and doctors, but in the end they were unsatisfactory and provided little help. I do have a girlfriend that i talk to every day, but she lives in a neighboring country so i can only visit once a year or so. My main problem is that i have so many interests and idea's that i feel strongly passionate about for a few moments but then i don't have the will power to follow up on them. Lately i don't leave the house anymore, i don't think i've gone anywhere by myself for the last few months. I need help, my girlfriend is the only light in my life but i cant expect her to wait for me forever or magically take care of me. I need to fix myself, but i feel too anxious to even try. When i think about even the smallest task that i have to do, it seems monumental. Where do I start? How can i be better? Today my younger brother tried to force himself into my room because he knew i was upset about something, but i couldn't even look him in the face. I feel like a failure. I was a gifted student, i felt like i had a great future ahead of me, and now i'm just a leech. If anyone has any advice, i'm all ears. I don't think i can continue living like this much longer, the guilt and shame that come with it is just too much to bare.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l6kvp3/im_spiraling_downhill_and_i_need_help_before_its/", "title": "I'm spiraling downhill and i need help before it's too late.", "social_network": "reddit", "user": "Spiralingants", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1611798761, "permalink": "/r/DecidingToBeBetter/comments/l6kvp3/im_spiraling_downhill_and_i_need_help_before_its/", "nsfw": false, "first_save": 1635436851.4112015, "replies_charged": false}