{"id": "t5_2tand_t3_ajr643", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "For most of my adult life I have been a mess. I was lazy, unmotivated, an avid procrastinator, and without any goals or desires. I literally was just alive, but not at all living. My anxiety prevented me from trying to obtain meaningful and consistent work, and my relationship suffered occasionally when I wasn't able to contribute. I was constantly finding myself backed into the corner with debt, bills, car repairs, etc. I would say for the better part of 10 years, I became so discouraged I literally thought it was impossible to break free of poverty. Especially when I didn't believe in myself to hold a job. I would always find a way to commit myself to something else other than working full time. I had not worked full time in about 10 years. We've been through evictions, hungry nights, and nights without lights. \n\nAs a whole, when my SO was promoted to a higher paid position, we became comfortable. We knew the rent would be paid every month, as would all the other bills. We even invested in a new minivan and took on a car payment. (Something I never EVER thought I would do) Then I became complacent. I felt like since we had what we needed, I should stress so much about the work. My SO was always so nice about this and reassured me that I contributed in many other ways. But, I always felt like a lazy piece of shit. I wanted to work, but I also had no desire to. Although we could meet the bill requirements every month, we often didn't have extra or gas money or any sort of leisure money. I started working UBER and Lyft for a year and I felt great. I could always make the little extra we needed,  then the car started messing up. So I went back to no income, not working at all. Right before Christmas. I was very very fortunate to have the members of r/santaslittlehelpers reach out and provide an awesome Christmas for my step kids. I know the idea of not working and asking for help sounds shitty, but I had been making such a decent amount of money with rideshare gigs that I thought I would be able to handle it. When it came down to it I simply didn't have enough time to come up with different money in time to provide the kids Christmas. The fact that the car was having issues and was my only way to make money, I couldn't afford to fix it. I literally just went into a day to day survival mode. Constantly babying the car, earning every little 5 dollars for gas I could taking neighbors to the store and whatnot. \n\nThen one day, I was sitting on my bed, browsing Reddit. I came across a post in a sub associated with my city. It was an offer for a full time job, well paid, in a field that I had experience in, full benefits the whole 9. Something in me thought it wouldnt hurt to respond and find out some details. I had been so discouraged by the car issues that a job was the last thing on my mind. But before I knew it, I was interviewing, then I was in class and started on site training the same night that I finished my certification. I worked my first full week this week. It's overnight 10am-6am, so it's a major adjustment. I've already worked additional hours on two of those evenings. I've already effectively accrued overtime. Today I opted in for $25 of every other check to automatically be put into savings (never saved a dollar in my life) also, for the first time in my life, I opted into healthcare benefits. One night during some dead time at work, I found myself responding to r/writingprompts and moments later I was writing again for the first time in years. It felt so good to write again and express my creative side. Today for lunch, I was going to have a burger but since I've been going in late my SO has been making me yummy nutritious meals. I didn't want it to be a waste of healthy eating, so I had a salad instead of a burger. Also, I've found myself walking in and immediately  hanging up my clothes, feeding the cat and straightening up before I take the kids to school and then go home to sleep. All of these things may seem so simple but I simply never really possessed proactive behavior. All of these things are making me feel great about myself, and I'm hoping to keep it up by continuing to work on my budget and savings. I hope someone reads this and realizes.. that they too can start on a better path, it only takes a baby step, accidental or intentional. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ajr643/i_kickstarted_into_self_improvement_without_even/", "title": "I kickstarted into self improvement without even meaning to. For years, I thought I would never be better.", "social_network": "reddit", "user": "KayMayDay", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 170, "down_vote": 0, "creation": 1548436325, "permalink": "/r/DecidingToBeBetter/comments/ajr643/i_kickstarted_into_self_improvement_without_even/", "nsfw": false, "first_save": 1635436061.3712754, "replies_charged": false}