{"id": "t5_2tand_t3_mkyatt", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "These past few days have been difficult for me mentally and emotionally. Releasing someone special in my heart is hard to process, all the memories whether good or bad resurfacing and I can’t help but question if I made the right call. I do not regret my decision but can’t lie to myself that I don’t think of the hypotheticals. I love this person in my own ways and have shown effort the best that I could and with that I am proud of myself. It is ok. I acknowledge that my concept of bare minimum might not be his and have expressed that I appreciate him nevertheless. I acknowledge that both of us lacked in some aspects in the relationship but also acknowledge we did effort more than before.\n\nAt the end of the day, I acknowledge that I am a kind person by nature and most importantly have shown someone how they should be cared and loved for. That is enough. It is enough. He is enough. I am enough. I acknowledge that there are days that I may have a hard time healing in which all the more, I need to be kinder to myself. That if I may have days where I feel more emotional than some, it is ok.\n\nI am content to have given this second chance a try and although it did not work out for me, I will be ok. I am letting go and looking within. Releasing and building myself more. I hope we don't hurt each other while in healing. I hope we can be kinder to ourselves while doing :)\n\nwith things going on in the world right now, I have to count my blessings. Despite of me ending a meaningful relationship, there are areas/aspects in my life I need to be grateful for. Just this week, I got recognition at work and will be getting more than the standard yearly raise starting next pay period after only 5months of working, strong support system from my parents, family and close friends I can rely on anytime. I cannot miss them and all these good things happening in present because of the past. I am not only just living for myself now but for others too. I am acknowledging past traumas, will forgive myself and respect my space, peace and heart more moving forward. I am going forward.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mkyatt/i_am_thankful_for_us/", "title": "I am thankful for us", "social_network": "reddit", "user": "tiarasmalls", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1617666521, "permalink": "/r/DecidingToBeBetter/comments/mkyatt/i_am_thankful_for_us/", "nsfw": false, "first_save": 1635435566.8699443, "replies_charged": false}