{"id": "t5_2tand_t3_my1c2h", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I am realizing I am the problem in my life. I have been playing small. Been arguing with my loving family for no reason other than I hate myself and everyone around me is a causality to my self destruction. Escaping into substance abuse. I am 9 days sober now and my real personality and feelings are starting to come back up. It’s disgusting and frustrating. There’s a lot of pent up anxiety about deciding what to do with my life I was avoiding. I don’t want to face the fact that I have to make big kid decisions now. But I can’t keep going in the circle I’ve been going in, because it’s not working. \n\nI had two panic attacks today, as I am no longer numbed by the drugs I was self medicating with to ease my distress. I’ve been severely detached from life, just wanting to escape it. But deep down, a tiny voice wants to do better... I figured getting sober would be a good decision and starting point. Coming back to myself is a nightmare because I’m truthfully an anxiety-ridden-under-achieving-former-gifted-kid that is “never doing enough” but also never wants to do more,  because doing more and fulfilling my potential would ruin my established identity as unlovable and incapable.\n\nIt sucks to have to give up the fight to prove I was mistreated, it sucks to have to give up on the ideology that I’m unsuccessful because of XYZ that happened to me. It hurts to have to put all of those feelings to the side and focus on what I can control. It’s one of the most frustrating decisions I’ve ever had to make, and one that leaves me feeling ashamed of how long I clung to those feelings. But I  have to decide to stop being so angry at life for my health. I’m wasting away. I’m so angry and anxious and disconnected that I can barely take a step without feeling some sort of emotional distress or uncertainty. I keep hoping someone will take accountability for what happened to me but no one will. \n\nSo now I take responsibility for myself and admit I am in control of my life, my feelings and my actions. I acknowledge all the time I’ve wasted, and can only hope to do and be better moving forward. I can’t pretend everyone else is ruining my life anymore. I’m the only one having a bad time in the corner by myself, while others can laugh and live life because they’ve learned a lesson I haven’t yet. I don’t think I’ll be able to laugh for a long time because the grief of having to move on from this coping mechanism I developed is devastating. \n\nBut I will learn new methods soon and stop being a ticking time bomb to everyone around me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/my1c2h/returning_to_self_after_years_of_avoidance/", "title": "Returning to self after years of avoidance", "social_network": "reddit", "user": "z00w33mamma", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1619327119, "permalink": "/r/DecidingToBeBetter/comments/my1c2h/returning_to_self_after_years_of_avoidance/", "nsfw": false, "first_save": 1635436832.7674353, "replies_charged": false}