{"id": "t5_2tand_t3_nr2ppq", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I'm autistic with Dyspraxia and GAD. I thought I was generically self conscious and insecure about some of the difficulties I had, but then I had a month of various friends (not just one, at least five) either directly losing their temper with me and us having an argument, or alluding to me annoying them in some way.\n\nThere were numerous bad habits and mannerisms I had which were called out, but two stood out. \n\nOne was timekeeping and punctuality. I don't really know f I can argue with that; I do probably get to socials late in order to feel less social discomfort.\n\nThe other was the cluster for a few things which all came out from me trying to share my special interest both written and in audio clips over the course of the pandemic. Monologuing. Verbosity (tl;dr)  Incoherence--not even monopolising but \\*nonsensically monopolising\\*. Stream of consciousness, except not in a Joycean fashion but without any finesse. Disjointed, disparate.\n\nInfodumping is something all things most people on the spectrum do to some degree, but I know of no other autistics who get called out on it. I now  feel like opening my mouth annoys people, because once I do the floodgates open with my special interests and/or perfectionist anxieties. And as to being incoherent? I put my English degree to shame and not in a good way, and I've lost faith in my original pre-COVID aspiration to TEFL or be a TA. It's hit me this hard. Sharing my  special interests brought me some confidence which has always been fragile, and it's now clear it annoys people. Even \\*hurts\\* them. Certainly my lateness hurts my friend--who, in a cruel ironic twist, gets to infodump on me for +10 years without a callout.\n\nOnce somebody points out of my problems I'm sort of locked onto either getting reassurance I don't have it, or desperately trying to figure out how to fix it. A wave of shame consumes me as, of course, I am struggling to fix the reason I'm annoying \\*because I'm autistic\\* and leads me into a depressive spiral of navel gazing and neurotic rumination. When I dip my head above the water for air, I either hide from people or end up apologising and shitting on myself. (Not literally lol) I spam Facebook or Reddit with the agony of security from outside me that I didn't fuck, rather I'm not \\*a\\* fuckup.  It's OK to not be perfect but it's not OK to piss people off. This time it \\*isn't\\* in my head, they have told me as much over the course of time. If they leave my life because I can't fix myself, it'll be my fault and the wave will be even higher. I feel scared like I'm going to drown under the weight of the expectation. Why can't I stop being annoying?!\n\n(I used to post like this paragraph above \\*all the time\\* and got myself banned from half the support subs, including AskMen and even Depression. The self esteem sub has downvoted me. It makes me feel like I'm beyond hope, rejected by those who theoretically would best understand what it's like to feel shit. I get it, I'm melodramatic--but I'm not crying wolf either)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nr2ppq/i_need_help_rebuilding_my_confidence_after/", "title": "I need help rebuilding my confidence after depressing realisations of how I come across", "social_network": "reddit", "user": "Xemnas81", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1622687175, "permalink": "/r/DecidingToBeBetter/comments/nr2ppq/i_need_help_rebuilding_my_confidence_after/", "nsfw": false, "first_save": 1635437516.4079487, "replies_charged": false}