{"id": "t5_2tand_t3_b7eqvk", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "I very often feel this way. Every day when I wake up I lay in bed for way too long looking at my phone and adjusting to the day. Then I go to work. With the time I spent laying around I could have forced myself to get up and go to the gym before work. It takes me so long to get going in the morning (which is basically mid day, then I leave for work at 2pm). On my days off it's a struggle to be productive and I have to make lists of small tasks I want to accomplish in the day. Even doing hobbies I actually really enjoy are a struggle to get doing. \n\nIt makes me feel like crap and I think back at all the wasted time where I could be learning skills, becoming smarter, getting better at a hobby. I feel like I'm not flourishing. I don't feel that energy, spark, drive, fire, passion, whatever you want to call it. I don't particularly think I'm depressed, but maybe I am and have just gotten so used to it. I also think it's an addiction to my phone and maybe also addiction to interaction with friends through texting all day because I feel like I don't have enough social interaction and am by myself a lot, mainly because I work when everyone else is ending their day and about to go home from work and I'm off then everyone else is working. \n\nDoes anyone else feel this way? What have you done to try and overcome this? Any tips or advice? I guess I know what I need to do, but want encouraging words from other people and maybe a different perspective. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/b7eqvk/i_feel_like_my_life_is_a_constant_struggle_to_not/", "title": "I feel like my life is a constant struggle to not be lazy....", "social_network": "reddit", "user": "infiniteblessings88", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1553972786, "permalink": "/r/DecidingToBeBetter/comments/b7eqvk/i_feel_like_my_life_is_a_constant_struggle_to_not/", "nsfw": false, "first_save": 1635436527.2997463, "replies_charged": false}