{"id": "t5_2tand_t3_gx80fo", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I have a habit of promising to start something and then not following through with it. It's one of the things I truly dislike about myself. \n\nFor some reason, it clicked to me this morning that I may be sabotaging my own happiness. I have been holding myself back from really being my best self. I have been depressed and anxious for years, but the quarantine has really kicked things up a notch for me. I have been sharing my studio apartment with my S.O who has really been trying their best considering everything going on with the world at the moment. For some reason, I have been quick to anger, closed off,  lethargic, snappy, angry, and I feel as though there's no hope. I don't want to talk to anyone on the phone, text, or even speak to my S.O. Most of the time I feel this way totally unprovoked. \n\nIt took me 3 months to realize that scrolling on twitter and instagram all day, laying in bed, doing the bare minimum at work (remote), and neglecting healthy eating and activity habits are not going to make me feel any better. Today I decided to commit myself to trying to keep my mind stimulated whether it's by reading a book or watching something interesting. To try to eat better and to get out of bed (and make it up). To feel more gratitude for the things that I have and to stop being/acting ungrateful. I need to take the time to live my life instead of just wasting my days. These 3 months have flown by so fast, it's scary and I have been taking time for granted. So it's time for me to be better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gx80fo/i_may_be_selfsabotaging_so_its_time_to_be_better/", "title": "I may be self-sabotaging... so it's time to be better.", "social_network": "reddit", "user": "guygxld", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1591375199, "permalink": "/r/DecidingToBeBetter/comments/gx80fo/i_may_be_selfsabotaging_so_its_time_to_be_better/", "nsfw": false, "first_save": 1635437029.581889, "replies_charged": false}