{"id": "t5_2tand_t3_alcx24", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "Life can sometimes be very hostile to us.\n\nShit hits the fan. Our plans get upended, people leave us, careers get stale, addictions take over, things get broken, illness comes in. If shitty shit happens to you, it doesn't mean that you've done something wrong or that there's anything wrong with you. The biggest self-help gurus and the wisest enlightened sages still stub their toes.\n\nRespectfully, I nevertheless suggest that your life is a reflection of what you offer it.\n\nWhat happens to many people, is that they get caught in this loop of\n\n1) Life becomes boring, tedious, shitty,  \n2) We withdraw from life, and into addictions or internet fantasies,  \n3) Life becomes *more* boring, tedious, shitty.\n\nAnd the feedback loop intensifies.\n\nSo no matter what, if you find life to be hostile to you, resist the temptation to withdraw, and instead engage *deeper* with it. This isn't to be aggressive or pushy. But looking at your life right now - what's so bad about it? Is it bleak, empty and meaningless? Then it's time to add some colour. Pick up a hobby, pick up a new routine, move out of your comfort zone, see some friends, cook them a meal. Do something. Is your life overly complicated with too many problems? Then ask where you've taken on too much. Or where are you waiting too long for problems to become urgent before you start acting on them?\n\nYour life can be either heaven or hell. Life becomes hellish when you decide that it's not good enough for you - or you too good for it. It becomes heavenly when you take ownership over your life as it is NOW, seeing THIS time as your opportunity. You can start by asking better questions. \"What can I do to make this more hospitable for me?\" or \"How can I take better care of my self?\" or \"Where am I refusing to accept responsibility?\"\n\nBelieve me, there was a time when I was so depressed and I kept thinking \"Man I just wish the whole world would leave me alone and let me sit in peace.\" I felt *hounded* by expectations, like everybody was expecting something of me. You know what though - it was *me*! **I** was the one that had all these expectations and I wasn't stepping up to serve myself.\n\nHearing this, you might be thinking \"I'm too tired though, I don't have anything more to give.\"\n\nGive *something*.\n\nTry it! You'll be blown away by the difference in how it feels. Offer something to yourself, to your life. Do something extra. Cook yourself and your family a nice meal. Go to the gym. Or just do 20 push-ups. You'll feel the change in energy. You'll feel the Universe just a little bit more on your side.\n\nMay you find deep fulfillment.\n\n*Brent Huras  \nPersonal Wellness Coach*\n\n----------------\n*A personal coach is someone who knows that you can make your life much more enjoyable and fulfilling than it is. Engaging deeper with life aligns you with your life's purpose. Feel free to send me a DM if you wish to learn more.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/alcx24/advice_improve_your_life_by_engaging_deeper_never/", "title": "[Advice] Improve your life by engaging deeper, never withdraw from it.", "social_network": "reddit", "user": "brenthuras", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 776, "down_vote": 0, "creation": 1548856690, "permalink": "/r/DecidingToBeBetter/comments/alcx24/advice_improve_your_life_by_engaging_deeper_never/", "nsfw": false, "first_save": 1635437165.5788286, "replies_charged": false}