{"id": "t5_2tand_t3_q9a3of", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": " There's a lot of comfort in having the idea to do something. Having plans and ideas can act as a safety blanket of achievement. Making you feel like you've achieved something when in reality you haven't even started. This sense of gratification is far better than the feeling of disappointment of starting something and failing. This is why a lot of people never even start.\n\nPeople will spend a lot of time researching the perfect gym routine before even stepping into a gym.\n\nThere's discomfort in starting.\n\nStarting makes you vulnerable to failure and that vulnerability sucks.\n\nBut if you never start you will fail anyway. No one wants to hear about the business idea you had but never acted on, or the gym routine you never implemented or the YouTube account you never started. Planning these things feels gratifying but they have no real world implications.\n\nUnless you voice them, you will never be remembered for your ideas.\n\nSo this is your sign to stop planning, stop over-thinking and stop waiting until a better time.\n\nThis is your time to start.\n\nToday.\n\nWhatever it is, whatever the first step is. Maybe it's buying a domain name, or contacting a supplier, or sending an email, or writing a blog post. Just start it bro...\n\nI've recently taken my own advice and started a YouTube channel that'll focus on self improvement. My first video is about starting, it's a little shit (as all first things are) but it's a start and we all need to start. Link in my bio if you're interested.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9a3of/advice_do_the_thing/", "title": "[Advice] Do the thing", "social_network": "reddit", "user": "bigjoerona", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 241, "down_vote": 0, "creation": 1634383380, "permalink": "/r/DecidingToBeBetter/comments/q9a3of/advice_do_the_thing/", "nsfw": false, "first_save": 1635435942.6005044, "replies_charged": false}