{"id": "t5_2tand_t3_lmrofb", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Been lurking here for a while. I see people post some truly hard to read stories and talk about the steps they have taken. I’ve seen posts about things as menial as remembering to brush teeth everyday. I often shake my head and count my blessings .\n\nThe last year of my life has been a personal journey. I got divorced. Lost, what some would call, an extreme amount of weight in the time frame. And most importantly I’ve been working on my mindset. Confidence. Discipline. Self love. \n\nI trimmed out things in my life that hurt me more than helped me. Gaming every free second of the day. Social media consumption, way way down. People who are negative, see ya.\n\nI’ve become a mental rock and often don’t even recognize the mental voice in my head.\n\nBut yesterday my training failed me.\n\nI’ve always struggled with anxiety and stress when things don’t go according to plan. Even more so when I am looking forward to an event and something comes up that delays me from the thing I am excited about.\n\nCut to yesterday. It’s been snowing a lot and my gym has been closed. I haven’t seen most of my friends in a few days and I also hadn’t got my post workout hit in days. I was pretty excited about it. 10 minutes before I leave work my boss comes over and has one of those deep discussions that take forever. Next thing I know I’m 30mins past when I wanted to leave. No big deal. Little annoyed, but putting in quality face time with the boss is never a bad thing.\n\nSo I leave work. Have to pickup my dog from daycare. I get hung up in the melting snow. A kind stranger drives by, has a shovel, 10mins later I’m out. I thank him and the karma gods for the assist.\n\nOk, gonna be a little late. No big deal. Text the group and tell them what happened. Within seconds I get 5 messages saying they will save me a spot and get me setup. \n\nGet home. Get the dog situated and gym clothes on. Get hung up again less than a mile from my front door. This is where I absolutely lost it. \n\nPanic. Fomo. Sadness. Crushing weight on my chest. Can’t think straight. I spent 5 mins digging snow with my hands. Didn’t help. Took a deep deep breath. Got in my car, literally backed up a foot and got out of the snow.\n\nMade it to the gym. Had an awesome time. I got home after and really reflected on the build up and subsequent freak out.\n\nWhy? What was so bad that I felt the need to get so out of control? Nothing. Some old  ways of thinking resurfaced and my improvements in the last year cracked a bit. Here is the positive takeaway. \n\nTwo years ago a day like that would have crippled me for a month. I would have indulged in some terrible food and sit on my butt feeling sorry for myself. And to make myself feel better I would have doubled down on the food. I would have made excuses for myself and accepted defeat.\n\nToday though I can write down what happened, take a look at it, shake my head, wad it up, and toss it in the trash. \n\nMental health is not a object we can buy. It’s not something you can just decide to be at any given moment.\n\nIt’s a muscle that requires exercise every single day. \n\nSometimes we get injured and need medication to get better. I’ve been on pills. Don’t need them anymore. I see a therapist every other month. It used to be every other week. \n\nTo work that muscle I read books about success and self improvement. I write in a journal when something stumps me. I browse Reddit and other sites for a break. For inspiration. For motivation.\n\nI never stop adding to the things that make me better. \n\nAnd that is deciding to be better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lmrofb/yesterday_i_cracked/", "title": "Yesterday I cracked", "social_network": "reddit", "user": "bunnzo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1613668280, "permalink": "/r/DecidingToBeBetter/comments/lmrofb/yesterday_i_cracked/", "nsfw": false, "first_save": 1635435592.0606773, "replies_charged": false}