{"id": "t5_2tand_t3_m2futx", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "In 2019, in my first effort /r/decidingtobebetter, I turned my life around.  I improved my confidence, got healthier, lost weight, left a dead end relationship, and landed my dream job (Previous Job) which I absolutely adored.\n\nLast March, I was unexpectedly and without warning forced to resign.  To say I was fully devoted to Previous Job would be an understatement.  I was appropriately challenged, worked incredibly hard, took on anything that was thrown at me, and excelled.  My performance reviews were perfect.\n\nI wracked my brain trying to understand what happened and have come up with absolutely nothing.  All I was told by management was that they \"didn't feel like I was going to be a good fit in the long run\" and since I was nearing the end of my probationary period, they were making the decision to let me go.\n\nPrior to this, I'd always believed that I'd get ahead by being honest, working hard, and doing my best.  I trusted that people around me were generally good and had others' best interests at heart.   \n Not to be dramatic, but losing Previous Job broke me and eliminated all of those beliefs.  I strongly contemplated suicide.  I was in a really dark place for several months. \n\nNow unexpectedly unemployed during COVID, I was forced to take the first job offered to me in a position I didn't really want (Current Job).  Current Job is far beneath my capabilities and absolutely bores me to tears.  It is also nowhere in the realm of what I'd ultimately like to do with my life.\n\nHowever, Current Job is fully remote working from home with plans to make it permanent post-COVID and I absolutely love that.  At Previous Job, I was extremely social, happy, and loved being around others every day.  Here, remote work has been a perfect storm, allowing me to become very comfortable being isolated and withdrawn from society while I've ruminated in misery, licking my wounds and feeling bad for myself.\n\nI've been casually applying and interviewing for other jobs more in the realm of what I'd like to be doing, but haven't had much success.  Today, to my absolute shock, I was offered another position (New Job).  Instead of feeling excitement and relief as expected, I'm absolutely overflowing with fear and dread.  \n\nNew Job would undoubtedly provide me with the fulfillment and job experience relevant to my career goals (neither of which Current Job will ever give me); however, I'd need to return to the office in the near future, interact with others all day long, and meet challenging expectations again for the first time in almost a year.\n\nSince the unexpected loss of Previous Job, I'm finding that I'm having an incredibly hard time pulling myself out of this turtle shell I've grown so accustomed to thanks to Current Job: working at home, never seeing or talking to anyone, effortlessly exceeding requirements, and spending half my days just slacking off.  This me completely lacks ambition and self confidence, and doesn't want to get dressed up, leave the house, or be forced to communicate with other humans.  None of this seems worth turning down a great opportunity to move forward with my desired career path.\n\nI want to be better again, and could really use some advice, encouragement, or whatever you have to give to help me get there.  I've never been in a situation like this and I feel totally lost.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m2futx/after_being_forced_to_resign_from_my_dream_job/", "title": "After being forced to resign from my dream job without warning last year, how do I move on and pull myself out of this rut to accept a promising new opportunity?", "social_network": "reddit", "user": "katythulhu", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1615430127, "permalink": "/r/DecidingToBeBetter/comments/m2futx/after_being_forced_to_resign_from_my_dream_job/", "nsfw": false, "first_save": 1635437626.4085035, "replies_charged": false}