{"id": "t5_2tand_t3_kje20j", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "Listen, I'm not a big fan of working out. I hate sweating and I hate being in pain afterwards but I knew things had to change. I was gaining weight rapidly and my health was obviously deteriorating. I couldn't live with myself any longer and just decided, fuck it I just have to start somewhere. All I had to do was show up and do something. Anything. As long as I wasn't in bed scrolling endlessly on Reddit. \n\nI began by going on short walks for a few days and then gradually moved on to inclined treadmill jogs. 10 mins went to 15 mins to 20 mins and etc. There were days when I mentally and physically couldn't be fucked to do anything but I kept nudging myself and telling myself that I needed to do at least 10 mins. The least I could do was 10 mins. Just to build up the momentum. To my surprise, on the days that I told myself I couldn't do it, I did much more than I intended because I guess once I was already at the gym I wanted to make my time there worthwhile. I completed a 3km incline jog in about 30 mins, the numbers could be better but for me that was a very good start. \n\nAfter 2 and a half weeks of consistently walking + incline jogs + 10-15 mins of bodyweight exercises everyday (with one or two rest days) I finally became more confident to start doing harder work outs. I am now doing a 2 weeks fitness challenge! It's been 3 days of planks, lunges, squats, sit ups, etc and I am feeling the burnnnnn. Don't get me wrong, I still hate exercising and sometimes I have to muster every ounce of energy I have to just show up but I know at the end of every workout I feel accomplished and pleased with myself. Tomorrow is my rest day and I am looking forward to resting and doing NOTHING lol\n\nLastly, I'd like to say how grateful I am to have found this sub. I don't think I would have even started without stumbling upon this page. I was inspired and motivated by everyone here who decided to do better for themselves so thank you to all of you for being so supportive! I want to continue working out every single day if possible and eventually lose more weight and gain muscle. I also want to quit smoking weed and combat my scrolling addiction completely but that's a battle for another day. For now I am so happy with my little progress and I can't wait to do better every single day.\n\nMerry Christmas and have a wonderful rest of the year to all of you!\n\nEdit: I fixed spelling and typos.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kje20j/i_worked_out_every_single_day_for_3_weeks/", "title": "I worked out every single day for 3 WEEKS STRAIGHT! I am so goddamn proud of myself.", "social_network": "reddit", "user": "laspapayas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3822, "down_vote": 0, "creation": 1608809996, "permalink": "/r/DecidingToBeBetter/comments/kje20j/i_worked_out_every_single_day_for_3_weeks/", "nsfw": false, "first_save": 1635437922.4320557, "replies_charged": false}