{"id": "t5_2tand_t3_ilayia", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "Over the last year, I have become aware that I suffer from Abandonment as well as Co-Dependency (not necessarily addiction) and all the “fun” neurotic qualities that are symptomatic of both.  It seems like a no brainer and there are those who would disbelieve that I didn’t know those things about myself.  Co-Dependency is difficult to see in yourself when you have so much repressed shame, anger and your self esteem is non existent.  But Abandonment was my Voldemort...it was such a deeply held fear that it was “that which shall not be named”.  One day, my horoscope suggested that I write down my fears.  What a novel thought....but honestly, who wants to do that?  It was an insidious thought, one day when I was cleaning the house, in the recesses of my mind a conversation quietly began with the question, what are you afraid of?  My life spun in my head like a Rolodex, each index card a memory, filed away.  When it stopped I was aware that feeling secure is something I have chased most of my life.  I was pretty stunned at this revelation.  I’ve heard it said that when you are safe you can be joyful.  Does that mean that I have never been joyful?  Sadly, the answer is yes.  I think I even have RSF “resting survival face”.  There is a literally a multitude of instances in my life that have nurtured insecurity.   It was then that I started to make sense to myself.  It was a powerful moment, it was the start of unraveling a mystery that has plagued me and robbed me of happiness all my life.  As much as I thought I have been in control of my life, of my self, the reality is I was always in survival mode.  The sad truth is I was conditioned into being someone that I was never meant to be.     \n\nWhen I think of the unnatural state that I have existed in most of my life, I think of my dog Choo-Choo. He was 8 weeks old when I adopted him in April 2019. I bought him from a woman who was advertising 5 chihuahua/dachshund mixed puppies for sale on Craigslist. I answered the ad, by the time I met up with her there was only one puppy left, Choo-Choo (who turned out to be a pit bull/dachshund). He was a grumpy puppy, he whined the entire way home and was not affectionate at all and to be honest I regretted my decision.  I have 2 other dogs (and a cat) and was worried that this puppy would bring a negative energy to our happy little pack.  When we got home, he bum rushed Bo (my 3YO male dog) and tried to nurse from him.  It dawned on me that there was more to his story and for a moment I was ashamed for taking him at face value.  He probably hadn’t been weened and he was likely abruptly separated from his mama.  The sudden end to nursing affected him deeply.  To this day, he has separation anxiety and is a very insecure dog.  It’s hard to take him for walks, he is neurotic and physically very strong, he fights the process all the way.  It hurts me to watch him suffer, he doesn’t pee or poop on walks and generally it’s a heavy lift for anyone along for the ride.  Underneath all of that, he is a quick learner and has a sweet, loving, loyal, sensitive, alert nature. I see his authentic self and am committed to bringing it to the surface, so he can be himself all the time.  My hope is that he will be able to release the fears and insecurity that he inherited from the devastation of broken parenting at a pivotal time in his development.  Through him, it is so clear how I ended up where I did.  It’s been nearly a year and a half, he’s made a lot of progress.  I take pride that he sleeps peacefully through the night now.  He shares his sweet and affectionate side more and more, there is a ways to go but I love him and he is worth it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ilayia/be_joyful/", "title": "Be Joyful", "social_network": "reddit", "user": "The_Bigger_Weiner", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1599066795, "permalink": "/r/DecidingToBeBetter/comments/ilayia/be_joyful/", "nsfw": false, "first_save": 1635437302.3983529, "replies_charged": false}