{"id": "t5_2tand_t3_phwg7q", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "I’m a 20 year old uni student with Aspergers Syndrome. I’ve realised I’ve been a selfish, unpleasant twat who has hurt those closest to me. \n\nI came back to my parents house to do a summer job doing street cleaning. At first this worked very well, I was occupied, was earning good money, and my family were proud of me. However, after 5 weeks in the job where the job got more difficult (having to deal with overflowing dog litter bins) I decided that quitting was the best course of action.\n\nMe and my family have clashed on and off. Political differences are a frequent source of tension, as well as my often selfish behaviour. During the first lockdown my parents paid for me to go and live elsewhere because they couldn’t stand the discord between me and the rest of the family. \n\nSeptember last year I decided to go to uni despite Covid, partly because I thought staying at home for another year was a worse project. My parents subsidised my living costs, giving me £40 a week. I came home at Christmas and Easter, and it’s fair to say on both occasions I wasn’t easy for my mum, dad, or two sisters, to deal with me. A combination of my anti-woke rants, my self absorption, and my lack of regard or spending time with others.\n\nToday, it was the last straw. I posted a controversial post on Instagram that many said was racist, and combined with both my aggression and overall selfishness, as well as already having been warned and threatened with being forced to find somewhere else to live, my parents kicked me out. I packed my bags and headed to my university town, hoping to stay with some friends before I could move back into halls and maybe get some work. I was determined to never surrender my beliefs, even if it negatively effected my life.\n\nBut my friends said the house was full and many were angry about the Instagram post. I had no money, and even forgot my passport required to find work. It was clear that without my parents supporting me financially, I would be unable to continue being at uni and the lifestyle I wish to lead.\n\nI want to change, but my parents have given me numerous chances before and I’ve blown them. I know that where I am now is as a result of my own making, but I looked into the abyss of where my life was headed and am desperate to turn back. I am fundamentally a selfish person who puts his needs above others. I don’t want to be saying this only in a moment of desperation, I don’t want to abuse my family further by saying I’ll change when I really just want their money.\n\nMy mom has said she’s considering giving me one more chance, and if she does I don’t want her to regret it. I want to be a better man.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/phwg7q/i_will_no_longer_take_my_family_for_granted/", "title": "I will no longer take my family for granted!", "social_network": "reddit", "user": "arctofire17", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1630778634, "permalink": "/r/DecidingToBeBetter/comments/phwg7q/i_will_no_longer_take_my_family_for_granted/", "nsfw": false, "first_save": 1635436300.5576851, "replies_charged": false}