{"id": "t5_2tand_t3_5vf4ei", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Hi all, thanks for viewing to help me out. \n\nRecently, I have been lazy, and too impulsive. I have been on top of things for my whole life; A's in school, have a job now as a teacher, and have a long term girlfriend. But recently, I am having a lot of trouble. \n\nBrief background: I am a 22 year old male who graduated college recently and got a job this year as a high school teacher. I have been frustrated at my new job, and I work literally all of the time. I am also in graduate school, so I have little free time. However, I feel I waste WAY too much time. Instead of doing my work, I will procrastinate online by browesing reddit or watching YouTube. Furthermore, I feel lazy, and as if \"I deserve slacking off\" because I have been working so much. I also am becoming impulsive; I just randomly went to a strip club the other week and blew some money because I felt like it. I had never been to a strip club before and I have a loving girlfriend for 7 years who would flip out if she knew I did that. I don't know what's happening; I feel I am starting to spiral a bit out of control. I am questioning my career and my life, and I feel like I am starting to become apathetic. I have goals like writing a book, learning a language, and others;but whenever I have any free time, I don't make any progress with these goals and waste time because I just don't feel like doing it.\n\nAlso, my happiness, humor, and creativity are gone. I used to be so funny, happy, and incredibly creative a few years ago. Now, I feel like that is gone. I know I am rambling, and I apologize, but I just need some help. Thank you!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5vf4ei/i_need_some_help_i_am_becoming_lazy_unmotivated/", "title": "I need some help. I am becoming lazy, unmotivated, and complacent.", "social_network": "reddit", "user": "taway2282", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1487720588, "permalink": "/r/DecidingToBeBetter/comments/5vf4ei/i_need_some_help_i_am_becoming_lazy_unmotivated/", "nsfw": false, "first_save": 1635436020.8186724, "replies_charged": false}