{"id": "t5_2tand_t3_k9t518", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "Every child knows the gratifying feeling of shouting into a cavern (or similar place) and hearing your voice echo back to you far into the distance.\n\nWho am I kidding, I *still* love that feeling as an adult.\n\nHere’s the thing about echoes, though: they’re only telling you what you’re saying to yourself already. There is no new insight or perspectives, only validation of our existing thoughts and beliefs.  As we grow older, we continue to indulge in the pleasure of the echo, except in the form of our family, friends, and coworkers instead of caverns and concrete hallways.\n\nPart of the reason we become stuck ruminating in negative emotions is because we are hearing the echoes of our selves reflected back at us from the people with whom we’ve formed relationships. We find validation and affirmation from like-minded individuals. But as we reduce the diversity of opinions and perspectives of the people around us we limit our ability to think outside of the box. Opinions become facts, false or limiting beliefs become truths, and our capacity for change begins to shrink.\n\nMaybe this helps protect you, like a shield against the ideas and opinions that you struggle to hear. Or, maybe they have entrenched you into a reality you no longer feel you can break away from so you come to accept it as simply your fate.\n\nIf you think about your own life, can you identify any echo chambers? Ones that are repressing your ability to stay open to opinions and perspectives outside of your own? Maybe your chamber is a family member constantly praising and celebrating your line of work, keeping you stuck in a career you don’t find fulfilling or satisfying. Maybe it’s a friend or family member who holds different political opinions and assumes or expects you’ll align with their perspective on the matter. Or maybe you unconsciously associate yourself with people who share your personal beliefs while avoiding those who do not, to avoid what could feel like uncomfortable conversations.\n\nHow are these chambers limiting your growth and development as a person? How are they keeping you stuck in the past instead of propelling you into your future? One of the things I love about being a Life Coach is that I can be the person that exists outside of these bounds that allows people to flex their thinking and realize their true beliefs.\n\nIt’s all too easy to become trapped by echo chambers in our own lives. Recognizing what they are and then making conscious choices to engage with people outside of your own perspectives can be a powerful way to expand your mind and help your life flourish! \n\n**“The people you surround yourself with influence your behaviors, so choose friends who have healthy habits.”** \\-Dan Buettner ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k9t518/are_you_living_in_an_echo_chamber/", "title": "Are You Living in an Echo Chamber?", "social_network": "reddit", "user": "envisagelifecoach", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1607525375, "permalink": "/r/DecidingToBeBetter/comments/k9t518/are_you_living_in_an_echo_chamber/", "nsfw": false, "first_save": 1635436547.2935302, "replies_charged": false}