{"id": "t5_2tand_t3_kv8wwv", "request": ["9ad14901-6d2f-44f9-8b16-48a4f40b66ab"], "text": "*“If you're afraid to name your big goals, the ones that actually inspire you, because you're afraid to name them and fall short, you're going to be left with only meaningless goals.”*\n\n&#x200B;\n\n# Why you need to have goals that scare the crap out of you\n\nIt's a sad affair to mope around day to day wondering whether I should be reading more, working more, trying to make more friends, or binging on other self-improvement obsessions like journaling or meditating. What to do? And why? It's almost a mournful state. And one that's easily infused with a sense of uselessness. Why? Because nothing builds towards anything else.\n\nEven if you simply had the goal to eat healthy, stick to veggies, and thus improve your gut health, whatever that means. It could be a real goal if it's written down somewhere and you track your progress and celebrate your wins. Then suddenly your trip to the supermarket to pick out a certain kind of food as well as your afternoon chopping vegetables becomes just a little more than those mundane tasks inherently are. ***They suddenly get a little purpose salt sprinkled on top because they’re part of a goal.***\n\n***But, what if there's no higher goal?*** Well, just fudging around your food intake to change the color and texture of your poop and \"make your gut healthier,\" feels like a rather directionless goal in itself even if you read somewhere that gut health determines your brain health and mental health and it's the new magic cure for everything.\n\n&#x200B;\n\n***What about goals and direction for life?*** Without them, even the \"get fit\" goals and \"run everyday\" and the \"practice writing 2,000 words everyday,\" all these goals are just floating little targets to run after. And again, quickly lead to the deflation of purpose and feeling constantly unmotivated.\n\n***When you don't have higher goals that give meaning to all the ones beneath them, it's no wonder motivation is always sagging.*** Your mind is not bad when it whines, “why? Why bother?” It's just not effective at telling you it's wisdom. It's trying to tell you, \"Why? Give me a why for all these goals!\" But, maybe all you're noticing is that you don't feel motivated and you constantly forget why you even set these little imaginary goals to eat differently, exercise, and learn some random new skill. Some goals aren't very inspiring in and of themselves naked of a higher purpose.\n\n&#x200B;\n\n***Some goals fill you with joy to even imagine them.*** \"Find an amazing life partner, and be an amazing life partner for them.\" Or \"get good enough at my job that people want me to be their mentor\". Wow, these goals might actually be the kind that you can salivate over and that fill you with bubbly warm feelings just to imagine reaching them!\n\n***Basically, they’re worth struggling for.*** It's worth dealing with headaches and low energy, and upset stomachs, and rejections. It's worth running in the rain for and sitting down and doing things you don't feel like doing when watching netflix sounds more fun. In short, it inspires you.\n\n&#x200B;\n\nIf you truly committed to that goal to find that relationship, build that body, or somehow create that life of abundance and admitted to yourself how important it is, how many sub-goals could hang off of it? How much weight could hang from a goal with real meaning?Would you agree that going on 5 tinder dates is doable this month if it were to find love? Or could you go ask local 10 restaurants if they’d be interested in buying napkins with popular internet memes printed on them to support a local entrepreneur if you thought that’d get you one step closer to your dream?\n\nThose seem like pretty legit ideas to serve their goal. And they seem like good things to do. But, if you try to do them alone without the higher arching goal, of course you're going to struggle to pursue the random tinder dates if you hate tinder and know 90% of your tinder dates or days at the gym will be an inconvenience at best.\n\n&#x200B;\n\n**If you're afraid to name your big goals, the ones that actually inspire you because you're afraid to name them and fall short, you're going to be left with only meaningless goals.** If you're only allowing yourself to write down or think about goals that don't hurt if you miss them, you're left with bland colorless porridge goals that don't draw you towards them. And thus, you'll not move towards them more than occasionally. ***And then, you'll want to drop them because they become reminders that goals suck. At the end, you become more afraid to name your big goals that inspire you, because you're convinced you can't reach your goals.***\n\n&#x200B;\n\nWelcome to learned helplessness. This is not a place you want to hang out in.\n\n&#x200B;\n\n***I know it's bitter medicine. But, having goals that scare you is essential.*** The reason they scare you is because they matter and you're afraid to fall short. And as much as that sucks, switching from being afraid you'll fall short to inspired and driven to reach them is an easier task than falling in love with chasing tasks and goals that don't mean anything to you.\n\n***You can't just magic-wand-wish meaning and motivation onto the mundane.*** You can't just decide that eating broccoli three times a day is your life mission and should fill you with joy and drive. You can't just decide that you'll feel fulfilled and connected to life if you could only run 5 days a week.\n\n&#x200B;\n\n***Those things can become meaningful, but only if they hang from something that has intrinsic meaning to you that not only needs no explanation, but likely has none.*** Why do you want to have a deep intimate relationship with a partner? Just because. You do. Why do you want to feel competent at your work and successful enough to be able to share your wealth with others? Because you do. I know if you're a psychology nerd, you can dissect these drives and explain them with some biological imperatives, but that's beyond the point and a distraction from what matters. Don’t be cynical.\n\nWhen somebody asks why you're spending your Sunday meal-prepping for the week, it's unlikely you simply love the act of filling Tupperware. You'd have to explain it's part of your diet or you're using your evenings to learn to draw and want more time. And that's why you do it. When you tell somebody, \"I want to be loved, and I want to feel like I contribute to the world,\" there's no f\\*cking follow-up question as to why. They understand. You hit meaning bedrock.\n\nIf the things you're aiming at don't hang from something that hits that level of meaning, it's like you're trying to build one of those crib mobiles that dangle toys over a baby's head but forgetting to anchor it into the ceiling. ***Naturally it'll just hit you in the face. And then you'll hate goals and crib mobiles alike.***\n\nBut once you anchor all that into something bedrock solid, you'd find how much weight can really be born by a structure that's anchored in primal meaning. That baby could have a 800lb crossfit squat rack dangling from the ceiling if it's anchored into a support beam for the house. And you could have serious impressive goals and accomplishments stack up when they're hanging from a primal goal that's anchored into your deepest human drives to love, connect, and fulfill your purpose in life. And that might scare you.\n\n&#x200B;\n\n***But you can only get there when you're not afraid to chip the ceiling plaster by drilling into the beams above, when you're not afraid to tap into those primal powerful centers of meaning and admit what you really want in life.***\n\nI'd say don't be afraid. But I don't know how to do that.\n\n***Be afraid, and set the goal anyway*** to find that relationship, to build a career you actually love, or become the person that inspires you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kv8wwv/my_call_to_purpose_dare_to_really_live_set_goals/", "title": "My Call to Purpose: Dare to really live, set goals that make your voice tremble and your heart fly", "social_network": "reddit", "user": "microthought", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1610390466, "permalink": "/r/DecidingToBeBetter/comments/kv8wwv/my_call_to_purpose_dare_to_really_live_set_goals/", "nsfw": false, "first_save": 1635435310.6521418, "replies_charged": false}