{"id": "t5_2tand_t3_ko07r0", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Something happened that catalyzed me finally getting out of my abusive relationship. He had broken me down bit by bit for the year and a half that we were dating. He destroyed my self-esteem by calling me names and telling me I had 20+ character defects, but I still stayed because he would give me consistent emotional support. That all changed over Christmas, when he blew me off repeatedly in favor of his friends and family and didn’t communicate with me except for businesslike 3-min check-ins. When I called him on it he exploded at me and called me a hypocrite and a liar because there were a few times during that same week when I hadn’t texted him as much (I stopped texting him cause he wouldn’t text me back). That did it for me and I told him we were done. In his final texts to me he was extremely angry and told me that I had no empathy and that he had fallen out of love with me a long time ago (but still stayed I guess to get physical fulfillment? Idk). \n\nThis year I’m gonna be focusing on getting physically, emotionally, and mentally recovered through therapy, diet, and exercise. I want to lose the 50 pounds I gained while I was with him, focus on strengthening my confidence/self-esteem and that sense of righteous anger that fights back when I am being treated poorly, and get my finances/messiness/lateness in order so that I can regain my reputation after letting my work ethic slide during this last semester.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ko07r0/got_out_of_a_verbally_abusive_relationship_and/", "title": "Got out of a verbally abusive relationship and looking towards next steps", "social_network": "reddit", "user": "astrid_96", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1609456247, "permalink": "/r/DecidingToBeBetter/comments/ko07r0/got_out_of_a_verbally_abusive_relationship_and/", "nsfw": false, "first_save": 1635436519.2083056, "replies_charged": false}