{"id": "t5_2tand_t3_k0z61w", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "e234981c-b061-4d83-8134-70d441847f74", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Oh boy, it's been quite a year for me.\n\n[Original Post](https://www.reddit.com/r/DecidingToBeBetter/comments/af7s3b/i_met_my_girlfriend_the_most_inspiring_person_i/)\n\n[Last Years](https://www.reddit.com/r/DecidingToBeBetter/comments/e1nii9/update_i_posted_my_commitment_to_be_better_1_year/)\n\nWhen I made this post last year, it was a spur of the moment thing, I just realised I wanted to mark the day of her passing somehow. This year, working towards this post and this day has been my north star and I have been counting the days (literally) since I made the last post.\n\nLast year I had a lot of drive, but didn't really have much else. Things fell apart towards the second half of the year, and even in the first half where I was staying motivated, I was not being very efficient. I had some important insights at the beginning of this year, and it is finally starting to like I'm operating where I need to be to live up to my goals. Three books that were a big influence are Peak Performance, Deep Work and Atomic Habits.\n\n**Habit Tracking**\n\nIn February I started posting a monthly update on /r/theXeffect , which has been very beneficial for me. It has a similar effect as this post but on a smaller scale. It keeps me accountable, gives me goals to aim towards, and gives me an excuse to share what I'm up to with others which has been very rewarding. Right now I have 12 different habits that I track and try to do every day. I think I've found a good rhythm with this, not only does it seem sustainable, but I also feel like I am much better at disconnecting and get more enjoyment out of leisure time than I did last year. One of the important changes I've made from last year is putting more emphasis on getting plenty of breaks and rest. \n\n[All X Effect Months](https://imgur.com/5G8KGa8) (You can see the Number on each month that counting down is counting down towards today.)\n\n[Last Months Post](https://www.reddit.com/r/theXeffect/comments/jlmmhc/october_x_971_close_but_no_cigar) which leads into a rabbit hole of all my monthly updates.\n\n**The Game and Art**\n\nI am working towards making a game as a 1 man team, which is at the center of all of this. The past 1.5 years have been dedicated to learning art. I'm a programmer by trade, so that part is already covered, but have always been terrible at anything visual or artistic, so this has been quite a challenge for me, but I am getting much more comfortable with drawing this year than last year even if I have a long way to go still.\n\n\n[Hours Worked on Game/Art by month](https://imgur.com/wRnPZU9) \n\n\nI have almost doubled last years effort which is good, but what I'm more happy with is that this is almost exclusively built upon a consistent 3-5 hours a day, whereas last year a good chunk of my time came from the oceasional 25+ hour weekend. After reading Deep Work I have also become much more aware of how important focus. Last year I sort of felt like as long as I clocked in the hours, the results will come which is obviously nonsense. First and foremost I make sure that when I do spend the time working on this I am focused and deliberate, and when I make sure I have that part down I can worry about how many hours I put in.\n\nTo show art progress I feel like I need to put things into perspective first with where I started. It probably looks like I tried to draw ugly drawings, but it was more just that I got frustrated after 20-30 minutes of not knowing what to do and gave up. \n\n[Some Drawings from first half of last year.](https://imgur.com/a/VwRtL7a) \n\nLast years drawing was mostly focused on very basic fundamentals like drawing shapes and boxes (mostly doing Drawabox.com), this year I've started drawing more actual things, and also started doing digital work. Mostly this is assignments for various courses (so I'm limited in the time I spend on them) and at the bottom is a WIP illustration I plan to put a lot more time into.\n\n[Some of This Years Drawings](https://imgur.com/a/JlSrYmI)\n\n**Goals and what comes next**\n\nI made a video which goes together with this post where I go a bit deeper into my yearly review. Linking videos here is against the rules but I got permission to mention it, so anyone who is interested can find it in my profile. So that is part of what comes next. This year I have just been working towards this post and not shared much with anyone, but now have created this channel where I will post updates on my art and game, as well as things I've learned when it comes to productivity, maintaining healthy habits etc.\n\nThe primary goal for my next yearly update is that I want to create a vertical slice for the game I'm working on, so that I am no longer just a person who eventually intends to make a game, but I'm actually someone working on a game. The main challenge is to land on and execute an art style I'm happy with at least as a starting point, and then implement some of the core gameplay mechanics so I have something to show.\n\nOther than that I also hope that as the world (hopefully) starts opening up sometime next year, that I'll be able to have a more healthy relationship to travel, where I don't inevitably end up pairing it with a very unhealthy binging. \n\nThank you to anyone who read this. Inspiring others through my actions is a huge motivating factor for me, so I hope someone got something positive out of this. Questions are also always welcome. \n\nSee you 25th of November next year.\n\n<3 Liz.\n\nEdit. I always feel bad not directly responding to every person who gives a supporting comment (but responding to everyone would also seem weird) so just want to say thank you so much for all the support. And to everyone who has reached out directly as well sharing their stories. I don't think I would be able to stay as committed to this path if I did not have anyone to share it with or did not think it would resonate with other people.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k0z61w/update_i_posted_my_commitment_to_be_better_2/", "title": "[UPDATE] I posted my commitment to be better 2 years ago after my Girlfriend passed away. My second yearly status report.", "social_network": "reddit", "user": "relderpaway", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1804, "down_vote": 0, "creation": 1606333006, "permalink": "/r/DecidingToBeBetter/comments/k0z61w/update_i_posted_my_commitment_to_be_better_2/", "nsfw": false, "first_save": 1635435446.147207, "replies_charged": false}