{"id": "t5_2tand_t3_5a5ujc", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Please stay with me for two major problems one being a fear of publicity and two being the feeling that I am not myself. \n\nI am an 80's baby who people believe to be intelligent, outgoing, self-motivated, and successful. \n\nI, on the other hand, believe that I have a poor retention, I only have motivation in bursts (for new knowledge),  and I am not successful by my standards. Also, if any of those qualities were true they are only so in a closed environment with no real publicity. Success for me is leaving a family legacy for generations. I believe the way for me to leave a legacy is through ownership. \n\nI have a legitimate fear of allowing masses to see my work. I don't have stage fright for presenting material at work, but when it comes to my personal work toward a design firm I struggle to have it seen. This crushes my motivation and I stop doing the work until I get some novel reminder that I ought to do it. I guess this is not really about motivation as much as it is persistence and overcoming the fear of publicity. Do you have any advice for how I can overcome this fear? \n\nWhere I am from you can regard as a tough neighborhood. I mean it sounds absurd now, but people, where I am from actually, expect to do time in prison and it becomes a badge of honor. I made it out, but that does not mean that I disregard the culture. Growing up was tough, but it was funny, there was happiness, and I feel my culture is something that feeds me and I see that it is appealing to people. My origin story is similar to people like Jay Z and T.I. and the delivery, cadence, and commentary that I feel most comfortable in with is similar to southern hip-hop culture. However, I feel so restricted when I communicate and I have filtered for so long that I feel so bland and filtering tires me out by the end of the day. \n\nI also have a family that does not share my upbringing and my significant other understands all of this is tries to help me be my truest self, but I still filter unless I am talking to people from back home which I do not do often because it makes me homesick and I almost feel fake. I am not talking about being disrespectful, or arrogant in public, I just want to be confident and show my culture. I watch interviews of people like Jay Z, T.I., Big Krit, Muhammad Ali, Timothy DeLaghetto, and the Hodgetwins to see how they interact in offices and dealing with people who are not of their culture. I just want to be able to do that; keep my southern accent, make references to my culture music and interest, and share my story. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5a5ujc/i_need_as_much_help_as_possible_please_do_this/", "title": "I need as much help as possible, please do this one favor for me, I need help to get things done.", "social_network": "reddit", "user": "burnafterreadingthis", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 23, "down_vote": 0, "creation": 1477831505, "permalink": "/r/DecidingToBeBetter/comments/5a5ujc/i_need_as_much_help_as_possible_please_do_this/", "nsfw": false, "first_save": 1635436506.937803, "replies_charged": false}