{"id": "t5_2tand_t3_hyqinp", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "For most of my life, I’ve been a serial quitter. Pick up a million new habits when feeling “motivated”, do them for a week, maybe two, maybe even a month aaaand then, I’d get burnt out and quit. \n\nRepeat this x 28.5 years and you’ll find where I was not too long ago. Feeling like I couldn’t do anything consistently, and that maybe I’d always just be a quitter. \n\nI’ve quit a lot of things because I’m a recovering perfectionist. If I wasn’t the best at something, I didn’t want to take part. It’s an easy cop out, really, because of course- a beginner will never be the best at something and continuously make a lot of mistakes- that’s how they eventually, over time with commitment, become a master. \n\nMy life is now very consistent, and it’s been this way for a few months now. It’s 7:15 and I’m about to go for a run, I just finished my AM yoga & meditation practice, and I’m currently reflecting on how grateful I am for the life I’ve cultivated. It didn’t come naturally- I built it day by day. \n\nI now realize that the reason I was a quitter was because I just gave up when I should’ve rested and regrouped. I never went back into something just because I was tired. I’d burn myself out so much and be heavily depleted, instead of resting when I anticipated I would get tired and then be excited to get back into my routine. \n\nThe past week and a half I’ve felt very heavy energetically. I haven’t wanted to move much. I did yoga most days but I took off two days last week which is rare for me now. I knew I needed it but I still felt a little fear- if I stop, will I ever start back up again? \n\nI now realize I’ve just been telling myself I’m a quitter- and self-fulfilling that prophecy over and over again. I’m not a quitter, I’ve just quit things because I didn’t know better and how to maneuver myself in the world ... now I do. \n\nNow I know I need to rest, and if I want to do what’s best for myself (and in turn, for everyone around me) then I need to look after & take care of me by continuing to participate in the healthy habits that have changed my life. I now know that the people who have the most purposeful & peaceful existence didn’t stumble upon it- they created it day by day but practicing what serves them & letting of what doesn’t. Sometimes, in life, those things change. Maybe running is best for me today- but tomorrow, rest will serve me higher. \n\nIt’s important to check in ourselves and notice where we are holding onto past stories or becoming complacent. Are we resting or being lazy? That looks different for everyone. I had rested and rested, felt pretty good and on Saturday I decided I would go for a run. I found a lot of thoughts saying, “maaaaybe just take another day” but I knew that I had the energy and rested - I just needed to re-establish myself and my habit. I went for a run and it was the BEST feeling. It’s no coincidence two days later I am waking up earlier than i have in a week and about to put on some running shoes. \n\nOur lives, although many aspects are out of our control, depend on how we react or respond in any given moment.  We have a huge part in how our experience goes. There’s no road map or instruction manual but we can go off of how we feel and intuitively, we know a lot more than we give ourselves credit for. \n\nI hope you all have a beautiful day!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hyqinp/rest_when_you_feeling_like_quitting_then_get/", "title": "Rest when you feeling like quitting & then get right back into that habit you want to build.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 122, "down_vote": 0, "creation": 1595849180, "permalink": "/r/DecidingToBeBetter/comments/hyqinp/rest_when_you_feeling_like_quitting_then_get/", "nsfw": false, "first_save": 1635436040.6860507, "replies_charged": false}