{"id": "t5_2tand_t3_5fpnc1", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Human psychology tricks that will help you improve the outcome of any situation, thus giving you a mental advantage over the others, and they’re worth reading.\n1.) When you first meet people, try to see their eye shading while smiling at them. It may be on account of you looking a second or two longer, it is assured that people really respond to it in a positive manner.\n\n2.) Asking someone to do you a small favor trains their brain to believe they like you.\n\n3.)Foot-in-the-door phenomenon, People are more likely to agree to do a task for you if you ask them to do something simpler first (Gradual commitment makes people think you like them). Alternatively, you ask them to do an unreasonable task and they’ll say no. So then you should ask for a more reasonable task and they will be more likely to agree.\n\n4.) Remembering Names, if you can get into the habit of not only remembering someone’s name when you first meet them, but using their name in the subsequent conversation you have, they’ll find you terribly charming and wonderful. Isn’t that awesome?\n\n5.)When laughter breaks out in a group of people, each one will instinctively glance at whichever other individual they feel closest to in that group. This is a good way of spotting who is more closer to whom in the group.\n\n6.) Chew gum when you’re approaching a situation that would make you nervous like public speaking or bungee jumping. If we are ‘eating’ something, our brain trips and it reasons “I would not be eating if I were danger. So I’m not in danger’’.\n\n7.) People’s feet are often an insight into what they’re thinking. For example, if you approach two people talking and they turn their torso to you but not their feet, they’d prefer you leave them alone. Similarly if you’re talking to someone and their torso is turned towards you but their feet are facing in another direction, they want the conversation to end.\n\nSource:http://mysoultemple.com/15-clever-human-psychology-tricks-that-everyone-should-know/\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5fpnc1/15_clever_human_psychology_tricks_that_everyone/", "title": "15 Clever human psychology tricks that everyone should know", "social_network": "reddit", "user": "yash131997", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1480513292, "permalink": "/r/DecidingToBeBetter/comments/5fpnc1/15_clever_human_psychology_tricks_that_everyone/", "nsfw": false, "first_save": 1635435844.0793586, "replies_charged": false}