{"id": "t5_2tand_t3_qfv3bt", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "I'm a 22 year old guy who proclaims to have lived several lives. I was born to Kurdish parents in Syria but I grew up in Lebanon until I was 14. I grew up speaking and learning Kurdish from my parents at first. Without knowing Arabic which is the language spoken in Lebanon. So I had to learn Arabic growing up during kindergarten. Therefore, it has been hard for me to fully express myself to my friends and surroundings, even until now. However, I had been ahead in my class and got to learn English through having only English cartoon at home deliberately done by my mom in order for me to learn it. I want to also mention that as I grew up, I had experienced parental abuse, poverty, discrimination, fear of racism (for being a Syrian national in Lebanon) growing up as kid. I'd work for my dad as a kid to help him out but as business went bad, life at home went bad as well. My dad became and alcoholic and would beat me or my mom up. But as a kid I thought that what he's doing is understandable. I did so because of the influence of religion that I've had from school and from my grandpa. I was raised in a Christian school and am from a Muslim family. I'd visit my grandparents in northern Syria during the summers and my grandpa was a Muslim extremist. He taught me about Islam and how to act and behave. I've always wanted to be a good, virtuous person as a kid. But all of that ended as my mom introduced me to the thought of secularism and atheism. That she did out of hate for what her dad (my extremist grandpa) forced her to go through in the name of religion. Then in 2014 we got completely broke and my dad lost his invested savings in Syria due to start of the war. My mom forced my dad to consider illegally traveling to the EU for asylum. While me and my mom and sister would wait in the village in northern Syria with my grandparents. However, shortly after that, my village got attacked by ISIS (Battle of Kobani). So my grandparents and the whole village fled to turkey and became refugees. We travelled to my grandparents by going through the worst trip of my life. That involved an overfull bus going from Lebanon to northern Syria through tens of Assad, free Syrian army, Al-Qaida and Kurdish troops checkpoints. Then we had to illegally cross the border from northern Syria into Turkey, that itself deserves it's on post The point of this journey was to wait with my grandparents until my dad would try to get to Europe illegally. He eventually did and it took the process of him getting a residence and us being eligible to travel to him around 2 years. In those two years I got to experience the Turkish culture. Very different. They don't speak any language that I spoke. They were very much racists towards Syrian, not all, but the majority. I've lived in Islamic parts of turkey, leftist parts of turkey and finally the mix of both which was Istanbul. In those two years i was also a refugee. I didn't have school because of language. I was forced to work as a 14-16 year old due to poverty. I was abused by my employers and overall it was a shitty experience. Then me, my mom and sister ended up in Sweden. My mom divorced my dad, and I had no contact with my dad's side of the family which I was really close to, due to choosing to live with my mom. Moving on to the subject of living in Sweden. As you can imagine, really different from where I've been. But I can't emphasize enough how different it is. People are nice but I didn't understand them, even sometimes now after 5 years of living here. Too much individualism, very little sense of community. \nWhen I came to Sweden, I learned the language asap in order to get back to school and start highschool. Now, here I am, studying 2nd year physics at Lund university and having the feeling of not belonging to any social group. I can easily mingle and talk to people, but I feel like no one gets me. I have friends, but I always have the thought and feeling that none of them has experienced what I've experienced. None of them has gone through what I've gone through. None of them I can trust and believe that they get me. \n\nPersonality wise, I like arguing and debating. I think it's fun to think of all the different perspectives. I sometimes even debate myself, like an actual deep debate between two different people. I'm also very competitive and can attain a high level of self focus. I am agnostic and additionally I feel like my brain is relatively faster than other's.\n\nThe reason for this post is that felt like I wanted to understand how to find a group of people like me but it ended up sounding like me giving a story about my life. There are of course a lot of more details, dimensions and complexity of what I've lived through. I also like ask if I am special. I like convincing myself that. Maybe that's why I'm writing this. To feel special. But I can't be sure.\n\nIf anyone wants to give their insights and mention immediate thoughts they have after reading something i wrote, please go ahead and comment. I want to learn more about myself and how to improve. I know I'd improve if I had a sense of belonging. Because then I'd feel more secured.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qfv3bt/person_who_proclaims_to_have_lived_different/", "title": "Person who proclaims to have lived different lives and feeling not belonging anywhere.", "social_network": "reddit", "user": "sherwan24", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1635210389, "permalink": "/r/DecidingToBeBetter/comments/qfv3bt/person_who_proclaims_to_have_lived_different/", "nsfw": false, "first_save": 1635436788.4260426, "replies_charged": false}