{"id": "t5_2tand_t3_aacanb", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "This year, I've also decided to share my *list of best books*. I concentrated on non-business books (if you allow me to use this weird description).\n\n**The Four Agreements by Miguel Ruiz**\n\n>The tools shared by don Miguel are based on common sense and shared with such simplicity, that the universal message underlying his teaching is recognized by many. don Miguel's message is simple, practical and when implemented, even incrementally, changes lives.  \n>  \n>In the tradition of the Toltec, a Nagual guides an individual to personal freedom. Combining new insights with old wisdom, don Miguel has dedicated his life to sharing the ancient Toltec wisdom by translating it into practical concepts that promote transformation through truth and common sense.  \n>  \n>Goodreads.com\n\nThis book is based on the wisdom of the Toltec Native Americans, who are not a separate race or nation but rather an organized group who had considered themselves scientists. I found the message in the book really simple and appealing: live your life by abiding  four simple agreements (I am omitting them in order not to spoil the book). They will make you a better person, will save you a lot of the hustle of the modern life (stress, depression, low self-esteem, and so on), and help you achieve personal freedom.\n\nI would recommend the book to everyone striving to achieve better harmony in their lives. It is very easy to read the book (it took me literally a day), but very hard to live by it. As Tin said in his review, the similarities between this wisdom, Zen, Stoicism, and others is striking.\n\n>Nothing other people do is because of you. It is because of themselves.  \n>  \n>Miguel Ruiz\n\n**Be an Island by Ayya Khema**\n\n>Ayya Khema (August 25, 1923 – November 2, 1997) was a Buddhist teacher and was very active in providing opportunities for women to practice Buddhism, founding several centers around the world. In 1987, she helped coordinate the first-ever Sakyadhita International Association of Buddhist Women. Over two dozen books of her transcribed Dhamma talks in English and German have been published. In the last year of her life, she also published her autobiography: I Give You My Life.  \n>  \n>Wikipedia\n\nThe path to Spirituality is pretty straight-forward, once you get on it. Most of the people I talk to, who are interested in finding it, struggle to get to the *starting point*. I usually refer them to Ayya's books, because she has described that stage as simple as possible. It is a bit too heavy on Buddhist jargon, but once you are past that, the message is clear.\n\nI would recommend this book once you've learned how to meditate (her other books may be more useful if you are not there yet). \"Be an Island\" can give you enough food for thought that you can address during your meditation sessions.\n\n>Our own mind makes us happy or unhappy — nothing else in the world can.  \n>  \n>Ayya Khema\n\n**Man's Search for Meaning by Viktor Frankl**\n\n>Viktor Emil Frankl M.D., Ph.D., was an Austrian neurologist and psychiatrist as well as a Holocaust survivor. Frankl was the founder of logotherapy, which is a form of Existential Analysis, the \"Third Viennese School\" of psychotherapy.  \n>  \n>His book Man's Search for Meaning (first published under a different title in 1959: From Death-Camp to Existentialism. Originally published in 1946 as Ein Psycholog erlebt das Konzentrationslager) chronicles his experiences as a concentration camp inmate and describes his psychotherapeutic method of finding meaning in all forms of existence, even the most sordid ones, and thus a reason to continue living. He was one of the key figures in existential therapy.  \n>  \n>Goodreads\n\nI was very careful with this book. I've been hearing praise about it for a few years before I dared to buy it. And a few more years passed before I dared to open it. I am happy that I waited so long and I am looking forward to the next time I get to read it a few years from now. This is an amazing book, but this is also a sad book. 70+ years separate us from the horrors described in it, but the wisdom that Viktor found in the concentration camps is eternal. You are no longer the animal whose only meaning in life was survival, you are now free to choose (or discover) your own meaning and your own calling.\n\nOnce again, this is an advanced book that I would not recommend if you're just starting your self-discovery. But I will surely recommend it, if you've chosen that path for you.\n\n>For the meaning of life differs from man to man, from day to day and from hour to hour.  \n>  \n>Viktor Frankl\n\n**The Gift of Fear by Gavin de Becker**\n\n>Gavin de Becker is an expert on  the prediction and management of violence. He has served on President's  Advisory Board at the U.S. Department of Justice and the Governor's  Advisory Board at the California Department of Mental Health; he now  runs a consulting firm which advises government agencies, universities,  police departments, corporations, and media figures on the assessment of  threats and hazards.  \n>  \n>Goodreads\n\nThis book is scary and educating at the same time. Gavin shares the horrors that modern life offers (both to men and women, but mostly to women) and the one gift that we all have, which can help us live a safer life. Most of all, this book teaches you to differentiate between worry and fear and to trust your intuition when you feel pure fear.\n\nObviously, I would recommend this book to all women out there, living anywhere in the world. But also, to all men who love their wives and want to help them feel safe and avoid danger where and when it actually exists.\n\n>Intuition, remember, knows more about the situation than we are consciously aware of.  \n>  \n>Gavin de Becker\n\n**Tribe of Mentors by Tim Ferriss**\n\n>Tim Ferriss is author of three #1 NYT/WSJ bestsellers: The 4-Hour Workweek, The 4-Hour Body, and The 4-Hour Chef.  He is also a start-up advisor specializing in positioning, PR, and  marketing (Uber, Evernote, etc.). When not damaging his body with abusive sports, he enjoys chocolate, bear claws, and Japanese animation.  \n>  \n>Goodreads\n\nProbably, you will consider this book a very weird choice, given the books before it. I agree! But something about it stroke a cord with me. Timothy Ferriss asked a bunch of interesting people a series of questions and published them. Simple idea, but hard to implement. Without over-generalizing, you can feel Tim Ferriss' personality in the choice of the interviewees: these are all fields that he is trying to perfect in himself (hence the title Tribe of Mentors).\n\nI would recommend this book to anyone. As Tim Ferriss' says, most of you will like a few of the answers and hate a good deal of the rest. And for other people, it will be just the opposite. Try it and let me know how it goes.\n\n**Summary**\n\nLately, a lot of smart people have be re-iterating that reading a few (\\~ five) hours a week is paramount to success. I believe in that and exactly because reading in the modern life has become an elite activity (only selected few do it), I would encourage everybody to do it. And I will also re-iterate Tin's advice: do not skim over books, do not learn how to speed-read, this is not the purpose.\n\n*Read more, enjoy more, be more!*\n\nGil Mayer\n\nAuthor", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/aacanb/gils_list_of_best_books_2018_nonbusiness/", "title": "Gil's List of Best Books 2018 (Non-business )", "social_network": "reddit", "user": "gilmmayer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1546018119, "permalink": "/r/DecidingToBeBetter/comments/aacanb/gils_list_of_best_books_2018_nonbusiness/", "nsfw": false, "first_save": 1635437139.0464916, "replies_charged": false}