{"id": "t5_2tand_t3_lwvh8b", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "My customer, Anton, was a businessman. Or at least he thought he was. By the moment he came to me, his business was still as small as it had been nine years ago. Anton came to me for some business advice, but his problem is not about his business skills. He is not a businessman by nature.\n\nAs you might remember, strategic thinking is not only about goal setting. The first thing to do is to analyze one's current position. In business domains, we use such things as market analysis to define it. What can we do in real life?\n\nTo answer this question, we should turn our attention to our brains. We know that we are all gifted differently. Somebody is a musician, and someone is a sportsman, and so on. But what makes us different? Our neural connections do. Everybody has in their brains a unique set of neural connections. The majority of them were created while the owner of the brain was under the age of three.\n\nHuman beings are able to create new neural connections throughout their lifetime. We can learn another language or playing piano at any age. But those first, initial neural connections are the strongest. What does it mean? That our brains work faster while using them. People call it \"talent\" or \"calling.\" When we do something in which those neural connections are involved, we do it better, faster, easier. As a result, we get pleasure from doing it. And, as a result of that, we try to do it as often as possible, polishing our neural connections and improving them even further.\n\nUnfortunately, just a few people realize their callings. You may see them on the covers of magazines. They live as if they have compasses inside their heads, always pointing in the right directions. But the majority of us (including me some years ago) cannot see what we were created for. We are lost among our dreams, parents' and spouses' demands, friends' opinions and publicly uphold behavior patterns. We change so many roles during a day, so we can't see which one is the most important. \n\nBut there is a solution, and you need nothing except a pen and a copybook. If you can’t see clearly who you are, you can reconstruct yourself by keeping a diary, writing down all the things you liked or disliked during every day. \n\nWhen you do something using our main neural connections, you feel pleasure. You can try to suppress this feeling if you believe it is inappropriate, but you can't stop feeling it. When you do something confronting your inner inclinations, you get angry or bored. You may try to suppress it as well, but the feeling doesn't disappear. When you get pleasure, you do the things very close to your calling. If you feel anger doing something, you are drifting away from it. \n\nI made Anton keep a diary for two months (it’s enough as a rule). By the end of this work, he found out that he was whoever but a businessman. He was a very creative person, and boring everyday business stuff drove him crazy. Why did Anton become a businessman? I'll tell you next time. \n\nKeep your diary at least two months, every day, and soon you’ll see that there are things you’re ALWAYS glad to do. They are very close to your calling. And there are things you ALWAYS hate to do. You’d better avoid them as much as possible. One shouldn’t interpret those signals from deep of their soul literally. But they are definitely worth listening to them. We will continue next time; stay tuned!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lwvh8b/strengths_and_weaknesses/", "title": "Strengths and Weaknesses", "social_network": "reddit", "user": "sbiryulin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1614782619, "permalink": "/r/DecidingToBeBetter/comments/lwvh8b/strengths_and_weaknesses/", "nsfw": false, "first_save": 1635436861.341568, "replies_charged": false}