{"id": "t5_2tand_t3_mnseqv", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "**Alert: mention of sexual abuse.**\n\nIt all started with my current relationship. My relationship with my partner is based on love and respect, we fight for each other and we always back each other up. We are a great team. However we both struggle with mental health issues and this enables lots of our triggers, so it can get difficult very easy.\n\nWe are currently going through a rough patch and we are trying to work things out with patience. \n\nBefore this last time, we had other times in which things were unstable; however, because this time I have considered seriously to break up with him and even asked him to leave, I was forced somehow into facing my worse fears. It took me days to recognise them and to speak my truth, but compared to the years I spent in self-hatred and fear --- this is so quick and incredible.  \nFor months, the whole universe was speaking openly to me. It was saying: it's time to do this. It had to happen in the most dramatic, unpleasant way but, you know, it happened.   \nI saw right through myself.\n\nI have never put myself first in any of my relationships.   \nI don't know if this is because of a learnt pattern, as women in my culture are used to \"serve\" (I am Italian) or because of my background of emotional and sexual abuse - my parents were emotionally unstable and I was abused by two people from my family when I was a child. I am sure it's a mix of all these things.  \nI am a pleaser, a giver (to a damaging extent), I lie to myself and ultimately I am not always authentic. It's hard to type these words, but it's the truth, and today I snapped out of it.   \nI had a massive, massive, massive shift in my soul and I recognised all the times in which I sacrificed my own space for the \"pleasure\" of being in the company of my partner, of making them happy, of making sure that I would not put myself in a condition of being left alone, of being in an unstable situation and so on. I would tolerate a lot of negativity unable to stand for myself.  \nBeing a control freak, I am mostly unable to manage unstable situations: they trigger me, I end up going crazy over tiny insecurities. I can track this back to my upbringing, as one of my parents had control issues that inevitably fell on me and my sister.\n\nI have also identified some other fears that never allowed me to express myself fully and authentically: as a consequence of the overprotective behaviour of my parents, I am terrified of living my life without a guidance or with a figure next to me (in this case, my partner). I know that many of my behaviours are related to this, my jealousy, my insecurities, my lack of confidence, being possessive, low self-esteem, and being aware of this pattern makes me feel... amazing. It makes me feel amazing.\n\nIdentifying fears, accepting them, helped me to see where I can get better, and putting myself first in every area of my life will be a relief to all this pain, as I can feel already since I started to apply it. I feel it so much. \n\nSo starting from today I am taking myself and my self-care, my needs and my own space and time seriously. I got in contact with a friend and we are planning on starting a women's circle, she is going to introduce me to her friends and I hope I will get more and more involved into spiritual activities. I want to have my own things, to be separate from my partner and enjoy my individuality, which I was never taught as a child/young adult. I am learning now and I feel so empowered and happy with this big change.\n\nTo celebrate I booked a massage session which I am going to attend on my own :) and this is going to be only the beginning of the beautiful journey that I am on.\n\nI am grateful to myself for having the courage to engage in this ultra heavy, courageous journey and to my partner for having the courage to speak his truth to me although he was scared of my reaction. Relationships allow us to grow, to face our worse fears and to recognise our own limits.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mnseqv/today_i_learnt_what_it_means_to_put_myself_first/", "title": "Today I learnt what it means to put myself first", "social_network": "reddit", "user": "Saragreen1995", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1618007828, "permalink": "/r/DecidingToBeBetter/comments/mnseqv/today_i_learnt_what_it_means_to_put_myself_first/", "nsfw": false, "first_save": 1635437753.1670058, "replies_charged": false}