{"id": "t5_2tand_t3_b2oc60", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I've always considered myself to be someone that's messy, but never \"dirty\". I've been living on my own without roommates for a year and a half, and in that time, it's been a slippery slope. It started immediately upon me moving in—I had dirty laundry from my old apartment, I didn't fully unpack everything or organize everything, and was working two jobs for a total of 60+ hours a week. It was just easier to be complacent. I made excuses for why my friends couldn't come over, and it became the place I slept and just threw my things down when I got home.\n\nI've been ashamed of my apartment and myself, and in the past several months it's gotten to whole new levels of bad. It was debilitating, and just easier to ignore it. I walked around with horse blinders on, stepping on magazines, dirty clothing, fast food bags, and just pretend it wasn't there. My fridge stopped working, and rather than calling maintenance I just stopped buying food that needs refrigeration and only bought fast food and non-perishables.\n\nEven now, I'm hesitant to use the word hoarder because I don't feel like I was hoarding anything— reading as much as I can online about hoarding, it always felt like they listed having an emotional connection to the items as one of the biggest signs. And that's never been a problem, I wasn't attached to the trash, I was overwhelmed by it. I couldnt start because I couldn't see the finish line.\n\n\"Do what you can, when you can. It doesn't matter if all you can do is one small thing, you've still done something.\" that was advice a therapist had told me years ago, in regards to my depression and anxiety and a completely separate issue in my life. Both then and now, I felt like that advice was stupid—if I could do something, small or otherwise, I wouldn't be in this place, I would have tried that already.\n\nI quit my job at the beginning of February, and have been unemployed since, I was spiraling further down than I ever have before. And then I woke up last Monday and realized I couldn't do this to myself anymore. I can't. I've hit rock bottom, and I can't do anything but go up, it's just a matter of figuring out how.\n\nSo I bought several boxes of large trash bags, and got to work. And, for the first time, I listened to my therapist, and I did what I could. I started with the fast food trash, the stuff that was obviously trash. And the I worked on the laundry, gathering it all up in one room, organizing it by color and getting rid of what was too small or had holes in it, or was from high school—I don't need nostalgia, I need to see my floor, and if I don't wear it I don't need it.. And then I went to bed.\n\nSee, that was the whole thing. I've always suffered from this need to be perfect, to do things perfectly. And what I didn't understand about what my therapist had said to me was that it's okay to start something that I can't finish, and only do one small thing. I've always felt overwhelmed because I felt like I had to get my life sorted in one go, and if not than why even start? And that's what allowed me to get to be as bad as I've been, because I felt like I couldn't start.\n\nI've filled up 22 garbage bags, and I still have a very long way to go before my apartment is habitable by normal human standards, and I'm not proud of the person I was that allowed me to get to this state, but I'm proud of the person I am trying to be that's digging myself out of this hole.\n\nIf you've read this huge block of text, thanks for listening, and if anyone has any advice on how to stay not messy (especially in terms of lack of motivation) that would be phenomenal.\n\nEDIT: holy cow. Wow. I'm genuinely astounded by how kind everyone has been. I thought I'd get maybe one or two responses, and honestly I was really anxious that people would think it was gross how bad I let it get so it took everything I had in me to post this. I'm gonna be responding to everyone individually, but to this entire community, thank you from the bottom of my heart. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/b2oc60/im_cleaning_my_apartment_for_the_first_time_in_a/", "title": "I'm cleaning my apartment for the first time in a year.", "social_network": "reddit", "user": "NotTheSharpestCacti", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 789, "down_vote": 0, "creation": 1552944429, "permalink": "/r/DecidingToBeBetter/comments/b2oc60/im_cleaning_my_apartment_for_the_first_time_in_a/", "nsfw": false, "first_save": 1635436045.819599, "replies_charged": false}