{"id": "t5_2tand_t3_fy8eyt", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "\nTL/DR: went from being a really miserable person to someone who’s about to be a double major with biology\n\n\nI’m a 19 year old trans guy, \nMy experience in highschool / middle school has been brutal, like most queer people. \n\nMy dad suffered severely from alcoholism, I didn’t understand it much till I was around 15, but he’s tried to commit suicide three whole times while I was in highschool.\n\nMy mom constantly had that stress on her, and my relationship with her was terrible. Especially when I came out as trans. \n\nMy family lost a ton of money, and I had to pick up a job to pay my phone bill and school fees. I went to school in a privileged area so it wasn’t common for students to have jobs during the school year, and not a lot of teachers were very understanding of this, so I was constantly called lazy when in reality I was just exhausted.\n\nMy school was kind of far from home and the bus ride was long, so I’d wake up at 5:30 am every day and I wouldn’t get home till 6pm.\nI also couldn’t afford a car so I walked an hour to work a lot of the time.\n\nSchool was my safe space for awhile because I didn’t get a long with my mom and I was safe to be myself at school. Because of work I didn’t have time to hang out outside of school either, so school made me feel less lonely. I had plenty of friends and a romantic partner which was great. \nBut I found out that my partner had been cheating on me with my best friend at the time, and all of my friends knew but no one told me.\n\nThis hurt me a lot and I lost a lot of trust in my friends and a lot of people stopped talking to me after I confronted them.\n\n\nI met one guy who became a close friend of mine and honestly he helped me through so much.\n\nI won’t go into more details but I really went through a lot of trauma, and I felt too guilty at the time to accept it as trauma. My grades slipped due to my depression, and I had a LOT of self hatred.\n\nIt was so bad that I couldn’t look at myself in the mirror, even on a good day.\n\nI would brush my hair facing away from my mirror, even.\n\nI will always remember getting into this terrible fight with my mom for staying out late (she thought i was drinking and she has trauma with alcohol) and hearing her say,\n“You’re such a selfish bitch, you’ve done nothing for this family. You only think about yourself. I wish you would just leave us alone.”\n\nI had been through seemingly worse things but that statement hit me the most, because it was ultimately what all of my self hatred revolves around. Everything being my fault, my existence being only something that could hurt people. \n\nIt also really made me realize how alone I was with everything. I didn’t have a real family, I didn’t have a safe place, everywhere I was constantly not good enough. No one knew what I was really going through and I had no way of communicating it.\n\nI eventually graduated highschool with a 2.7 GPA, and got into college.\n\nI was filed as an independent when I was 17, so I have a TON of financial aid, and I don’t rely on my parents financially at all. \n\nMy best friend who never betrayed me in hs became my roommate, and I really love them like family.\n\nI worked really hard, and now I have a job at Whole Foods where I make more money than most people my age.\nI can pay all of my fees on my own.\n\nI pay for my own hormone therapy (testosterone) and I’m starting to pass physically.\n\nI still keep in contact with my mom and love her, and she’s finally understanding my identity.\n\nIm a sculpture major and I just got accepted to double major in biology for this fall and plan on pursuing a masters later on in biomedical visualization. \n\nI’m nervous to work with biology students, especially because of how intelligent they are. But I’m actually really excited too.\n\nMy GPA is a 3.7 (not amazing but way better than before!) and my professors constantly compliment me on my work ethic and character.\n\nI have moments where I do get really lonely and empty, like when my roommate goes to their family for birthdays and stuff.\n\nBut for the first time In years I finally feel motivated and I’m actually starting to love myself again. I look in the mirror and stare at my face while I brush my teeth, and it doesn’t fill me with dread.\n\nIf you’re reading this and are going through a rough patch as a young person, I know it sounds cliché, but it really really gets better. \n\nAnd that’s not something just saved for people who work hard and brilliantly through their depression.\n\nI went through a lot, but I also made a lot of mistakes. And things are still looking up.\n\nPlease don’t stop pushing, even if that just means waking up the next day. Please forgive yourself and be gentle when you can.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fy8eyt/queer_kid_who_lost_it_all_finally_kind_of_gets/", "title": "Queer kid who lost it all finally kind of gets somewhere", "social_network": "reddit", "user": "angelhairpasta69", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1586493259, "permalink": "/r/DecidingToBeBetter/comments/fy8eyt/queer_kid_who_lost_it_all_finally_kind_of_gets/", "nsfw": false, "first_save": 1635437857.2073977, "replies_charged": false}