{"id": "t5_2tand_t3_o8tp5v", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "“I really wish I had never allowed that person to convince me to do this.” “We should have never moved here.” “Why did I buy this, it was such a poor choice.”\n\nRegret comes in many different forms.  It could be from a purchase we made, a reaction to a situation (raising our voice at a loved one), or a decision at work. In the end, regret is a feeling within us and something that we can change.\n\nWe all have decisions that we make every day. We make decisions based on many things and for a myriad of reasons.  Do you have regrets about decisions you’ve made? If so, why?  \n\nRegret stems from how we think we should of acted or chosen a path differently based on a very unfair reality that we need to identify: information.  We all make great decisions, and we all make poor decisions.  In the end, we make decisions based on the information we have at the time and on the outcome that we think or predict will happen.  When we make good decisions that work out in our favor or in the manner we predicted, we think we made a “good decision.” When we make a “poor decision” we attack ourselves with thoughts like “why was I so stupid” or “should of saw that coming” or “I wish I should(n’t) of….”\n\nWhat can we do?\n\n**Trust yourself**: you made the decision you made for a reason, and you made it with your best interests in mind.  \n\n**Reflect on you decision** (whether good or bad) with curiosity or compassion, not judgement. Write down your thoughts on the decision. What were you thinking when you made it, and what are you thinking about that same decision now? Why did you do what you did – again, approach with curiosity or compassion, don’t judge yourself or beat yourself up. \"This didn't work out the way I wanted, and that's ok. How can I make it better looking forward?\"\n\n**Move forward no matter what**: How can you let this go? How is dwelling in the past helping you now? Do you need to apologize to yourself, or someone else? Explore what do you need to let it go, and then ask how can you get that.\n\nIn the end, and after you’ve let go of that regret, you can now allocate that energy to something more productive and more value-added. \n\nI hope this helps you to judge yourself less and better let go of past decisions that have turned out to be “poor” ones.  We all make bad decisions but learning to move forward is key to getting over it without it continuously haunting us. \n\n**TLDR**: We all make “bad” choices sometimes. Do you regret those choices? Explore the feeling of regret with compassion for yourself to identify why you made that choice. Then, let go of the regret knowing that you made the best choice with the information you had at the time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o8tp5v/removing_regret_from_your_life_tldr_at_bottom/", "title": "Removing Regret from Your Life (TLDR at bottom)", "social_network": "reddit", "user": "Ok_Hamster3522", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1624785618, "permalink": "/r/DecidingToBeBetter/comments/o8tp5v/removing_regret_from_your_life_tldr_at_bottom/", "nsfw": false, "first_save": 1635436504.8847106, "replies_charged": false}