{"id": "t5_2tand_t3_mnnyjk", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "Hi, i’ve recently come to the realization (like 5 minutes ago recent) that I have a very cynical mindset. I find it hard to trust what others say whether it’s about self improvement or a thought they have that sounds nice. I tell myself that this person doesn’t actually believe what they’re saying and they are just trying to convince themselves. I realize that this is a thought process i’ve developed as a result of my own shortcomings and it is wrong and simply not fair to judge others based off my inability or failure to make a change I felt would better me as a person.\n\nI don’t want to change this mindset simply because I don’t want to doubt others, but it has become such a toxic roadblock that I am cynical towards my own desire to change as well. Even if I do make a change, I find it difficult to appreciate myself or feel proud that I was able to change something hard for me. For example, I quit nicotine and porn almost 6 months ago and even though it was a nice boost to my confidence, it’s not enough for me to believe that people can actually change. So this causes strings of doubt within my own journey of self betterment. \n\nOverall, I am really fucking over this shitty way of thinking. It’s not fair to others and more importantly it is not fair to me. I deserve to be happy and I know that change is possible. \n\nP.S. if anyone knows of any self improvement books to alleviate a cynical mindset, I would appreciate hearing about them.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mnnyjk/im_done_being_a_cynical_person/", "title": "I’m done being a cynical person", "social_network": "reddit", "user": "TheRussianCosmonaut", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 132, "down_vote": 0, "creation": 1617994257, "permalink": "/r/DecidingToBeBetter/comments/mnnyjk/im_done_being_a_cynical_person/", "nsfw": false, "first_save": 1635435254.2352593, "replies_charged": false}