{"id": "t5_2tand_t3_c58eod", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": " \n\nDear Reddit,\n\nPlease provide me with your advice, I could use it greatly. Let me introduce my situation by stating the following.\n\nI (Male, 28) am a lucky bastard in many respects:\n\n* All the people I care about are in good physical health. I am in good health as well.\n* I have a fantastic relationship with my girlfriend, we have been going strong for over 5 years and I would rate our relationship a 9.5/10 – moving in together soon.\n* I have a large and varied group of friends. Some of these friendships are long-lasting and deep. I feel like a valued and cared for friend and – *vice versa* – I value these friendships greatly.\n* My parents were certainly not perfect, but they have provided me with so much love, care and life lessons. I can say I had a great and warm childhood which I cherish.\n* I have a well-paid, challenging and most importantly satisfying job, which I have obtained through excellent university performance and extracurricular activities. At every place I have worked at I have felt that my work was valued. In my current job, I have a chance to give back to society.\n* I have been able to travel the world quite a bit – as well as lived abroad.\n* I live an active lifestyle ranging from doing sports (at which I am usually at least slightly above average) and doing other fun stuff (going to comedy shows/theatre, political debates, musea etc etc)\n* While no one on this earth is immune to vanity or void of external/non-intrinsic motivations, I can say with a fair degree of certainty that I live my life the way I do largely because I WANT TO, not because people pressure me or expect me to.\n\nBefore I continue please let me explain the following:\n\nOne the one hand, I feel extremely grateful for having such a life. Certainly, I am hugely indebted to my family, friends, partner, society I live in. I am very lucky and I understand there are many people off worse through no fault of their own. Please let it be clear that I absolutely do not feel ‘better’ than anyone else.\n\nAt the same time, I am (relatively) proud of what I have done with the opportunities that I was lucky enough to get.\n\nAt this point, whatever the cause is of being in the position I am in (and this is crucial):\n\n**I feel that I should not have the feeling that I have to prove myself constantly to people (or to myself) in social situations.**\n\n*However*, I do have this. I continually want people to see me as funny, cool, intelligent, charming and/or athletic (etc) and I have this (subconcious?) need to 'impress' people.\n\nI feel like this affects my (social) behaviour in (subtle) ways. Paradoxically, this actually has a counterproductive effect. Perhaps, this makes me come across as 'try-hard' in a subtle way from time to time. Regardless of the way it comes across, when I am behaving in a 'needy' way (albeit subtly) or when I feel that neediness, I feel bad about myself.\n\nTo provide you with an example: I absolutely cannot STAND silences during conversations. Whether in 1-on-1 situations or in groups, I will almost always be the one breaking the silence. At times, I will even 'forcibly' say something random/stupid because if the conversation is silent, I am scared that the other person may think I am a boring person.\n\nI guess my question is two-fold:\n\n1. Why do I have this? Where does it come from? I feel like everybody has this ('wanting to be liked') to some extent, but for me it is definitely a bit more intense.\n2. How do I get rid of it?\n\nI have tried a number of things, amongst others: meditation/mindfulness (e.g. focusing at self-esteem and gratitude), healthy sleep regimen, healthy food regimen, healthy physical exercise regimen. I have done this fairly disciplined and usually at the same time. To date, it seems there has not been structural progress.\n\nPlease help me out dear Redditors, I feel like I could be a better person if I work this out.\n\nThank you in advance!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/c58eod/why_do_i_care_so_much_about_what_even_random/", "title": "Why do I care so much about what (even random) people feel/think about me.", "social_network": "reddit", "user": "zephy-1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1561468551, "permalink": "/r/DecidingToBeBetter/comments/c58eod/why_do_i_care_so_much_about_what_even_random/", "nsfw": false, "first_save": 1635435825.9811468, "replies_charged": false}