{"id": "t5_2tand_t3_ltzrf0", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "only thing I would tell any one going through things in their life is to really take a step back and breath!\nListen to your self and in the same token always have a open mind as-well. \nSome times you have to make difficult compromises but it’s never the end. \nI’m sorry guys I just need to vent because I know there’s a lot of people who can’t puzzle it together and sometimes that’s me sometimes it’s not but is okay keep moving forward and you will eventually find a place where YOU find YOUR SELF. \nI’m 24 I’ve worked full time for 3 years straight doing overtime basically slaving for a better situation. I was the youngest of 5. Lived in East Harlem NYC for maybe about 20 years. When I was in college my mother lost our apt ( a culmination of many factors to much to go through) I had to drop out of college because of a job was offered that was to good to turn down at the moment. I did it dropped out literally the last week and was doing 13 hr shifts 6 days a week. Made about 1.8k in 2 weeks and that was enough for a room at my boys place who’s parents moved out. It was refreshing being about 21/22 starting my own life and just the feeling of being on your own. Months go by I’m doing good working a lot of hours getting all types of jobs with the same company around Manhattan. This time of life while recent feels like a daze a Fog like I was clocking in and out into my routine. My friend ends up losing the lease I had like 3 months to save up and move. Again in like three years this is the second time I’m getting envicies from a place it was out of my control the first two times and it was a feeling of impending doom it sucks. I decided to call up my sister and we end up making plans that were successful in getting a new apt under our names. My sister ( who I live with ) is very dependable and trust worthy. That’s where I’m living now I love the apt I really made it into my own and I guess with all the time now I have to reflect on my life and especially because I’m not working right now ( I have some money saved ) like I’m just being honest right now being evicted was so traumatizing for me because I lived with my parents and my 3 sisters ( my other sister lives in another state and is fairly older ) and we all were like in shock and idk just personally I thought my parents would always end up overcoming what ever came. You just always have that faith in your parents you know. But it didn’t end up like that it just hurt I spent my whole life in NYC skated the streets smoked weed in the parks with my friends. Go on wild walks at night I loved NYC. I know a lot of people from different walks of life in my life so far and I really appreciate everyone and everything. And I felt like it was striped away from me. I live in good ole NJ now haha. It’s cool my time here has just gave me the time to actually sit down and knowing i have the responsibility for my self now no one else. So it falls on you. And ITs your life. Idk man to every one who wants to do better mentally , physically just take a second and reflect. UNDERSTAND You’re self \nLISTEN to you’re self \nTAKE CARE of you’re self \nAnd all these things are going to be different for every one. Keep on going because every day every second is another try \nBut don’t take anything for granted!\n\nPs Again sorry I just read some post and love everything about this page because it just gives me the perspectives of people and it’s just so relieving to hear solutions to problems we all have and we all face. Again thank you if you read this rant !!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ltzrf0/i_just_want_to_be_honest/", "title": "I just want to be honest", "social_network": "reddit", "user": "KeepitRolling7", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1614467590, "permalink": "/r/DecidingToBeBetter/comments/ltzrf0/i_just_want_to_be_honest/", "nsfw": false, "first_save": 1635437006.331335, "replies_charged": false}