{"id": "t5_2tand_t3_fg3utr", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "“Life can be magnificent and overwhelming—that is the whole tragedy. Without beauty, love, or danger it would almost be easy to live.”\n\n\\-Albert Camus\n\nSo coming from someone with direct experience as a creative, an introvert and an empath. I think it's about time to talk dealing with mental overwhelm. (Especially now that I did my article on The Obstacle of Infomation Overload  (if you're interested in that, just lemme know in the comments) .\n\nGrowing up, I was not the most social of kids. I kept to myself for the most part and only really felt comfortable around select individuals. It shouldn't come as a surprise then, that, even today, I'm not a huge fan of crowds or pushy, loud, force-their-way-into-my-personal-space people. Their presence alone can cause massive amounts of stress — causing massive energy drain, discomfort self-consciousness, overthinking, shutting down, retreating into your mental space, etc.\n\nBut as we know, in life we are forced to deal with these things and types of people at some point. And as someone with a somewhat naturally high competitive drive. The fact that these people and scenarios could cause me to react in such a way made me feel frustrated like there's this mini-boss that crushes me upon every contact.\n\nThis is overwhelm.\n\nOverwhelm is pretty much a by-product of information overload. The amount of information you're taking in is surpassing your ability to process it, thus your systems detect a threat and either hyper-focus to fight off the threat, get you to escape the threat or shut down completely (fight, flight or freeze response).\n\nNow while I used a personal example as an illustration, we all have different triggers and scenarios in which we do get overwhelmed. So let's talk about how to deal with it.\n\n## Steps to Calming Down\n\n**1. Remove yourself from the source of overwhelm.** It should go without saying that you can't treat with a burn wound while your hand is still in the fire. Find a space where you can go, collect yourself and catch your breath.\n\n**2. Do a Mind Dump.** Of course, this requires you to have something to write with and on.  So I definitely recommend you carry around a pen and pocketbook with you for such occasions. The goal of the mind dump is to get all the information clogging up the gears of your brain out of your head where you can't process it and put it somewhere where you can filter through and decide what's worth processing. Write until every piece of information in your head in on paper and your 'brain pressure' drops to a comfortable level.\n\n**3. Now that you have a list of your thoughts, decide on what to focus on.** What was it you were trying to do when you got overwhelmed. Were you trying to do your sort through your bills? Deal with your kids? Console an also overwhelmed friend? Find what is it that you were trying to accomplish or if you weren't doing anything, something to accomplish in line with your own interests and benefit.\n\n**4. Focus on that task.** Without all that extra information to trigger you into survival mode. You can move forward and do what it is that you needed to do. Don't worry about anything else. Just do your task with a calm mind. \n\nOverwhelm is an all too common affliction of modern-day life. Especially for those of us striving to improve ourselves and do things beyond the ordinary. So having a system to bring us ground us when we delve into the chaos is essential. So give this a try and tell me what you think.\n\nDo you guys struggle with overwhelm?  How've you managed to deal with it?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fg3utr/how_to_calm_an_overwhelmed_mind/", "title": "How to calm an overwhelmed mind", "social_network": "reddit", "user": "Yen277", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1583795449, "permalink": "/r/DecidingToBeBetter/comments/fg3utr/how_to_calm_an_overwhelmed_mind/", "nsfw": false, "first_save": 1635435790.3174691, "replies_charged": false}