{"id": "t5_2tand_t3_evd822", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Hello,\n\n>***Before venturing forth, take a deep breath it's a looooong post.***\n\nSo I've decided to make this post in order to perhaps motivate some of you who are just deciding to be better, or are in that journey along with me already, and perhaps even a few veterans who might want to add things to the list.\n\n**Before going there, some context:**\n\nPretty much last year was one of the worst in my entire life. I'm in my 30s, never really had anxiety attacks, or actual strong signs of depression, but last year everything happened. I had anxiety attacks that were almost like hallucinogenics which made me see walls coming at me, I was depressed to the point I couldn't sleep in my room and I had to always keep windows open to breathe, I stopped playing PC and building apps (used to be my two hobbies), me and the person who I swore was gonna be the mother of my children broke up, and well, it was a rollercoaster with way more to tell.\n\nSo in October to December I started to fall immensely mentally to the point where I had these weird attacks of my eyes filling up with tears whilst driving, having severe mood swings, had a panic attack that rushed me to the ER (that was a first), and that made me take a step back, look at my life, and understand that I needed a psychiatrist and a therapist, and I never knew I'd get to this point of my life, so at that moment I decided to have the **\"I'll try anything to get me better\"** mentality.\n\nSo, having that context, I'm here to share what little progress I've done so far to help my self, really hoping that this inspires anyone.\n\n\n\n\n**I started a gratitude journal**\n\nOne day I was just mindlessly browsing YouTube and I got a hold of this video ([https://www.youtube.com/watch?v=WPPPFqsECz0&t=4s](https://www.youtube.com/watch?v=WPPPFqsECz0&t=4s)) and I've done for well over a month now, and I can tell you that I kinda feel happier and this is because whenever I'm doing something, like talking to someone and enjoying the conversation, or I feel the sun, or I listen to the rain, in my mind I somewhat think about being grateful for that, and I'm not sure how this will progress in the future, but so far I believe it has done me good. Also it's a part of my ritual now, when I go to bed it's when I write my gratitude list.\n\n\n\n\n**I started journaling**\n\nThis is not for everyone, and perhaps my method is not great, but every each other day, perhaps about day yes day no, I vent in a journal. There's a particular event in my life right now which is a huge cause for my problems and I write about it freely. I feel as if it helps me get a bit of my anger out of my system before going to sleep, and I'm not sure of the results of this, but it gives me something to look forward to as I do this after writing my gratitude list, and I also feel like it's a way to somewhat \"communicate\" with my inner self, as if I'm having a 1 on 1 with me.\n\n\n\n\n**I started reflecting on things each x time**\n\nSo I decided that it would be a good exercise to reflect on my progress. I did it weekly, I put up a reminder on Google Calendar on Sundays that would bring up a message asking \"hey man, how are you?\" and I'd think about how was I in that moment related to last time. So I took this to an extreme level, I put up reminders for January 1st 2021, and some other important dates in my life where things went south, so that hopefully when I get that reminder in that moment I'll look back and be proud of myself for all my hard work.\n\n\n\n\n**I started Yoga**\n\nI'm not a spiritual person, the first lesson was actually a bit weird for me because I wasn't aware of all the things that involved it, and I know there are different styles, but the thing is, in my mentality I knew I needed to see and try different things, get out of my old routine, so I needed to build a new one and yoga seemed like a good opportunity to challenge my self into maybe finding another side of mine - it's been a month, I'm actually enjoying it, and some of the things I've learned there, like breathing exercises, I've been trying to incorporate them in my day-to-day to calm my self or help fall asleep which I think it's quite positive.\n\n\n\n\n**I mostly quit Social Media**\n\nReally it's poisonous. If you scroll on your Facebook mostly what you see is people posting happiness and such, and yeah I'm glad for them but it doesn't help me being shoved in the face that I'm not only single, but that I don't have a more-stable life right now. It sounds a bit douchy right, but if you're down, it doesn't make you happy to be fed those illusions of a happy life because you will crave it and you will bash yourself for not having it, which is negative.\n\n\n\n\n**But not instagram**\n\nBecause I found a lot of positive channels which are really just positive quotes and words of encouragement, and I feel nice for whenever I browse Instagram all I read is stuff that tells me to continue going forward and believing that everything will be okay - sounds silly, if I had talked with my self a few months ago I would laugh at this mentality since all I cared about were memes and the sorts. I also unfollowed **absolutely everything else**, such as memes and anything about making fun of anything, all I care about is encouragement.\n\n\n\n\n**TED talks and the sorts**\n\nI spend some of my free time looking for TED talks that encourage me and educate me regarding all of this. The battle that we struggle is to improve ourselves, but each in different ways. I'm trying to become more positive, and to believe in my self, so I look for TED talks, or anything on YouTube related to that. This has helped me spend my time better as I'm not mindlessly looking at videos that just waste my time, as I'm spending time helping my self, not just procrastinating.\n\n\n\n\n**I try really hard to look at my flaws**\n\nI got to where I am now, in this sad point of my life, due to my choices, my flaws, my path in life to sum it up. So I need to verify where I am wrong. I am very fortunate to be surrounded by great human beings that help me see these things. As an example, in my case, one of my biggest flaws is not thinking enough about my self and always being there for everyone else, even when they prove to me that they wouldn't do the same, so constantly I end up screwing my self (for example not going somewhere or doing something I wanted) so that I could help another, who then later on would not do the same for me. I also learned that unfortunately I am very easy to be manipulated, and well I'm working on that one still. These are all points that I try to really grasp about my self to bring to my therapist, as to speed up the process of finding my root problems.\n\n\n\n\n**I tell my self it's going to be okay**\n\nAgain, I know this is silly. When I wake up in the morning, I look at my self in the mirror, I try my hardest to smile sincerely and then I just try to pump my self, usually by saying \"today is going to be a good day, because you want it, you deserve it\". It gives me some sense of confidence regarding my self, as if I had control over things. I know it's silly, most of you will probably not try it, or feel weird doing it, I did as well at first, but truth is there is something about looking at my self in the mirror and saying those things that part of me believes in it, maybe it has a connection with my attempt to shift my mentality into a more positive one.\n\n\n\n\n**I try my hardest to simply accept and live the present**\n\nListen, we all have different issues in life, some way more serious than others. Right now I'm going through some stuff that I regret so hard and that it's affecting me in so many ways that honestly sometimes I still think why do I deserve all of this when I've been a good person, and you will do the same too, you maybe question the same thing, but... there's no answer. So, I'm trying to slowly simply accept things, and look at the present of things as much as possible, don't think of the future because you will fantasise too much and if it's something bad you'll demotivate your self. If you think of the past you'll be condemning your self for your current present. Live the moment, deal with the moment, the moment in which you are, because each day has 24h and you don't know what can happen, good or bad, doesn't matter, worry about the **now**. This has had a big impact in my life as I just try to literally live the moment. So I'm writing right now, my heart is pretty much in a corner crying because he wanted to receive a message from someone, but my mind is focused on writing this, so I'm trying my hardest to live the now of the positive thing, and not worry of the things I've done that lead to the state of my heart, neither on the grim future, I just worry about this post.\n\n\n\n\n**I try to take it day by day**\n\nPretty much what I said before. A day has 24h, I try to live like that, I worry only of the present, and I let life do the rest. Sure, it's agonising, it's completely hard to get there, but it's the sort of thing that sticks to you, because really, we have to be at peace with the reality that we cannot control things outside of ourselves. We can try and control our emotions, our reactions, our actions, but not of other people's, which brings me to...\n\n\n\n\n**I completely cut off toxic people from my life**\n\nHey, I'm the worst at this, nice to meet you. For some reason I always attracted people with problems in life that made them really toxic, and mostly manipulative. I ain't saying I don't have my flaws and maybe I too was toxic to some people, but surrounding yourself with people who only feed your negative side aren't really helping you progress, I was in two toxic relationships... one right after the other, so yeah I'm somewhat of a veteran in that mistake. Reality really sucks, and realising the people you're with aren't helping you going forward is really a hit in the balls, but... Deciding to be better means you will face these choices, realise these things, and you will need to pick options. It's hard, I had to let go of people I once liked a lot, but realising how much they actually \"damaged\" me was something I wasn't willing to accept because I want to be better, for me, for my self, for my own life, and I can't accept people trying to diverge me from that path.\n\n\n\n\n**I'm getting out of my comfort zone (slowly...)**\n\nYeah well, this one is also hard. Remember that thing you wanted to do but were always afraid? Yeah well, I'm doing those things, because deciding to be better also means knowing yourself better, and if you don't get out of your comfort zone you'll just be embracing your old self. I can tell you that so far things have gone well in that sense, of course they were hard to do, simple things like going alone to places, or signing up for that workshop, or making that trip... I still have a long way to go, way way long, but I'm trying my hardest to really shout out to life **\"I WANT THIS\"**. Seriously, don't fall asleep thinking you didn't do the enough... one day you'll regret that moment. Remember that thing you wanted to go, but everyone said they didn't want to at least minute? **GO ANYWAY** (if applicable of course).\n\n\n\n\n**I'm trying to get to know myself, and mostly RESPECT myself**\n\nPerhaps the hardest thing for me. As I said I'm in my 30s, and I have really engrained things about my personality. I want to help everyone, and as I said earlier I pretty much put everyone else above me. To put things into perspective I fell hard for someone (romantically) and even though she treated me like she didn't want me in her life I kept doing everything to please her, and that's the equivalent of me saying **\"you're right, I'm worthless\"**. So I began this long and hard journey of getting to know a new side of me that respects himself, and that believes that he deserves better in life, and that he doesn't need to subdue to other people's wills, and that he has the right to be in first place. It's hard, having to say \"no\" when you said \"yes\" your whole life, but... getting to know myself in this sense, of realising flaws, learning new philosophies, and trying to get into a more positive state of mine, is also encouraging because it's like discovering something new, and it's a positive thing because you're valuing yourself. Personally this has been great so far because I look in the mirror and I appreciate who I see, I say that guy deserves better in life, that guy deserves a chance to be happy, that guy has the right to be in the top of his priority, that guy is a good guy.\n\n\n\n\n**And finally... I'm trying to give it time**\n\nThese things take time. I'm only about 2 months in, I'm still carrying a lot of weight, just today I nearly broke down crying because of everything, but it has been better each day, the pain has lessened, and... well, things take time. My perspective, and what I want you to get deep inside your brain, is that you must keep progressing, even if just 1%, just keep going, keep believing, keep trying to grasp that confidence, keep up the good work, and **VALUE YOURSELF FOR YOUR HARD WORK**. Be your own motivator first and foremost, other people will also notice yes, but **YOU MUST ALSO BELIEVE**. Smile for the path you're going is hard, but it's a positive one, and you're loving yourself by doing this, you're being good to yourself... Continue being awesome to yourself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/evd822/little_advice_from_someone_who_has_been_walking_a/", "title": "Little advice from someone who has been walking a new path in life since December, and made unexpected leaps during January", "social_network": "reddit", "user": "ilovebitoque", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1580251856, "permalink": "/r/DecidingToBeBetter/comments/evd822/little_advice_from_someone_who_has_been_walking_a/", "nsfw": false, "first_save": 1635435915.4106739, "replies_charged": false}