{"id": "t5_2tand_t3_nxmgl4", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "Heyyyooo... coming to you live from a puddle of self-doubt and confusion. \n\nTLDR: I’m a human being, so I need money to live. I don’t find anything pleasing about the Starving Artist idea. I value balance and vitality. I can’t sing consistently enough to be putting out music all the time to break through. **I don’t want to give up on my dream, but I can’t invest ALL my time ALL the time.** Even if I could sing enough, the music I like to make isn’t objectively great music - it’s pop music expressing feelings of a young woman navigating love and life, but not instrumentally technically advanced. I don’t love the music I’m currently making but I need to release it NOW (according to business advisors). **How do I accept that what I make is okay even if its not great???** I don’t want to taint my image with shitty music forever (Alanis lucked out with her bubblegum-alt switch). It feels so silly to ask but, damn. I’m feeling lost.\n\nThe following is a little messy, please be gracious with me😅\n\nI’m (23F) an all-around performing artist: songwriter, actor, multi-instrumentalist, vocalist - you name it, I’ve grown up doing it. I have always felt most comfortable and alive in this sphere, even though most of my “career” has been learning curves atp. I’ve won scholarships and awards for my performances and work, and songwriting comes more naturally to me than breathing (think Alanis Morissette, F+TM, Taylor Swift, KT Tunstall). I have always been confident in my ability to craft the bare bones of lyrics and melody. **Being a mainstream performing artist and songwriter has been my dream ***forever***.** This also includes making money. I want to make money - I need to make money lol!\n\n*However*, in the last 5 years, I have felt a tectonic shift in my confidence and willingness to commit to my art. I feel like the foundation of my self-assuredness has devolved from reliable, compact earth, with responsive soil, to a crumbling mess of dried up dirt. My footing cannot be found. The more I learn and surround myself with colleagues (I’m pursuing an academic career in psych and philosophy), the more I feel like what I do is garbage because it doesn’t make all these incredible musicians, high-thinkers, fine-art-appreciators *feel* something. \n\nI am considering the fact that there is an objective quality to art. This idea comes from the higher-ed folks I have grown up around and the uni classes I’ve been in - it is an idea that is weaving its way into my mind as a stronger and thicker thread every day. How can we equate the skills of someone who puts together a Gentileschi-like work to that of a student of Warhol’s? How can I have grown through my teen years feeling like Taylor Swift had a direct line to my soul, but still feel like if *I* release music like that, it won’t be good enough to satisfy those people who don’t like her? \n\nThis trepidation has been able to grow thanks to an illness that takes away my voice. I’ve been able to sing very infrequently in the last year.5, which means I haven’t been able to consistently sit down and *make* the shitty shit to even get comfortable with growing in the studio. (I have been learning to produce my own stuff since I was 12, but only real, serious stuff in the last year and a half.) \n\nThen we have the whole issue of how fucking constant work needs to be released in order to break through the saturated market. AH! I can’t sing constantly ➡️ I can’t make, produce, release constantly ➡️ I can’t break through at all ➡️ no money and no way to afford to live ➡️ no way to build a life of experiences to continue developing art ➡️ must invest time in other things to make money.\n\nAnyways.. I don’t want to give up on it.. but it seems like unless someone is giving an arm and a leg, they get nowhere... and I don’t believe dreams can survive on an empty stomach.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nxmgl4/childhood_dream_doesnt_account_for_confines_of/", "title": "Childhood Dream Doesn’t Account for Confines of Reality: Is “Giving Up” The Adaptive Solution?", "social_network": "reddit", "user": "IrreversibleDetails", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1623435221, "permalink": "/r/DecidingToBeBetter/comments/nxmgl4/childhood_dream_doesnt_account_for_confines_of/", "nsfw": false, "first_save": 1635435097.8815079, "replies_charged": false}