{"id": "t5_2tand_t3_oz0ljk", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "badbd7e1-4692-457a-97bc-7317bdf8e5c1", "b69cf201-6737-4217-b486-9096135546b8"], "text": "today, I just feel so great.. I'm just squealing and so excited for myself. I've never really felt like this before but in a way, I see my younger self that was so broken, so relieved and smiling. \n\nin the past:\n\n* was so overcome with anxiety, trauma, depression, was on the brink of feeling suicidal again\n* stuck in a toxic relationship that was going nowhere except feeling trapped and worse about myself\n* did not have friends or active supportive circle\n* extremely toxic family environment of no contact for months\n* stressed about my career and lost in what to do, felt pressured to \"make something of myself\" by ex\n\nnow:\n\n* on a developed path of healing and balance, peace within myself and accepted all could be\n* couldn't do it anymore and left my ex, my anxious attachment made me try to go back but broke the toxic cycle for myself\n* have a very, very supportive friend group that talk to me and care for me, met lots of new people and friends!!\n* made up with my family in the best way we could have, they are the dearest people to me, i have grown so much love and forgiveness for them. \n* working hard towards a new career path that I failed at and now retrying with lots of support with people already in industry\n* i moved out to be with the love of my life! we live a really nice and simple life together with our dog and enjoy every day with each other", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oz0ljk/a_healthier_happier_and_lighter_version_of_myself/", "title": "a healthier, happier, and lighter version of myself", "social_network": "reddit", "user": "soured_peach", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 402, "down_vote": 0, "creation": 1628228866, "permalink": "/r/DecidingToBeBetter/comments/oz0ljk/a_healthier_happier_and_lighter_version_of_myself/", "nsfw": false, "first_save": 1635435229.3500307, "replies_charged": false}