{"id": "t5_2tand_t3_o5ck1k", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I'm 18 and stuck in a weird period at home right now. I got back from college towards the end of May, after successfully transferring to Cornell and I felt on top of the world.  I met so many great people, had such engaging conversations, even met someone who I am now in a relationship. I was curious, energetic and excited, and I felt I was on top of things and had finally matured in the eyes of myself and the eyes of my parents. My self confidence and sense of self were strong, I was more open and it felt like I was living more fully. \n\nAfter being home for about a month, I can't help but feel as if I've reverted. I'm on my phone a lot, watching the same, nonsense content that is entertaining but not fulfilling. I'm simply letting time go by, without experiencing anything. \n\nWhat's difficult for me is my parents. They want me to become more like an adult while simultaneously treating me like a child. At least that's what it feels like. Their issue is initiative and motivation, and the lack they see in me. They also don't approve of my relationship though it has become a source of growth and positivity in my life. I'm sure they don't mean it but every conversation feels like a lecture, with the tone \"we know more than you, so you should do things like we want or suggest\". If they know the best way, then why try to find my own way? That was my mentality for awhile growing up, and it certainly stunted any curiosities or urges to intensely pursue hobbies. \n\nI am behind in some aspects. I just passed my drivers test last week and landed a job this week, something my parents said I should've done a year ago. With the possibility of purchasing a car soon, I will have the freedom I desire, but I'm not sure if I deserve. I also owe a lot to them. They've worked incredibly hard to provide an immense amount of comfort for me. I'm completely tied to them financially except for a small sum of money that is my own. I also still want to make them proud and prove to them that they did a good job parenting, but it's hard to appreciate their methods of concern (mostly lectures and nagging). \n\nI'm at a bit of a crossroad here. There is a bit more soul searching and work to be done on with myself but I have a small feeling that I might just do more out on my own completely. I don't know for sure, but my home environment, while comfortable and a luxury, feels a bit cramped and trapped. I don't feel as supported, though I know my family wants the best for me. I also don't know if my problems are real or in my head. I'm aware of my privilege to be even contemplating these emotions while many have no choice but to buckle down and either deal with it or work their ass of to get out of their situation. I want to do better, and I believe I'm taking the right steps. Any advice would be appreciated, and I might update later after I've slept on this. Hope you have a good day, night and everything in between", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o5ck1k/maturity_and_independence/", "title": "Maturity and Independence", "social_network": "reddit", "user": "Flam3magician", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1624330387, "permalink": "/r/DecidingToBeBetter/comments/o5ck1k/maturity_and_independence/", "nsfw": false, "first_save": 1635437845.7340438, "replies_charged": false}