{"id": "t5_2tand_t3_lzwxmh", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a"], "text": "I (28F) just ended an unhealthy 3.5 yr relationship with  my now ex-bf (31M). During our relationship, I developed depression (I think I had high functioning depression for a while, but our relationship coupled with quarantine just made it worse). I got on antidepressants have helped me tremendously!!! But it felt like I was putting a bandaid on the deeper issue... my relationship. I was very unhappy. \n\nI started seeing a psychologist and she helped to put things into perspective for me and made me see my relationship for what it was... unhealthy and a source of my depression. My ex wasn’t outwardly abusing, but he never validated my feelings, was critical at times, disrespectful of my boundaries, and subtly manipulative. Over time, these things can really start to eat away at someone.\n\nAnyway, I ended things a week ago. My depression has been pretty bad this week, I’ve been having a hard time focusing at work, sleeping more, and finding 0 joy in things I used to enjoy. I know this is just part of the break up/grieving process, so I’m just trying to be kind to myself during this time and not beat myself up. He still lives with me until he can find his own place, so that makes it a bit more difficult to get over the grieving process because the bandaid is still lingering instead of being ripped off so to speak.\n\nSo now here I am, a single mother who is working through her depression with proper treatment, ended an unhealthy relationship, while being in college. I’m terrified but also ready to start this new chapter of my life.\n\nTl;Dr: I’m depressed, ended an unhealthy relationship, and have become a single mother again while putting myself through college, yet I believe this is the best thing for me and I am looking forward to my new chapter in life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lzwxmh/depressed_and_newly_single_but_this_is_whats/", "title": "Depressed and newly single, but this is what’s right for me", "social_network": "reddit", "user": "AceOfSpadez-", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 53, "down_vote": 0, "creation": 1615143057, "permalink": "/r/DecidingToBeBetter/comments/lzwxmh/depressed_and_newly_single_but_this_is_whats/", "nsfw": false, "first_save": 1635437330.2505288, "replies_charged": false}