{"id": "t5_2tand_t3_964ei3", "request": ["3beff282-9f02-4b47-aead-1584560e0735"], "text": "I'm in a sort of state. Thank you if you read all this because I think this is going to drag on. I'm pretty sure its venting. I don't know if this is presumptuous but I'm 100% okay with either advice or validation. I just don't really have anywhere to go.\n\nI... feel hurt? I don't actually have a real reason to. I'm just sort of lost. I just look at people and see them hang out and whatnot and get butthurt. Specifically at this moment. Its odd. I shouldn't be, I don't why I'm doing this. Just being jealous of people's social lives, wishing I was more interesting and experienced and had friends. At least, in the area (I moved a year ago). Feeling like I ruined it with the people I have met.\n\nEven then, I was never close to people before, I was always at school, training, or working. Otherwise, catching up on sleep or going driving. I don't know why. I mean I do, between minor parental issues and such, but its just hard.\n\nI don't hate myself or anything. I like myself. I've helped a lot of people, gotten a lot of laughs, made a lot of people's lives better. I appreciate the way I look. I'm healthy, I exercise. I used to be an MMA teacher, which is really cool. Just helping people do something, get somewhere, mentally more than physically. To just be there for people. I think I'm an okay person, and pretty lucky too, considering how bad some people have it. I just feel like I don't have purpose anymore since moving, I don't train for anything, or teach or help anyone. I have so much time. And I don't really interact with anyone. And everyone seems so far ahead.\n\nI know what I need to do. I've been trying to improve. I'm trying to get out there, to work on my health, to work on habits, mindset, and sleep. But it doesn't stick. It does, I look back, and I making a comeback. I've improved some things. But its so hard. I don't really even have anyone to turn to. Or maybe I do, and I'm too insensitive or anxious or insecure to know.\n\nI just feel lost. I just want a couple good friends to hang out with. To just be able to go back and forth, no expectation or judgement of each other. To just have fun and be there for each other. At least I think? I'm open to the possibility that my thoughts aren't what I think they are, that I might be lying to myself about what I actually want. I doubt it, all I ever want from the people I choose to be with is some decency and love. But being so insecure and upset right now, is a good friendship really the concern? It feels more like ego, insecurity, and immaturity. Self-image. Doubt. Distorted perception.\n\nI don't know what to do. I question why I'm doing this. I think I'm just trying to desperately find some form of validation. I don't know.\n\nI'm really sorry this isn't a productive or helpful post. I'm not suicidal or anything. Just hurt for some reason. Can I just get some sort of pointer or something?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/964ei3/m18_rant_warning_feeling_lost_not_really_sure/", "title": "(M18) (Rant Warning) Feeling Lost, Not Really Sure What to Do", "social_network": "reddit", "user": "whiskeyandstargazing", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1533881257, "permalink": "/r/DecidingToBeBetter/comments/964ei3/m18_rant_warning_feeling_lost_not_really_sure/", "nsfw": false, "first_save": 1635437798.1166768, "replies_charged": false}