{"id": "t5_2tand_t3_ea1hhi", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "I’m going to be 100% authentic and real in this post. No sugar coating anything. I’m a 20 year old brown Muslim dude who’s LOST. I feel like I’m a bystander just watching life pass by trying to plan everything to perfection and not actually DOING anything. For the past 4 YEARS, I haven’t exercised... I used to be outside playing sports all the time but ever since I stopped playing organized sports in sophomore year of high school I’ve been gaining weight like crazy. Combined with the fact that I’ve never really dieted or taken care of myself otherwise. I’m in university and I have no idea what I’m doing... I have no personality. Porn has hijacked my life and I developed an inferiority complex because I feel like I’m supposed to be some big black dude to be masculine. I don’t know what masculinity is. Am I supposed to transform into some sort of fuckboy to impress girls? Chase money, manipulate people and try to get to “the top”? I don’t know if I am a liberal or conservative. I don’t really have social media but I spend all day on my phone. I have no friends. I’ve really been into conspiracies and don’t know what’s true or not. Is God real? Do we have an afterlife? Will I be reincarnated? Or will I just disappear? I act like I believe in Islam  but I really do not know. So I act fake in front of my family because I don’t want them to be disappointed in me but also because I’m scared that if God really does exist, will I not make it in heaven? Is heaven even worth it? If I decide to come out, I ’ll probably be disowned by most my family but maybe my parents will still stick around because they want to live nearby me when I get married. If I do decide to stay, I’ll most likely get an arranged marriage but I don’t know if I’ll love the person... is love even real? Is it just some chemical reaction? Should I try to blend in with others and follow trends? Get the new iPhones? But the new trendy clothes? Will I fit into them? Could I pull it off? I’ve been wearing the same 2 hoodies for the past few months, no one has really said anything. Is it selfish for me to take care of myself? Should I put others before myself?\n\nI’ve been trying to plan my life but it never works because I don’t have the answers. I’m too perfectionistic and haven’t done anything as a a result.  Should I just go with the flow?\n\nThank you for tuning into my existential crises lol", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ea1hhi/i_dont_know_who_i_am/", "title": "I don’t know who I am...", "social_network": "reddit", "user": "idkdjvdibdub", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1576226462, "permalink": "/r/DecidingToBeBetter/comments/ea1hhi/i_dont_know_who_i_am/", "nsfw": false, "first_save": 1635437175.2944508, "replies_charged": false}