{"id": "t5_2tand_t3_piy6ko", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "How do you go from wanting to implement one habit to changing your life to the point where your whole day is a habit. Your whole day can become your routine.\n\nFirstly and most importantly, don’t focus on the idea of having your whole day as a series of continuously self serving habits. It is not sustainable to make too many changes to your life in a short space of time. The most important thing to remember about self-improvement is that in order to do it properly and create actual long term changes in your life, it takes time.\n\nBut how do we go from a life we are unsatisfied with to a life that is continually serving us?\n\nFirst we get one habit entrenched. This is usually something like working out or meditation or reading. Pick the one that you would most like to do, the one that you feel you desire to do most. Once you have this, now we need to schedule it in.\n\nThe best time for people is usually the morning. This is because we have just woken up and have energy and more importantly will power to perform a new task. Willpower is like a muscle, the more you use it, the more fatigued it gets, however, the more you use it, the more used to the volume it becomes and then it increases in its capacity.\n\nAt the moment, your willpower resource is most likely small, as you spend the majority of your time on low willpower, instant gratification activities such as netflix and social media. The more willpower you exercise throughout the day, the more your resource will be drained, hence why the morning is a good time for your new habit.\n\nNow let's think about the habits that you already have. Once you wake up, I presume that you most likely have a shower or brush your teeth or something like this. An effective way of ingraining a new habit is stacking it, or linking it with a pre-existing habit. This is called Habit stacking.\n\nSo you wake up and you brush your teeth, now stack meditation on top of brushing your teeth. Because you are already performing a habit daily and consistently, by stacking a new habit you are more likely to be successful in integrating this new one.\n\nSo now you brush your teeth and then you meditate and then you shower and then you just do whatever it is with your day normally. Well done, you’re on your way to a good morning routine.\n\nNow here is the important part. Wait. Do nothing else. Just keep doing this. Days, weeks and months. Once you have consistently performed your new habit for at least 1 month, but I would suggest 2 for proper embedding, now we can think about adding.\n\nThe biggest reason why people fail is because they try to do too much.\n\nNow we have ingrained a new habit. Let’s add to the stack. Let’s say you want to incorporate journaling (card for video) or gratitude practice. We simply do the same thing again.\n\nSo now we have, wake up, brush teeth, meditate, journal, shower - normal day\n\nSame again, stick with this until you are consistent.\n\nThen we can stack again, and again and again.\n\nThis is how slowly, sensibly and realistically, we can change our lives. Not clickbait change your life in 10 days, but over the course of months and years, through hard work, we can change our lives.\n\nThe other important thing to bear in mind, is to also schedule and routine rest and relaxation. Too much rigidity causes fragility. The branch of the tree is strong because it allows itself to be moved by the wind.\n\nEveryday make sure you make space for something you like doing that isn’t necessarily optimal, whether that is a bit of internet surfing, watching netflix etc. but it is important to make sure you are scheduling this time, so you don’t end up spending longer than you’d ideally like on these activities.\n\nKeep stacking, go slow and you will be successful.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/piy6ko/habit_stacking_how_to_successfully_build_habits/", "title": "Habit Stacking - How to successfully build habits - what I've found works", "social_network": "reddit", "user": "yusefsanei", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 192, "down_vote": 0, "creation": 1630930064, "permalink": "/r/DecidingToBeBetter/comments/piy6ko/habit_stacking_how_to_successfully_build_habits/", "nsfw": false, "first_save": 1635437208.4783638, "replies_charged": false}