{"id": "t5_2tand_t3_eps08f", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Pressure, pressure, pressure. I feel it so strongly some days. If I mess up at work, I’m a basket case re-evaluating my entire existence.  Making dinner last night with my boyfriend he tasked me with cutting the garlic bread since I never learned to cook and I ended up smushing it and halfway through I thought it looked so sad and I asked “what am I doing?” and put down the knife. He jumped in and showed me how to do it the right way and his came out looking fricken artistic next to my smooshes. “I suck” - Me. “You can’t suck at something you don’t know how to do, you just don’t know how to do it. And you watch and learn. You practice.” - Him. \n\nSometimes it frustrates me that I sit here and do all of this work on myself and I get mad about garlic bread and then my boyfriend comes through with the profound truth that’s so aligned with what I try to learn and strive to achieve on the daily. He’s never read an improvement book or spiritual book in his life. Meanwhile I study and take courses and read and write and expend so much (beautiful) energy on it. \n\nIt’s becoming perfectly clear that I take life way too seriously all day every day. And I make myself miserable for no reason by doing it. I grew up in a very serious environment and death has followed me for most of my life. I get why I’m serious. And I get why I got extremely mad when my mom who is the most fire-cracker tempered person would tell me to lighten up. \n\nBut it’s time to lighten up. And I invite you to join me. \n\nLife is really hard sometimes. Stuff happens that I wouldn’t wish upon anyone. I’m not saying this is one size fits all advice and i realize I’m very fortunate to live the life i live but I think so many people would benefit from lightening up. As a society, we are plagued. We’re plagued with anxiety. We’re plagued with depression. We’re plagued with misery. And I think a lot of it is tied to the fact that we think we have to be perfect all the time and that it’s not ok to screw up or to make a mistake or be spontaneous or to leave our comfort zone. Where’s the fun? Where’s the space for laughter? We only have one life here! Why does everything have to be so serious?! \n\nThere’s a ton of expectations out there but what if we let go of some of them? Other people’s expectations are not our problem or responsibility. Our own are though. And we’re beating ourselves into the ground with them. What if we laughed at our screw ups? What if we said, “ok I tried my very best at this particular point in time, now I’ll get up and try again with a little more experience.” Why do we think mistakes are the end all be all? We’re not screw ups because we made 1, 5, 20, 5000 mistakes. We’re not screw ups because we let someone else down. We’re human and this is a journey in which sometimes we do really well and sometimes we fall real hard. There’s lessons in all of it. And it’s beautiful (although not always pretty). \n\nSometimes we hurt people because we were hurt and didn’t know how to deal with it. Let it go by acknowledging you did the best you could at any given point and work towards doing a little better. Stop carrying a guilt that does nothing but weigh you down. Apologize if you have the opportunity. And if you don’t, say the apology out loud or write it out. Don’t beat yourself up over and over for the same thing! We need to let go of the idea that our worth is based on what we’ve done or how good we are at something or how much we have. we are inherently worthy.  We are worth something way beyond definitions or tangibles. As is everyone else. \n\nAnd a beautiful thing happens when we lighten up on ourselves. We lighten up on other people. We’re kinder. We’re loving. We’re compassionate. What a world it would be if we didn’t walk around trying to prove something. \n\nSo today I’m not trying to prove anything. I’m going to smile for no reason. I’m going to laugh at my mistakes. I’m going to focus my energy and attention on the joy instead of the places where i believe it’s lacking. I’m going to help my boyfriend cook dinner and probably mess it up again. And laugh. And keep going even if it’s not pretty. And ask questions on how to cut an onion the best way because I still can’t figure it out and it takes me about 25 minutes. And not get mad when it doesn’t look as pretty as when my boyfriend does it. \n\nHope you all have a wonderful morning/day/evening. Whoever you may be. Wherever you may be. You deserve it. And remember: LIGHTEN UP :)!!\n\n___\nTL;DR\n\n\nThere’s a ton of expectations out there but what if we let go of some of them? Other people’s expectations are not our problem or responsibility. Our own are though. And we’re beating ourselves into the ground with them. What if we laughed at our screw ups? What if we said, “ok I tried my very best at this particular point in time, now I’ll get up and try again with a little more experience.” Why do we think mistakes are the end all be all? We’re not screw ups because we made 1, 5, 20, 5000 mistakes. We’re not screw ups because we let someone else down. We’re human and this is a journey in which sometimes we do really well and sometimes we fall real hard. There’s lessons in all of it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/eps08f/its_time_to_lighten_up_and_not_take_everything_so/", "title": "It’s time to lighten up and not take everything so seriously", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 56, "down_vote": 0, "creation": 1579218915, "permalink": "/r/DecidingToBeBetter/comments/eps08f/its_time_to_lighten_up_and_not_take_everything_so/", "nsfw": false, "first_save": 1635436643.1119623, "replies_charged": false}