{"id": "t5_2tand_t3_i4eb6y", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I’ve had a lot of traumatic experiences. Daddy issues, my first sexual experience was a sexual assault, history of being cheated on and rejected for other girls. I’ve always felt abandoned and rejected. I realize I have a tendency to choose abusive men, but have noticed an upward trend overall.. I think I am improving my judgment, as each one has been better than the last. But I still haven’t found the right one (obviously) & find myself behaving in ways that I’m embarrassed about afterwards.\n\nI’m a very emotional, passionate person. I fall so hard and deeply. I’m faithful, devoted, but also can be possessive (unintentionally). I put these expectations on the guys I like, and if they don’t do or say what I like, I get triggered, resent them, & don’t communicate about it until the anger becomes so overwhelming & I explode! I realize I need to work on my communication skills. I don’t know how to tell them how I feel, and this comes to positive feelings sometimes too, like telling him I like him or appreciate him. I guess I’m always on guard and scared of being hurt again. Over the years, I’ve had this deep seated resentment towards men that I’ve spent years of therapy to get over. Sometimes I’m angry at them for their privilege of being male & not having had to deal with the struggles I’ve had to deal with as a woman of color. & sometimes my anger is because of the male figure I had growing up, who was sexist and emotionally unsupportive. Logically, I know it’s not rational. A lot of the feelings I have aren’t. I’m trying to resolve these negative feelings, stop being triggered so much, and be an emotionally balanced person.\n\nI am in therapy, always looking into self help, and have this awareness.. I guess I’m seeking as much advice as I can possibly receive.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i4eb6y/how_can_i_learn_to_be_a_healthier_partner_in/", "title": "How can I learn to be a healthier partner in relationships?", "social_network": "reddit", "user": "throwawayjuly220", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1596663014, "permalink": "/r/DecidingToBeBetter/comments/i4eb6y/how_can_i_learn_to_be_a_healthier_partner_in/", "nsfw": false, "first_save": 1635437857.9168906, "replies_charged": false}