{"id": "t5_2tand_t3_g4n9d3", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "Clarity is two things together: One, it is the absence of readymade concepts based on which one lives, one reacts, one sees the world, and parallely, simultaneously, on the other hand, it is the ability to respond greatly. So, on one hand, you do not have any ammunition with you, you do not have anything pre-made with you. When life comes to you with a situation, as it always does, you really have no dependence on experience and concepts from the past. You really have no dependence on memory or imitation. \n\nOn the other hand, even though you have no ammunition with which to face life, yet you have a vigorous capacity to respond. \n\nWhen you have no ammunition with which to face life, then you have a lot of love with which to greet life. So, this clarity is an emptiness in one way, emptiness in the sense that you are empty of all rubbish, and on the other hand, this emptiness is a great fullness. These two, hence, must be called as two but understood as one. I started by saying that clarity is two things. These two must necessarily be called two, but understand as one. \n\nOn one hand, clarity means absence of dependency on concepts, experience, and memory. So, it is then clarity in the negative sense. Negative in the sense of negation, that clarity is not this, clarity is the absence of something. \n\nOn the other hand, clarity is something very positive also. It is negative and positive together. These two must be understood as one. It is something very positive because it enables you to have a full response towards life. So, it is a nothingness that is capable of everything. It is a very full emptiness. Scriptures say, that great void from which everything arises, that nothingness which is the mother of everything. That is clarity. Then you know so much because you do not have any knowledge. Free of knowledge, you are now full of knowing. Do you see how these two are opposites yet one? Free of knowledge, now you are full of knowing. That is clarity. It is obvious that clarity is not knowledge or information or conceptual load.\n\nClarity means – the ability to stand naked in front of life. I stand in front of you carrying no weapons, no defences. In front of an enemy, you stand all loaded. Have you seen those warriors going to the battlefield, how thickly armoured they are. Clarity is like going to life like a lover – naked! Not like a warrior. Not like a fighter. Not armoured. But, naked! Like a lover. Full of knowledge all that you get is wounds and all that you give is wounds. That’s what concepts are there for, inflicting wounds. If you are not afraid, would you still need knowledge, would you still need to be prepared in advance? If you are not afraid then you can just present yourself empty handed, naked, without preparation, without defences, without armours, without weapons and clothing. Here I am, naked. Unprepared. Not the warrior, but the lover. \n\nHave you seen anybody loving along with his armours? So, clarity is an absence and an overflowing, both together. Rubbish is absent and the Real, the Truth, is overflowing, that is clarity. But that overflowing is spontaneous. Remember, you cannot come prepared with that overflowing. That overflowing is something that arises only as a response, otherwise it remains sleeping as a potential. So, unless life presents you with a situation or a challenge, you have no idea or knowledge as to how to respond to it. But, when it comes, then suddenly from nowhere, the response comes. And the response is totally unpredictable, that’s one characteristic of clarity. It gives you responses that are not predictable because they are not readymade. So I knew nothing, but because you asked me a question so I said so much. I knew nothing. I have no idea what you are going to ask, worst still, I had no idea of what I am going to speak. But because you asked, from somewhere the response came. \n\nThat point from where the response comes, without preparation, without past, without motive, without memory, that is clarity.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g4n9d3/mental_clarity/", "title": "Mental clarity", "social_network": "reddit", "user": "AcharyaPrashant_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1587362274, "permalink": "/r/DecidingToBeBetter/comments/g4n9d3/mental_clarity/", "nsfw": false, "first_save": 1635437630.6890976, "replies_charged": false}