{"id": "t5_2tand_t3_mp2lb9", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "155 Days ago I started a daily check in routine, beginning with a gratitude practice: writing down 3 things I'm grateful for before I start the day. I'm proud of keeping this up for so long - even on bad days I'd force myself to scribble something down to maintain consistency. This was the first tiny step - a 5 minute commitment that helped push me from unstructured, depressing days to a point at which the idea of going a whole day without at least some concrete action towards my goals or well being is no longer even an option.     \n\nYet I'm now I'm kind of struggling to keep this from being an idle ritual - especially since I've expressed the \"big stuff\" multiple times (periodically I'll still remind myself of basic stuff like my \"good health\" or \"family\"). But it still feels like a ritual. It's hard to think of new or interesting things to be grateful for - a new coffee flavor, the weather, spiders, an interesting crack in the wall. It can start to feel silly. I dunno, maybe once the world gets back to normal it'll be easier?  Does anyone else have a similar practice? Any tips on how to keep it fresh?\n\nAt some point I added a \"forgiveness\" column based on something I read. This definitely helped while I was quarantined with family (lol), but now that I'm back to living alone but still not socializing IRL I find that it causes me to either look for negativity (what should I forgive myself for?) or excuses (\"I forgive myself for not working out today because I was tired.\") For now I've made this optional by asking myself \"Does anything require forgiveness today?\" If not I'll move on. \n\nDoes anyone include something like this?\n\nOn a positive note, I'll add that at some point I added a \"Triggers\" section, in which I'll note thoughts, events, interactions, even substances etc. that had a positive or negative impact on my mood. It helps me to spot patterns and opens avenues for deeper work when I have the time. This is probably the most fruitful part of my daily routine.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mp2lb9/gratitude_and_forgiveness_practice/", "title": "Gratitude and Forgiveness Practice", "social_network": "reddit", "user": "cutlass15", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1618185774, "permalink": "/r/DecidingToBeBetter/comments/mp2lb9/gratitude_and_forgiveness_practice/", "nsfw": false, "first_save": 1635438443.5961065, "replies_charged": false}