{"id": "t5_2tand_t3_k99f1w", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "i am 19 years old boy from north Africa,i am a computer science student,1st year in the university.\n\nin the pass 2 years i was trying to improve myself in many fields.\n\nPhysically,i started nofap and went the gym but i was not disciplined enough.\n\nmentally i started reading books,meditation but i don't do it regularly and i usually quit  .\n\ni wanna be great,rich,in shape smart and all,but  i cried from time to time just thinking about the future. My problem is that my mind is used to fast and instant satisfaction and just focusing on getting a dopamine rush asap(video games,porn,snacks...you name it).I wish i could just rewire my brain and just doing the work,hitting the gym,getting those grades,learning that skill,buying that book but nah dude, my brain is like : yeah just one more game,one more YouTube video,one more scroll and we move on .\n\ni tried so hard,i quit porn for 3 months and quit,i read 4 books (300-400 pages) i really felt depressed after each books i finished i was kinda immersed in those books but i stopped,i have over 15 books saved on my PC and phone but i just read like 1 chapter and quit and i can tell you that i genuinely enjoy reading,training,writing a code or solving a problem but none of this activities will give my brain that instant pleasure that i used to, And i know that in order to rewire it i should do the hard work and accept that the pain that i feel is going to ease out as i continue doing the right things, But i always quit,so what is really ? my lack of will? or not putting clear goals or setting a TO-do list?maybe i am not determined enough to follow my dreams but i cry every time i see a video of the car that i wanna buy(actuality i do, i really love cars :D),or getting those 6 packs or that girl or that job or finishing that project.I am really an optimist person and i believe in myself so much but still my brain is really slowing me down and pushing me back to my comfort zone  .\n\ni am sorry to say that but for last 5 years i played videos games for \"6 h everyday\" ,watched porn at least 4 times a week and rarely do a home work or work hard on something and stay on track.\n\ni know my situation may look a lite bit complicated but i know that there is someone that will help me move on and become a better me :) .", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k99f1w/i_need_a_wake_up_callor_any_advice_really/", "title": "I need a wake up call,or any advice (really)", "social_network": "reddit", "user": "Snoo_26889", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1607451017, "permalink": "/r/DecidingToBeBetter/comments/k99f1w/i_need_a_wake_up_callor_any_advice_really/", "nsfw": false, "first_save": 1635437612.1592846, "replies_charged": false}