{"id": "t5_2tand_t3_ncmckt", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I'm a freshman in high school, 15. My envy of other people's fantasy creation's is so bad to the point that I can't even view the page of Steam or Netflix without seeing something that makes me envious. I have basically caved myself in by never even opening Netflix or ever buying a new game from a platform like Steam for the fear of something popping up and thus making me envious. And when I do see something, it haunt's me like a ghost and makes me cry. I know the reason why I'm feeling this way, but I still haven't been able to get over it.\n\nI have created this MASSIVE immersive world filled with story's and loveable characters inside of my mind like no other, that took 5+ years to build. I am planning to bring this world of mine to life one day by programming and creating art for the game by myself, for the world to see. However, with these unqiue idea's like the one's I have made being slowly taken away, It just makes me want to sob because of people will see that as a 'non unique' idea, and thus having less impact on the player.\n\nI don't want to go to the therapist because of a certain trust scar that I've had, and the fact that therapy has never worked with me. I don't want to talk to my family about this neither, since they do hear me, but never actually act on 'helping me get rid of the problem' no matter how much I remind them. I do not currently have any friends at my despoil either, so I'm pretty much relying on the internet to give me advice.\n\nI think this started a couple months ago, when I saw the new avengers movie trailer come on as an ad. (You know, the one where they are stuck in a sit-com.) I was listening to music at the time when the ad started playing but I was to focused at the time to skip it entirely. I heard about the movie ad, and then started to feel bad about myself, since it was a scrapped idea I had. I felt like the world was going to start catching up on my ideas and steal them before I could create my game, even though that idea that the avengers movie ad was a scrapped idea of mine. However, I have earlier memories about watching a Youtube music video which had one of my ideas in it and still enjoying it, and I still do because of the beat, but when I remember what the music video was about I start to become depressed so I deleted it from my music playlist.\n\nPlease don't say, \"Well, just stop comparing yourself to others and get a life.\" Because I can't stop comparing myself to others, since it's basically wired into my brain since the very beginning, and I can not get myself to stop it. I feel like I'm running out of time before someone else steals my idea completely before I let out my ideas to the world, and It's making me suicidal. I don't know what to do. I think I might be shadow banned so this might not get seen, but if someone does read this please respond with any type of advice what-so-ever. Thank you for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ncmckt/severe_creative_envy/", "title": "Severe creative envy", "social_network": "reddit", "user": "RubySparkeler", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1621036548, "permalink": "/r/DecidingToBeBetter/comments/ncmckt/severe_creative_envy/", "nsfw": false, "first_save": 1635437513.4345028, "replies_charged": false}