{"id": "t5_2tand_t3_q3fmex", "request": ["f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "That is the conclusion I have arrived to. There is still times that I doubt this, a spark of \"maybe I'm not that bad\" rises, which explains why I'm making this post right now. \n\nI am definitely the most insecure about my looks. There are a few good days every now and then when I feel that my likeable features outweight my unattractive ones but I always get smacked into the \"god damn look at how ugly you are - who would want to be with or even be seen with someone like that?\". I am rather confident with my personality (I know my values and I try to act according to them) but I am very scared that I annoy others or that they find me ridicilous. \n\nI don't want to feel this way. Or I don't think I do. But in my heart I am scared that I'm overestimating my worth and honestly I think I'd rather underestimate it. My self-esteem is affecting my ability to make new friends or even be polite with others. I do not believe that someone would want to have anything to do with me or if they make a kind gesture, it is because they are trying to be friendly (as in they are rather doing it for their sake - which totally acceptable). \n\nI can work fine when we have to do group projects in assigned groups. I know it'll be easier for everyone if I just do my job. But if I have to form a group of my own? Well fuck me. \n\nI do not remember the last time I started a conversation  not related to a school project with a person I have not met before. As long as I can remember, I haven't even considered the possibility.\n\nAny thoughts would be appreciated. But to be honest I feel like tomorrow I am going to feel ashamed of this post and will probably continue the loop of \"you're garbage\", \"maybe you're not fully garbage?\" and \"what garbage you are for thinking you're nit garbage?\"", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q3fmex/i_feel_sincerely_inferior_to_others/", "title": "I feel sincerely inferior to others", "social_network": "reddit", "user": "sans-puissance", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1633632025, "permalink": "/r/DecidingToBeBetter/comments/q3fmex/i_feel_sincerely_inferior_to_others/", "nsfw": false, "first_save": 1635438397.5888963, "replies_charged": false}