{"id": "t5_2tand_t3_kzl8zq", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "e234981c-b061-4d83-8134-70d441847f74"], "text": "I’m so happy i finally did this, although i wish i did this months or a year ago, it’s better late than never. I (18F) have been dealing with personal issues, and i’ve recently come to a realization that my “friends” from high school aren’t actually my friends, so this was the best decision to make, and is already such a huge progress for me as i’ve had my twitter, snapchat, and instagram since 2014. I also haven’t  left my house in 10 months, but today i finally did, and it felt amazing. \n\nI already feel much happier; it’s like i have a huge weight off my shoulders. now i can focus on college, and have much more time I can put into my passions while simultaneously improving my mental and physical health.\n\nOriginally, i was going to leave and come back on instagram by my 19th birthday this summer, but i decided to do the full year as i truly want to get the full experience and benefits of quitting social media for a really long time. \n\nI will be starting a full time job next week, will continue to eat balanced and not relapse into my eating disorder, read+write more, run 6 days a week (unless my body needs a break), and buy my first car. \n\nIn a couple of days, i plan on maybe deleting reddit as well since i spend some time on here (i’ll probably try to just manage the time i spend on here), the whole point of this journey is to use as much time as i can to try new things and be disconnected from the online world. \n\nHere’s to a better year and me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kzl8zq/i_permanently_deleted_my_snapchat_twitter_account/", "title": "I permanently deleted my snapchat & twitter account, deactivated instagram as I don’t plan to be back on that until the end of this year, and have started to run daily again.", "social_network": "reddit", "user": "camr9435", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2351, "down_vote": 0, "creation": 1610937634, "permalink": "/r/DecidingToBeBetter/comments/kzl8zq/i_permanently_deleted_my_snapchat_twitter_account/", "nsfw": false, "first_save": 1635435267.0286255, "replies_charged": false}