{"id": "t5_2tand_t3_26kcr2", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "One year ago today, I stood in front of my mirror. I took my shirt off and stared at myself. 195.1 pounds. Borderline obese. Scared beyond belief at what the future could possibly hold. Disgusted with myself for letting it get this bad. Stuffed to the brim after eating an entire large Papa John’s pizza for lunch. And more than anything, just tired. \n\nI was tired of looking at myself and looking away. I was tired of not caring about what I looked, about not caring about anything really. I was tired of lifting my shirt and jiggling my belly and people laughing—not that I didn’t enjoy making people laugh, but I was tired of it being at the cause of my self-deprecation. \n\nI was trapped in myself and I couldn’t stand it. And I had promised myself several times that I would make a change, only to fall behind after a single run or to stop finding the time after a week. The truth is, there was time. There was always time. I just wasn’t ready for it. \n\nI remember looking at my stomach. The gentle slope of my shoulders. The chest that was starting to look less masculine and more feminine. And I told myself that this would be the last time I ever saw myself with that kind of disdain. \n\nSo I snapped a photo. And I began my journey. \n\nIt started out slow. A few trips to the gym every week, a couple meals that I would consider my “start.” More than a few walks up flights of stairs that became something akin to treks into the Himalayas. I would come home and groan in agony into my pillow before hitting the shower on its coldest setting, leaning against the wall. Saying no to high-calorie options, saying yes to vegetables and swallowing my sadness. \n\nI wondered why people did this to themselves. Why they would set their lungs on fire by running, and leave their muscles in scattered ash. I’d had friends who’d always been athletic, always been muscular, and I had always, always envied them for that. There was something they’d cracked, I thought to myself. Something they did that I couldn’t. Because nobody could keep this up for the rest of their lives and enjoy themselves to the fullest. Three weeks in, I was on the verge of giving up entirely; but—just to be sure, I took another photo before I threw in the towel. Compared it to the one I’d taken at the beginning of the month. \n\nAfter seeing that photo, a fire was lit within me. \n\nI started going to the gym more, eating healthier, sleeping deeper. I couldn’t stop talking about it, looking up articles, keeping myself motivated. My friends and I would talk so much shop looking back that I’m wondering how they didn’t murder me by August. The numbers started falling down. \n\nThere were times that tested me, of course. The birthday celebration where I was offered a piece of carrot cake—one of my favorite desserts. The time I was re-racking a pair of dumbbells and jammed my finger. The time the air conditioning was out in my gym in the middle of July in Central Texas. The pizzas and cookies and chips in front of my face every single day. \n\nBut if there’s anything I learned it’s that the road to success is paved with little failures. I turned down the carrot cake and had a banana instead. I finished my workout with a swelling and bruised finger. I ran a mile and a half with a shirt that I could wring with sweat before I even had set foot on the treadmill. And those moments were tough but it was in those moments that I found out the depth of my own limits. Who I could be if I so desired. \n\n“In order to be an extraordinary person, you have to make extraordinary choices,” I kept telling myself before ordering a tomato soup and half a sandwich for dinner. “You are extraordinary, and it’s time for you to reflect that.” I saw myself as a boy becoming a man, a nobody from some nothing town becoming a legend. I would become fable—I was more than a writer, more than a slacker. I was a phoenix, rising from the ashes of who I was and becoming who I was born to be. \n\nI started telling myself this so often that I ended up believing it, and I began to achieve it. By the end of 12 weeks (beginning of June – end of August) I had lost 32.7 pounds, going from a chubby 195.1 to a svelte 162.4. I was happy with myself; I was proud of my accomplishment. But I knew I could do more. And after empowering myself the way I had, I wanted to do more. So I did something counter-intuitive. \n\nI began gaining weight back. On purpose. \n\nSlowly, mind you. This wasn’t a “binge yourself on everything”-type paradigm shift. It was a conscious and calculated effort to eat a lot of healthy food. “Calculated” in the literal sense of the word—calories still played a part in my daily choices. But they were calories from fruits, from oats, from peanut butter, from concentrated whey protein. Whole wheat breads and pastas. Spinach, zucchini, broccoli. Enough Greek yogurts to keep Chobani profitable for the next 100 years.\n\nDespite the math problems behind living out every day, I still managed to have a love affair with food. Learning how to live on a restricted budget, eat healthily, and delineate time to prepare my food for the day (or even the week) was part of the curve. But Sriracha meatballs, chicken chili, veggie egg scrambles, roasted shrimp and broccoli—delicious, cheap, and healthy meals poured out of my kitchen on a daily basis. It wasn’t that I stopped loving food, or started to love my own vanity more than food. It was just a rewiring of my brain to enjoy it differently. \n\nIt was difficult to do, after getting a tutoring gig and starting my Master’s program. I won’t lie to you, there were days where I went lax. But I never stopped hitting the gym, even waking up at 5:30 AM two or three times a week to do so. I learned to find pleasure in pushing myself, in earning a shower after a hard gym session. I kept learning everything I could about nutrition, about exercise. I gained a new vocabulary: hypertrophy, ketosis, Smolov. If I wanted to be extraordinary, I had to know as much as possible about what it took, and then execute it. Even as I researched about surveillance theory and New Formalism, I was watching myself form my own destiny. \n\nAnother twelve weeks went by, then another twelve. I was back up to 190, leaner than I’d been—but only barely. I’d gained a considerable amount of fat, and I was ready to take it off. So, I decided to do something a little bit crazy. But then again, all extraordinary things are a little bit crazy. \n\nI started fasting sixteen hours a day and eating during an eight hour period. In this “feeding window” I would go down to almost zero carbohydrates, and then increase over the course of the next three months. For that first month, I was in heaven. A pound of 80/20 beef three nights a week with some grilled vegetables and I still lost 10 pounds. \n\nGradually the carbs started increasing and the weight became harder and harder to lose. I started adding sprints to my workout regimen. Pushing myself every chance I could in the gym. To those guys that continuously had to raise the barbell off my chest after a failed bench press, I truly am sorry, I thought I could handle that weight and I guess I couldn’t. \n\nAnd now it’s been a year. A full year, and I remember distinctly wondering several times if I could ever be the same person as the boy I took a photo of last June. \n\nI can’t. And that is a great, great thing. \n\nMy body is starting to reflect the power of my mind. My self-love is starting to show physically. Even if it weren’t I would still be doing this. I think that’s an important point that needs reiterating: even if I saw nothing physically change from here on out, I would still continue this healthy lifestyle. I could never go back to that level of apathy. I mean, I ended up becoming a (remarkably unskilled) cook, dietician, nutritionist, personal trainer, life coach, scholar—without even meaning to.\n\nAnd the strange thing is, even in this “Year of Being Extraordinary,” as I ended up calling it—fitness isn’t the only way I saw a change in myself. I started flossing every day. I worked my butt off in my classes, harder than I’d ever worked before. I started loving going to work, for Pete’s sake: every morning I had a shift, I would wake up, turn off my alarm, pump my fist and yell “YEAH!” before getting out of bed and starting my day. I just turned in a 16-page paper, a 20-page paper, and a 50-page write up that I’d written over the course of a single month, and it was all high-quality work. \n\nI’d never had that kind of pride in myself. Never taken the time to go “I am worth putting every bit of my effort into this.” I’d never looked at myself and gone “You are awesome.” Now it’s something I try to do as often as I can. Because I AM awesome. I’m worth it. And I know I have the capability to see things through. \n\nI started out this journey for other people. For looking good, for recognition, for becoming an object of desire. I wanted to be loved. I wanted to belong. I wanted to be accepted. And on some level that’s still true. I’ve come to inspire people through my journey, and I hope they start their own because of me if only to realize the power they hold within themselves.\n\nBut now I realize that none of that could have happened without accepting myself first. I love myself now. I accept myself now, for who I am and all my shortcomings. I belong to my own pride in my own worth and my own accomplishments, and nobody can ever take that away from me. My journey is not over—there is a difference between self-acceptance and self-improvement. But I still can take a great deal of pride in the man I have molded myself into, and every step I took, every weight I lifted, all the blood, sweat and tears I poured into my metamorphosis. \n\nI started out for other people. I’m still going for me. \n\nI stand before you, all 165.6 pounds of me, transformed physically, but more importantly, mentally. And this is my call to you to join me on year two. It will be difficult—I grant you that. There will be moments where you fail. Tough choices will have to be made. But I believe that you can make them. I charge you to realize your potential and fight for what you can be. Become more with me as I continue my quest to become the strongest version of myself. Open yourself up to the possibility of achieving what you thought was impossible. Knuckle down. Put in the work. Do wonders.\n\nI’ll end this with a mantra I made for myself over my year:\n\n“REFUSE ANYTHING BUT THE BEST FOR YOURSELF. \n\nANYTHING LESS THAN 110% IS ROBBING YOURSELF OF POTENTIAL. \n\nYOU ARE WORTH EVERY BIT OF ENERGY YOU PUT TOWARDS THIS. \n\nTHIS IS THE YEAR OF YOU. THIS IS WHERE IT BEGINS—WITH YOU.\n\n\nBE PASSIONATE \n\nBE DELIBERATE \n\nBE MINDFUL \n\nBE EXTRAORDINARY.”", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/26kcr2/waiting_to_stellify_a_success_story/", "title": "Waiting to Stellify: A Success Story", "social_network": "reddit", "user": "ASD_Sinfonian", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1401150876, "permalink": "/r/DecidingToBeBetter/comments/26kcr2/waiting_to_stellify_a_success_story/", "nsfw": false, "first_save": 1635437188.4082885, "replies_charged": false}