{"id": "t5_2tand_t3_axom1g", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "*\"Failure is not an obstacle; merely a stepping stone\"*\n\n&#x200B;\n\nWe all feel unmotivated at times. But sometimes, we feel so unmotivated that we can't be bothered to do *anything*. And it's usually the case that this feeling persists for more than just a few days -- sometimes it lasts for weeks, months, or even years.\n\n# Learned Helplessness\n\nIf this is you then you may have fallen into a pattern known as \"learned helplessness.\" Learned helplessness is the psychological phenomena where you feel that even the smallest goals are out of your reach, and is usually caused by a progressive series of failures and disappointments.\n\nEventually, you come to accept that your fate is naturally doomed to a miserable existence and an eternal lack of motivation. But, don't beat yourself up. We all fall into periods of depression and learned helplessness from time to time; it's normal.\n\nSo your problem isn't that you've fallen into learned helplessness, but something else entirely...\n\n# The Problem\n\nThe problem (at least this was my problem when I reflect on my own life) is that you're trying to escape from learned helplessness in the *wrong* way. If you're anything like me, you're setting big grandiose goals for yourself, lost in reverie of what your life will be like when that blissful kiss of motivation returns again.\n\nAt the very least, you're thinking of the big picture goals that you wish you were motivated to do.\n\nOriginal thoughts:\n\n1. \"study algebra and ace that class\"\n2. \"read 4 new books this month\"\n3. \"clean the apartment\"\n\n# The Solution\n\nIn reality, you should do just the opposite. Set minuscule goals (rather than big picture goals) and give yourself productive choices that you can't help but achieve. The idea is to basically reverse engineer your learned helplessness. Because, in this context, learned helplessness usually burgeons from the repeated failure of goals, both big and small. So you have to counteract this by *repeatedly achieving* goals, over and over, no matter how small they are.\n\nIn other words, teach your brain that you *can* accomplish something, anything, and then work your way up from there. Over time you'll feel your motivation start to return and your hope blossom.\n\nNew thoughts:\n\n1. \"do one math problem\"\n2. \"read one paragraph\"\n3. \"vacuum one rug\" \n\n# That's All\n\nLearned helplessness is best counteracted by slowly building momentum rather than making big changes all at once. This certainly helped me, and once I started focusing on the *minuscule goals* and then working my way up, I paradoxically became more productive and motivated with my big goals overall. So I think that you can expect BIG results if you apply this to your life as well. It may be a simple or small change in attitude or methodology, so what have you got to lose? Give it a try.\n\n&#x200B;\n\nP.S.\n\nSomeone messaged me about a productivity post I made here, and asked why the post did not include a link to the YouTube video, when the link was included on the same post in a different subreddit. The answer is because the mods here banned me from posting links. Which is no biggie, because that's their prerogative! However, I will continue to make these text posts because I really like this community and I think that this is valuable information that should reach as many people as possible (and we have a really good community here because it's so active!) So yeah, the important thing is that we can still share ideas at least! Just wanted to get that out before I get any more messages about it. Thanks", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/axom1g/advice_why_you_cant_motivate_yourself_to_do/", "title": "[Advice] Why you can't motivate yourself to do anything", "social_network": "reddit", "user": "ALefty", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 587, "down_vote": 0, "creation": 1551811511, "permalink": "/r/DecidingToBeBetter/comments/axom1g/advice_why_you_cant_motivate_yourself_to_do/", "nsfw": false, "first_save": 1635435633.326287, "replies_charged": false}