{"id": "t5_2tand_t3_kaa0wo", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "I am 39 y/o guy and I've had a lot of dating experience in my day.  Mostly because I have a few talents that people took notice of, such as singing and playing guitar in a band.  But I am an introvert for sure, and can find myself in some pretty lonely patterns where I just don't meet anyone for months or years.  \n\nSo I came upon this guy named James Marshall on youtube and he is a \"pick-up\" artist and his whole thing is that women want to be approached.  The basic premise is that people are social animals, its okay to exude an appropriate level of interest with a stranger, men should initiate, and these interactions make life richer.  Fair enough..\n\nI have been trying to motivate myself to talk to more women, but I keep making excuses, such as that everyone is wearing masks. \n\nIf you think about it, the most ethical place to chat with a lady is in some public sort of place like a grocery store, etcetera.  Because she can easily excuse herself from the conversation and walk away. \n\nDeveloping a crush on the Barista at the coffee shop or waitress is common because she *has* to talk to you, and you have to talk to her too if you want coffee, but anyway even if there is chemistry, she is working, you see, there's no getaway for her, not very fair.  Its not a big deal though; I would not say that such situations are off limits.\n\nAnyway, I was leaving work today and noticed the nurse who is stationed at the entry and I'd seen her there before looking all cute so I stopped in my tracks, turned back around, and said \"I like your mask\". \n\nWhat was interesting was, in the next five minutes, how quick she was to want to chat with me, tell me what Netflix series she is watching, toss her hair flirtatiously, and set me up with witty banter which I had no idea what to do with.  Its like, she was so happy that this awkward bachelor was chatting with her.  I didn't know what to say next so I just said, \"well... have a good night Kate,\" and I exited.\n\nI guess, if there's anything I would have done different, it would have been ask:  \"is that an engagement ring on your finger?\"  Because thats what was going through my head half the time so why not just say it.\n\nThrough this interaction I realized that some of the problems I have had with women are my own.  For instance, I was about to go on my moral high-grounds rant about binge watching Netflix, rather than reading books which is what I do, but she cut me off to tell me how much she liked Orange is the New Black and why.  She was cheerful, and enthusiastic, while keeping a sarcastic tone which made me smile.\n\nIs it possible that my judgemental stances are just defense mechanisms set up to keep me in my baseline state of loneliness waiting on miraculous romance?  Or do I simply know what I do and don't like?  I think it goes back to my childhood honestly.  At what point do you become more accepting of other people and their tendencies?\n\nI guess, I am learning.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kaa0wo/i_talked_to_a_woman_and_she_responded_positively/", "title": "I Talked to a Woman and She Responded Positively", "social_network": "reddit", "user": "blueeyed_ranger", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1607580697, "permalink": "/r/DecidingToBeBetter/comments/kaa0wo/i_talked_to_a_woman_and_she_responded_positively/", "nsfw": false, "first_save": 1635435865.9802773, "replies_charged": false}