{"id": "t5_2tand_t3_o0dpqr", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Hello! \n\nI'm looking for tips from someone who put off improving themselves for years, and how you actually got started and kept it up.  I sometimes convince myself I can't change and I won't even start because of that! I need a little hope and would love to hear any stories about your self improvement journey, especially if you convinced yourself that you couldn't do it. I would love to hear your \"Ah-ha moment\"  that propelled change, and how you continued the momentum when you felt like returning to old habits. I'll put some stuff below about myself if you have any specifically advice, but I would love to hear about anything you improved. \n\nI feel like I have a pretty typical story for someone on this subreddit (maybe! I'm generalizng!). I'm addicted to social media/internet consumption. My health is meh due to poor diet and no exercise, and I'm getting older so I feel it more in my body. I don't engage in hobbies much because I'm probably too busy staring at a screen. I have trouble setting and reaching goals. My work sometimes suffers from procrastination (not enough to have  consequences, but not creating my best work). I come home from work to my messy apartment to just sit and I'm just tired all the time. That being said, I'm still happy and a pretty positive person, and there are things about my life that I love! I recently followed my dream and moved abroad and I have great relationships with my friends and family. I've somehow reached my bigger goals, but lack of routine and discipline often makes my daily life feel chaotic and I feel unsatisified. I've wanted to change forever and have a vision of what a better functioning life would look like for me, but I think I'm too lazy to start, or I get overwhelmed. \n\nMy childhood was really chaotic and I was neglegected quite a bit, so I never really learned have discilpine with myself and I kinda just let myself do whatever brings me pleasure the fastest. I feel like I need to re-parent myself, but I'm not sure where to start! \n\nThank you in advance! I'm excited to hear any stories or advice you may have :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o0dpqr/ive_decided_to_be_better_how_do_i_actually_start/", "title": "I've decided to be better: how do I actually start?", "social_network": "reddit", "user": "pabstduderibbon", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1623761779, "permalink": "/r/DecidingToBeBetter/comments/o0dpqr/ive_decided_to_be_better_how_do_i_actually_start/", "nsfw": false, "first_save": 1635435097.4557889, "replies_charged": false}