{"id": "t5_2tand_t3_pdb203", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "In early 20s, Graduated from college and in a government job in engineering.\n\nIt's not \"bad\", pay is Ok, good balance, supposedly meaningful work but it feels like I should be doing more. My life was complicated enough where I really just needed that first job to gain my own independence but after my one-year agreement I might want to find another job. \n\nI never knew what I wanted to do in college, I tried a bunch of things everything felt like 'oh something else to get done, just to get done.' I majored in useful majors from a really good school and I'm making less than the average engineering grad alumni and possibly less than other peers and it just feels like I'm not using the potential and talents that were given to me.\n\nI also feel like I'm working with people who just want to get by since the job doesn't entail that much. I run the risk of getting hate on this post but I feel like someone as smart and accomplished as me should be trying for more. \n\nI had my reasons for being in the job, namely not really knowing what I wanted to do and needing to be independent since I didn't have the support from family. \n\nIt's a wonderful position with a lot of perks but in a year I think I'm going to try for more because I want to. I try not to listen to others, but I've already gotten some questions about why I'm working there, it seems like I could have gone for 'better'. But it was the best option I had in terms of a gaining independence from a job. (and it's a good job for some people this is their mission) I mean if this society is chasing job after job, accomplishment after accomplishment....\n\nMaybe I'll be happy with the position and I don't need to change, most others want to stay there at least a couple years. I'm not unhappy with the position, it just get by and by, keep delaying, hour long lunch breaks, jokes about other employees working here for many years, etc.\n\nI tried researching about what I would do. If I had an endless supply of money I would buy an expensive car to drive (typical young person) and plan and go on vacations in interesting locations. But  that would get dull after a while so then I had some hobbies I wanted to get better at, like saxophone, so I could get a coach. Then if the money was limited maybe I will start buying properties to rent for passive income. So maybe this means in the future I want to go back and be in money making.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pdb203/start_looking_for_another_job/", "title": "Start looking for another job?", "social_network": "reddit", "user": "Fabulous-Advantage", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1630161930, "permalink": "/r/DecidingToBeBetter/comments/pdb203/start_looking_for_another_job/", "nsfw": false, "first_save": 1635435246.3582344, "replies_charged": false}