{"id": "t5_2tand_t3_9sbkbk", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I currently am in my first lease with my my current girlfriend, sister, and my mother who we all take care of she has had a total of 3 strokes, 2 types of cancer; melanoma(removed completely), b-cell non-hodgkins lymphoma(current status: REMISSION!!!!!). At least 4 major heart attack, resulting in stints, filters, eventually a quadruple bypass.  She has 2 blood clotting disorders (PAI1) (lupus antiquagulant disorder(not related to lupus the autoimmune disease (brackets within brackets within brackets bracket-ception?))) with the amount of health problems that run in my family (my father passed away on the 17th of this month 2 days after finding out he had throat cancer I think my sister said that his heart just gave out kinda I guess) let alone the fact that I have let  lupus run untreated through my body for 3 confirmed years whilst kicking the shit out of myself with drugs, alcohol, not to mention for at least the last year or 2 4-5 monster energy drinks a day..... So all this made me kinda apathetic and not seeing a life that could be long and happy but hey things can change right? That's why we are on this sub, no? I can kinda see why now that I can and should do what I have put off for so long and try and actually achieve something, which right now is I have no fucking clue what but it's more than I've had in the past and I'm slowly building more and more of the frame work for a better life than I've had and the skills to maintain a healthier mind/mindset for sure the health part I mean yea I'll have to face it eventually but right now I'm still young enough to at least fake it through these tougher bits in the midgenning(I'm 28 so it's like the middle of what should of been my beginning hehehe. I mean it's gunna take a lot of time and a stupid amount of work to do this but I think I might finally see that if I just maybe progressed a little in life finally I wouldn't be so damn miserable all the time for fuck sake. \n\nI know I can't kill myself or anything along those lines I guess like slowly and apathetically letting  your body kill it self like my brother-in-law let happen to him, he never took care of his diabetes and is now in need of new kidney he can't get cause the doctors basically saw him not try to better himself. That would cause to much harm to the family and mom.\n\nI also can't just keep existing in a barely I mean barely scraping by kinda life I have to do something other than let what once was a, to paraphrase our uhhhn Commander in queef I mean cheif Donald j. Trump: \"good brain\" go to complete and utter shite.... \n\n\nAny tips or suggestions? please help ;) basically I am 28 work at 711 almost full time, take care of my mom which is cool but I don't drive because I never bothered to get a licence. Before moving back to San Diego (home town) I lived in a small Indiana town didn't need one really and now Uber but that's getting expensive. I dropped out of school at 16 after my step-dad passed away my mom had been diagnosed with the lymphoma the year before that. So basically I have become complacent in within a routine....\n\n tldr: life sucks and I finally realized I can't kill myself for the simple fact alone it would be to much for my family to have to take on with out me for one and they would be sad duh ;) but since this life I've lead as a loser so far sucks so far I gotta do something about it cause I finally used both working brain cells I have left. \n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9sbkbk/so_it_finally_hit_me_and_i_need_a_to_be_better/", "title": "So it finally hit me and I need a to be better! Help? Long post with tldr", "social_network": "reddit", "user": "omfgitsjonn", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1540805339, "permalink": "/r/DecidingToBeBetter/comments/9sbkbk/so_it_finally_hit_me_and_i_need_a_to_be_better/", "nsfw": false, "first_save": 1635436083.1789591, "replies_charged": false}