{"id": "t5_2tand_t3_mch6nv", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7", "f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "**I (M/Non-binary 21) think I’m a Covert Narc—**\n\nI feel like I have NPD. No information helps me decide whether its true or not. My therapist and psychiatrist also disagree when I raise such concerns (stating “well everyone has these traits”) but sometimes when friends and I talk about people we perceive to be Narcs I almost feel like we could be talking about me (especially with the deep rooted feelings of shame) And yes I have read that thread about suspecting yourself of narcissism. Sorry, not convincing. I wonder if anyone has experienced similar issues and can reflect on this. And yes I know writing out a very detailed post like this can come across as self-absorbed (I tell myself that already)\n\nDiagnosed with ADHD at 7 and then again at 13 as well as with a NVLD (similar to “high functioning” Autism spectrum disorder) and added Depression and OCD/ ED at 18. I grew up in an affluent family, both parents being physicians (both of which I think display NPD and Codependent traits) and essentially was given “everything.” I remember overall having a pretty happy childhood, I was a difficult kid though ( always calling out/acting up in class, cut the phone wires at my moms work at 8 bc I was playing “spy”, threw dirt in a counselors face at 9, lied about watching R rated movies/getting my ears pierced at school, lied about having bulimia to make a friend in middle school as I had none, though I did have undiagnosed anorexia etc. all of which make me totally sick but also I try and repress all as I tend to ruminate) and that caused tension between my parents and I. I imagine my parents were often pretty stressed due to their demanding professions and would often time be lax but sometimes erupt in borderline abusive or cruel ways, sometimes with a scary intensity in their eyes, a look I know I have given others before. \n\nMy father spoiled my sibling (he can be a bit of a people pleaser / “fixer”) and I while my mother was very reserved and acted as though we were much less well off than we were (even though it was obvious we were rich). It often felt like my dad was the “good cop” and my mom was the “bad cop” though that would shift. While my parents would have moments of genuine concern / connection they mainly approached things analytically which would often times lead to feeling invalidated or feeling unsupported, I was often times told to “go entertain yourself.” As are both high achievers/performers they’d always tell me how smart I was and if I just applied myself to school in the way I did to my outside interest I could do so well. Because of poor school performance and tension thereafter it felt like the way to get their love/approval was through performing well. They won’t have to pretend to be cool with okay grades even when they said they were happy while emphasizing “well if you just applied yourself more think about how much better you could do!” \n\nI had a difficulty time maintaining friendships, and I was always a bit immature for my age/behind socially (due to ADHD and NVLD) and didn’t really catch up till middle school which caused me to be frequently picked on / ostracized. I remember report cards saying I’d often shut down when stressed, would say “alienating” things to classmates without remorse, had only superficial friendships but not “best friends: and had trouble with personal space. I spent most of my time in my room alone / not reaching out to any peers or getting invited to anything. This not only was incredibly lonely but I think made me into a Narcissist as I was only really thinking / concerned for myself due to essentially no good social development (with the exception of outside of school activities) and gave me the deep seated impression that I was not only unlikable but that there was something wrong/very different about me. Growing up queer was difficult too— being gay was completely okay but experimenting with gender expression/identity always had this atmosphere of taboo around it. When I began more assertively trying to do such later in HS my whole family would saying things like “what do you have on your face, take that off” or “what are you wearing!?” All leaving me incredibly defensive and insecure. Because I wasn’t allowed to truly express myself comfortably for so long I truly believe this created a “false-self” something I know Narcs have and I worry me asking for they/them pronouns and expressing myself currently as non-binary is just a way to get attention / is me thinking I deserve special treatment from others/ can only be surrounded by special people that understand. \n\nSome of my negative traits that I think indicate that I'm probably a narcissist myself:\n\n&#x200B;\n\n1. being offended easily (or jumping to a snarky defensive quickly instead of asking someone to elaborate but I am getting better at this)\n2. disregard to others' personal space / property (using friends / roommates things without directly asking)\n3. Lack of empathy and compassion (sometimes I question whether I only feel cognitive and somatic empathy and if when I do begin feeling emotional at something someone is telling me, showing me or reading to me that I’m just projecting, also occasionally feeling irritated when friends come to me with their issues, complaints and problems that seem trivial/stupid to me. However when I fuck up and hurt someone I rarely don’t feel remorse/guilt and know that when I apologize full accountability is necessary and to use I statements and not blame the person something I use to do however I never know where is the line between sincere healthy apology is without self loathing and compensation for narcissistic guilt?)\n4. numbness (feeling lots of apathy or non-intense emotions or having a dull response sometimes when a friend is upset)\n5. Sliding perception of others (however I can realize when I’m splitting someone in my head and remind myself I fuck up too, nobody is perfect and that I love and care for hem) \n6. low self esteem (definitely feel like I have deep rooted feelings of shame/guilt, I often times do not think I’m a “good person” and if people knew about the things I had done in the past they’d view me as unlovable)\n7. Wanna-be perfectionism (while for the majority of my life I got B’s and C’s I’d often procrastinate because I’d want my work to be perfect but knew what I was trying to reach was untenable for me)\n8. Suppressed aggression (my mother was very passive-aggressive and my father was generally laid back until something upset him and he’d be overly aggressive— this has lead me to kicking and cracking the windshield of a car, kick a dent in the wall, yelling at a roommate and occasionally having an angry outburst / temper tantrum something I’ve suspected is Narc rage/injury)\n9. Self esteem roller coaster (from “that bitch”, attractive, smart, etc. to piece of garbage, bad person, cowardly, etc.)\n10. limited capacity for social interaction (Sometimes I really like being around people and other times I shut myself in my room and want to be alone and isolated as up until 7th grade I had little to no friends/ was never invited out)\n11. Get distracted easily\n12. I feel very hollow, confused, guilty and bored at the same time and sometimes feel like I have to fake not feeling this way (other times I just feel calm/neutral).\n13. Wanting to be the center of attention (especially in conversation, I rant, vent my problems, talk about the things I like, etc and often times turn it back to myself and then get upset at this and think “stop being Narcissistic make sure they get a turn too and feel heard”) \n14. Expect rejection / disappointment and do not believe the compliments I receive although they sometimes ease my anxiety about being a “bad person”\n15. Either can take criticism well or not at all\n16. a lot of my fantasies are infested with episodes of high praise and adulation to the point where I'm really wondering how grandiose I am\n17. struggle with long term goals realistic goals and often wonder if my high aspirations are Narc exaggerations to make myself look better (because secretly I sometimes think I won’t really be able to become a doctor/scientist)\n18. the-child-who-can-please \n19. Charming / know what will make people feel good / validated / comfortable (while I know this doesn’t sound bad is it really that authentic if I’m potentially doing it for subconscious reasons like trying to make them like me, I was often told by my mother “wow you can really turn the charm right on”)\n20. irresponsible/impulsive (abused drugs, smoke weed everyday, procrastinate on my workload, have cheated in college, shoplifted thousands of dollars as a minor, etc.)\n21. unassertive: as I’m scared I’ll come across to blunt or hurt someones feelings\n22. searching for and fantasizing about getting narcissistic supply, more often than not subconsciously. (Posting instagram selfies/ scrolling social media, using Grindr/tinder to snapchat and have sex with lots of people, using drugs, buying material things, watching porn etc.)\n23. shoehorn my achievements and skills in every conversation, get bored and disappointed when people don't react or are unimpressed.\n24. Always self conscious. Always feel in the wrong. Always feel bad. Always ashamed. Always out of place. Always feel like everyone in the room is watching me. \n25. Doing nice favors for friends— I worry that I’m only doing such because I have a subconscious need to control therefore I know that if I’m doing something for someone that can never EVER be held over their head, regardless if I don’t really want to do it or not)\n26. Oscillating between hyper-involvement in my friends and families lives to ghosting / being detached", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mch6nv/think_im_a_covert_narcissist/", "title": "think I’m a Covert Narcissist", "social_network": "reddit", "user": "Southern-Primary-593", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1616621312, "permalink": "/r/DecidingToBeBetter/comments/mch6nv/think_im_a_covert_narcissist/", "nsfw": false, "first_save": 1635435820.8290617, "replies_charged": false}