{"id": "t5_2tand_t3_qgfu0o", "request": ["b69cf201-6737-4217-b486-9096135546b8", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "\\*First of all, if this is against the rules, mods please let me know. I'm not trying to sell anything or any group, because there's nothing to sell. I'm merely trying to gauge interest.\n\n**Would people be interested in a \"self improvement article club\" over Zoom?** Like a book club, except we read articles instead of books (because 1. they're free, and 2. they're a lot shorter so it's accessible to people who don't have a ton of time to read an entire book).\n\n*Here's why I want to start this:*\n\nSocial media, and especially the r/DecidingToBeBetter subreddit, do a great job of distilling information to help you become a better person. Which is great. But the one thing it lacks is a strong community; at most we're just replying to other virtual users whose real names we don't even know. But community is what keeps us going, and it's what brings people true joy. Read any of the studies on happiness and the theme that keeps coming up over and over again is that the happiest people have strong communities with shared values. So I want to create a real community of real people who are working to improve themselves. It seems like a shame to have all these great people in this community but yet not have any real connection.\n\n*Here's what I'm thinking:*\n\nWe meet once a week, over zoom, to discuss an article (or even Ted Talk) that someone from the group picks. We'd rotate who picks it each week to give everyone an opportunity to share something that has helped them. Having your camera on would be strongly encourage (although obviously if you really don't want it on that's fine too). The main focus to start would always be the article and what we each learned from it, but I'm sure it would (and we would want it to) slowly delve into more personal topics and really allow people to connect and make friends, even if just over Zoom. In the beginning we'd always do introductions and an icebreaker or something like that to help people get to know eachother.\n\n*Logistics:*\n\nOnce we get people, we'll create a big group chat and I'll send out a form to see what time works best for people. Then we'll pick an article for the first week and go from there.\n\n**If you're interested, reply to this post, and if you want, throw in an article you'd like us to read.**\n\nI'd also love to hear any feedback people have on this idea. I'm really big on the concept of taking shallow internet relationships and turning them into real relationships, especially with people who share common values and passions, so I'd love to hear other people's thoughts.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgfu0o/self_improvement_article_club/", "title": "Self Improvement Article Club?", "social_network": "reddit", "user": "OfficialBenStevenson", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1635281217, "permalink": "/r/DecidingToBeBetter/comments/qgfu0o/self_improvement_article_club/", "nsfw": false, "first_save": 1635436441.8034368, "replies_charged": false}