{"id": "t5_2tand_t3_clwmka", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Whats my biggest problem? How do i make people like me/give me attention? Do i need to work/love on my self then people will like/love me? Life is about adventures and experiences right? Its like i would be very happy if ppl gave me attention. I try to take a shortcut to get girls approval/attention in online.\nIm the worst version of my self. What do i do?\n\nI have to depend on porn or texting girls or watchin youtube or tv shows to keep my self happy im addicted to only those. \nIm 18 and look at the state of my life. Im just not interested in anything. And idk how to make things right. No one is here to hold my hand like ppl in movies do, im alone. Bc im worthless. i fucking hate my self. WHAT THE FUCK DO I DO?? Im so fuckin angry rn i read posts here how ppl brag how they changed easily. My heada tellin me to masturbate again i havent done in 3 days.\n\nim a boring person/boring-ordinary life/conversialist/not charismatic/im passive aggreasive/i have a boring life/no selfesteem/i aint wise/im too generic/no confidence/im uncreative/im needy and desperate/im dull and bland/no knowledge/not cool/no knowledge/no skills/no qualities/no job/no sense of humour/i have no creativity or imagination/i have no ideas or orginal opinions or jokes/not funny/not likeable/not friendly/not charismatic/i dont have a sharp minded or good thinking one/not witty/ not charming/not fun/not intelligent or smart/im not mysterious im very predictable/im not a genius/ im rude sometimes arrogant and ignorant im egotistical.. i make boring dull uncreative rude and egotistical jokes.\n\nDo i have to do things in my life differently? I have a boring life, i dont have hobbies or passions or friends, i just sit home and do nothing, maybe my thinkin is true after all.. no one wants a friend like me right? Do i need to challenge my self ? \n\nI run out of things to say or talk about, im the one who asks boring questions no one seems to give an F for, in convos i always say more, put more effort in,Idk how to make friends or flirt with girls.\nIdk what i should be saying or should be talkin about. But people always ignore me.\nEven in chats. How pathetic that is. I really know nothing. I aint smart. I have a small brain. Only good thing is i know 2 languages i play a bit soccer. Still virgin.\nI dont even know how to start a convo or open up with a subject Im jealous of ppl who talk for hours, that never happens to me. My convos are boring/tedious.\n\nI have a self destructive behivour\nI dont even like my self. Im waste of a man, waste of a life. I dont go out anymore or try to make friends cause it will only make me hurt/hate my self again. I have lost interest in makin freinds coz i never get them, The real ones, Im sure i always bore people, having no personality, So how can a girl like me.. I feel like im not good enough. Maybe its truth. I try to impress people to get them to like me or give me attention.\nI try a lot to make ppl laugh. But nobody likes me. Never got loved. Idk how to stop this. I never been loved or important or been liked by anyone. I get ignored. I feel the need to get a Gf or girls to like me online or to masturbate. And im like girls \"Text buddies\" online.. pathetic...And i bet gettin a GF wont solve my problems right? What the fuck do i do then???\n\nIts like im peoples servent \"keepin them entertained\" by tryin to make them laugh. And they ignore the shit outta me. Never ask me questions or care about me. Idk how to be interested in people. Everyone who rejects me its my loss not theirs. I dont deserve any friends. \n\nIts the hardest thing making friends for me...i dont make any sesne when i talk. \nIm an idiot. I have no confidence, calmness, strentgh. Im depressed. Insecure. Afraid of ppl leaving me. Im the worst version of my self. Idk my real self. And challengin my thoughts is so hard.\nAnd nothin really special ever happened in my entire life. 18 years of pointless livin\n\nIts like i chase girls online to make me \"Happy\" it should be the opposite. But i cant make friends with girls also. I chase everyone its never ppl chasing me\nIts never a girl liking me first or falling in love with me. and i please people just to give me attention and make me feel \"valued/worthy\" i guess this is why i always depended so hard on porn. Im just fucking invisible. No one gives a fuck about me, or misses me, or likes me or loves me, or even cares to start a convo with me. I just feel like i was born for nothing. Sometimes i wish i died.\nIm 18 idek how to have fun or meet ppl or make friends. Whats wrong with me?\n\nI have no plans no job or goals or big dreams or hobbies or passions, No one loves me i dont blame them. Im like an bactaria to this world. Im in bottom for everything. Only good thing about me is i know 2 langauges. Im not special. Just an invisible foolish idiot with no life. I have such a small mind. Im passive-aggressive.\n\nI have no qualities, no orginal opinions or creative ideas or big thoughts or sharp thinking. Im just nothing. Im at absolute 0. \n\nI always bore the fuck outta ppl. My convos are always boring. I always say 3 sentences other person says 1 word like their teeth is being taken out. Its always like they are forced to talk to me. Its like i always say close-ended things.. that ends any convo so soon. \n\nI always feel like people are too good/cool for me, i feel like they are smarter/funnier/cooler and assume no one likes me.I keep comparing my self to everyone even super stars in movies or tv shows.\n\nSo what do i do to be likeable? Cool? Smart? Funny? A person with personality? How do i stop being opssessed with textin girls and porn? Ppl say be yourself? Idk who my real self is, who am i supposed to be?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/clwmka/im_really_tired_of_my_life_idk_what_to_do_with_my/", "title": "Im really tired of my life. Idk what to do with my boring personality and life. I have no personality or friends or a GF. Do i need self improvement? Im in rock bottom. I feel empty and stupid. I have no life. Im just freakin invisible.", "social_network": "reddit", "user": "hamacule55", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1564927333, "permalink": "/r/DecidingToBeBetter/comments/clwmka/im_really_tired_of_my_life_idk_what_to_do_with_my/", "nsfw": false, "first_save": 1635435832.3010466, "replies_charged": false}