{"id": "t5_2tand_t3_ppd78y", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "None of us want to live a miserable life. We want to be happy, but that's momentary and difficult to quantify. Thus, our best shot at the life we'd be glad to live is to strive for satisfaction and fulfillment, which can be quantified to a good extent. Fulfillment is mainly dependant on three states- our social state, financial state, and the state of our career. Doing reasonably well in **all** these three areas is essential. This post will be discussing the **social** aspect.\n\nHumans are biologically social creatures, no matter your personality type or preferences. Your social life is essentially the product of the quality of relationships times the number of meaningful relationships you have. If either component is lower than a critical amount, we're setting ourselves up for huge problems in the near future. Also, having a good social life is beneficial in other important ways like reinforcing self-confidence, making connections, and improved communication. The good news is- you can learn to be social.\n\nFirstly, you must make sure that you're meeting strangers. The number of such interactions isn't of importance but it is essential to keep having them. \"Everyone is friendly, but you have to go first\". A few of the times, the event will fall apart. This is normal and completely fine! Do it anyway. It’s more than worth it.\n\nSmall talk isn't trivial. Practice having positive small talk instead of complaining about the weather. Small talk is the door to deep friendship. You must make small talk first. People need to know you won’t stab them before they want to hang out. \n\nAfter meeting new people, ask open-ended questions to get them to talk. Why what and how questions are a good choice. Another good trick is to try forming \"a one-sentence life story\" to enhance listening. Everyone loves to talk about themselves, all you have to do is appear interested. A good rule of thumb is to be about 10% more excited about the topic than the person speaking. \n\nTalk to people’s emotions. Finding common things might seem difficult but a metalhead and a classical music lover can connect on how emotional they get during a raw, deep piece. Also, conversations about emotions and feelings are far more memorable than throwing around fun facts. \n\nAnd lastly, and this one's a little bitter to accept- You're the villain in someone's story. Letting go of the thought that people have to like you is the best decision you will ever make. Even the most dislikable people have friends who love them, and the nicest ones have ardent haters. \n\n&#x200B;\n\nIf you learnt something, you join me on my journey of development.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ppd78y/lone_wolf_a_recipe_for_misery_and_a_solution_13/", "title": "Lone Wolf- A recipe for misery (and a solution) [1/3]", "social_network": "reddit", "user": "NotRealHyde", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1631798518, "permalink": "/r/DecidingToBeBetter/comments/ppd78y/lone_wolf_a_recipe_for_misery_and_a_solution_13/", "nsfw": false, "first_save": 1635435435.9011316, "replies_charged": false}