{"id": "t5_2tand_t3_mwd6w1", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I've found I keep waffling between bingeing games for rank and getting super frustrated with Hearthstone and League of Legends. \n\nEvery once in a while I would feel optimistic about the League experience. Every time I'm stymied by a bunch of trolls, snobby casuals, and afkers. No, I'm not a toxic jerk myself - I'm a team player. But I'm also no mechanical god. I can't will a team to victory, I'm essentially rolling the die with a single control factor - me. Its demoralizing compared to the \\*idea\\* of playing League.\n\nWith Blizzard, I find I keep coming back to Hearthstone because its easy for me to rank up and get a false sense of achievement. I'm not improving as a player, I'm just taking the easy route for instant gratification. Furthermore, the F2P Hearthstone experience is a significant time sink. I say this as someone who used to give them money. Plus, Blizzard has a history of blatantly lying to their customers.\n\nNeither game is really doing anything healthy for me. It takes forever to get anything meaningful from them. So its time to let them go. Technically, both my accounts are queued for deletion, its not an instant thing. But my accounts are synced to a spam email; its very easy for me to ignore them now that I've gotten over the decision. \n\nHopefully this will help me channel my energy into more productive hobbies, or at least less annoying past-times. There are other games I play on and off, but none of them are anywhere near as problematic. That's two fewer distractions for me.\n\nWhy didn't I do this before? /s", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mwd6w1/tired_of_lovehate_relationship_with_lol_and/", "title": "Tired of love/hate relationship with LoL and Blizzard; deleting my accounts.", "social_network": "reddit", "user": "ADHDftw", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1619121218, "permalink": "/r/DecidingToBeBetter/comments/mwd6w1/tired_of_lovehate_relationship_with_lol_and/", "nsfw": false, "first_save": 1635437591.994993, "replies_charged": false}