{"id": "t5_2tand_t3_pq9wan", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "I see a lot of people struggling to find accomplishment and fulfillment in their daily lives. I used to be that way, so I know it sucks and it seems hopeless. That's why I'd like to share a couple things that I started doing that changed everything for me.\n\nOne, morning routine. I wake up at the same time seven days a week and do the same things every morning. Go potty. Make my bed. Get dressed. Drink water. Go on a ten minute run, sometimes more if I'm really feeling it. Take a shower. Eat breakfast and take my vitamins, gummy vitamins obviously. Brush my teeth and tend to my beautiful goatee. Then I end it all by sitting in silence and running through what I need to do that day. Then I start my day. You see, by having small tasks for myself every morning I always start my day with small accomplishments. I start every day feeling like I can do great things because I've already proven to myself that I can do small things.\n\nTwo, I learned to enjoy the act of doing nothing. This was definitely difficult to learn. I used to ALWAYS have to be occupied with something. By doing nothing, I don't mean watching TV or browsing Reddit. I mean literally sitting in silence and breathing. I try to get a good ten minutes a day. This I do whenever I can fit it in, usually after I get home from work before the family gets home from school. It's just nice to know that I can always have a minute for me.\n\nFurthermore I set long term goals for myself. It's near impossible to live up to another person's standards. We get so caught up in Instagram fitness and modeling or Reddit karma points or trying to be the best at everything we do that we forget to do things for ourselves. I set many goals for myself and every time I check one off I set a new one. It's how I lost 24lbs so far with another 36 to go. It's how I got my credit in line and bought my first brand new vehicle last month and next it's gonna be a nice house. It's how I moved my wife and her beautiful children out of a craptastic single wide trailer and into a nice farm house. It's how I beat those voices that tell me I can't on a literal daily basis. Those voices are absolutely fucking wrong, and so are the ones in your head.\n\nLastly, and most importantly, I came to the realization that a bad day is just that. One day. I take the L, chalk it up to the game and try again tomorrow. I'll get that W one way or the other. At the end of it all, it only takes one more day to do awesome things. Always give yourself one more chance, cause if you don't who will?\n\nYou CAN do great things. I hope maybe something I said here can be that springboard for you. You don't have to do what I do to a T. Maybe running ain't your thing. Maybe you don't like eating breakfast. That's all cool, we're different people. You don't have to live to my standards. You just have to find your standards and kill it each and every single god damn day. And if you have a bad day, walk it off and get some rest. There's always tomorrow. Keep on keepin on, peeps. You got this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pq9wan/simple_changes_that_make_lasting_results/", "title": "Simple changes that make lasting results.", "social_network": "reddit", "user": "HotNastySoup", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 332, "down_vote": 0, "creation": 1631916387, "permalink": "/r/DecidingToBeBetter/comments/pq9wan/simple_changes_that_make_lasting_results/", "nsfw": false, "first_save": 1635435341.1358395, "replies_charged": false}