{"id": "t5_2tand_t3_i9d7dm", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Disclaimer: I am not a native English speaker. I will try to convey my thoughts as thoroughly as possible.\n\nHi there. I recently browsed my wife's search history and have found that she has recently found the term emotional abuse.\n\nOn the superficial level, I have always thought that emotional abuse was about not giving/showing love or affection. That's why brushed it off as something I do not personally do.\n\nI know that I am manipulative, but I have always correlated manipulation with intelligence. The more manipulative and in-control you could be, the more intelligent you were.\n\nThis was something I picked up by watching my single mother navigate through life as she was raising 5 kids.\n\nI have always thought highly of people who could bend the will of others in their favor. I thought that as the manipulator, you were always the smart one. You were in control. You make it a point to win. Always one step ahead of others.\n\nFor some context, I am the friend that you ask for advice when you need a logically sound solution. I give my advice based on the information given, present choices, then let you decide on your own.\n\nTonight, my wife had an episode where she cries and tells me how alone she feels. She rarely cries to me as I tend to close up emotionally only to present choices/solutions. \n\nI tend to lose my temper when I feel that I am baited to engage emotionally as I have a hard time dealing with emotions other than anger.\n\nAfter going through her search history, she has been searching for reasons as to why I have always been short tempered. And for the succeeding searches, the term emotional abuser always came up.\n\nReading through the pages, I was in shock to have read that I possess majority of the signs of an emotional abuser.\n\nThe descriptions fit me. I felt nauseated. I was tensed and felt like shit. \n\nI was overwhelmed by emotion and felt sick to my stomach. I've never wanted to be associated with any form of abuse..\n\nAs of this writing, I have already composed myself..\n\nI want to be better.. I want to change.. I want her to be happy.. I want to be the person she deserves..\n\nI know I need professional help, but given the current state of things, I am in no way able to afford therapy..\n\nIf you've finished reading up until here, thank you very much. Hoping to read your feedback.\n\nEDIT: additional context\n\nI have read all the comments. The support is overwhelming. Thank you. \n\nAs I've said, I do not typically snoop around. I have already told my wife that I read her recent search history as I was at a loss on why she was crying and was also losing her temper. I wanted to understand where she was coming from. She knows about the thread and will join me to read the comments later.\n\nAdditional context:\n\nWe have barely talked openly for the past few months. \n\nI found out I was capable of effective manipulation during my college years. Knowing I could get my way by being manipulative helped and gave me advantages. \n\nBeing the product of a manipulative family (which I honestly thought was just being more intelligent than others) I always knew when people were manipulators. I have always thought that if people were to try and manipulate me, it was a knock on my intelligence. \n\nHaving grown up in my family (sales people) these traits were passively passed on to me. It became part of my nature. It was my norm.\n\nWhen I met my wife, I wanted to spare her from being manipulated by me. I consciously made the decision to stop myself from manipulating her. Unlike my experiences, I wanted her to have the freedom of choice, free from emoitional manipulation. \n\nAnd finding out that she feels emotionally abused, I know I failed.\n\nGrowing up in a family where serial womanizing and physical abuse was a norm, I knew those were the things I never wanted to be a part of.\n\nFinding out that I was an abuser came as a shock and made me sick to my stomach as I swore to myself that I would neither be a deadbeat father nor an abuser.\n\nI was not aware that most of my coping mechanisms: trying to be too logical, losing temper easily, or most of the shit that I thought was normal was already emotionally abusive. \n\nI believe that I also have Narcissistic tendencies, talking too much when I should have just shut my mouth and listened.\n\nBetween the two of us, I knew I was the one that had stress and anger management issues. When she also started to lose her shit on small things, I knew something was wrong; she has always been the person who is calm and collected.\n\nUnfortunately, she had already locked me out in fear of me lashing out on her (which I found out was from me being emotionally abusive) which is a problem as I wanted to help fix whatever was causing her stress.\n\nI feel that this pandemic has caused so much stress ontop of all the pent up emotions she had with me.\n\nIt sucks to know that I am part of her problem, but knowing now that I am the problem because I have a coping problem is better than being oblivious and going about my \"normal\" ways.\n\nNow I know I have something I know I must fix.\n\nAgain, thank you very much for all your insights.\n\nTL;DR\n\nI found out I am an emotional abuser, now looking to fix myself for the sake of my family.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/", "title": "I recently found out that I am an emotional abuser, how can I change for my wife and kids?", "social_network": "reddit", "user": "ChodeBrad", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2013, "down_vote": 0, "creation": 1597370335, "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/", "nsfw": false, "first_save": 1635435161.3630445, "replies_charged": false}