{"id": "t5_2tand_t3_cbceto", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Hello r/DecidingToBeBetter\\- I am new to this community, but admire much of what I've seen posted and would also like to become involved.\n\n&#x200B;\n\nI hit a bit of a dead end this year: I thought for some odd reason that I had escaped the awful genetic luck of my family by the time I reached college, but of course it's not gonna work out like that. The past year and a half have been plagued by an awful and new social anxiety- an irrational and intense one which has left me at some points isolated from friends, housebound doing fucking nothing, and really without new and exciting activities which would probably help brighten my days. That hasn't been fun. Then, my dad died- my best friend in the fucking world died out of nowhere at the start of December, to which I had no preparation or even chance to 'say goodbye'. That fucking hurt, a whole lot. \n\n&#x200B;\n\nSince then, my life has been full of complacency, constant dread, anxiety, lack of motivation, and even the basic energy to show my friends that I care. It's been crippling... I haven't really treated my family well, but considering my dad and I were closer than anyone else in my family, it has been hard to open up to anyone, keep in touch, etc.\n\n&#x200B;\n\nThings must change. I want to be a more extraverted guy, like I have been and always thought of myself. I want to meet new people, since I really am a happier person being around people that I love, but anxiety has prevented me from doing that recently. I just started therapy with a really nice guy in Chapel Hill, so hopefully that and maybe a new prescription routine will help me move things in the right direction? I just really want to get more of life than I have been the past few months, and really hope that I can find support/friends here in this community which may have similar stories to tell or even advice. Please feel free to hit me up and chat! I look forward to the journey to come, where I will hopefully be happier and more considerate of the people who matter...thanks yo!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cbceto/in_need_of_friendsa_long_journey_ahead/", "title": "In Need of Friends...A Long Journey Ahead!", "social_network": "reddit", "user": "wonderfell", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1562735480, "permalink": "/r/DecidingToBeBetter/comments/cbceto/in_need_of_friendsa_long_journey_ahead/", "nsfw": false, "first_save": 1635436084.5136487, "replies_charged": false}