{"id": "t5_2tand_t3_qelzck", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "b69cf201-6737-4217-b486-9096135546b8"], "text": "Hey Reddit how is it going? The grammar may be a bit sloppy but bare with me I’m working with a lot. I’m in a spot where I really need some advice and an honest reply would be appreciated. So I want to quit my job and work to become a stock trader in the future but it’s a bit more complicated than that.\n\nBackground info:\nI got a job a little over a month ago as an electrician apprentice thru an electrical union. This job is difficult to get into and most people wait two years or more to get in so I already know if I decide to quit then I won’t be able to get my job back, ever! The job has full benefits and pays alright and only pays more the further along I get. \n\nI start apprentice classes in January (important later on)!\n\nI started trading in the stock market about year ago and I really enjoyed the thrill and the hunt for micro pieces of information that can effect the market drastically.  I took a fairly large hit a few months back and after that I have been working tirelessly studying and taking online classes and learning everything I can. This past week I’ve been getting very little sleep because of this and it has been affecting my work. \nI can’t sleep right now because I’m still thinking about new strategies on how to make money, I’m hooked. \n\nCurrent problems: \nYou see I’m facing two problems right now. The first one is that I don’t have enough money saved up to make a living off of trading in the market, also I’m not good enough to feel comfortable doing that. So that would leave me to the same decision. Keep my current job and save money while working at it until I can hit a point that I would feel comfortable with having trading my only source of income. I mean that’s the logical decision, I would be happy doing this except….. \n\nMy apprentice school costs a decent chunk of change, but only if I am to quit. If I stay employed then i will have no cost. The math for this is as follows: \n3 year apprenticeship\n$40,000 in total, approx 13k a year \n10% of this cost is eliminated for every year employed after schooling is over. \n!! I start schooling on January!!!! \nSo I need to make this decision quickly because if I decide to go for it in two years I’m 30k ish in debt.\n\nSo that would leave me stuck in this job for 13 years, while this is a great job and I do enjoy working. I have a desire for the market. \n\nI live in a very blue collar family so if I were to quit my job I would have no support from them. Everyone I have to talk to on this would tell me that “stock trading is risky”, “that seems like a terrible decision to me” or “your really going to throw this great job away like that”.  \nI live with my girl and her family when I told her how I felt “ehh stock trading is risky, I think you should stick with what you have”. I haven’t told her family that I want to do this but I would receive no positive responses from this I’m certain.  Btw I told her plan b.\n\nOptions(not in and specific order):\nA. Keep my current job and work on market in my free time\nB. Quit this job and find something less permanent while working towards my goals\nC. Go all in towards studying and work with what I have", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qelzck/a_little_advice_on_one_of_my_biggest_decisions/", "title": "A little advice on one of my biggest decisions would be appreciated", "social_network": "reddit", "user": "Due_Attorney6603", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1635054385, "permalink": "/r/DecidingToBeBetter/comments/qelzck/a_little_advice_on_one_of_my_biggest_decisions/", "nsfw": false, "first_save": 1635435989.5837867, "replies_charged": false}