{"id": "t5_2tand_t3_q98cyk", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "So by all metrics I'm doing okay so far. Externally at least. And I'm most likely going to do an MBA next fall in the US (giving interviews now). \n\nSome context: I've been struggling for a bit with self control and emotional regulation. My relationship of 5 years just ended in what was a 3 year long breakup. And it has really done a number on me. I've struggled at work, and even though I've managed to pull through enough, it has been too much of a struggle. I've recently been diagnosed with ADHD, but I've researched that it's overdiagnosed and don't want to resort to medication without trying other non clinical coping methods\n\nI keep wondering, is this for me? Should I do something else? Do I even want an MBA? \n\nI am a singer and I taught myself to play the guitar. I'm decent for playing at parties and so on but have to learn a lot to be able to be professional. I also taught myself basic piano and am trying to learn some production so that I can write and produce my own tracks. In the recent past I havent been able to do any of that. \n\nIf I do my MBA, I'll be in debt for a good few years and lose my 20s. If I get a good MBA I don't know if i have the balls to leave it and pursue music especially since I don't know if it's my ADHD triggering it or if I'll sustain even when things get hard. \n\nOne option is paying off my debt, having the MBA and then take a break to pursue some music in a few years (4 years or so) but it seems too drawn out.  Also I have no clue how i would go about it either! I feel like there's a lot I need to learn and a lot of time I need to put into practice than I currently have. \n\nWhat do I do... any advise or help would be greatly appreciated", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q98cyk/i_am_25_and_im_about_to_do_mba_but_i_want_to_do/", "title": "I am 25 and I'm about to do MBA, but I want to do music", "social_network": "reddit", "user": "Dense_Willow_3322", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1634374891, "permalink": "/r/DecidingToBeBetter/comments/q98cyk/i_am_25_and_im_about_to_do_mba_but_i_want_to_do/", "nsfw": false, "first_save": 1635438184.4905787, "replies_charged": false}