{"id": "t5_2tand_t3_pwecwq", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "By the age of around 11 or 12 I began to be unhappy. I was not happy in school and I had no understanding of an outlet for how I was feeling. I had no concept of how to regulate my emotions, how to channel my energy, how to calm my mind. I intuitively knew that I felt good when I ate food. It wasn’t about hunger or needing more energy, it was about feeling good.\n\nFirstly, I got a kind of mellow high feeling, a feeling of comfort, or warmth and in some ways happiness. I guess subconsciously that when I was eating I was safe and this is what I needed as my world felt very unstable, insecure and anxious.\n\nI’m from a middle eastern background where food plays a central role in family life. Meal times were always a big deal and food was always prepared with love and care. There was also the ideas, usually placed on males, that eating lots is good as we are ‘growing boys’ and ideas like ‘the way to a mans heart is through his stomach’ so I also felt that by eating lots I was being rewarded.\n\nMy mother is also a very good cook and put a lot of love into the food she makes. When I became isolated from myself in my early teens and began to experience anxiety and depression, I subconsciously held the idea that the more I ate, the more love I was consuming. And since my waking reality was one of despair, food was one of the few ways that I felt love.\n\nOnce I got a bit older and was able to begin making my own food choices, that’s when the problems really started to escalate, as well as my weight dramatically increased.\n\nI could now get my hands on ultra processed junk food like pizza, fried chicken, instant noodles, fast food chains\n\nThese foods were like going from weed to cocaine. The high I felt, the buzz I got was more intense but as we all know, this only lasted a little while.\n\nI was also becoming more and more aware of my weight, feeling very uncomfortable in my own body and incredibly self conscious around people. \n\nThis heightened state of shame and anxiety make me constantly think about my weight, but also continue to seek comfort in the food I was consuming. So I would get home from school and eat several packets of ramen noodles or something similar that would give me a quick feeling of warmth.\n\nBy this point I was emotionally addicted to food. This means that I was using food in order to cope with how I was feeling and I would enter into these cycles of consumption and shame.\n\nIt was very similar to the experiences of porn addiction. The desire to watch porn, the seeking out and finding the right clip, the climax and then the feeling of emptiness and shame.\n\nWith food it looked like this, the thought of, I could order a Dominoes. The ordering process, choosing the pizza, stuff crust, large, lots of toppings etc. The anticipation of waiting for it to arrive, the high of the doorbell going, eating the first few pieces. Then going almost into a blackout like an alcoholic and feeling quite numb as I ate piece after piece until the whole thing had been finished.\n\nAs soon as this had happened I would feel disgust, shame and guilt. I would want to get rid of the pizza box as soon as I’d finished, most times still chewing food and I went and threw the box in the bin.\n\n\\-\n\nAt my heaviest I was 115 kilos, at the moment I weigh around 80 kilos, so I was carrying more than a third of my body weight extra.\n\n\\-\n\nThis is the difficult part, where people want advice on how they can lose weight, or get out of similar cycles\n\nIt is not that simple because everyone is very different.\n\nHowever, the thing that we all share is that we use things, in this case food, to feel good about ourselves, to escape a reality that we are not happy with.\n\nHow we deal with this is to address what it is in our realities, in our past experiences, that we haven’t processed, that we haven't learned to cope with. We do this through meditation, journaling, and therapy. Address the root cause of these problems and the rest will sort itself out.\n\nI had tried diets and eating healthy loads of times before and it never worked because I was always addressing the symptoms and never the cause. The cause is the unprocessed experience, the weight is just a byproduct of that. When I started to understand myself, process my experiences and begin to love myself then the weight loss was just a side effect and it has never come back.\n\nSure, I still eat unhealthy foods from time to time, but this is because I enjoy it rather than using it to feel happy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pwecwq/why_i_was_fat_how_i_dealt_with_my_unprocessed/", "title": "Why I was FAT - How I dealt with my unprocessed emotions through food and how I changed that.", "social_network": "reddit", "user": "yusefsanei", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 485, "down_vote": 0, "creation": 1632739129, "permalink": "/r/DecidingToBeBetter/comments/pwecwq/why_i_was_fat_how_i_dealt_with_my_unprocessed/", "nsfw": false, "first_save": 1635435767.2877753, "replies_charged": false}