{"id": "t5_2tand_t3_m5tlk6", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I'm 20 years old and every time I hang out with these people in person things never feel like they click.\n\nI realized a little over a year ago without those 3 things this \"friend group\" would be nothing. \n\nI spend most of my time on discord with them because I don't know what else to do after work and it's so easy to get on and have time go by, only to regret later for wasting my time.\n\nI think I am starting to slowly resent them and nitpick the things I don't like -- which isn't good.\n\nI'm also fairly different from them, I consider myself to be a very social guy, very fit, likes going out etc pretty much actually DOING things instead of sitting at home high on the computer. Whenever I bring something up about bettering ourselves or starting a business, trying to be better or even flat out going out/getting out of the house I get shutdown and told to \"stop talking about that hippie shit\" or they say something like \"why would I want to go out when I'd much rather be here playing league\".\n\nthey are very judgmental people towards others not in the group (behind their back) while I am not, (ironically I am judging them in this post) and when I talk to my coworkers I feel more natural than when I talk to them. The vibe just feels \"lower\" around my friends so I am not as social among them since I don't feel as if I have much to say. \n\nthroughout high school out of 10 guys maybe 2 or 3 would want to go to a party when they happened (which didn't happen often in my town) and the rest would rather be home on the computer...\n\nThey were talking about my other friend (who has moved away) how he's really disciplined (who i consider my best friend that I really respect) and they said \"You think I can change what I do on day to day?\" \"I can't change that, I wake up and do what I usually do\" and they all laughed. I didn't think it was funny at all because that's literally the one thing you can change...\n\nI don't understand why they are like that I really don't. Why would someone want to stay in the same spot year after year? Do you not see the years slipping by already?\n\nUnfortunately I don't have my license yet (working on it) so it's really hard for me to do much on my own (no public transit except for our local sketchy cab) or make new friends because I don't want to depend on someone always picking me up when it seems... unfair? And fairly lame like I am an adult man I should have a license -- bare minimum.\n\nI've been thinking about dropping these friends and going solo but im not sure... what do you guys think? To me it seems they are very weak willed people and I don't think its very beneficial for me to be around them anymore.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m5tlk6/my_friend_group_is_centred_around_weed_video/", "title": "My friend group is centred around weed, video games, and anime", "social_network": "reddit", "user": "BigPPSmallDreams", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1615838866, "permalink": "/r/DecidingToBeBetter/comments/m5tlk6/my_friend_group_is_centred_around_weed_video/", "nsfw": false, "first_save": 1635435456.58549, "replies_charged": false}