{"id": "t5_2tand_t3_no76cg", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "Today I ended up in a situation where my immediate neighbours giant German shepherd tried to maul another neighbours tiny white fluff ball. \nMyself and my partner heard the screaming while out in the yard and ran over to help, with my partner running in blindly and me following behind trying to see what was happening. \n\nUnfortunately, the way it played out was this: \nAs my partner is focused on giant German shepherd trying to hit it with her bag, lady owner of tiny white dog is swearing her head off at my partner and male owner is screaming at her too, thinking the German shepherd was ours. Immediately, I lost control at the sight of two grown people swearing and abusing my partner and called them out on it. I yelled at them for swearing at her and aggressively said that we were trying to help. Male dog owner got right in my face and continued screaming and yelling at me, so my reaction was to push him away and tell him not to speak to my partner like that.  \n\nAnother neighbour got between us (after German shepherd had run off) while we argued and it got a little physical. He tried kicking me, I pushed him away as he was in my face screaming. \nNow, I’m 26 and strong, and he’s potentially mid 50s and quite skinny. If it escalated, it would not have ended well for him physically, and it would not have ended well for me and my future. \n\nI understand that this is a highly charged situation and people tend to act irrationally. On both our parts, it wasn’t handled well. I hate that it resulted in physical push and shove and I’m so grateful it did not escalate. \n\nI have always been ready to get involved in confrontation if I don’t feel something is justified, but this could be detrimental to my career. I have just accepted an offer in my dream career as a paramedic. After working so hard, I finally made it and I would hate for my job to be taken away because I couldn’t control myself. \nI am fully aware that I will frequently find myself in situations like this during my career. So I’m asking for any advice or help I can get on how to manage charged and stressful situations like this. \nTia", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/no76cg/need_to_maintain_control_so_i_dont_lose_my_dream/", "title": "Need to maintain control so I don’t lose my dream career", "social_network": "reddit", "user": "11snake_eyes11", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1622365177, "permalink": "/r/DecidingToBeBetter/comments/no76cg/need_to_maintain_control_so_i_dont_lose_my_dream/", "nsfw": false, "first_save": 1635435790.9260423, "replies_charged": false}