{"id": "t5_2tand_t3_pciblc", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "Today, my mom and I had a really deep conversation about life when I was growing up. We had a relatively rough time growing up; mom was in an abusive marriage which ended in a divorce, grew up with money troubles, etc.  \n\n\nMy mom at the time was busy with work and keeping food on the table as a single mom that she never really had time to enjoy being a mom.  \n\n\nI remember I would come home and wanna share something cool that happened that day, but my mom was so stressed from work that she would be doing other things while I tried to get her attention. Even though she was just trying to put food on the table, my child brain processed it as her disinterested in my achievements.  \n\n\nI never knew how to verbalize how that felt until now.  \n\n\nWe ended up untangling that whole trauma a little bit, hugged it out, and cried it out.  \n\n\nIt felt good.  \n\n\nI told her how I was frustrated that I basically had to be clean-up crew from my past traumas by dealing with all these weird after effects of a slightly traumatic childhood since trauma doesn't heal overnight, but she assured me that I had time because I was still young.   \n\n\nShe was right.  \n\n\nThere are people I know that are too old into their lives to remedy past traumas and issues they have accumulated over time. All those relationships they could have recovered, those personal struggles they could have healed, they're unable to make that a reality because how late they are in life.  \n\n\nSo, with the gift of youth, I get to have that opportunity to fix a lot of issues that I had gained from my childhood.  \n\n\nI'm really glad that my relationship with my mom lasted long enough for us to have that moment. I will remember that forever.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pciblc/just_had_a_really_deep_talk_with_my_mom/", "title": "Just had a really deep talk with my mom.", "social_network": "reddit", "user": "angrykumu", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1630048122, "permalink": "/r/DecidingToBeBetter/comments/pciblc/just_had_a_really_deep_talk_with_my_mom/", "nsfw": false, "first_save": 1635436832.359668, "replies_charged": false}