{"id": "t5_2tand_t3_jh1mjs", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Last week, I took the proper steps to report multiple OSHA violations at one of my job sites. The conditions are life-threatening and I had to make a choice between speaking up or keeping my head down and being complicit in an accident just waiting to happen.  \n\nThis next week is booked with meetings between myself,  HR, and management.  I've already been told that they will \"take the matter very seriously, \" but also \"try to understand what is an actual issue and what was a misunderstanding. \" If you have a background in corporate side-speak, you'll understand that this is code for 'we're going to make you look as crazy as possible and find an excuse to fire you that won't land us in court.' \n\nI knew this would happen and I am prepared to face it... but it still sucks. However,  their records will now show that the violations were reported and if they choose not to correct them, both OSHA and the victim(s) can cause them a world of hurt. \n\nDoing the right thing is rarely the easiest path and more often than not, you are not thanked for your efforts.  I am grateful that I am in a privileged position where I can afford to be blacklisted. Many people cannot and, due to need, continue to work in illegally hazardous situations. \n\nI just hope that I can meet the coming situation with professionalism, bravery, and dignity. It's not going to be easy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jh1mjs/reporting_hazardous_osha_violations_even_though_i/", "title": "Reporting hazardous OSHA violations even though I know that I will lose my job", "social_network": "reddit", "user": "thisusrnmisalrdytkn", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 341, "down_vote": 0, "creation": 1603508823, "permalink": "/r/DecidingToBeBetter/comments/jh1mjs/reporting_hazardous_osha_violations_even_though_i/", "nsfw": false, "first_save": 1635437846.7608688, "replies_charged": false}