{"id": "t5_2tand_t3_preg15", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Hey y'all!\n\nI have struggled with extreme anxiety, depression, and OCD for three or four years now (as well as a more recently-diagnosed illness-POTS- that affects my everyday life)... I have started to make small changes (running/climbing 5x a week, turning to creative outlets instead of harmful ones, I am about to FINALLY go to therapy and work on my extreme sensitivity/people pleasing issues, etc.), but I still feel low all the time; I never feel like I'm even close to \"having it together\". All my friends are stunning, they cheer, they have the cutest clothes, they take care of themselves and have rituals and set aside time to do so- scented candles, comfy pj's, whatever else. I'm lucky to have incredible people in my life, but I always feel like the odd one out.\n\nI'm past the point of feeling sorry for myself and instead am trying to take active steps to get better. I think the one overarching thing that's missing from my life (and has been my entire life) is that I have no concept of how to care for myself. My ADHD makes it difficult- I CANNOT for the life of me, no matter how hard I try, keep my room clean, remember to shave my legs, make my bed, do laundry, meditate, journal, etc.... but despite that, I think I just feel overwhelmed on where to start. I think a lot of my feeling out-of-place with friends and feeling sorry for myself stems from zero self-care.\n\nI am a senior in high school, about to go to college, and I really want to have the whole self-care thing down before I'm on my own in order to avoid slipping back into old habits. Can anyone give me some tips/share their own self-care things they do? I need a solid, tangible plan to stick to so I don't get overwhelmed. How can I set aside time to help/take care of myself? Thanks in advance!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/preg15/selfcare_tips/", "title": "Self-care tips?", "social_network": "reddit", "user": "jbc11386", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1632079045, "permalink": "/r/DecidingToBeBetter/comments/preg15/selfcare_tips/", "nsfw": false, "first_save": 1635435084.8587685, "replies_charged": false}