{"id": "t5_2tand_t3_et3mig", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "**The reason I’m writing this post is, because throughout this journey, I’ve read a few reddit posts that have inspired me and I wanted to return the favor. If this helps out just one person then it would have been worth it.** *TL;DR at bottom*\n\n#Some context:\n\nI was always a shy guy. All throughout my childhood and school years, I never had the courage to initiate relationships with friends, much less ask a girl out; mostly due to my weight and how I saw myself. I was obese for a huge part of my life and always considered myself unattractive. \n\nI went to college right after high school, at 18, and I put on more weight (freshman 15 and all that). I dropped out of college at the age of 20. I felt like a failure, and I ate away my guilt, putting on even more weight. \n\nI was at the lowest point in my life. I was the heaviest I’d ever been, I was a college dropout with no job, living with my parents, no goals, no friends. Looking back, a lot of it is a blur and if it weren’t for video games who knows what I’d have done. \n\nAll I remember is my cousin having a quinceañera coming up, so my brother and I decided we’d lose a couple pounds in time for the party. Flash forward two weeks, we weighed ourselves and we had lost around 10 lbs. **My weight loss is a whole journey on its own, but this isn’t r/loseit . I just thought it was important to highlight the moment my life turned around.**\n\n**Flash forward 2 years** \n\nI’m down a bunch of weight, I got a job, I got braces to fix my teeth, I reconnected with old friends,  I took more pride in my appearance, I started dressing nicer, I got into skincare, I did some proper grooming. I know a lot of it seems superficial, but it was all about helping me to feel more confident. And I did. I felt more attractive, I felt more confident than I ever had, but I still couldn’t manage the courage to approach women and ask them out or start a conversation. \n\n*What followed was the hardest, most important part yet,  and it’s where I experienced the most growth*\n\nI eventually found the podcast **Shrink for the Shy Guy** and I started listening to it on the drive to and from work, on my free time at work, on trips to the store. I listened to it a lot. At the end of every episode there’s some sort of action step that’s meant to help you work on your fears and insecurities or with things that are outside your comfort zone. Little by little, I was breaking down the anxiety barrier. \n\n**However, the approach to overcoming social anxiety and shyness that stood out to me the most was from one of you, here on reddit.** I can’t remember if it was a post or in the comments of a post, but I remember someone mentioned a strategy to overcoming the fear of going out and socializing. Basically, it was saying “yes” to any and every opportunity you had to go out and socialize. They went into much further detail, but I don’t remember the specifics.\n\nI used to hate going out, not that I didn’t want to, it was just easier not to; anywhere from going to the store for errands, to going out to a party or to any type of social gathering. And so I wouldn’t go out anywhere unless I really had to. This had already caused me to miss out on so much, and I didn’t want to continue living that way. \n\nSo I started saying “yes” to any and every chance I had to go out and socialize. Eventually, I had the opportunity to go out on my first date **ever**. Yes, I was 23 and hadn’t ever gone out on a date. Now, this was peak anxiety for me. A one-on-one with a girl for dinner where all we could do was talk. I almost didn’t follow through, but I **had to say yes**. That date was a bust, but at the end of that night, I felt like I could accomplish anything. \n\nTaking that huge step forward made everything that followed much easier. A company dinner came up  that I normally wouldn’t ever go to, but I was invited and **I had to say yes**. My friends invited me out to bowling, which I’d never done before and was afraid of making a fool of myself, but **I had to say yes**. Both amazing experiences that I’m glad I went to. \n\n*Eventually, everything I had been working on would be worth it.*\n\nI came across an old crush from my middle school and high school days. She was still as beautiful as I remembered. She hadn’t noticed me, but I had noticed her. She was getting ready to leave. I was always a bit intimidated by her, but in those last few seconds, I talked myself into approaching her.\n\nI walked her to her car and we stood there for a while catching up. She gave me her number and we texted non-stop for a week. She invited me out to a party, and I almost said no. I had never been alone to a party before, with people I wasn’t very familiar with, with alcohol. But why change what had been working for me so far. So **I said yes.**. \n\nIt was an amazing night. I won’t ever forget that night. I couldn’t think of anyone more perfect to have my first kiss with. We’ve been on a few dates since and it’s been great seeing her every time. \n\n\n#*This isn’t a **how to overcome social anxiety and shyness** story, it’s not a **how to better yourself** story. It’s just my personal experience that I wanted to share. If anyone can take any inspiration from it, then fuck yeah. I’m just the happiest I’ve been in a long time and I wanted to share that.*\n\n**TL;DR:** Shy as shit at a young age all the way up until my 20s, mostly because of my weight. Decided I hated living that way and worked on my physical and mental health. I was at the point where I was confident enough to approach an old crush at a random encounter and she gave me my first kiss ever at the age of 23.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/et3mig/i_had_my_first_kiss_at_23_years_old_after/", "title": "I had my first kiss at 23 years old after deciding to be better the past two-and-a-half years.", "social_network": "reddit", "user": "immerjoachin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1233, "down_vote": 0, "creation": 1579831821, "permalink": "/r/DecidingToBeBetter/comments/et3mig/i_had_my_first_kiss_at_23_years_old_after/", "nsfw": false, "first_save": 1635436511.1272585, "replies_charged": false}