{"id": "t5_2tand_t3_mk5a47", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "There's something I've learned over the past few years as I've struggled with depression that I think is extremely valuable and important to acknowledge. It's the kind of thing you hear all the time growing up, but often don't allow to really permeate your psyche and gain a foothold in understanding.\n\n**We cannot control our feelings.** As much as we want to, as desperate as we are, it's not something we can do. There's freedom in admitting and understanding this. As anyone who's struggled with depression will tell you, you can go around and around and around in circles, intellectualising why you shouldn't feel a certain way, why you shouldn't feel so sad or despondent, *forever*. For hours on end. It won't change how you feel. \n\nThe same way you can't control, can't intellectualise who you're attracted to. It's not a cerebral thing. Not a puzzle you can think your way out of.\n\nThis may sound like a negative, but as I said above, there's freedom in this. Understanding that we can't control our feelings frees us up to work on what **we can control:** \n\n1.) **How we react to our feelings.** We may not be able to control the feelings themselves, but what we can choose is how we respond to those feelings. Take anger for example. Anger comes up for you in this moment. Now imagine the difference between using a meditative technique like Noting and simply acknowledging the presence of the anger, and sitting with it, and allowing it to control you. To give into it and punch a wall, or lash out at someone close to you, or harm yourself.\n\n**We are not our feelings**. Because we can't control them. Shift your mindset to thinking of feelings as something that happen **to us.** How we respond to them? That's our choice. That's free will.\n\n2.) **The situations that tend to engender certain feelings for us.** Notice when certain negative and positive emotions come up in your life. Do dinner parties make you joyful? Do they make you terribly anxious? Does sitting in the sun for 30 minutes in the morning, or exercising before work, make you feel full and alive? Calmer for the rest of the day? Are there people in your life who cause you great distress? \n\nNotice these things and begin shaping your routines to maximize the chances of the arrival of positive emotions and diminish the chances of negative emotions.\n\n&#x200B;\n\n*Acknowledging that we cannot control our emotions, and that we are not our emotions, can grant us the freedom to develop a healthier relationship with them, and take greater control of our own well-being.*\n\nRock on ya'll.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mk5a47/understanding_your_feelings/", "title": "Understanding Your Feelings", "social_network": "reddit", "user": "Consider-TheLobster", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1617571604, "permalink": "/r/DecidingToBeBetter/comments/mk5a47/understanding_your_feelings/", "nsfw": false, "first_save": 1635436999.4747903, "replies_charged": false}