{"id": "t5_2tand_t3_mkd74t", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "802203c7-ca80-4c23-ad08-f571694cfc55", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "\\[21\\] \n\nOur life changed in 2020. For me, I was lost and heartbroken. When Zoom university started, I was living with an unhealthy routine. I didn't realize it then. I was dating someone who I thought I was going serious with for the first time. They were everything I wanted (or so I thought). I didn't give a crap about my studies, mental health nor other relationships. The pleasure and adrenaline of dating someone was all I thought about. It was all I looked forward for because it was different in my boring life. It was until one day I woke up and realized the situation I was in. I argued with my parents. I haven't seen my friends for the entire semester. I did not feel like 'me'. \n\nSo, I decided- 2021 would be the year for 'me'.\n\nWe broke up (mutually). I signed up for therapy. I opened up to my friends. I focused in school. I tried to be nicer to my parents. I tried to focus on myself. I've always have imagine this ideal version of me and I thought it was about time to finally work on going to that direction. \n\nSo here's what I did (or what I'm doing, the baby steps);\n\n* I always make my bed, drink water, open blinds/window first thing in the morning. \n* I downloaded Cold Turkey. Blocked every distracting websites when my online classes start. \n* I lessen the time I listen to music. I felt like I was using it too much, to the point I can't function without it. So when I'm studying, it's in silence.\n* I haven't watched porn/masturbated in a week (and counting). Never again. \n* Taking walks three times a week (after my MWF classes, to relax my mind). \n* I'm trying to swear less. (Already failed Day 1 but we're still going to keep trying, one swear word = 1 minute planking)\n* I always clean up after myself and stick to a cleaning routine. No more leaving plates in the sink. No more clothes pile. My room is always clean and organized. \n* I read before I go to bed instead of browsing on my phone. (Currently reading Atomic Habits by James Clear)\n* I'm still working on a consistent sleep schedule (this is probably the hardest one in this list for me).\n* A white board for to do list, reminders and day counters (for swearing, nofap, productivity)\n* I make sure I brush my teeth at least twice, floss and shower everyday. Also, skin care routine!\n* I try to look good and smell good even though I stay at home most of the time because when I do, I feel good.\n* No hoarding and no unnecessary purchase. Spend your money for healthy (and legal) things that makes you happy. Save some too for future use. (Just be smart with money)\n* Spend less time in social media. I muted all the notifications. My friends know that if they really need to talk to me, they'll text me. \n\n&#x200B;\n\nHere's what I need to work on more:\n\n* Complain less. Be more grateful. \n* Journal. \n* Just be me. Be more comfortable with myself. \n* Confront what you need to confront. Basically my fears, anxiety, parents and other people (or at least my memories and thoughts of other people). \n* Be more honest and kind with myself.\n* Forgive myself and others. Forgetting is hard so instead I'll learn.\n* Take more pictures of my love ones. Again, be more grateful. Show more love and give more warmth.\n* Stay focus on my goals.\n* Cook more.\n\nHere's what I want to do:\n\n* Learn ukelele or the violin. (Already have an ukelele :D)\n* Skate. \n* Wear what makes me feel good. (Already on it but need to do more)\n* Dye my hair.\n* Get more ear piercings.\n* Be more active.\n* Learn more. \n\nThis is all for self-love. It might not make sense to some but it's been difficult. I felt like I haven't been living for myself. There's always some restriction that stopped me for doing so. I've always been jealous or envious of my friends or other people. I'm just so tired of doing that. So tired of feeling not enough, being behind or being pathetic. So cheers, 2021- here's to us.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mkd74t/2021_progress_projects_and_inner_peace/", "title": "2021: Progress, Projects, and Inner Peace.", "social_network": "reddit", "user": "throwaway_122919", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1617599238, "permalink": "/r/DecidingToBeBetter/comments/mkd74t/2021_progress_projects_and_inner_peace/", "nsfw": false, "first_save": 1635435902.2402437, "replies_charged": false}