{"id": "t5_2tand_t3_h91kfb", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I used to be very fixated on judgements of certain things. For example, pizza or Oreos or drinking = bad for me. And any time I ate the bad thing or drank, it came with a sense of guilt. Then, I would self-sabotage and go overboard. It was a very interesting cycle of self fulfilling prophecies that never worked in my favor. \n\nI know where this is rooted. I grew up in a very judgmental household. I was on a diet at the age of 8. My mom struggled with her weight her entire life too and didn’t allow “bad” foods in the house. But for celebrations of things, we’d literally binge. She has also been sober my entire life (as were both my dads) and any time I drank it came with a threat that I better watch out or I’ll become an alcoholic. \n\nI learned that certain things were bad and others were good. But I know now it’s not that black and white. I know about balance. I know that just because I eat pizza I’m not going to get fat, and I can drink a glass of wine without feeling guilt and shame that I used to. \n\nSince shifting my beliefs about certain things, and understanding that judgements are relative - my life has completely transformed. I don’t crave “bad” things because there are no bad things. I wasn’t allowed or was told that i shouldn’t do something and it made me want to SO badly. Being told I can’t automatically meant I must. \n\nNow that I allow myself to do whatever I want, I’m actually much healthier. I eat healthier and I work out nearly every day. I eat pizza (had some this weekend) but instead of eating 4 slices I’ll eat 1 or 2. \n\nI now make decisions based on how I feel. Do I feel good drinking nearly everyday? No. I feel groggy and I can’t wake up and I don’t have energy to do the things that feel good. I don’t really drink anymore and if I do it’s 1-2 max on a weekend. Do I feel good eating greasy food everyday? No. My skin flares up, I’m bloated, and again have 0 energy. \n\nUnderstanding that I can do whatever I want makes things so much better. I don’t judge any one item because they’re not inherently good or bad, but some make me feel better than others. Other people are also different so they might feel good from certain things that make me feel bad. Who am I to judge what someone else does, it’s none of my business. \n\nFocusing on how things make me feel, whether it’s food, drinks, activities, people, etc, has been extremely helpful in navigating a healthier life for me. I take inventory often- how does this make me feel? Does it energize me or drain me?  \n\nThought I’d share because my life has been shifting so much recently and I know a big reason is releasing judgment on things and allowing myself to do whatever I want, but also being mindful of how what I buy, eat, do, say or think, affects my energy and continuously making decisions based on that. It’s been really beautiful to watch everything unfold in the way it has been and I want to share for anyone who may be struggling with energy or taking inspired action that they want to. \n\nHope you all are having a great day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/h91kfb/making_decisions_based_on_energy_has_helped_me_so/", "title": "Making decisions based on energy has helped me so much.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 37, "down_vote": 0, "creation": 1592168144, "permalink": "/r/DecidingToBeBetter/comments/h91kfb/making_decisions_based_on_energy_has_helped_me_so/", "nsfw": false, "first_save": 1635436517.9530954, "replies_charged": false}