{"id": "t5_2tand_t3_pie77l", "request": ["b69cf201-6737-4217-b486-9096135546b8", "18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "Hello\n\nI'm an Indonesian male who just turned 29 this year and this feeling has been bugging me since 2020 began, when I turned 28.\n\nTo start off, I was raised by my parents to have a strict, study only lifestyle, and in my entire educational life, I've hardly failed a subject, always had good grades and eventually, when I turned 17 was able to make it in the National University of Singapore, where I studied Computer Engineering, and thankfully, I graduated at 22.\n\nAfterwards, I flew back to Indonesia where I was able to secure a job, was able to gain significant experience, certifications, promoted twice at work, raises and all that and thankfully, I was able to earn all that throughout my life and I've been helping with the bills at home since I turned 23. Not to mention I've never smoked, been on drugs and been drunk, ever. The closest thing I had to a vice was caffeine (to keep me motivated and awake).\n\n**Except here's the kicker**, I still live at my Dad's house, where me and my bro pay for all the bills, seeing him turn 70 is really giving me serious anxiety, and also, my social ineptitude because of my obsession with work and study has made me miss out on serious relationships (I've never had one, ever) and it made me think *\"What if I turn 40 and you hit the wall? you'll be forever alone bro!\"* while I watch my old classmates get married and pop out babies. I still don't feel like getting married yet because there are lots of things I still want to do (travel, things like that), but the thought of me hitting the wall in my 30's is bugging me that a part of me is pushing me to find a wife before it's too late.\n\nI really need some advice. I had big plans before 2019 ended but thanks to the C0VID, this has been halted. It dawned on me when 2020 started that 2010 was 10 years ago and I just let life pass me by, got to busy making a living while I forgot to make a life. In a panic move, I quit cold turkey on video games, got a gym set and got in shape (Lost 60 lbs since October of last year) and added more side projects to the mix for more money.\n\n*Additional note: This is not an incel post, I am not resentful of women because they \"never wanted me\". I blame it all on myself for not taking action early.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pie77l/turned_29_this_year_and_im_having_a_quarter_life/", "title": "Turned 29 this year and I'm having a quarter life crisis.", "social_network": "reddit", "user": "UnionOfPeace", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 37, "down_vote": 0, "creation": 1630852567, "permalink": "/r/DecidingToBeBetter/comments/pie77l/turned_29_this_year_and_im_having_a_quarter_life/", "nsfw": false, "first_save": 1635436440.975343, "replies_charged": false}