{"id": "t5_2tand_t3_op0ey7", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Good day! I wanted to share some things I've learned over the past few years that have helped me to improve my interactions with people and go from RBF to what people have described as \"a people person\" - this happened pretty organically without me even realizing it, but here goes:\n\n1.\tRelax your face - this in combination with #2 was seriously 75% of the journey to becoming a more sociable person. I used to carry a lot of tension in my eyebrow/forehead area, and it took me a while to realize it. It was only when I started seeing a massage therapist that I noticed it, but it should not be hard to recognize. Focusing on relaxing the muscles in your face has the benefit of broadening your range of facial expressions and being perceived as more open to conversation. It has also helped me to fall asleep at night, as holding this tension takes effort that kept me awake. Everyone has their own method of doing this, but what helps me is focusing on far away objects and trying to move my ears back (sounds funny I know). Give it a try and see what works.\n2.\tSoften your gaze - I used to be unable to look people in the eye during conversation because it felt like I was staring daggers into their face. I didn't feel shy about doing so, it seemed more hostile than anything. My trick at first was to imagine they had one of those Magic Eye 3D pictures printed on their forehead, the ones where you have to relax your eyes and shift your focus to something further away. You can definitely overdo it, so avert your gaze periodically.\n3.\tExplore your space - If you're in a waiting room, on a bus, in work meetings etc. try to sit back, open your shoulders, use the armrests on your chair, maybe throw an arm up on something. Don't be obnoxious about it and deprive other people of seating or encroach on their space, just let people know you're there. You should do this with your voice too, watch some videos to learn how to project. It used to really bum me out when I would always get asked to repeat myself, or even worse if the person never heard me at all.\n4.\tListen to people - Everyone says this, but that's because it's true. And really listen, people are pretty fascinating most of the time.\n5.\tStart slow - making observations about the weather or the long wait in line or the price of gas may seem silly, but you have to start somewhere. Once you're comfortable initiating a conversation you'll be more open to exploring more interesting or personal topics in future interactions, or giving people compliments. After a while you'll find that you'll start engaging people (and vice-versa) without any hesitation. They say practice makes perfect, but really it only makes things a little less awkward each time.\n\nAnyhoo, that's all I have for now. I really hope this helps someone, these are things that are fairly easy to do and build up to in increments, so don't feel like you have to tackle them all at once. Have fun and be well!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/op0ey7/how_to_be_more_approachable_personal_experience/", "title": "How to be more approachable (personal experience)", "social_network": "reddit", "user": "lando55", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 43, "down_vote": 0, "creation": 1626905799, "permalink": "/r/DecidingToBeBetter/comments/op0ey7/how_to_be_more_approachable_personal_experience/", "nsfw": false, "first_save": 1635438044.5171704, "replies_charged": false}