{"id": "t5_2tand_t3_l9k23w", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I (29F) have a long history of making attempts to be physically fit and making a lot of progress and then willfully plateauing... A few years ago, I lost about 40 pounds and have maintained excellently without exerting too much effort - but I'm still clinically heavy. In the last 6 months, I've been itching to pick up where I've left off and finally meet my fitness goals. I've spent that time mulling some things over, clearing away distractions, going to therapy, and dealing with some issues (relational/love/sex addiction type stuff).\n\nI've always had a growth oriented mindset, I have all the right ideas, I can even commit to diet changes with no issues - but I still let let fear hold me back, like in a big way??? I can't even say for sure WHAT I'm afraid of, but I'm terrified?!!! My best guess is that I'm scared of looking like a fat idiot. I'm vain and I'm scared of getting ugly and looking ugly?\n\nI'm at the crucial point where I feel the ideation is coming to an end and it's now or never - it's time to DO SOMETHING. And I know it's not a race, but in my heart of hearts, I'd like to make significant progress with my weight and fitness in the next 6 months (by my 30th birthday). I'd be VERY happy if I lost 20-30 pounds. I probably \\*need\\* to lose closer to 50 in total.\n\nI picked out a gym that I'd be willing to join. They offer an insane variety of classes and times, they even have a weight room for women only. It seems so simple, however, I'm STILL anxious about it!!!!\n\nI know we all have to start somewhere, I'm never gonna get anywhere by stalling, things can only improve... \n\nAny ideas for me? What has motivated you to do something that TERRIFIES YOU?\n\n**Be tough with me (but not abusive please lol).**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l9k23w/im_almost_there_the_discomfort_of_staying_the/", "title": "I'm *almost* there: the discomfort of staying the same has finally become equal to the discomfort I feel towards making the effort to change. Looking to reddit to tip the scales discomfort in my favor...", "social_network": "reddit", "user": "nastyyynico", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1612121957, "permalink": "/r/DecidingToBeBetter/comments/l9k23w/im_almost_there_the_discomfort_of_staying_the/", "nsfw": false, "first_save": 1635436498.7476904, "replies_charged": false}