{"id": "t5_2tand_t3_9hxp0t", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "From what I can remember, I was a very friendly and empathetic child/teenager. I got attached to people easily and had a great deal of love that I wanted to share with those around me. I still want to be close to others and bond with them, but I feel like I don't have the capacity to do it anymore.\n\nI was bullied as a child because my English was poor, my father passed away when I was 5, my mother lied to me about it and didn't tell me he had passed on until after his funeral, I was bounced around from school to school due to money issues and was always the new kid/outcast, my first boyfriend cheated on me and then dumped me in a text after 3 years, the second got seriously injured and lost most of his memories (including those of me), I've been sexually assaulted, threatened and hurt by many people I've trusted.\n\nOne of my best friends overdosed on sleeping pills a few years ago. Last week would have been her birthday. Another is in rehab after almost suffering the same fate from heroin. And no, I don't hang out with junkies, he'd been clean for years and slipped.\n\nI met this one guy about a year and a half ago and it was the first time in quite a while that I was able to feel excitement and joy from another person. Our relationship fell apart due to drastic differences in our lifestyles and expectations, and I actually held a soft spot for him until I found out that he gave me an STD and lied about it when I told him.\n\nAt this point, I feel like if I care about anybody they'll either abuse me in some way or I'll lose them and suffer the grief for it, and I think my mind has shut down my ability to get attached. I feel empty and alone, and I don't know what to do.\n\nHow do I go back from here?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9hxp0t/i_feel_like_im_too_damaged_to_be_happy_again/", "title": "I feel like I'm too damaged to be happy again.", "social_network": "reddit", "user": "BubbleTee", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 46, "down_vote": 0, "creation": 1537598470, "permalink": "/r/DecidingToBeBetter/comments/9hxp0t/i_feel_like_im_too_damaged_to_be_happy_again/", "nsfw": false, "first_save": 1635438285.2678337, "replies_charged": false}