{"id": "t5_2tand_t3_bg5g10", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Let's say our body is the frame of a car. A car won't move by itself. So..\nWe need something to control our movement and speed right? \n\nThis job falls on the gearbox. It's pretty straightforward now to think of motivation, discipline and habits as a spectrum. Motivation as the first gear, discipline represents the 2nd till the 4th gear and habits is the 5th and final one.\n\nYou need motivation to get started. You go into \"overdrive\", you want to do everything today, spending a lot of time and energy researching and practicing. But you can't reasonably travel very far only using the first gear. This only leads to burn out.\n\nSo after the motivation has done it's job and you have a certain momentum and speed you need to change gears! So you need discipline! It takes the momentum built by the previous steps and establishes it in an upward trajectory. By slowly getting through the grind of discipline you gain speed and moving forward takes less and less energy. But it still takes significantly more effort than you would like. \n\nThis leads to our last step. Habit building. By switching to the 5th and final gear you have almost all the momentum you need. There is a very small increase in speed usually only if you find yourself in favorable conditions. But there is minimal effort expenditure. You just cruise on the assist given to you by your previous self.\n\n---\n\nImagine this as an explanation for a layperson that hasn't yet thought extensively about these definitions. This is the exact road most gamers take. They improve until they play the game mostly by habit. This explains perfectly why someone can play the same game for years and years and not really improve.\n\nSo there are times when you need to fallback from 5th to 4th or 3rd. And if you stop for whatever reason you need to relive the cycle, albeit shorter. Cruising by habit is not always the correct solution. - this depends of course on your goals -\n\nThoughts?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bg5g10/a_working_analogy_to_convey_the_importance_of/", "title": "A working analogy to convey the importance of motivation, discipline AND habits. Help me hash it out.", "social_network": "reddit", "user": "SwilSo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1555957248, "permalink": "/r/DecidingToBeBetter/comments/bg5g10/a_working_analogy_to_convey_the_importance_of/", "nsfw": false, "first_save": 1635436534.3122947, "replies_charged": false}