{"id": "t5_2tand_t3_ln0ife", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Not sure why but I’ve never been very open with other people about my life or my mental health. Especially with the people I’ve shared a home with for 27 years. \n\nHonestly I have so many problems it’s bad. Obsessive compulsive disorder, bullied/abused in the past, social anxiety, low to non existent self esteem, issues with sexual stuff due to being a virgin, issues with becoming independent, only ever had one job, haven’t worked since graduating college three years ago. Heavy guilt because my parents have been supporting me through all this. \n\nI have no honest dialogue with my family so I have no idea what they think is going on with me. And we’ve been in the same house in quarantine for a whole year now. Maybe they’re too busy to worry about what they’re deadbeat son is doing. Maybe they think one day I’m just going to snap out of it and become an adult. Maybe they know-just like I often suspect-that I’m doomed. Maybe it depresses them to think about their failure of a first child. I think they hide what they really feel from me because they think I’m fragile, and I am. I mean I am basically a privileged man child living in a fantasy funded by my parents. I’ve never faced the real world. Deep down they know this. I wonder if they think I’m naive enough not to realize it myself. \n\nAll this stuff goes on while we’re stuck in lockdown all year. My parents are high risk. I wonder at times if we’re just gonna go collectively insane. I mean I barely see daylight. I realized during covid how much I like to be by myself and being in a house filled with people there’s not much time to be alone. So at some point or just gradually I changed my waking hours so I could be alone while everyone’s asleep. I kind of wait until everyone’s gone to bed then I hang out by myself and get high. So end result is I end up going to sleep around 4, 5, or 6 AM. Sleep 6 or 7 hours. During the day I’ve basically take on housekeeper as my occupation. Everyone else is busy working so I have to do something, even though it gets annoying and I feel like everyone relies on me to pick everybody’s shit up now. I also exercise a lot. I’m actually really physically fit, kind of my only achievement in life I was once nearing obesity. I also look online for work that I can do remotely but that hasn’t panned out so far. So yeah this is my life as a 27 y/o man. \n\nJust had to rant and admit what my life is like i guess. Idk. But yeah I’m considering maybe talking to my family. I might not have a choice. Last year I almost broke down but I kept it together and idk how many more years I can go on like I am", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ln0ife/i_think_i_might_finally_open_up_to_my_family_and/", "title": "I think I might finally open up to my family and tell them that I’m not ok.", "social_network": "reddit", "user": "st0nervirginsunit3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 181, "down_vote": 0, "creation": 1613690805, "permalink": "/r/DecidingToBeBetter/comments/ln0ife/i_think_i_might_finally_open_up_to_my_family_and/", "nsfw": true, "first_save": 1635437844.8476164, "replies_charged": false}