{"id": "t5_2tand_t3_p5i2up", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I’ve been working on self improvement. Mostly with the idea of improving my mental health (and hopefully physical) in mind. \n\nMondays are often dreaded, and don’t get me wrong, the clock is still ticking down to work time. That said, I’ve decided to be mindful instead of anxious. \n\nThis week is working on being mindful and in the moment. I struggle with this often in my daily life. I am constantly losing things, forgetting things, ignoring others, etc. because my mind is always somewhere else, often thinking about what is coming next. Whether that’s 10 minutes or 10 months from now, it doesn’t matter. \n\nToday I started with a morning walk. I then decided to do yoga. During yoga I found my mind drifting to next Monday, my first day of college classes since I graduated with my associates 2 years ago. \n\nI stopped myself. I consciously reminded myself that I am doing yoga right now, this is not next Monday. This is now. \n\nI then journaled for about 10 minutes. I have been trying to hold myself accountable to this, as I always say I’m going to start doing something, and then quit a week or two in. So far, I’ve managed to journal several times a week for about a month now. \n\nI’m working on many things that all come back to the same idea. Life is happening now, not tomorrow, or next month. To assume happiness is only found in the future is to declare there is no happiness in the moment. We all know that isn’t true. \n\nToday I will be here, and no where else ahead or in between.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p5i2up/what_a_beautiful_monday/", "title": "What a beautiful Monday!", "social_network": "reddit", "user": "roolyons32711", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1629126894, "permalink": "/r/DecidingToBeBetter/comments/p5i2up/what_a_beautiful_monday/", "nsfw": false, "first_save": 1635435337.157667, "replies_charged": false}