{"id": "t5_2tand_t3_nvnqf0", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "In 2016 I was let go from my workplace after the company went bankrupt. Being in college I was sick of trying to balance schooling and work and decided to take almost a year off and lived on one of my credit cards for most things, using money saved up to just pay the minimum each month to make it stretch. It was honestly, incredible. Besides schooling, no bosses or worries were had and I got a shitload of projects around my house done. At about month 8, I decided to get back in the job search and shortly thereafter I got hired at my current workplace. By that time, I had a balance of approximately $10,000 of revolving credit and I just kinda let it ride and hid it away thinking \"I'll start saving and paying it down next paycheck\". Fast forward 2 years.\n\nIn 2018, it got worse. Roughly $15,000 in monthly credit card balances, and funny enough my credit score didn't tank somehow. Go figure. Then I sat down and saw the numbers. I had just gotten a used Suv for $10k (financed, obviously), I had a motorcycle still being paid for (about $8k left at that point) plus monthly insurance on said bike. All in all, my monthly bills came out to over $1100 depending on what the minimum payments were, all of it being credit and financing related stuff, not including essential bills like cellphone and internet and such. Day to day life at that point was misery just by looking at the inside of my wallet and seeing my cards. Alot of mixed feelings combined with a struggling personal life meant it was going down a very.....unpleasant road. \nSo I started the process to change. A little bit here, a little bit there, then numbers went down. \n\nOver the course of last summer I finished paying off both my vehicles and selling the motorcycle (don't need it, keeping the SUV, its my baby and I *just* passed 103k miles on it) which cut my expenses in *half*, then came the fun part. I had whittled down the card balances significantly but there was still a chunk the equivalent of a used car and it kinda plateaued a bit and I thought I was in danger of it going back up while I focused on paying off the vehicles. Fast forward to today. \n\nI put the payments in on Friday and today the balances have updated. I am looking at 3 great big 0's across the board and it has hit me that its all gone now. An estimated $40k of debt, considering the revolving amounts of purchases going on, gone. Because I *fucking* did it. All those people that thought I just wasn't shit on the sidewalk to be stepped over like I didn't have my shit together. I succeeded, out of spite, and I hope they suffer seeing it. The view looks good from this mountain. \n\nAnd I'm not done yet. \n\nI fucking win.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nvnqf0/todays_the_day_i_saw_0_balances_across_all_3_of/", "title": "Today's the day I saw $0 balances across all 3 of my credit cards", "social_network": "reddit", "user": "Darkfire346", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 82, "down_vote": 0, "creation": 1623214929, "permalink": "/r/DecidingToBeBetter/comments/nvnqf0/todays_the_day_i_saw_0_balances_across_all_3_of/", "nsfw": false, "first_save": 1635435214.9061713, "replies_charged": false}