{"id": "t5_2tand_t3_px1pw7", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "I know there are a lot of posts like this lately, so this will be more of a collection of my thoughts, but of course I accept advice and constructive criticism. I'll try to sum things up shortly, but knowing myself it will still be long, haha.\n\nSo the current situation is that I have a diploma which I can't/don't really want to use because it's a foreign language one but I don't speak the language too well, and I don't even want a job in that country or connected to that knowledge. In fact, I have no idea what do I want.\n\nI've had signs of depression since my teens: lack of enjoyment/interest and lack of motivation. It wasn't too bad when I was in school since I just \"did what I had to\", but now that I have endless job opportunities, it's like I suddenly have to decide on something and do that even though I'm probably not interested in it. And yes, this may seem extreme, but I actually don't know what my interests and hobbies are, if there are any.\n\nI like playing videogames, watching streams on Twitch, videos on YT - but that's about it. And however much I'd like to think I can make money in the future by streaming or monetizing my videos, 1) there's only a slim chance for that to happen, 2) I can't live off of that money alone, and 3) frankly, I don't even want to either. I want a fulfilling job which I like, and I believe it can't be a (solely) home office one for the sake of my mental health. I need that exercise or experience of leaving home for work, keeping the two places separate, if that makes sense.\n\nSo what am I doing now to be closer to the answer? I'm looking for not too specific, more common jobs now, like receptionist, office worker, etc. Even though I know I don't like the 9-to-5 worktime, I also know that I need to start somewhere, I have to make compromises first.\n\nIn the meantime, I started a yoga instructor course online. I'm not sure I'd like to have that as my job, but 1) it would be beneficial for my health, 2) I could at least earn some money while I'm figuring things out, 3) it's not a 9-to-5 job. I think I'll only be able to finish it in the beginning of next year though, that's the earliest.\n\nI'm also waiting for my driving school to call me when will my instructor be free to start the lessons with me. I failed my previous test, so I know how to drive, I remember enjoying it, that's why I still want to get my license. I'm thinking of a food delivery job or something like that where 1) I can kinda arrange my own schedule, 2) I can enjoy driving a car, 3) I have alone time but I also have little interactions with people, and 4) it's most likely not a 9-to-5 job.\n\nSo yeah, these are my current thoughts and \"plans\". I'm still lacking motivation to do things, but I'm trying. And I also know that I need money for my future goals of moving out of my family's house, go to therapy for my depression and anxiety, etc. I just feel lost ever since I received my diploma, like I'm unable to go forward because I'm still not sure what I want. I know this isn't uncommon with people in their 20s, but damn, it really is discouraging to see some of my peers having the time of their life (in their job, with their children, etc.), and even seeing people in their 40s and 50s being content with average jobs and lives, while here I am, being depressed since years over basically nothing.\n\nI'm trying not to be hard on myself, but sometimes I just can't think positively of what I'm (not) doing, how and where I stand in life. I also have worries and insecurities regarding my friends, relationships and myself too, but right now I think what I need most is to get a daily routine (that involves getting out of my house and doing something productive) and to earn money to broaden my options and to be able to heal myself better.\n\nSo uhh, not sure how to end this \"little\" rambling, lol. I guess if you're in the same boat, know that you're not alone, and if you want to, we could maybe share ideas and inspire each other to be able to find our own life's purpose. If you _were_ in the same boat in the past, I'd be glad to hear your story - it's usually a good motivator to see/read that someone has overcome feelings and situations like this. And if you stuck around until the end only to read my story, then thank you, that's already more than some people do in my life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/px1pw7/lost_in_life_mostly_question_marks_around_jobs/", "title": "Lost in life (mostly question marks around jobs)", "social_network": "reddit", "user": "anxiety___throw", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1632817045, "permalink": "/r/DecidingToBeBetter/comments/px1pw7/lost_in_life_mostly_question_marks_around_jobs/", "nsfw": false, "first_save": 1635435434.1585329, "replies_charged": false}