{"id": "t5_2tand_t3_ini9d2", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "**About this post**: I’m just a regular guy who enjoys writing about making friends in adulthood (I’m 35). In 2016 I found myself without a single friend I’d call “close”. And since then, much of my spare time has been dedicated to fixing this.\n\nThis post (and all others) is nothing more than a fun project where I write about things I’ve found. I am not – nor in any way – claim to be an expert on making friends or any crap like that.\n\nToday’s post is about small-talk.\n\nI used to find myself stuck in small-talk all the time, and was genuinely crap at it. Seeing as my goal was to make new friends, I figured I had to get better at it...*right?*\n\nWRONG!\n\nThere's no such thing as better small-talk. Small-talk by definition is terrible conversation. And as you'll see, there's a much better way.\n\n**The Secret to Fun Conversation**\n\nHave you ever found yourself stuck in crappy small-talk?\n\nEveryone has. It’s boring, goes nowhere, and leaves a feeling of awkwardness with whoever spoke with.\n\nThe reason this happens is because most people approach meeting new people in the wrong way. It’s too rigid and formal.\n\nYou solve this by changing your mindset when meeting strangers. From here on I want you to…\n\nAssume everyone is already your good friend\n\nLet me explain.\n\nHere’s how a normal conversation begins:\n\n&#x200B;\n\n*You: Hi, good to meet you, how are you?\\**\n\n*Bob: I’m good thanks. What about yourself?*\n\n*You: I’m great too. So I heard you’re an architect.*\n\n*Bob: Yeah for 7 years now. I work in ….*\n\n&#x200B;\n\nCongrats, you’ve now entered small talk land. The home of the bored and depressed. Instead here’s how a better conversation goes:\n\n&#x200B;\n\n*You: Hey what’s up man, how things?*\n\n*Bob: I’m good thanks. What about yourself?*\n\n*You: Ahh man, I’m bored as hell. I got stuck in a conversation with my wife’s uncle. He lectured me for best part of 10 minutes about selling propane. What about you – anyone bored you yet?*\n\n*Bob: Actually, see that woman by the statue? I had a chat with her about her daughter’s graduation. She wouldn’t stop…*\n\n&#x200B;\n\nSee the difference?\n\nBy treating Bob like a friend and speaking accordingly you give him a chance to do the same – which opens the door to a potential friendship.\n\nOf course, the other person isn’t always going to respond with something good. Some people take time to warm up – and others are just born boring!\n\nBut the point is you lose nothing by speaking to them with the same ease you would with a good friend.\n\nI remember when I first tried this. I was worried I would look like some socially inept odd-ball. But to my surprise tons of genuine, fun guys have loved the humour and openness.\n\nIt was a relief, but made sense right away.\n\n(After all, wouldn’t you love it if someone spoke with you like this?)\n\nSeriously give it a go.\n\nI bet you’ll be pleasantly surprised by the results ;)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ini9d2/i_suck_at_smalltalk_and_used_to_think_i_had_to/", "title": "I suck at small-talk and used to think I had to master it to make friends as an adult. But this is wrong. Small talk is by definition bad conversation. Here's a far better way to start conversations and make more friends.", "social_network": "reddit", "user": "jay_mcf", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 108, "down_vote": 0, "creation": 1599379328, "permalink": "/r/DecidingToBeBetter/comments/ini9d2/i_suck_at_smalltalk_and_used_to_think_i_had_to/", "nsfw": false, "first_save": 1635437675.0735073, "replies_charged": false}