{"id": "t5_2tand_t3_qcebrc", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "\\-after graduating college, I found a decent entry level job that I was happy with but shit happened and that ended shortly. I have been extremely depressed since then because a**fter years of never having anything to my own name**(I'm 27), I found a job that (would have) allowed me to become independent but that opportunity went down the drain for certain reasons.\n\n\\-despite dealing with (severe) and (multiple) mental illnesses at once, I did my best to graduate with my Bacehlor's from a good school with honors and write 2 publications. I was thankful for the decent job it landed me, but now I'm working a job that in my field that I absolutely hate & is very low paying.\n\nDuring my first week of working at this place though, one of the best trial lawyers in the country (former federal prosecutor who graduated from top law school with honors) asked me to interview with him and the job offered to pay pretty well. but I never went bc I was too scared to ask the trash job for a day off as I just started it. I also thought he would find out that I got fired from an old job , which now looking back I dont think he would--**----> Im such a fucking idiot bc it resulted in me working this low paying job that I hate when I could have been financially independent for the first time in my life (while working alongside the best of the best in my respective industry b/c I've worked hard for it) if I had the courage to interview with him.**\n\n\\--> Since then, I passed the phone screen with one of the largest law firms in the world and I believe this position pays quite well. Got invited to interview with (6) different hiring managers. To get this job, I have to pass the interview with 6 different hiring managers who ask behavioral questions which I fucking suck at for a few reasons. Like how am i supposed to ace something that involves answering random hypotheticals that i've never encountereD?\n\n--> the thing is, I believe im very well qualified for the job. Based on   profiles of previous employees...\n\\-> anyway, this is my shot towards the life I always dreamed about (financially independent and working for a firm in my dream office location) and I don't even think i have a real shot bc behavioral interviews are hard.\n\n**--> but im going to do the best that I can to research and practice my answers.  I better fucking attack this bc i have no other choice:p**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qcebrc/been_poor_my_whole_life_passed_phone_screen_to/", "title": "Been poor my whole life & passed phone screen to interview with the hiring managers & Partners of an elite and one of the largest corporate law firms in the world. But i feel like i don't even have a chance b/c I suck at behavioral interviews. But, I've been telling myself im gonna attack it.", "social_network": "reddit", "user": "Cat_Eyed_Goddess94", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 507, "down_vote": 0, "creation": 1634773653, "permalink": "/r/DecidingToBeBetter/comments/qcebrc/been_poor_my_whole_life_passed_phone_screen_to/", "nsfw": false, "first_save": 1635436934.9945786, "replies_charged": false}