{"id": "t5_2tand_t3_krn1zm", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I knew this on a conscious level for a loooong while. Every friend who has been supporting me in my quarantine-induced depression has said, I'VE said it to THEM. But it just never really... clicked for me how actually true that was?\n\nAnd the thing is, the trigger for this realization was something incredibly stupid.\n\nI literally just... recieved a compliment on my social skills.\n\nI don't know why but I feel like I just woke up, like my mind just feels clearer. I just suddenly realized I've been thinking hopelessly about my social life, my career options, everything. And on a conscious level, I knew that was just making it worse. I knew getting so depressed I couldn't attend college was just making things worse but I feel like my brain has finally accepted that info. I suddenly feel way more optimistic, I don't know how to explain it.\n\nI have obsessive compulsive disorder, if a thought gets stuck in my head, it just doesn't go away. \"Your genes are inferior to other people, you're intellectually incapable of achieving your dream career\", etc.   \nAnd I feel like for a moment those thoughts have just kinda... gone away? And I'm realizing that they were kinda dumb. Hoping this lasts!   \n\n\nIt might be related that I've been working on my diet, I'm eating significantly healthier than I used to even if I haven't lost any weight yet.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/krn1zm/i_just_had_a_massive_realization_about_my_own/", "title": "I just had a massive realization about my own life: I live in my own head.", "social_network": "reddit", "user": "suddenrealization111", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1609936540, "permalink": "/r/DecidingToBeBetter/comments/krn1zm/i_just_had_a_massive_realization_about_my_own/", "nsfw": false, "first_save": 1635437607.452188, "replies_charged": false}