{"id": "t5_2tand_t3_k81jbs", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": " \n\nI am writing now while I'm crying so hard..I am a 26 years old girl..I have 4 sisters..the oldest one is 32 years old and the youngest one is 21 years old..I have always believed that I have the most kindest-respectful and open-minded father ever! but as I am growing up, I realized that I was wrong ..it's very disappointing to start seeing things differently and clearly. since early childhood, God gifted me empathy esp. to those who are weak physically..and gradually I have a strong feminist's mindset although I was not having any issues at home!. Recently, I have realized that I was seeing him like that because I used to have the same beliefs as him in almost all life aspects so you can say there were not any rebellious behaviors. But when my beliefs have changed and I start seeing the life differently , he is not an open-minded father that will support you no matter what..he is not the kindest father anymore.\n\nI live in the middle east so father have control in the family..and its a social programming that the father has the right to become angry and we must understand that because he is the father!\n\nmy younger sister who is 21 years old has some issues regarding her temper and nervousness with some symptoms of ADD...she is so messy in all her life; academic (she is a third year dental student) and due to her messy life and social media addiction, she failed the third year and she is repeating it again..we have tried to advice and guide her with kindness and logic..I even encourage my mother to let her see a psychiatrist and things were begin to be better but after a month she returns to her old bad unhealthy habits and she became more nervous and rebellious even when I want to help her..she do not listen to anyone even when my dad told her in a kind way but nothing change..\n\nToday after almost 2 months of this semester..3 hours ago..my father told my sister to follow him as he wants to talk to her about something..she fears my dad because there were some experiences in the past when he got angry so she was begging my mother to come with her but my dad said that it's nothing than a talk!\n\nI was listening to him scolding her and telling her:\" to give her mobile to my older sister at 9 pm and if you give her at 9:01 pm then you will not have it for 3 days and if you repeat it again it will become a week and so on! I am not your kind dad anymore I am a tough person with strict rules just try me and see! you have failed a year and I was wrong to allow you to repeat the year and paying thousands dollars on you with no change of your behaviors ..you have a privilege ..other fathers will not do it..also when you eat and leave some food in the plate to finish later, put your dish in it's place or I will throw it with the food on your face..say yes in a loud voice!\" then the conversation ends and my sister went to the balcony to cry and he came to us asking about her ..we told him that she is in the balcony..he followed her and was calling her name but she was crying and she was begging my mother to come to her..then he started to yell loudly and my mother went to him trying to stop him and here is my second big shock! he yelled at my mother and told her not to engage in a disrespectful way!!! my mother came to the room and she started crying and I was in a cycle of mixed feelings of being shocked, resentful, angry, hatred and anxious! it's the second time my father disrespect my mother under the pretext of anger! the first time was 2-3 weeks ago when he got angry on the same sister because of the same reasons and she was screaming like an insane and when my mother was trying to stop him from hitting her he pushed her aside and she fall on her knees and everyone cried because of that (all of my sisters)\n\nI can't forgive him anymore! now after 33 years of marriage and respect! anger is not a excuse. We are humans not animals! my bigger sister told me not to engage between their relationship but I could not keep silent! not because of him being a man with a physical strength and a loud voice, he has the right to do whatever he wants because it's okay he is angry!! I was angry because he treated my little sister like that! even though she has a bad temper and rebels my mother orders (which is for her sake regarding academic life and sleep habits) this is not an excuse to talk and treat her in a bad disrespectful way! my head will explode.. I hate him so much.\n\nand he then came to the room after hours and saw my mother sleeping on the coach and asked me if she is okay? and what happened! like he did nothing! he is acting like nothing happened!\n\nI can't stand him anymore..please guide me to learn how to deal with him and not to let what happened today to happen again! what's the healthy relationship between a father and a daughter looks like?\n\nnote that my sisters do not see any problems with the way he talked to my little sister..it's the opposite! they said that she deserved this because she have crossed all the lines..they think that some scolding may work with her but I am totally against this!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k81jbs/help_me_with_thismy_brain_is_against_my_reality/", "title": "Help me with this..my brain is against my reality!", "social_network": "reddit", "user": "fatimasunshine", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1607287047, "permalink": "/r/DecidingToBeBetter/comments/k81jbs/help_me_with_thismy_brain_is_against_my_reality/", "nsfw": false, "first_save": 1635436881.4137046, "replies_charged": false}