{"id": "t5_2tand_t3_mks2dc", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I was invited to a surprise birthday party for a close friend of mine. I don't particularly like being around her friends because, to put it bluntly, they are higher class than me. I'm not saying this is bad, I have no problem being the only one in the room who isn't a lawyer and can't afford a Peloton, but it definitely makes it difficult to socialize when people are that different from yourself. \n\nI was dreading it until I decided this time I was going to join in the conversations more, and try to be a little more involved in the party instead of being the fat friend in the corner petting the dog like I usually am. \n\nIt ended up being so cool. There were only  7 or 8 people there anyway because of the health concerns, so I already felt like the universe was rewarding my decision. I did exactly what I set out to do. I joined conversations, I listened to jokes, (I still pet the dog hahaha) and allowed myself to come up to the surface. Turns out I can't really contribute to a conversation about bidding on vintage wine, but I got a kick out of their faces when I said \"$15 MAX\". \n\nWe ended up playing Cards Against Humanity, and to my pleasant surprise I WON. It was such an eye-opening experience for me. Like yeah, I'm poor, I'm dumb, I'm fat, but apparently I'm also hilarious, and despite what my insecurities try to tell me, I am *likable*. \n\nI hope you all get something out of this and as always I love hearing similar stories. Thanks for reading! I hope you all have a great week!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mks2dc/left_my_insecurities_at_the_door/", "title": "Left my insecurities at the door", "social_network": "reddit", "user": "JenineMenine", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 35, "down_vote": 0, "creation": 1617649157, "permalink": "/r/DecidingToBeBetter/comments/mks2dc/left_my_insecurities_at_the_door/", "nsfw": false, "first_save": 1635437666.425519, "replies_charged": false}