{"id": "t5_2tand_t3_n15awd", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "I just had my second session today. I know people scoff at the idea of sessions with therapists, but there is so much of BS hidden in the subconscious. Even if you're not going through something staggeringly life threatening, sometimes you are unknowingly doing things that are chipping away at you and your health. I just became much more conscious of inbuilt resentment against my mother, the ways I've rebelled to assert my individuality and sense of self against her control and often destructive ways. When I say destructive - things that destroy a child's self esteem, sense of safety and trust and later end up messing their decisions and responses to life as an adult.  \n\nI get a very bad taste when I look at things objectively and dispassionately about how a kid was treated, a hapless kid by a fully grown adult. Parents should remember their responsibility to children, but often they punish their children by projecting their own failings into them and get some sick sense of satisfaction in breaking their spirit and controlling them. I know not everyone is like that. I also know going through it makes you more conscious of what is good parenting and helps you someday probably to create a safe and loving space for your children. \n\nThey say the tormented becomes the tormenter and that can happen to anyone. So if you were ever at the receiving of any kind of abuse, verbal, emotional or physical from someone you trusted - please do the right thing and find someone who can help you. \n\nIt's not an overnight change, but even working on something just eases the load off from your mind and leaves you at peace.\n\nHope you all have a lovely day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n15awd/if_you_have_trust_issues_and_a_bunch_of_toxic/", "title": "If you have trust issues and a bunch of toxic behaviours", "social_network": "reddit", "user": "effortsmatter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 26, "down_vote": 0, "creation": 1619705784, "permalink": "/r/DecidingToBeBetter/comments/n15awd/if_you_have_trust_issues_and_a_bunch_of_toxic/", "nsfw": false, "first_save": 1635438110.4852576, "replies_charged": false}