{"id": "t5_2tand_t3_hqn92k", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "This is a gross one. The kind of gross you can't tell anyone about in real life. The kind of gross where you make a new internet name because you can't let your real username be tainted by it. \n\nFor the past too long (weeks maybe months). I've been ignoring crap. It's easy. No clean clothes? Just spend the day in pj's. No clean dishes? Just use a napkin and clean one fork. Trash is full? Just set it down, you can take it out later. \n\nToday, I decided I needed to start treating myself as someone I'm responsible for taking care of. There's a lot to catch up on, so I made a deal with myself. I'll start small and write down one more thing to do later today. Repeat until done. Bite size goals. Written down goals. Time to do it.\n\nI open the lid and it's just bugs. Everywhere. They fly too. Right there in my kitchen. I screamed in pure rage. Panting to bring up some adrenaline, I put on a facemask and some rubber gloves and pull it out of the bin. Close it up and run to take it out. \n\nWhen I get back I realize that's not enough because an Egyptian plague of them are still in the bin. I throw the whole thing out before I realize I should have done that at the start.\n\nThe deal with myself is off. I scratched it out on the paper and wrote down \"CLEAN EFFING EVERYTHING\".\n\nThat's what I'm going to do today and I'm taking tomorrow off too. After that I'm going to start paying attention to what I need and treat myself with the respect I deserve. God knows I'm going deserve it after I'm done with this.\n\n\nSo anyways, does anyone know a good way to get rid of bugs in an apartment? I got rid of most of them, but there's a few stragglers.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hqn92k/ive_decided/", "title": "I've decided", "social_network": "reddit", "user": "PissedOffAtBugs", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 56, "down_vote": 0, "creation": 1594672634, "permalink": "/r/DecidingToBeBetter/comments/hqn92k/ive_decided/", "nsfw": false, "first_save": 1635435888.564128, "replies_charged": false}