{"id": "t5_2tand_t3_dq3szx", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "So far in my life, I have always considered cooking as the activity of making food *more* edible. I am a *functional eater* which, for me, means that I see eating as a function (to keep you alive), not as must as an art.\n\nMeditation, however, is an art. You start with baby steps as you learn how to concentrate on one thing at a time. Then, you learn how to concentrate on a particular thing at a time. And finally, you learn how to concentrate on nothing.\n\nI've tried different, conventional meditation practices (standing in lotus pose, lying, sitting on a couch). And, I've also tried some unconventional ones: walking meditation, guided meditation. Finally, after so many years of rejection, I tried cooking as a meditation. It is amazing with the side effect that you are also producing something tangible at the end. It feels almost like a guided meditation (somebody, in my case a cookbook, is telling me what to do). But also, as I said there is the added concentration from the fact that you are actually in charge of preparing a meal for the whole family.\n\n## Time to read\n\nTime to read: **13 minutes** (based on 150 works per minute).\n\n*Disclaimer: I am not a professional cook (you will see below), follow any of my tips at your own discretion.*\n\n## Introduction\n\nHave you ever tried escaping from your daily life? Have you ever felt stuck during the workweek and exhausted at the end of the day? Do you ever find yourself just in need of some time in the evening when your work brain is shut down? But then, how can you find that time? Especially in the evening when everybody is looking at you (or your spouse) to prepare something for dinner. And most probably he or she (your spouse) is in a very similar condition.\n\nThis article is about cooking as a meditation technique, as a therapy after the end of the stressful day. But you can also transfer the knowledge to any household chore. If you've read any book on Buddhism, you probably think that Buddhist monks spend a lot of time sweeping floors. Well, this is a wonderful way to be present, to be mindful (you don't want to have to sweep a room twice, because you let your mind wander).\n\nIn this article, I want to talk about the cooking as another similar chore. You have to concentrate (these onions won't chop themselves). You have to be careful (you will still need your five fingers for work the next day). And, if you allow yourself to, this is a very nice way to relax and leave your *work brain* to rest a bit.\n\n## Problem\n\nBut what prevents you from already doing this? Why can't you teach yourself to see every chore as a Zen exercise? I don't have an answer to that question. Maybe it is because we've always done it this way (chore = bad). You learn to be uncomfortable doing your household chores when you are little, because they are not *fun*. But is that true? Can they be fun? Who defines what fun is what isn't?\n\nThe benefit of this article is a new way to look at cooking (specifically, but also at everything else that you *have to do*). I will walk you through they way I approached it. And I will try to sell you on the idea of actually giving it a shot. And, once again, the hidden benefit is that at the end you will have a dinner ready for the whole family. I really liked how the cookbook that I bought as part of this experiment put it. It is very unlikely that whatever you made (and potentially mess up) will be inedible.\n\n## Personal story\n\nI have always stayed deliberately clear of cooking. Ever since I started living alone, I knew that I am not good at it. So, I tried to avoid cooking as much as possible. I would eat out, order in, buy semi-prepared portions from the supermarket. And, I literally could only make a weird meal with chicken and frozen vegetables (on which I had to put a lot of ketchup), and scrambled eggs (with a lot of white cheese inside).\n\nOver the last years, I have been reading a lot of philosophy books (with sweeping monks), how-to books based on a lot of interviews (with meditating celebrities), and biographies (with emphasis on the importance of finding meaning in whatever you are doing). It was about time I connect 2 and 2 and get 5 as a results.\n\n### The spark of inspiration\n\nI started simple, with pancakes (of course). Everybody around me was very proud of their pancake-making skills. And, it did not look that hard. I would usually wait for my spouse to be in a *pancake mood* and I would enjoy feeling spoiled while eating them. But one morning, our kid came out of bed and begged for pancakes. I cracked the phone open and just *did them*. They were not that good, but good enough (with a lot of jam and cheese).\n\n### The motivation\n\nAlso, our lives were getting harder, with a big kid and less time for anything. And, I saw how inefficient we are when preparing the meals for the week. I would help in the kitchen as much as I could (you know cutting the ingredients and other small tasks), but we always ended up fighting, frustrated, and exhausted. Food-preparation is strange from economy point of view. If you spend a lot of effort preparing it, the return on investment (ROI) is so low. But, I thought to myself, if you increase the quantity and prepare something simple, than the ROI goes through the roof.\n\n### The result\n\nThis is when the idea occurred to us. We did not have a single cookbook in our kitchen. We would rely on recipes from our parents or on finding something on the Internet. And in most of our friends houses, there were cookbooks. So, I did my research and bought our very first cookbook. After a lot of years of marriage and a kid, we committed to a cookbook.\n\nThe point of my article is not advertising, so the name of the book is not important. Our only goals were simple: 1) Find a book for complete beginners; 2) Make sure that it has a lot of recipes (high ROI); 3) And a hardcover (you know ... like a *real book*). This is how we made up our mind.\n\n## How can you use cooking as meditation?\n\nFinally, I will share some steps that work really well if you are pursuing cooking as meditation, but you still want to produce something good enough.\n\n### 1. Buy a cookbook\n\nConsider it like a textbook for any field that you want to study. As I already said, I did my research and I found a book for beginners with a lot of basic stuff. Like what skillet is, for example. And how to convert cups and ounces to normal measuring units (I am from Europe). The index is your friend, because the choice if overwhelming.\n\nOnce again, I am not going to tell you which books did I bought (yes, I ended up buying two). But I went for thickness and I went for basic, simple, and easy recipes.\n\n### 2. Concentrate\n\nMy first advice is to concentrate (somehow). I personally can't do more than one thing at a time. If I am 80% efficient with doing one thing, then I am only 10-15% efficient doing two things. And the performance degrades a lot after that. If your family insist on watching TV while you cook, use noise-cancelling headphones. If you are an audio person, you could try listening to some soft music (I would say without lyrics, but it is up to). Most probably, people who can study on music will be able to also cook on music.\n\n### 3. Pick a recipe\n\nThe sooner you do this, the better. Preferably, with enough time in advance so that you can buy the ingredients. But pick one. I guess in the beginning it does not really matter and you could guide your choice by the contents of your fridge.\n\n### 4. Bring order to chaos\n\nI have always wondered why do they use a million *mixing bowls* in the cooking shows on the TV. My current answer is that it makes you feel in control. You've examined the list of ingredients and you've started preparing them (in my case, mostly chopping). And, it feels good to have all the small bowls lined up ready for use. (It also makes your life easier).\n\n### 5. Follow the recipe\n\nIf your goal was to be creative, then this article is not for you. All I wanted, was to prepare dinner and relax a bit. I generally don't mind when people tell me what to do in certain situations. And with regard to cooking, you need to follow the recipe. Of course, I did not follow everything (e.g. we did not have a few of the ingredients, so next time I will make up my mind in advance and do the shopping before). But I followed everything I could.\n\nI especially liked using measuring tools (they probably have names, but I am still a newbie) to use exactly *400ml of whatever* and *1 teaspoon* of something else.\n\n### 6. Detach from the results\n\nWell, this may sound weird, because you do want to prepare something edible. What I ended up with did not look anywhere near the picture in the book. But it was delicious. And, I was *too relaxed to care*, if you know what I mean. At the end of the day everybody was happy, everybody ate dinner.\n\n### 7. Encourage yourself\n\nIt takes time, there is no other way to look at that. Celebrate your results and still eat your failures. The cooking world is huge, and there are people who do that for years before they can prepare something extraordinary.\n\nYou've spent some wonderful time after work (maybe even an hour). You've prepared something that everybody can enjoy. And, you(hopefully) had fun doing it.\n\n### 8. Sweep the floor\n\nBack to the Buddhist monks. Make sure you sweep the floor (and everything) after you're done, because it will be messy. But during the whole time, be present. Don't go back to your work mind, concentrate on the task at hand. Don't worry about the future (of the meal or your own). Forget the past - it does not matter.\n\n### 9. Buy and read a book about nutrition\n\nOnce again, the name is not important, but I bought a book about nutrition. And I learned a lot about the subject, so that I could make up my mind on what I wanted and what I did not want (e.g. I decided to reduce my dairy intake and most animal fat).\n\n### 10. Mindfulness\n\nImmerse yourself in the activity, be present, and be mindful. You have this chance to shut your work mind off, even only for half an hour or so. Do not let the wild monkey mind get back to work.\n\n## Summary\n\nCooking can be a wonderful way to meditate in the evenings after work. You could completely detach from your *work mind* (and, since you are a beginner, from the results of the cooking itself). You could spend a few minutes (maybe an hour) following very specific instructions, being present in the moment, and being mindful.\n\nAnd then, who knows, maybe you'll like it (just like I did). And you will find something wonderful that you could do.\n\nTin Mayer\n\nAuthor", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dq3szx/cooking_is_the_new_meditation/", "title": "Cooking is the New Meditation", "social_network": "reddit", "user": "tinmmayer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1572612657, "permalink": "/r/DecidingToBeBetter/comments/dq3szx/cooking_is_the_new_meditation/", "nsfw": false, "first_save": 1635438292.3517425, "replies_charged": false}