{"id": "t5_2tand_t3_m9thtd", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I should be happy, financially I'm doing quite well. I'm fortunate enough that I'm able to generate an income online, from home. The way I generate income is not scaleable so I can't spend any further time progressing here. This leaves me with a ton of spare time that I'm wasting.\n\nI did start a good workout routine at the start of the year and I've stuck to it, I have gained a significant amount of strength and muscle. That's one big positive but that still only fills 60-90 minutes of my day, and not every day. \n\nMost of my day is spent idly browsing the web, I want to do something productive. Occasionally I get a taste of what it feels like to be productive, for example I recently bought a squat rack and had to set it up. It took me about an hour to build, during that hour I was solely focused on the task at hand not thinking about life. \n\nIf I just had something that I could strive toward I know I'd be so much happier. Sometimes I think about starting a blog or something but then I'm like, what would I blog about? I'm not passionate about anything, I'm not an expert at anything so I don't bother.\n\nWhen I read sound advice like plan your day ahead, keep a schedule, write your thoughts down etc I feel like this only further highlights how little I have to do. \n\nSeeking your advice, thanks in advance :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m9thtd/i_have_so_much_time_but_so_little_to_do/", "title": "I have so much time but so little to do", "social_network": "reddit", "user": "wishfulkiwi", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1616320700, "permalink": "/r/DecidingToBeBetter/comments/m9thtd/i_have_so_much_time_but_so_little_to_do/", "nsfw": false, "first_save": 1635436618.6157491, "replies_charged": false}