{"id": "t5_2tand_t3_pr2pbf", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "883794f3-030f-4844-8950-6e28281dfa3f", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I am a 25 year old depressed individual with an advanced degree in finance living with my parents (which is not rare in this part of the world) and addiction to Netflix. I have always been above average in academics. I have known to be to hard on myself.  My objective is to earn money. \n\nI currently work in an underpaying, non fulfilling job in finance with only a 20 day annual leave. Over the months I've come to like the job, but I dislike waking up everyday to go through the same routine for the rest of my life. What I like about this job is free health insurance and the weekends. Im not a very social person or someone to take on additional responsibilities, in order to grow in this environment this is something thats expected of me. I've been spoon fed all my life, its difficult for me to know what is expected of me and what the bosses want. I've hated all the 9-5 jobs that I've had, deeming them to be monotonous \n\nI am considering starting a businesses but I'm afraid of putting myself out there, don't like the idea of publicly humiliating myself or maybe I'm just lazy either way. I want to try out an idea but I spend all my free zeit watching \"just one more\" episode of my favorite TV shows signifying laziness on my part. \n\nFor the past few years I've just been existing, living by the day, now I look in the mirror. I see a 25 year old who dislikes their life, job and for doing nothing I dont want to see myself as a 30 year old and being in the same position that I am. \n\nI really want to get out of this rat race of a corporate life and want to actually achieve something. In order to do this I have to build self confidence, would need to cut down on my screen time and know how to go about starting a business considering that I have no discernible skills or know what am I passionate about. ​Advise would be welcome. \n\n\nSide note: I would like to be social, but there I dont know what to say most of the times or how to conduct myself so social situations make me extremely uncomfortable. This is something that I have to work on too 🥲", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pr2pbf/trying_to_find_the_motivation_to_achieve/", "title": "Trying to find the motivation to achieve something in life", "social_network": "reddit", "user": "Usernameisnottakenn", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1632032598, "permalink": "/r/DecidingToBeBetter/comments/pr2pbf/trying_to_find_the_motivation_to_achieve/", "nsfw": false, "first_save": 1635435075.3711598, "replies_charged": false}