{"id": "t5_2tand_t3_4ml2dq", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "EDIT: Thank you all for all the replies.\n\nLet me preface this with 3 things: first, I apologize for the length and angst of this; I want to get everything out exactly as it is in my head. Also, I know what is defined as \"loser\" will vary from person to person, but for me, it's defined in comparison to my family's status. I know I shouldn't do that, but that's how it is. Lastly, I do not suffer from depression.\n\nI just turned 25, and I can see the rest of my life: I work entry level jobs that mercifully pay more than min. wage, but not by much (my current job doesn't allow overtime.) I live at home as a hermit, isolated from the world almost always, with no friends, and no desire for contact. Maybe I move into an apartment, cutting off family contact (I think I'm frugal enough that I could survive independently, but am not educated enough to know for sure.) I have no desire to improve myself; I am resigned to my fate. This lifestyle most likely never changes.\n\nI look at my doctor/lawyer relatives, and hear my successful cousins and family friends, all with great relationships and social lives, blazing through college towards extremely lucrative futures, and I know that I am drastically under-performing: I am a loser. After dropping out of college 2nd semester in, I've realized I have no interests - no desire to better myself - and am no longer capable of learning skills, nor do I want to. I've had as many privileges and opportunities as my peers to succeed, but having failed to act at all, they are forever gone.\n\nThe thing is, I don't care about any of these things, or at least that could be the case. All these insecurities certainly used to not bother me at all. \"We can't all be Superman - we can't all be middle class, or even productive members of society. That's just the way the world works.\" I used to be content with that idea: that this was my place in the world. That changed maybe 3 years ago, when all these insecurities started creeping in. I should be comfortable with it if that's to be my place in the world, shouldn't I?\n\nI feel I could be more accepting of my fate, were it not for these external forces bringing me down and making me care (no one is physically impressing these things on me, so you know.) I think that, left unresolved, these insecurities will one day be the death of me.\n\nPlease, if my lifestyle as I've described it is truly unsustainable - if I truly have no choice but to improve myself academically and socially if I want to survive - please say so. Otherwise, what I really want to know is: is it okay for me to be as I am? Is it okay that I'm a loser?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/4ml2dq/is_it_okay_that_im_a_loser/", "title": "Is it okay that I'm a loser?", "social_network": "reddit", "user": "AndysSeveredHead", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 18, "down_vote": 0, "creation": 1465086305, "permalink": "/r/DecidingToBeBetter/comments/4ml2dq/is_it_okay_that_im_a_loser/", "nsfw": false, "first_save": 1635437867.5469663, "replies_charged": false}