{"id": "t5_2tand_t3_obd5t4", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I’m not sure if this is the right place to post this but here goes nothing. I’m a 19 year old Indian female who is currently a sophomore in college. Up until freshmen year of college, I received zero positive attention for men. Now, I receive a lot and I don’t know how to handle it in a way that is healthy and productive for me. When I first started getting more attention, I started talking to this guy, let’s call him Alex, and I grew close to him. He turned out to ultimately be an ass and said some pretty terrible things. Although those things were never about my appearance, he said a lot of things from slut shaming me to saying that I was worthless to him.\n\nNow a big part of this story is me losing weight and moving to a new state. I moved from the west to the east coast before my freshman year of college and during my first semester, I lost about 25 pounds. It was done in a very unhealthy manner BUT it boosted my confidence tremendously. Now comes to moving, I had lived in the same town on the west coast since I was about 5 years old so pretty much everyone in my town knew me. I wasn’t popular in highscool and tbh I was kinda seen as a lame, shy nerd. I never dressed the way I truly wanted to or had confidence in myself and a major part of that was the environment that I was in. I felt like if I dressed the way I wanted to or acted more confident, then people would judge me and think I was trying to be someone that I was not.  Were these fears irrational? Possibly, BUT that is how I felt. I felt like I was stuck in a box that I had outgrown and couldn’t get out of. Once I moved, I began to dress the way I wanted to and put myself out there more instead of hiding as much as I could and trying to blend into the background. For example, I finally started posting on Instagram after not posting ALL 4 years of high school. These things were also big part of my confidence boost.\n\nFor a while, the things that Alex said and the way he treated me overall, hurt a lot and I went through a major depressive episode during my second semester of freshman year. I fluctuated about 5 pounds while I was depressed and now I am back to the initial weight that I was after losing weight. However, I look in the mirror and I don’t feel like my body looks the same anymore. Despite the scale telling me I am the exact same weight as when I first lost weight.\n\nI wonder if I gain even 5 pounds or if my acne comes back or if I dress slightly less stylish than I’ve begun to dress, will I never get attention from men again? Will it be like it was in highschool? If I gain just a few more pounds will everything change for me again. Will no one ever like me again? It’s not just men at this point too I’ve had a few girls reach out to me telling me that I’m SO pretty and they’d love to be friends with me and girls who used to be rude to me become nicer and I’m just scared if I’ll be able to maintain all of this. I mean sometime I breakout, sometimes I bloat, sometimes I wanna just wear an ugly sweatshirt and not do my hair or makeup. Sometimes I just wanna eat dinner instead of ignoring the hunger pangs and drinking coffee as a meal replacement. Will people view me negatively again if I’m not on my A game all the time? Do i have to look and act like the same girl I was in my first semester of college in order to be attractive and desirable as a person? Can i grow and change as a person and still be considered attractive or will people view me as they did before while I lived in Washington? Also, have any other women gone through a similar experience where they received no male attention until college and once they began to receive it, they didn’t really know how to handle it? Anyone who has read this far, THANK YOU THANK YOU SO MUCH. i hope you have an amazing day!! :))\n\n- ALSO i’m sorry if any of my issues seem a little of vain or over exaggerated in importance but i’ve been through a lot (other things that aren’t relevant to this specific post haha) and I needed a space to get my thoughts out and hoped that maybe I could help someone else who is possibly going through or has gone through a similar situation and is feeling alone.\n\n- TL;DR: 19 year old girl who began receiving positive attention from males and females alike after losing a lot of weight and changing a lot post high school and doesn’t know how to deal with it in a healthy manner. afraid it’ll all go away if she doesn’t maintain the EXACT version of herself that first started getting all the attention.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/obd5t4/19_yr_old_girl_who_began_receiving_attention_from/", "title": "19 yr old girl who began receiving attention from males and females alike after changing a lot post high school and afraid it’ll all go away if i don’t maintain the exact version of my self that started getting the attention", "social_network": "reddit", "user": "thatwatertribegirl", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1625109842, "permalink": "/r/DecidingToBeBetter/comments/obd5t4/19_yr_old_girl_who_began_receiving_attention_from/", "nsfw": false, "first_save": 1635435388.4056165, "replies_charged": false}