{"id": "t5_2tand_t3_bcxk7q", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I had burnout 5 years ago, suffering from anxiety and depression. My level of fatigue was so high that some doctors thought that I may had developed chronic fatigue syndrome. I got better and my doctor said I no longer needed any medication (I was taking luvox and bup back then). After two and half years, I thought some symptoms (anhedonia, feeling a little bit melancholic, like a soft background melancholy, poor concentration and poor productivity)  were back again, but I decided that I needed to get back to therapy and not taking any drugs yet. After 6 months in therapy, my symptoms were still there, untouched.  I decided to go back to the doctor and he prescribed vortioxetine (initially a 10mg dose, now 20mg). I got better. That soft melancholy, the feeling of dissatisfaction and sadness as a background, vanished. However, my cognitive symptoms didn’t improve. Poor concentration, procrastination, poor productivity, high level of distraction were still there.\nThis week, my doctor decided to prescribe me ritalin (up to 30 mg a day)\nI took the first pill today (10mg) and got few side effects: dry mouth, headache, heavy head and drowsiness. Although I worked for 5 hours straight, the quality of my work was poor. Not that much concentrated and focused. I need to be productive, because I have to publish some articles and write my doctoral dissertation. I’m feeling anxious about that, as well.\nBesides that, I’m treating my migraines crisis, and I’m taking nortriptyline (20 mg) and Cyclobenzaprine hydrochloride (10mg) at night. I’m also meditating daily and exercising 3x a week. \n\nThat said, I’d like to ask: is there anyone suffering from those cognitive symptoms of depression/anxiety? Have you taken ritalin to improve poor concentration levels? How are you dealing with those cognitive symptoms?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bcxk7q/cognitive_symptoms_in_depressionanxiety_taking/", "title": "Cognitive symptoms in depression/anxiety. Taking ritalin to improve concentration. Need some guidance", "social_network": "reddit", "user": "briggitethecat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1555203918, "permalink": "/r/DecidingToBeBetter/comments/bcxk7q/cognitive_symptoms_in_depressionanxiety_taking/", "nsfw": false, "first_save": 1635438293.1411233, "replies_charged": false}