{"id": "t5_2tand_t3_ivunth", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "*Edit: This sub is amazing. I appreciate everyone's kind words. I have a very small social circle so I don't hear a lot of \"proud of you\"'s in my life. You all have made me very emotional today in the best of ways. I'm glad my story has motivated some of you as well. A few people have messaged me personally and I will help anyone looking for a little advice or push in the right direction. Sometimes that is what we need. I am going to comment on my own post with a few more things I had learned categorized by \"work\", \"college\", and \"life\". I didn't want to make my OP any longer but we are all in different places so maybe my tips will help :-) You all rock!!!!!!* \n\nThrow away account as I don't want to accompany this story with where I live or who I work for.\n\nI've followed this sub for a long time and every story I've read about success has always inspired me to do better. I feel obligated to pay it forward and hopefully my story inspires others to grab life by the horns and make it their own as well.\n\nI didn't graduated high school. I flunked some classes senior year and honestly didn't care. I did well in school when I tried but I just didn't try. I was lazy. All my friends went off the college and I just stayed around town and worked odd jobs. I worked mainly retail and moved up the ladder into management positions. It wasn't bad and at the time, I felt like I was doing great. I didn't have any real long term goals but always told myself \"I'm planning on getting my GED and going to college\" though I was only lying to myself.\n\nFast forward to age 22 and my father passed away. I won't go into that but I used it as an excuse to why I wasn't doing more with my life.\n\nI never quite had a car the way most people have a car. I had bought a car from a used dealer and ignoring payments. It got taken away. Another car I had, I was making payments but didn't pay my insurance. I took a chance on a yellow light once, and end up getting pulled over. My insurance wasn't valid and I think my tag was also expired. They took my license and my plate. I had my car towed back to my apartment, where it eventually got towed. This was just a string of irresponsible decisions and not understand the consequences of my actions. I never did drugs or drank more than I should. I wasn't a bad person, just a lazy one with no drive.\n\nAt 23 I had my first adult relationship. She had her life together and was going places. She took a chance on me and after 2 years of excuses for why I wasn't getting my life together, she broke up with me, and rightfully so. I had lost my management job in retail (no car and couldn't get to work. She drove me when she could but she had a life and couldn't do that every time). I was stuck in the catch-22 of no job to pay for a car and no car to get me to the job.\n\nI took the breakup really hard and for a good few months I was really upset with her for doing that to me. I was 25 at the time.\n\n**TLDR Intermission: I was lazy my whole life. Laziness lead to me having no car or job at 25 and my long term girlfriend dumped me because of it.**\n\nSomething clicked one day.\n\n*I am in the position I am in because of me. No one else put me in this position and no one will get me out of it other than my own decisions.*\n\nThis was the most important realization of my life and I believe this is step 1 to anyone trying to make their lives better.\n\nI made a list of what needed to be done to turn my life around. This was what I came up with:\n\n\\-I needed a car\n\n\\-I needed a job\n\n\\-I needed a GED\n\nI decided the GED was the easiest to accomplish. I was a pretty smart guy and I felt if I applied myself, I could do it. I called up the local testing center and signed up. The test was 2 months away. I ordered the \"GED readiness\" book from amazon and started studying. A big issue I still had was how was I going to get to the testing center. Each of the 4 tests were a week apart. I had friends but all of them were sick of driving me places. Public transportation is a thing where I live but for reasons, it didn't allow me to get to this testing center. I asked my friends anyway since I had no other choice. Most of them didn't even know I didn't have a diploma. This is where I learned the second lesson for a better life:\n\n*People are much more willing to help you when you are trying to help yourself.*\n\nTo my surprise they were more than willing to help and were very proud of me for going for it.\n\nI took all my tests and passed all but the math portion with flying colors. I now had my GED. This was an amazing feeling as I actually assumed I would never have it. A huge weight was lifted off my shoulders. And it wasn't nearly as hard as I made it out to be and was a little angry at myself for not doing it sooner.\n\nDuring this time, I also started working at a deli that was within walking distance of my apartment. It was crap hours and crap pay but it was something.\n\n~~GED~~\n\n~~JOB~~\n\nCAR\n\nTwo down, one to go. Keep in mind, I didn't have a long term plan at this point. I just figured these things were better than nothing.\n\nAfter getting my GED, the momentum of success really started. I become addicted to studying hard then getting a good grade on a test. It was the best feeling!!! A friend suggested I enroll at community college. I did well on the GED so why not. He said something very important that has stuck with me to this day. I consider this another important lesson:\n\n*The time is going to pass anyway. So why not doing something with it?*\n\nI looked in to what it takes to enroll. Turns out, I can get grants because I was poor AF and essentially go for free. But I had to go full time. I ignored the lack of car situation and enrolled. I would figure it out just like I did with the GED. I chose to do all my classes online. Aside from Speech and Foreign Language, I could get my entire AA online, which was great. I still had to take some of the tests in their proctored testing labs but I took the bus. It sucked and sometimes I got there an hour earlier than needed or waited an hour or two later but it was what it was. The first semester I got three A's and one B. The B was in meteorology and didn't know it yet but it was the last B I was going to get for the next or 9 semesters...\n\nI was afraid of federal loans but I took out a little bit of one to buy a cheap car when my first \"in person\" class, Speech. Also during the end of my first semester, I met the girl who I eventually was going to marry. She had just graduated from college and was a first year teacher. She was a huge support system for me during all of this and I know she wouldn't have given me the time of day had she not seen my drive to push myself forward.\n\nSo now I have a car, and I graduated with my AA with a 3.97 GPA. I got straight A's the rest of my time there. I was eligible to transfer to the University close by and continue my education. I did. I chose Economics as my major, as it looked like it was a pretty useful degree and I enjoyed the Intro class I took at community college.\n\n~~A.A Degree~~\n\n~~JOB~~\n\n~~CAR~~\n\nB.S in Economics\n\nBetter Job\n\nI learned another huge lesson during this time:\n\n*Success drives more success. There is momentum in it. As you check things off your list, new things appear on the list you thought would be impossible. They aren't impossible.*\n\n**TLDR Intermission #2: I graduated from community college just shy of 4.0, met the love of my life, and enrolled at a major university, going for economics.**\n\nBy this point, I was obsessed with school. I took all my classes online as much as I could and drove an hour to the ones I couldn't. It was tough. I got straight A's for the first four semesters.\n\nThe job update: somewhere along the lines, I had to switch jobs as the deli was going under. There was a restaurant in the same plaza. I applied and the only position they had available was a dishwasher. I said yes. I washed dishes for 6 months and eventually moved up to server and then head server. I was making $20+ an hour. I did this full time while in school full time.\n\nAt the end of my junior year (quasi-junior year. I was taking 4 classes instead of 5 a semester so it took me 5 years to get my degree instead of 4) I ended up tutoring a few 5th-6th grade kids through a family friend. It was nice money on the side. I jokingly mentioned to one of their parents if their place of work offered internships. He said yes. He worked in the aerospace industry. I didn't even know economics majors could work in that industry. I gave him my CV and he passed it along. I got an interview and ended up getting the paid internship for the summer. This was for a VERY large company and I cannot stress how huge a moment this was when I received the call. One of the best moments of life. This was another very valuable lesson I learned:\n\n*Share your goals with people. In this world, no one can make it entirely on their own and people can't help until they know you need it.*\n\nI did the internship that summer full time (while still serving part time on weekends). I was offered a position as a part-time retained intern while a finished my degree. I said yes. I am now working part-time at company XYZ, working part-time as a server, and doing the hardest two semesters of my life. I am driving to school, an hour away, 4 days a week. My life started from 5am and ended at 8pm every day. This was also when I got my next B, in Econometrics. I had been on the president's list ever since my first semester at community college. This should also be the time to say I had a full scholarship because of my grades. I had to take a few loans out the first few semesters but it is what it is. I graduated from University with a 3.7 GPA. I was also offered a full-time job at my company. I still work there today. This is what my list would have looked liked at this point in the order they were added.\n\n~~CAR~~\n\n~~JOB~~\n\n~~GED~~\n\n~~ENROLL in Community College~~\n\n~~GET a Bank Account to receive college money~~\n\n~~Pass all my classes~~\n\n~~Enroll at University~~\n\n~~Get a better job that makes more money~~\n\n~~Get internship~~\n\n~~Get retained at company~~\n\n~~Finish college~~\n\n~~Get hired full time at company~~\n\nThese are all the BIG steps.\n\nThere was a lot more lessons and introspection involved in my story but I went on and on as is. A few more things I learned were as followed:\n\n*The one who tries the hardest is the one who gets to the top. Not the one who is the most capable.*\n\n*Large goals involve hundreds of tiny choices that are hard to make. Success isn't a huge moment but a bunch of small moments.*\n\n*Celebrate each little victory. A dessert, a nice meal, a new videogame, a small gathering. This is very important.*\n\n*Starting something is often the hardest part. 99% of success is showing up. Cliche' but true.*\n\n**TLDR; I went from no job, car, or GED and ended up a financial analyst at a large aerospace company through a mixture of burning my ships behind me, working very hard, taking risks, asking for help when I needed it, and believing in myself. I can do it and you can too.**\n\nFor anyone who is still reading, thank you for letting me share my story with you. I'm a horrible writer so sorry if it wasn't engaging. This is the first time I've fully shared this with anyone.\n\nMy final advice to anyone deciding to be better...\n\nYour life is going to be better if you choose to make it better. No one else is going to change it but you. But I promise that the version of yourself 5-10 years in the future will thank you for your decision. That person is waiting to exist. So go F\\*\\*\\*ing do it!\n\nFeel free to AMA.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ivunth/i_went_from_no_hs_diploma_job_or_car_to_working/", "title": "I went from no HS diploma, job, or car to working as a financial analyst for an aerospace company. I decided to be better, here is my story.", "social_network": "reddit", "user": "GoodRetina", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3617, "down_vote": 0, "creation": 1600529519, "permalink": "/r/DecidingToBeBetter/comments/ivunth/i_went_from_no_hs_diploma_job_or_car_to_working/", "nsfw": false, "first_save": 1635436983.7050545, "replies_charged": false}