{"id": "t5_2tand_t3_o2skar", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "Back in October of 2020 I had an random work meeting called after hours. I walked in expecting some sort of problem that required some extra work to figure out. Instead I walked into a room with my closest friends waiting for me. They were concerned about me, physically and mentally. My anxiety and depression had been slowly showing its face despite my best attempts at keeping everything bottled up in my head. The fake smiles were apparently easy to see through, and I had been pushing everyone I loved away from me. They convinced me to start seeing a therapist to try and help me work through my own mind. I paired weekly sessions with KAP (Ketamine assisted psychotherapy) and really leaned into the process of seeking acceptance of myself, within myself. After a few months I truly started to embrace who I was over who I thought I was before. It wasn't until the beginning of May that I really came to accept it though.\n\nThen I woke up one morning, about a month before my 31st birthday. I awoke with such clarity regarding my happiness, or lack thereof really. I was overweight, had no motivation to do anything other than go to work, come home and smoke myself into a slumber. My diet was terrible, my physical activity was even worse. I had a girlfriend of 8 years, someone who I really didn't connect with any longer but was afraid to leave due to my own fear of being alone. I was anxiety ridden, the type of \"friend\" who cancelled plans last minute, make up any excuse in my mind to justify why I couldn't do this or that. Just all around a bummer to be around. That particular morning when I woke up and saw myself in the mirror I realized that I could change every aspect of my life that was keeping me down. There was no physical barrier, all mental. I had become content with being unhappy, and it was all that I had known.\n\nI swallowed my pride and started communicating with my now ex, about how I felt and how she felt regarding our relationship. It quickly came to light that neither of us were happy still and that we both had kept trying to keep things together out of fear of change. We amicably split up and went our separate ways while retaining a friendship, something that historically I was unable to accept. It was crushing at first, but as the weeks went by I came to value the independence that I had regained. I used the momentum of change to reorganize my household, finding myself in a place of constant creative expression. New artwork, new plants, even the small things like placing dishes in a new spot felt exciting. I started cooking for myself again instead of the constant delivery cycle I had become accustomed to. I still wasn't happy with my appearance physically, so I simply just started walking more which ultimately led to using my spin bike daily. I used the momentum of that to apply small tangible goals weekly like making my bed every morning, washing my face twice a day, flossing, cutting out pop/sugary drinks in general. I quit smoking cigarettes which I thought I would do until the day I died.  I found confidence to express myself through my clothing, switching from an all black wardrobe to currently wearing a tie dye shirt. I've recently met someone who makes me feel valued and empowered. \n\nI guess what I'm trying to say here is that I was lost in a void that I truly believed couldn't be filled. I had made myself believe I was some sort of \"dark\" person inside and couldn't accept happiness. I made the uncomfortable choice and shook up my entire life and it led to the most beautiful growth I could have never expected. If you're feeling stuck or lost sometimes the quickest way to the surface is already in front of you. Don't be afraid to take your life back, to live as you deserve to live. Never let anyone, and I mean ANYONE hold you back. Start small and celebrate the small victories just as much as the big ones. Even when I fail at something, I celebrate the effort that I put into it.  Every day is an opportunity to grow and do something better for yourself because **you deserve it.** By no means is my journey over, as I feel my life has just really started and I hope that if you're struggling in any way that you may find the inner resolve to get back to the things that make you happy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o2skar/at_30_i_woke_up/", "title": "At 30 I woke up", "social_network": "reddit", "user": "dawisp", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1624032295, "permalink": "/r/DecidingToBeBetter/comments/o2skar/at_30_i_woke_up/", "nsfw": false, "first_save": 1635435389.2042315, "replies_charged": false}