{"id": "t5_2tand_t3_d0fuex", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I'm following my dream of working in veterinary medicine. I'm a clinical externship and a certification exam away from becoming an approved veterinary assistant, and plan to enroll in vet tech school after I pass. \n\nI got a part-time job working at a dog boarding and day care facility that I can work around my clinic schedule. Despite being around animals all day, I cannot find enjoyment in this job. There's this very strict hierarchy there that is crushing my ego. I came from being a supervisor in retail, and being at the bottom of the totem pole again is hard enough without \"managment\" stressing the \"importance\" of \"knowing your place\". There was this weird meeting about how no one but managment is allowed to be seen by customers, talk to or acknowledge them. We were told very sternly we are by no means allowed to even go to front desk if we have a question, we have to wait by a gait until they see us on the security camera. It's demeaning. And these managers are very young and don't explain things tactfully; almost as if they are high schoolers telling someone they cant sit at their table. It's a very weird environment and it's been making me feel hopeless and stupid.\nI want to be better and put my ego aside, and relax and accept that this is just a temporary job to get me by. How can I just let things be and find enjoyment in a simple job?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/d0fuex/struggling_to_find_joy_in_my_current_situation/", "title": "Struggling to find joy in my current situation, and it's making me want to give up on my goals", "social_network": "reddit", "user": "vriksasanaRx", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1567772030, "permalink": "/r/DecidingToBeBetter/comments/d0fuex/struggling_to_find_joy_in_my_current_situation/", "nsfw": false, "first_save": 1635437319.8505156, "replies_charged": false}