{"id": "t5_2tand_t3_jvuv8u", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "So I’ve come to realize that whenever my friends check up on me, I always have something “going on” in my life that’s affecting my mental health and causing me to be anxious. A friend of mine asked me the other day how I was doing and normally he’ll hear about how overwhelmed or depressed I feel and rather than offering my usual response, I told him that “things were going well and that I couldn’t complain.” His response was: “okay but seriously, how are you actually doing?”\n\nI thought that spoke volumes of my overall attitude and disposition in life. Yes, it’s important to address my mental health and take steps to find healing but I think part of that process is learning how to be thankful for the big and small things. I have a wonderful family, I have great friends, I’m in good health, I’m working towards my goals, I have a job that’s providing me a bit of financial freedom. Covid-19 has destroyed many families (whether it be mental, physical, or financially) and my issues do not even come close to the immense suffering that people are currently enduring. Life is what you make of it, folks. There will always be something to be miserable about, and I think it takes great courage and resiliency to say: “hey my life may not be where I want it to be, but I am pretty darn blessed.”", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jvuv8u/doing_well_and_my_friends_are_in_disbelief/", "title": "Doing well and my friends are in disbelief", "social_network": "reddit", "user": "2020ismyyear", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 52, "down_vote": 0, "creation": 1605626714, "permalink": "/r/DecidingToBeBetter/comments/jvuv8u/doing_well_and_my_friends_are_in_disbelief/", "nsfw": false, "first_save": 1635435586.5631888, "replies_charged": false}