{"id": "t5_2tand_t3_gcm07n", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "In the midst of quarantine, I was feeling kind of down. Actually, really down when I hit rock bottom. Never had suicidal thoughts, but I did begin to question myself and the life I was living and what it would look like 10 years, 20 years down the line if I just continued to live the same way. \n\n Since the beginning of quarantine up until the beginning of the last week, I was doing the bare minimum work-wise due to self limiting beliefs and making up excuses for why things can't get done. It was at that point last week where I realized, if I don't do things differently, my life trajectory will stay the same, which is not looking too great. I do alright for myself, but it's not enough to bring myself and my family out of our current financial situation (very average middle class). \n\nI then came to realize that there hasn't been any significant achievement in my life yet (mid 20's) and I've been completely complacent throughout everything... I used to blame things that happened to me and my family when I was in middle school and high school for me not being in the places I wanted to be. I went onto college, at my parent's volition, and half-assed the classes and partied too often. I didn't have a plan on what I wanted to do, but just wanted to get the degree for my parents. I knew it was important to them. \n\nAfter university, I fell into my current field and still didn't take it too seriously my first year. My second year, I became a bit more experienced and progressed, but still not at the point where I wanted to be financially. I kept on making excuses for why I haven't reached the level of success I want to reach and why other peers have made it there. It was when I hit rock bottom last week that I realized it's my own fault for being complacent my whole life and not taking back the wheel. It was my own fault for having spurts of motivation and then falling off again. Similar to how I approached the gym since freshman year of college. I could do a 6 month routine for 2 weeks straight and then I miss a few days and start all over. And I was wondering why I don't have humungous pecs. \n\nI really haven't felt this level of clarity before hitting rock bottom and feeling like absolute shit. I just roasted myself for all the things I've fucked up on for my entire adult life. All the bad habits (weed, porn, nicotine, pure laziness) I've picked up over the years all of a sudden seem to be beatable. I threw all weed paraphernalia in the garbage, deleted my NSFW throwaway, nicotine I've been good for 3 weeks now, and I've been reading all those books that I knew would benefit me, but have been collecting dust for a few years. \n\nI guess the point of this post is everyday is a clean slate. You don't need to live by what happened to you in the past. It's up to you to change the trajectory of your life if you want it to change. No one is just going to hand you a rope to climb up, you have to get yourself out of the hole if you're in one.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gcm07n/hitting_rock_bottom_and_being_brutally_honest/", "title": "Hitting Rock Bottom And Being Brutally Honest", "social_network": "reddit", "user": "BeautifulValuable7", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1588487732, "permalink": "/r/DecidingToBeBetter/comments/gcm07n/hitting_rock_bottom_and_being_brutally_honest/", "nsfw": false, "first_save": 1635436062.2011843, "replies_charged": false}