{"id": "t5_2tand_t3_n5hgyf", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Dear members,\n\nI have attended a webinar on the subject of the importance of saying NO.  \nhere are my notes, I hope it helps :) \n\n  \\------------------------------------------------------------------------------------------------------------------------------------\n\n\\- Rebrand the meaning of NO\n\no What does it mean to me when I say NO: feeling of guilt, selfish, arrogant person\n\no What does it mean to me when I say YES: being helpful, the need to not hurt the feeling of others\n\n\\- Saying NO:\n\no I Have the RIGHT to say NO\n\no Saying NO represents confidence and self-respect\n\no When I say NO to someone, it doesn’t mean I am rejecting the person but the request\n\no Saying NO doesn’t mean I dislike the person \n\n\\- Anyone also has the RIGHT to request something from me\n\n\\- And I have the RIGHT to say NO to the request\n\n\\- I don’t need to be liked by everyone \n\n\\- Ask yourself:\n\no Do I want to help this person?\n\no Do I have time for this?\n\no Why do I want to help this person?\n\n\\- Learn to say NO by knowing WHY you want to say NO\n\no For me its TIME, Time = Money \n\no You live only once\n\no Once you start to respect your own Time you have the reason WHY to say NO\n\n\\- Have a vision for your life to know where you want to invest your time \n\n\\- Once you start to say NO you will filter out the right people for you \n\n\\- Once you say NO to a certain request, suddenly no one will come to ask for it again\n\n\\- Categorize requests that you get to 3 (the traffic light technique)\n\no Red= Absolutely NO (Would you steal for me?)\n\no Yellow= Rather NO (Would you do this work for me?)\n\no Green= Rather Yes  (Would you help with this if you have time?)\n\n\\- What scares you to say NO?\n\no Avoiding conflicts? Conflicts are part of our lives, you can't satisfy everyone (As Jordan Peterson said: Delayed conflict is multiplied conflict) \n\no Fear of abundance? People who don’t respect your time doesn’t belong in your life\n\n\\- In which situations you have a problem in saying NO? is it work? Family members? Partner?\n\n\\- If you don’t have boundaries and rules, you will always play by others rules \n\n\\- People will push your boundaries as long as you let them\n\n\\- Revise your values and remind your self \n\n\\- How to find out your values? Use this technique\n\no Think of someone whose actions make you angry\n\no For example, if someone makes you angry by lying your value is honesty\n\n\\- Reactions when someone asks you to do someone for them:\n\no Passive – you agree to avoid conflict\n\no Assertive – let's talk about it, I don’ want to do it because …. (I don’t have time or I have something else to do)\n\no Aggressive – you say no but in a very aggressive way \n\no Passive-aggressive – oh really? You don’t have time to do this for me? Heh (sarcastic laugh)\n\no Manipulation – oh so you don’t want to help me? Ok, I will remember this if you will need something from me later!\n\n\\- If you were raised by parents who were always helpful and never said NO, you will tend to think that it's correct, people will sense that and they will use you.\n\n\\- Manipulators will always make you feel guilty \n\no They attack your emotions\n\no They act like a poor person who nobody wants help \n\no They act aggressively (threatening) \n\no They will want to be above you\n\no They will compliment you a lot \n\no They will degrade you \n\no Intellectual bullying (for example they use advanced/professional words to make you feel stupid)\n\no They pressure you by the time \n\n\\- ALWAYS STAND UP TO THE MANIPULATOR, never ever avoid eye contact\n\n\\- Some manipulators don’t even know they are manipulating\n\n\\- Phrases to use on manipulators:\n\no I feel you are pressuring me now, I need time to think it over (repeat if necessary) \n\no Put yourself in my position, would you do it?\n\no I feel you are trying to scare/threaten me? Am I right? \n\no What you are doing right now is clear manipulation/emotional abuse, that does not work with me, if you don't change your way/tone there is nothing to be discussed between us\n\n\\- Rights of assertiveness:\n\no I have the right to judge my behavior thoughts and emotions and to take responsibility for their initiations and consequences. Others may influence my decision but the final choice is mine.\n\no I have the right to offer neither the reason nor excuse to justify my behavior. Others may try to manipulate my behavior and feelings by demanding to know my reasons and by trying to persuade me that I am wrong but I know that I'm the ultimate judge.\n\no I have the right to judge whether I'm responsible for finding solutions to others' problems. If I fail to recognize these assertive rights others may choose to manipulate my thoughts and feelings by placing the blame for their problems on me.\n\no I have the right to change my mind. Others may try to manipulate my choice by asking that I admit or by stating that I am responsible it is never the last unnecessary for me to justify my decision. \n\no I have the right to say I don't know. \n\no I have the right to make mistakes and be responsible for them. Others may try to manipulate me having me believe that my errors are unforgivable that I must make amends for my wrongdoing by engaging in proper behavior. If I allow this my future behavior will be influenced by my past mistakes and my decisions will be controlled by the opinions of others. \n\no I have the right to be independent of the goodwill of others before coping with them. It would be unrealistic for me to expect others to approve all my actions regardless of their merit. \n\no I have the right to be illogical and making decisions. \n\no I have the right to say I don't understand \n\no I have the right to say I don't care. \n\n\\- Assertiveness rules:\n\no Show understanding:\n\n§ I understand your situation but….. \n\n§ Thank you for choosing me to help you but…\n\n§ I would love to help you but….\n\n§ I don’t think you will like my response but….\n\no Say your point of view \n\no Offer an alternative solution\n\n\\- The scratched CD technique: \n\no You need to be calm\n\no Repeat your request or sentence", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n5hgyf/saying_no_defines_who_you_are/", "title": "Saying ‘No’ Defines Who You Are", "social_network": "reddit", "user": "Posty1111", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1620225605, "permalink": "/r/DecidingToBeBetter/comments/n5hgyf/saying_no_defines_who_you_are/", "nsfw": false, "first_save": 1635435104.5811856, "replies_charged": false}