{"id": "t5_2tand_t3_e72m0y", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I woke up this morning feeling emotionally disconnected. It’s near the holidays so everyone is insanely busy and i’m aching to see my loved ones again but i forget that people get too caught up in their own lives and it sometimes makes me feel forgotten. It makes me feel like i should disappear and it’s so frustrating because i don’t want to feel that way. \n\nI’ve been working on my self worth lately bc giving myself scraps at the table isn’t enough anymore. i deserve more. to snap myself out of that gloom, i remembered a tip about listing 10 things i’m grateful for after waking up. it sounds silly, but i thought to myself while showering. \n\n1. I’m grateful for a loving mom. \n\nyeah she’s hard on me and she doesn’t understand sometimes because i’m first generation born in the US- she immigrated here. but recently we’ve started to understand each other more as i get older. \n\n2. I’m grateful to be able to have a hot shower. \n\nit’s cold in california now\n\n3. [...] to have a roof over my head\n\n4. [...] to not worry about my next meal\n\n5. [...] that i really do have friends around me who care. \n\ni have wonderful laughs and memories with them. i’m not left behind. \n\n6. [...] that i have wonderful hobbies to indulge. \n\ni got back into painting and reading recently. it’s soo refreshing to invest myself into such a simple activity in our fast paced lifestyles. \n\n7. [...] that i go to a wonderful 4 year college\n\ni should savor all of the experiences and explore for more. \n\n8. [...] i can recognize, cope and control my emotions better than before. \n\nat this point, i realized how i’ve diffused my tunnel vision of self pity and feel proud at how i’ve emotionally matured over the years. \n\n9. [...] i can take it easy \n\n10. [...] that there’s a lot more to be grateful for than i realized if i step back and breathe\n\nthis was just my experience this morning but i hope this can help some people! \n\ntldr; count your blessings. it calmed me down and i felt more in control of my thoughts.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/e72m0y/10_things_im_grateful_for_tldr_count_your/", "title": "10 things I’m grateful for (tldr; count your blessings. it calmed me down and i felt more in control of my thoughts.)", "social_network": "reddit", "user": "uwuart", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1575657560, "permalink": "/r/DecidingToBeBetter/comments/e72m0y/10_things_im_grateful_for_tldr_count_your/", "nsfw": false, "first_save": 1635435565.5331416, "replies_charged": false}