{"id": "t5_2tand_t3_myzx71", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "Been living on my own since 17 in a country away from my parents. I was a pretty troublesome kid. Very confused, didn't know what to do with life. \n\nI'm Aspergic. Pretty high functioning but obviously this came with difficulties interacting with people. When I moved back to the UK things were fine until 2013, where I lost my Grandpa to Dimentia, my closest cousin to suicide at the age of 24 and then diagnosed with Crohns disease all in one month. \n\nIt all really hit me hard. My Crohns has had a massive impact on my life.\n\nThen I discovered drugs. Pretty hard ones. I'm talking getting off my face every day for at least 7 years. It didn't seem like there was any hope. Eventually, I ended up in prison for 3 months. \n\nI vowed to change things and here I am. \n\nI've quit drugs,I don't drink, I actually spend time looking after myself and my health.\n\nI have had a stable job for 8 months as a carpet fitter. I got my FIRST car 3 weeks ago and I'm gaining weight, I'm almost 70kg for the first time in my life!\n\nNow I use logical thinking and avoid any negativity. I don't lose my cool anymore. I feel like I could take on the world.\n\nI've finally found peace, content and structure in my life. \n\nI still have a long way to go and I'm willing to work my arse off every day to get further.\n\nI knew I could accomplish whatever I wanted to and now I feel like I can finally prove it.\n\nYou can turn your life around. I promise you all.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/myzx71/turned_26_yesterday_and_im_finally_proud_of_where/", "title": "Turned 26 yesterday and I'm finally proud of where I'm taking my life. If you knew me 3 years ago, you'd be proud too.", "social_network": "reddit", "user": "BoisterousLlama", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1686, "down_vote": 0, "creation": 1619449990, "permalink": "/r/DecidingToBeBetter/comments/myzx71/turned_26_yesterday_and_im_finally_proud_of_where/", "nsfw": false, "first_save": 1635436129.281998, "replies_charged": false}