{"id": "t5_2tand_t3_iijfzm", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Title really sums it all up.\n\nMy bf is an amazing human being. I can say without a shadow of a doubt that he loves me. He cares for me in every way imaginable. I call him during panic attacks because he is the only person I can even imagine calming me down. He listens to me rant about my abusive family. He put me to sleep over video call by talking softly to me while he lies in bed himself. We spend time together virtually- Texting, Calling, Skyping- during the day. I have a full time job, so not 24/7, but when I get off work we are inseparable. I've never felt like he hasn't thought of me during the day. He's kind, compassionate, loving, and really- the ideal boyfriend.\n\nThis weekend, my parents are out of town and I wanted him to come over to my place. I've been planning it for about a month and was going to get his favorite foods, a dumb movie for us, and candles to cuddle. It was going to be an evening event, for 2 nights. ( I wanted him to be able to work on his stuff and I had work, So I would just pick him up 2 nights around 7)\n\nBecause of a shit ton of trauma he's had to deal with, in addition to him being nervous about the new school year, his car being rear-ended and being in the shop, his need to research a property his family business is going to be buying through his inheritance money... Needless to say- He's been really busy. He also voiced this to me multiple times and has complained about how he feels overwhelmed within the past 2 months in particular.\n\nI had been planning the surprise for a month, but told him on Tuesday, so he could work out whatever he needed to do. On Tuesday he said he was excited and could make it. My mindset when I was planning this was for it to be a relaxing break from all the shit he's had to deal with, and I was excited to be able to bring him some peace.\n\nCut to wednesday- His new school is all online, and he is having a lot of trouble navigating the website. Due to trauma I don't want to disclose, he did not do well last year in college (and was in a situation in which NO ONE would have expected him to be able to do well). He is nervous about stepping back into the academic world and wants to do well. For his hardest class, he needed the professor to give him a code to even START the assignment- which is a week's worth of work all due on Monday. In another class, he expressed to me doing 3+ hours on a single video, and noting that the quizzes were difficult as well. With this time crunch, he expressed to me on Thursday that he felt like he could only do one night so that he could work between 7-12. At the time, I told him that it is totally fine, and I genuinely want him to do well and to be ambitious about his future.\n\nI even said to him: \"I would be completely fine if you said that you couldn't do either nights!\" (In a non-joking voice.)\n\nThis morning, I text him and ask what time I should pick him up. He says around 7, and he will let me know at 6 (I am an hour drive away) if he can do it tonight. I was crushed. I felt betrayed. I felt like I was the only one contributing to the relationship- when in reality- He most likely contributes more. All those 1 am calls of talking me down from panic attacks, all those soft good morning texts, all those random calls during the day about things he's found funny that he knows I would too... In the moment, it all just went forgotten. I was so upset that I told him that unless its convenient for him that he never spends time with me, which is bullshit. He spends a ton of time with me. And in the call, he starts breathing heavy, and is clearly crying, just like me. And he says \"I feel like I'm giving you so much, and if it's not enough I don't  know what else to do... I don't have anything more.\" And it broke me. It entirely broke me. I saw the big picture of how absolutely disgusting I was treating him. I had completely lost sight of why I wanted to do the night-over in the first place. I instantly tried to calm him down the way he calms me down, and started spewing my apology. I really was taking EVERYTHING he had done for me, for granted, and it hit me how HORRIBLY I treated him. I drove over to see him immediately after we got off the phone, and we talked through it all, did some cuddling, and he said that he forgave me. I explained to him that i was 100% in the wrong, and was being a downright disgustingly entitled girlfriend. We are both all good now, and are chatting like normal via, text and whatnot.\n\n\\_\\_\\_\\_\n\nI will note that this is the first that I've ever done something to this extent. All our other fights have been 1 hour or less. We have only been dating about 1 year now, Not sure if that matters. It is not a recurring event, but the fact that I said so many things I didn't mean and hurt the person I love most- it really breaks me. We have been apart for 3 hours now, and I am still crying about how I hurt him like this.\n\nPlease, any advice on how to deeply apologize even more would be helpful. Any advice on how to better myself as a person to not act like this in a fit of rage, would be helpful. Anything really to help- This is the first time that I've treated him like this, and it WILL be the last.\n\n&#x200B;\n\nTL;DR: My boyfriend treats me insanely well. I like to think I treat him good as well. I made plans for him and even though he expressed feeling overwhelmed with everything in his life (justifiably), when he told me he couldn't make it, I got really upset. \n\n&#x200B;\n\nEdit: Added TL;DR", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iijfzm/long_i_am_absolutely_disgusted_in_the_way_i/", "title": "[LONG] I am absolutely disgusted in the way I treated my boyfriend today. How can I make it better?", "social_network": "reddit", "user": "New_Locksmith_8409", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1598663029, "permalink": "/r/DecidingToBeBetter/comments/iijfzm/long_i_am_absolutely_disgusted_in_the_way_i/", "nsfw": false, "first_save": 1635437020.9895165, "replies_charged": false}