{"id": "t5_2tand_t3_n6bo8w", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Growing up, it’s the age old tale of me being the nerdy emo kid that got bullied at school. Every day was a constant barrage of punches and being called names. \n\nI’m 30 now and I’ve always considered myself a “nice guy”, not in the same way as the internet’s idea of a nice guy I guess? But just that I think I’m actually pleasant with people and people always comment on me being nice. \n\nHowever, I’ve reflected a little bit and realised that I actually have some defensive flaws that I need to change that I could potentially blame on my bullying that actually make me feel like I’m a bully:\n\n-\tI reflect negative comments by finding something negative about the other person\n-\tI feel like I belittle people for not knowing things they should and only realise after I’ve done it\n-\tI’m very to the point to where things seem black or white and it seems very dismissive when I think people are wrong\n-\tI don’t control my body language well and 100% let people I don’t want to speak to know it\n-\tI once made a joke about my friends dead grandma (I infinitely regret this)\n-\tI constantly make comments about people on reality though shows in a negative way or try and find their flaws if I think they’re somehow better than me\n\nIt’s a lot and there’s probably more but I just wanted to spill my thoughts onto some sort of page. I need to change something and the realisation that even if I *am* nice to some people but then there’s something to improve. I need to change to be the best me that I can be.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n6bo8w/i_had_a_realisation_that_im_not_as_nice_as_i_think/", "title": "I had a realisation that I’m not as nice as I think", "social_network": "reddit", "user": "Intothewildrc", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 30, "down_vote": 0, "creation": 1620319554, "permalink": "/r/DecidingToBeBetter/comments/n6bo8w/i_had_a_realisation_that_im_not_as_nice_as_i_think/", "nsfw": false, "first_save": 1635437664.740476, "replies_charged": false}