{"id": "t5_2tand_t3_75yj63", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "Does anyone have any tips on how to optimize idle time?  A while back someone made me aware of the concept of \"fridge apps\", things like Facebook and Reddit that i would continually check throughout the day only to expect that there was nothing new or worthwhile.  I have since deleted Facebook, but still find myself using Reddit to fill idle time.  My work is sporadic and random.  Much of the time i have 5 minutes or so between conference calls, so i go smoke (working on that too) or i just sit and scroll through Reddit but it is never fulfilling.  I have felt like this is a gigantic waste of time since i am getting little benefit out of it.  The thought occurred to me last week to start thinking about life from a \"tomorrow\" point of view, as in thinking throughout the day \"tomorrow, will i look back on today and think, i am really glad i spent that time refreshing Reddit\" or \"a few years from now, will i be happy that i never stopped smoking?\".  when i think about life in this way i am finding that i want to be progressing more every day because i want to be able to achieve my goals and not look back and think of all the time i wasted.\n\nSo what are your suggestions for filling this idle time?  I am studying for certifications, and putting off reading books, but have not found that i can fit that in to these disconnected bits of time.  I feel like i can only really get something accomplished when i sit down and dedicate time to it, which works but at the end of the day i feel like i wasted precious hours doing essentially nothing.  \n\nThank you", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/75yj63/finding_ways_to_optimize_idle_time_and_take/", "title": "Finding ways to optimize idle time and take advantage of the time I have left.", "social_network": "reddit", "user": "drfalken", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1507829185, "permalink": "/r/DecidingToBeBetter/comments/75yj63/finding_ways_to_optimize_idle_time_and_take/", "nsfw": false, "first_save": 1635435172.1061983, "replies_charged": false}