{"id": "t5_2tand_t3_pxzj9k", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Officially an adult, but still dependent on my parents financially. My parents are both sick (liver problems, brain infection), but I never contributed anything to my family (not giving any emotional support), not even doing house chores, literally a parasite in the family. You see I have a problem of being toxic, cynical, and procrastinating. \n\nI consider myself a Karen because I always give people advice and rob other's happiness away. For instance, threatening my siblings not to play games but I ended up doing so. But my main purpose is to not let them end up like me, who have problems with self control, but that actually made them worse, as they learn how to lie and are more rebellious than before. \n\nI have extremely weak willpower, which brings me to my second problem of procrastination. I always tend to finish my assignment in the last hour before the due date. I consider myself an extreme hedonist, in which I spend most of my time on the internet, social media, and youtube for entertainment. Yup, I let time fly just like that, completely neglecting my lecture and assignments. I feel like it's a waste to spend money on my studies, definitely a letdown for my sick parents. I don't want to stay on like this, I feel guilty every night before bed. Tried many techniques to change me (eg: deleting apps, blocking websites), but nothing ever works. \n\nI'm a complete coward outside my home. I have social anxiety when interacting with people, that's also one of the reasons why I don't have many friends. \n\nI guess that's all about me. I appreciate your time and your care. It's very hard to find people like you, who are willing to care for others. I hope I can get some feedback on how to change my imperfect self into a better person. God bless :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pxzj9k/can_a_heartless_toxic_weak_man_ever_change/", "title": "Can a heartless, toxic, weak man ever change?", "social_network": "reddit", "user": "MountainOne3769", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1632934308, "permalink": "/r/DecidingToBeBetter/comments/pxzj9k/can_a_heartless_toxic_weak_man_ever_change/", "nsfw": false, "first_save": 1635435547.005225, "replies_charged": false}