{"id": "t5_2tand_t3_mdptl8", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Whenever depression is brought up people tell you to exercise. And while I absolutely agree that exercise is fundamental to being healthy and it absolutely provides both an instant and a long term boost in well being, to exercise you need to be appropriately fed in order to have the physical strength to do it, and I dont see that mentioned. \n\nThe problem is not only that preparing food requires a certain amount of organisation (making sure the fridge is full, the kitchen is usable, and time managing several meals into the day) and often depression leaves you in a state in which you push off eating until you're absolutely starving and just eat the bare essential like a bowl of cereal to keep you going (which is never enough fuel to actually face the day). I'm finding the problem to be that depression also kills your appetite, and the act of eating in itself, not just everything around it, becomes very challenging. \n\nIt becomes hard to eat more than a few nibbles of something which then sit in the stomach like rocks and have you feeling queasy (more of an anxiety symptom I guess, but the two are hand in hand for me) and still really hungry but also unwell. Even when the will to exercise is there, the difficulty in getting enough fuel into me makes it impossible. I can barely manage to go for a slow walk, because I'm not feeding myself. Many days I will not move nor eat, and the two (eating and movement) form a vicious cycle together which i think is a fundamental block of dealing with depression. \n\nI would love to see more resources to help with the energy intake aspect. I dont know if this is the place to post, it's just stuff I've been thinking about.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mdptl8/exercise_is_always_suggested_to_help_with/", "title": "Exercise is always suggested to help with depression. What about suggesting ways to manage eating enough to be able to energetically afford exercise?", "social_network": "reddit", "user": "Procrasturbator2000", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1616768758, "permalink": "/r/DecidingToBeBetter/comments/mdptl8/exercise_is_always_suggested_to_help_with/", "nsfw": false, "first_save": 1635438446.1277137, "replies_charged": false}