{"id": "t5_2tand_t3_n4ef1u", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "My life has been incredibly not good for these past 3 years of my life, well honestly it’s been longer than that but these last three years stand out more so. The other day my friend reminded me that in like 6 months I’ll be 21. 21 years of age and I would’ve not achieved anything. Currently I’ve done like only 2 semesters of community college then decided to “take a break” out of mostly laziness. The big bad COVID set me back a bit and I had to work at a shitty low paying job. Then my old job hired me back finally. Which is still a less shitty low paying job where I work my ass off. I’m fat, ugly, terribly single, still depressed and heart broken, underachieved. It’s that reminder that I’m 6 months I’ll be 21 and I am currently nothing. That thought reminded me in 5 or 6 years I haven’t heard the words “I’m proud of you” or “I’m happy for you” or anything like the sort. No one roots for me. No feeling of happiness or satisfaction I have felt in almost a decade. No luck or success in almost a decade. Last night I thought about all these things and I finally decided that I don’t know how but I have to improve myself. I have to better my life somehow. It’s literally sink or swim. I know it’s gonna be hard but I have to do it. I have to improve myself somehow. My first step is I am probably gonna try to concentrate on the first steps of getting fit. That will hopefully improve my overall mood, self esteem, luck in finding a romantic partner,  and make me feel less lazy and tired. Anyone have any advice on working out, or anything else related to helping improve oneself drastically? Thank you everyone and sorry for the very long post.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n4ef1u/i_might_fuck_around_and_finally_get_my_life/", "title": "I might fuck around and finally get my life together", "social_network": "reddit", "user": "NickyPoo9919", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 28, "down_vote": 0, "creation": 1620096955, "permalink": "/r/DecidingToBeBetter/comments/n4ef1u/i_might_fuck_around_and_finally_get_my_life/", "nsfw": false, "first_save": 1635438106.8626854, "replies_charged": false}