{"id": "t5_2tand_t3_qgx6bn", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "b69cf201-6737-4217-b486-9096135546b8"], "text": "This is a trick I used to quickly break a lot of bad habits this year. This knowledge is inspired by a certified behavioral scientist named BJ Fogg, and some trial and error on my own part. Note: I'm not a doctor, if you have a serious addiction go see a professional yada yada, obvious stuff out of the way.\n\n## The WDM lie\n\nWDM is pseudo advice that relies on Willpower, Discipline and/or Motivation to make/break a habit. It's a lie pushed by your favorite gurus and the MSM to keep you a slave to your bad habits, and worse, jamming online search results with misinformation so you can't actually get genuine help. Almost any news station, verified YouTube channel or well-known self improvement author will be pushing this lie to you, and they usually know they're doing it because they themselves have made it to success, so why would they tell you false advice? Because they don't want you as competition, they want money and power. Are there exceptions? Definitely, but they're not gonna be YouTube famous or have any influence on pop culture.\n\nWDM is tricky to spot. For example \"If you want to be successful, put in the work\" and \"If you fail your bad habit the first time, you absolutely cannot fail the 2nd time\" all sound humble, but are two dangerous examples of WDM. WDM doesn't work because it's an emotion that does nothing but create stress. It's like saying \"Are you fat? Just don't be fat bro\".\n\n## How to actually break bad habits\n\nI'll use smoking as an example, but this should work for any common bad habit.\n\n1. (Optional) Change your environment to make the habit harder to do. Take the cigarettes and put it somewhere hard to access. Sometimes you can't do this. For example, if you're living with your family who frequently engages in bad habits, or if you're in some corporate office / external environment that encourages the bad habit and you can't do anything about. Don't worry, this isn't a necessary step, it'll just make things quicker.\n\n2. Whenever you catch yourself smoking, consciously stop for a minimum of one second and treat any additional seconds as extra credit in your mind.\n\n3. Each time you smoke, try to increase that time of consciously not smoking by a bit longer. You won't always be able to. One time you might go 20 seconds, and the next you'll only be able to do 10. It's fine. Despite these minor setbacks, your brain will get better and better at it each time without needing WDM.\n\nEventually you will get to a point where you stop in the middle of smoking for so long, your brain will go \"Eh, I don't wanna smoke right now\". At that point, your bad habit is doomed. So keep this up, continuously take those breaks and extending that time, and don't feel discouraged if you have a couple days where you can't. The minimum is one second and if you do that, you win every time. Your brain will adapt to not doing the habit in a way that cause very little (if any) psychological stress, and before you know it the bad habit will be gone.\n\n## The Science\n\nIf you want to know the actual science of your brain adjusting, look into neuroplasticity. In a nutshell, your brain physically alters itself based on the behaviors you do every day. This is why there is a high amount of psychological stress cutting out bad habits with WDM, because your brain is adapted for one lifestyle, not the one your consciousness is trying to tell it to do. By using the method above, your brain can naturally adapt to developing the new habit no faster than its own pace.\n\nI'm kinda skimming over this for sake of making it easy for everyone to understand, but you can find the studies and evidence via a quick Google search.\n\n## \"This will take too long! I'll be 60 by the time I cut anything out\"\n\nIt goes by way faster than you think. Over the course of this year, I lost 51 pounds, cut out video games, and movies/anime. In my experience, it took about 1-2 months to cut out each habit.\n\nIf you have any doubts, just try it. Worst case scenario, it doesn't work.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgx6bn/how_to_actually_break_bad_habits/", "title": "How to actually break bad habits", "social_network": "reddit", "user": "SecretBooklet", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1635342745, "permalink": "/r/DecidingToBeBetter/comments/qgx6bn/how_to_actually_break_bad_habits/", "nsfw": false, "first_save": 1635436284.2953072, "replies_charged": false}