{"id": "t5_2tand_t3_q2yqcj", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "Been living my life scared. Going for safety and security. Choosing to live life safe and predictably. I mean there are reasons why I chose this way, but ultimately I am unhappy. I graduated college and I was lost in life and struggled with the real world. So I went the safe route. I did nursing. Now I live in a small town and I make good money for cost of living, but I find myself bored with my life. I am 30 years old, single guy, mentally tired, and unpassionate. Life feels like a drag with constant work and recover so I can work the next day. \n\nI want to travel, I want to move to a bigger city, I want to have my own business (don't know what in tho) I want to just meet bunch of people and form a bunch of relationships, and hopefully find the love of my life. Yet I am either too tired from work, too scared to leave my comforts to make a change. Its tough. My current life is very comfortable. I make good money, work is not too difficult, I work night shifts (which sucks), I am able to save a good chunk of money, work in a small college town but my life is dull. Maybe I want too much out of life. Other people would want the life I live, but I was always a big dreamer. \n\nI want to travel: I am scared to venture out in foreign land by myself and not knowing the dialect and having to navigate around. I would be completely on my own. How do I set up money? How do I communicate? I lack the balls to do it. Traveling inside the USA no problem, but out of the country? thats a big step for me. I have always traveled with family where my dad would set things up if it was outside the country. \n\nI want to move to bigger city: I am throwing away my comfort zone. My life right now is comfortable. I am knowledgeable on what to do on my floor, the people are nice, coworkers are chill, I make good money, rent is cheap. Throw that all away to live in a bigger city with more hustle and bustle, meaner people, I won't be as knowledgeable on the job, might be too much for me to handle, meaner coworkers, higher cost of living, to chase after something that might not even be there. The cheap rent, good money, and comfortable lifestyle here is guaranteed, but to move to a bigger city to possibly make more friends my age, maybe find the love of my life, live a more exciting life is not guaranteed.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q2yqcj/feel_like_i_am_living_my_life_scared_playing_it/", "title": "Feel like I am living my life scared. Playing it too safe. Too lazy to make a change.", "social_network": "reddit", "user": "samantha145151", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1633571488, "permalink": "/r/DecidingToBeBetter/comments/q2yqcj/feel_like_i_am_living_my_life_scared_playing_it/", "nsfw": false, "first_save": 1635435960.0980697, "replies_charged": false}