{"id": "t5_2tand_t3_k3af1d", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Yesterday I woke up and decided to be better.\n\nMy entire life I've felt like I was living on autopilot. Selling myself short of living my dreams; following in other's footsteps instead of my own (due to controlling parents and abusive relationships that instilled a lack of self esteem in me). I got a DWAI in August and I'm slowly seeing the blessings it's bestowed - no longer drinking means I can work to rid myself of anxiety, saving money that I'd be spending on alcohol, eliminating friendships based on drinking, etc. I met the man I would like to marry (after, you know, a while longer). I finally -- for some reason -- feel free of everything that's held me back despite my DWAI consequences.\n\nYesterday I sat on my yoga mat in the sun and just felt overcome with emotion. I sat and cried, and it felt *good*. I journaled a bit and made a surface level plan to outline the next few months: DWAI stuff will be over in 4 months, then I can start planning to move out of state. I found my dream home, and I plan to start saving for it. I decided to begin every morning for the next 30 days with an hour of yoga and meditation, followed by 30 min of journaling to create a new morning routine. I'm going to stop ordering takeout & focus on cooking more (healthier, cheaper, and far more fun). I feel as if I'm slowly making peace with something that never really let me feel this empowered & I am excited to see where I end up in a year. \n\nI'm going to get out of bed, shower, and sit down & plan out a little more in depth of how I want the next few months to look (including hobbies, goals, etc). This feeling... it's nice. :-)\n\nHappy Sunday to you all - I hope it's a day well spent.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k3af1d/31_and_finally_waking_up_to_my_own_potential/", "title": "31 and finally waking up to my own potential", "social_network": "reddit", "user": "hauntedkittydragon", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1606660817, "permalink": "/r/DecidingToBeBetter/comments/k3af1d/31_and_finally_waking_up_to_my_own_potential/", "nsfw": false, "first_save": 1635435597.1792243, "replies_charged": false}