{"id": "t5_2tand_t3_nw3t2s", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "\\[M 33\\] I dont know if this is the right place to post this. This is not productivity per se I think.\n\nI'm afraid to do almost anything I haven't done before. Or I feel like I have very little agency in my own life. I have a decent paying job and some banked money - like 20-30k euro/dollars, but I'm not spending them on me. I used to have zero money, so spending money scares me and I dont feel pleasure in doing it. If I spent money on something or myself I feel like I'm stupid to have wasted this money and it takes he pleasure out of the activity I spend money on.\n\nThis summer I really want to get a stand up paddle board (I live 500 meters from water) and some hiking gear to go on small hikes. I thought of this like 2-3 months ago and spend alot of time researching what gear to get etc, but the activity still \"scares\" me. Like do I just go to the store and buy a board? And how does it acutally work when I'm by the sea? How do I get the board in the water? Do I need a life vest? Can I actually do stand up paddling? I have already wasted so many good summer days, so now I think it wont be worth it to buy a board this year :(\n\nIts the same with hiking. How do I know I got the right equipment? And maybe its alot of moeny to spend on something I won't do very much. And how do I know I will like it or that I got the stuff to the right price.\n\nAnother example I can think of is getting a car. I have friends who just drives around visiting and have so much personal freedom with a car. I would like to have one, but I simply dont know where and how to get a car? Also its a HUGE expense in my country (scandinavia), so getting a car will cost.\n\nI envy people who do stuff on their own and by themself. They seem so extremely happy with their hobby's and life. THEY DO STUFF AND TAKE ACTION. They see something they want and they buy it. They look at something they want to try and they try it.\n\nMeanwhile I'm over here and wanting to try and do stuff but can't put myself to doing it :( Makes me a bit miserabe. I'm 33 years old for gods sake!\n\nEDIT: To make matters worse regarding SUP (stand up paddle) I thought of getting a board AGES ago. In the meantime my ex and her new lover posted pictures on social media being out on paddle boards... So now I feel SO stupid for not having bought one myself a long time ago. And if I buy it now I will look super bad, and they will think I only got a board because they did :(", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nw3t2s/im_afraid_to_do_things_new_hobbies_or_buying/", "title": "I'm afraid to do things - new hobbies or buying stuff. I feel like I want it. But never do it.", "social_network": "reddit", "user": "Psychological_Reason", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1623266045, "permalink": "/r/DecidingToBeBetter/comments/nw3t2s/im_afraid_to_do_things_new_hobbies_or_buying/", "nsfw": false, "first_save": 1635437738.530071, "replies_charged": false}