{"id": "t5_2tand_t3_po6u53", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I just started my Senior year at college, but one day before the quarter started I decided to drop most of my classes to focus on my personal projects. I pondered upon the decision for a long time (as it meant pushing back my graduation date), and then, one day before the quarter started, I felt it in my gut: dropping my classes would be the best thing for me both personally and artistically. \n\nTwo days after the said decision, though, I've found myself feeling extreme fear. Most of the people I planned on collaborating with have just told me they won't be able to help me with my artistic projects during the quarter. I was overwhelmed with fear and found myself almost registering back to most of my classes to play it safe. I couldn't do it, though - I felt like I was giving up on myself and my goals by registering back on my classes. \n\nMy intuition guided me towards this decision, but I'm so f\\*cking afraid - so afraid and anxious that I found myself texting my therapist (she's not available, though). I can barely stop thinking and having anxiety. \n\n***The fear is that this was a mistake and  I'll waste all of my time - extending my graduation date for nothing.*** \n\nI guess I'm just asking for advice. Should I play it safe and register all my classes back (and then try to find the time to do my projects)? Or should I trust what my gut told me and dive into unknown waters? If I decide the latter, how can I make sure I don't waste my time?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/po6u53/i_just_took_a_big_risk_and_now_im_really_afraid_i/", "title": "I just took a big risk and now I'm really afraid. I have until the end of the day to play it safe.", "social_network": "reddit", "user": "JASC24", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1631638805, "permalink": "/r/DecidingToBeBetter/comments/po6u53/i_just_took_a_big_risk_and_now_im_really_afraid_i/", "nsfw": false, "first_save": 1635437390.211152, "replies_charged": false}