{"id": "t5_2tand_t3_kj4swv", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I wanna be so much better than I currently am.\nI want enough money where if I want something, I can just get it. \n\nI want my children, nieces and nephews even my god children to always be straight and too never need for anything. 🗣❗️I wanna be somebody people can depend on and come to about anything.. I wanna be able to walk around without shame about my decisions and be content with everything I’ve done in my life, I wanna be in the best shape I’ve ever been in.. I wish to improve my grammar and to have my grades up, I wanna be that top student in the class. I have the brains for it but don’t put in the effort.\n\nI want better control of my emotions, I wanna be more empathetic and sympathetic towards people. I want a genuine bond with somebody, I wanna look at my partner and smile knowing I could die for this person and not regret anything. I wanna live a long, meaningful life and travel around the world.. meeting new people. I wanna smile without having anything deep down hindering me from really meaning my smile. I wanna be the man, in my eyes and the people I keep around me.. I want genuine friends, I want to be spiritually, emotionally and physically connected with God. \n\nI don’t want my mama to worry about me.. I wanna be someone I’m proud to be and starting 2021, I’m putting these changes into action. 💯 I’m gonna work towards my goals and be successful, I’m gonna allow myself to fail and not beat myself up about it. Regardless of what happens in 2021.. I’m gonna make sure mentally, physically and health wise I’m straight. 🗣\n\nJust a vent to myself and affirmations.\n\nI’m not beating myself up anymore, about anything, or anyone for that matter. I’m gonna work out more consistently, pick up sports, meditate, eat right.. invest my money into stocks and real estate, get a nice job.. a car, my own modern apartment until I can get a house.  I wanna look good, and smell good.. and most importantly feel good. I wanna be the best possible CALEB GREENE. I’m done reflecting on the past and stressing myself out about things I can’t change, I’m done laying down all day and not doing anything, I’m done being addicted to my phone and letting people walk over me. I’m done playing with people’s emotions and letting people play with mine. I’m done being lazy and making excuses and always saying “I’ll start tomorrow.”, I’m tired of sugarcoating shit with myself . I’m realizing my problems and I will change them, I’ll become more enlightened, nicer, a amiable person. I’ll become more optimistic, more hard working and driven, more independent, more valuable. I’ll be somebody worth meeting and worth remembering; I’ll be better than my past, I’ll be better than my mistakes and I’ll learn from them. I’m gonna take myself and school more seriously, I’m gonna stop being so goofy about everything, I’m gonna stop going to social media when I have a problem, I’m gonna stop being this, shitty version of myself wasting my potential. \n\nTo everybody who doubted me, talked about me behind my back. I forgive you and it’s okay, to all the person who said “this is like the 3rd time you’ve tried to change , so whatever.” When I told them I wanted to better myself FOR THEM. I’ll prove you wrong, to everybody who took advantage of my feelings for them . I’ll make you regret it, to everybody who used to bully me and shit I forgive you, to everybody I ever disrespected or said anything foul too I apologize, and I won’t hurt or say anything mean to anybody else again.\n\nI’m so proud that Leroy Green was my father and I’m gonna be someone who Leroy Green is proud of having as his son. I promise, on my daddy. I’m gonna change for the better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kj4swv/i_am_changing_for_the_better_for_me/", "title": "I am changing, for the better. For me!", "social_network": "reddit", "user": "FallingBackInPlace", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1608769233, "permalink": "/r/DecidingToBeBetter/comments/kj4swv/i_am_changing_for_the_better_for_me/", "nsfw": false, "first_save": 1635435195.4697294, "replies_charged": false}