{"id": "t5_2tand_t3_aouhkg", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "Yeah I made it through 22 years without flossing my teeth and had very limited experience with professional dental hygienists. But late last month I had a free oral prophylaxis (the third in my whole life) and decided to start flossing so here I am.\n\nCurrently using floss picks. And after a quick googling I found out that it's unpopular pick for dentists because it's apparently less effective and hygienic than good ole floss strings, but personally, I think it's a good introductory tool to flossing. Using floss picks make flossing look less messy and scary and tedious. Which is why I picked it in the first place, because I expected a lot of gum bleeding.\n\nAlso, gum bleeding. This is the best part. Google told me that it's normal result for flossing for the first time and to expect it in the first two weeks. But I've only started two days ago, and I'm super delighted to see that the bleeding is 90% gone now. It feels super encouraging to brush my teeth and hardly see a smudge of blood mixed in what I spit out.\n\nPlanning to switch to floss strings after I run out of floss picks. And I hope to have the discipline to keep on it a month from now on (they say it takes 21 days to form a habit). So far, I enjoy doing it so I'm feeling hopeful.\n\nI'm still not 100% sure if I'm doing it right but I did peruse some tutorials online. Even so, tips are always welcome (that's what this sub is all about afterall).\n\nTo my fellow dental hygiene neglectors, it's never too late to start flossing!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/aouhkg/i_started_flossing_two_days_ago_and_it_has_been/", "title": "I started flossing two days ago and it has been great!", "social_network": "reddit", "user": "jedephant", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 47, "down_vote": 0, "creation": 1549733900, "permalink": "/r/DecidingToBeBetter/comments/aouhkg/i_started_flossing_two_days_ago_and_it_has_been/", "nsfw": false, "first_save": 1635436206.2711198, "replies_charged": false}