{"id": "t5_2tand_t3_fd8ide", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I need to let this off my chest and I really do want to be better. \n\nI don’t really have any friends. My closest friend, who I was never really that close with, had a baby about 3 weeks ago. I would see her 2-3 times a year, I felt like she understood me without having to really open up to her. We have an awkward friendship but I can tell we both wanted to be closer, I think I have this strange barrier that I’m still trying to work on. \n\nShe’s focusing on being a Mum right now, so even if I was able to go to her, I feel it’s so petty and she’s so stressed as it is. I also feel it’s unfair that I’ve never been there for her, hardly made plans or checked up on her; yet I expect her to be there for me the moment I need it, it’s just not right.\n\nI think because I have been so lonely for so many years now, I feel nobody knows me. I don’t have deep conversations anymore, I don’t express myself anymore. The only person who could even grasp or possibly care about me is my ex of 5-6 years. We broke up about 3 years ago but he still had a mental hold of me up until about 6 months ago. \n\nHe has been the most unhealthy thing that has happened to me. There’s a lot of history, and I’m only now realising that there probably was some abuse there too, mental, physical, psychological. At the time I was so young and alone, so much in denial that I couldn’t see what he was doing was wrong.\n\nThe last few times we spoke, it has been messy. It’s been hard to put my foot down and really kick him out of my life for good. He sweeps in at the most loneliest moments and I do believe that he genuinely cares about me, but he brings forth so much pain. He doesn’t realise that it’s not healthy, but I feel like he does worry about me.\n\nWell today he messaged me, out of the blue. He asked to see how I’m going and make sure everything is okay. I replied “I told you not to talk to me”. As lonely as I feel lately, as much as I needed to know somebody cared, I chose not to engage. This has really put me in an upset mood, but I know I’m doing the right thing. I want some affection, I want somebody there.. but I shouldn’t. I can’t. \n\nIt may be small, it may be extremely hard, but I’m very proud of myself. I’m trying to stay positive. I’m telling myself how fortunate and grateful I am for the fact I can read, I can read books and escape my reality. I’m thankful for the person I am. I am strong(ish), I’m just not ready to “do life” but I’m getting there.. very very slowly. I can see that I can do this, but I don’t have to right now. It’s okay to take my time.\n\ntl;dr: Manipulative ex is the only person who cares about me. Being so lonely, I am choosing not to respond to his messages as I know it will lead me back down the wrong path.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fd8ide/im_sorry_if_this_doesnt_belong_but_i_feel_proud/", "title": "I’m sorry if this doesn’t belong, but I feel proud of myself, even if it’s just something small", "social_network": "reddit", "user": "idk2384729477", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 18, "down_vote": 0, "creation": 1583300735, "permalink": "/r/DecidingToBeBetter/comments/fd8ide/im_sorry_if_this_doesnt_belong_but_i_feel_proud/", "nsfw": false, "first_save": 1635436644.6779914, "replies_charged": false}