{"id": "t5_2tand_t3_lgsn5z", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "Last year I started working through my early life trauma. It was really tough, but so worthwhile to begin releasing trapped emotions built up over so long. I've been going through a lot of self reflection, introspection and soul-searching, trying to change my self limiting beliefs. But I just wanted to tell you all how much I love you!\n\nThank you Redditors, for always being there for me to help me through stuff. I like reading random uplifting stuff on here. I feel so filled with love that it almost feels like my heart will burst and let out love to every random person I meet or interact with. I really mean it, I wish I could take away all your individual sorrows and put a smile on each and every one of you here :) Pain and suffering help us to grow and learn, whatever you're going through don't lose hope, you'll get through it and be even more beautiful, stronger and wiser for it.\n\nOne of the most important things I've learnt is being aware of when we judge others. It's quite natural to subconsciously make a judgement of people we interact with, and it can be really subtle, so we can be completely unaware. So realising this I try to judge compassionately and imagine all the different scenarios they could be going through to explain their behaviour. We're all on a wonderful journey of learning, and we all have days when we could do better. Every time we see something we dislike in others, it's inevitable that we also have that same trait within ourselves too, which is why it bothers us when we see it.\n\nI then make sure to love them, even if they did something to hurt me. People who are unkind only behave that way because they are missing something in life but don't realise it. It's a reflection of how they treat themselves, so why not break the cycle and show them kindness. Non-judgement is so freeing, it takes back power that we give to others opinions over us. Every single person who comes into our life is both a student and a teacher, if we only choose to embrace them!\n\nI've also started shadow work alongside learning self-love so I'm more balanced and not in denial about darkness in the world, but I truly believe accepting and validating the dark (your sadness/negativity/'bad' feelings) leads to more light. Don't judge your emotions, they're all part of you! But if we focus on improving ourselves, it helps us to stop viewing other people's actions critically. Imagine if we all were to become less judgmental and pass this lesson on to each other, the people who matter to us, it could start a chain reaction for collective change.\n\nTell someone you haven't heard from in a while you miss them and appreciate them, note how such a simple act of kindness can bring such happiness to them and you. Doing or saying something nice to someone, anyone means you made a difference to them, even if it's just one person, and if you do it without expecting anything in return it's one of the best ways to increase your own self appreciation and heal yourself.\n\nI hope I truly always feel love for all, and that it is passed on to everyone who reads this, I'm honoured to be sharing this journey of life with you and I appreciate you. I want to make my life about love and working on passing it on to others, and hope others will join me in this. Thank you so much for reading and please upvote to show support. Xx", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lgsn5z/i_love_you_guys_thank_you_for_everything_why_do/", "title": "I love you guys, thank you for everything. Why do we judge each other? Spread love, pass it on :)", "social_network": "reddit", "user": "Supashaka1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 943, "down_vote": 0, "creation": 1612960229, "permalink": "/r/DecidingToBeBetter/comments/lgsn5z/i_love_you_guys_thank_you_for_everything_why_do/", "nsfw": false, "first_save": 1635435277.5801165, "replies_charged": false}