{"id": "t5_2tand_t3_7ri5p0", "request": ["9ad14901-6d2f-44f9-8b16-48a4f40b66ab"], "text": "Hi, \nI just want to say I discovered this community today and everyone here seems super supportive and friendly. To give you guys a quick background of me, I had quit smoking weed 3 months ago and started my journey towards spiritual enlightenment. I realized just how much my life was being controlled by that substance and how I wasn't accomplishing anything in life as well as it interfering with my relationships and duties. Yesterday, I was engaging in a little introspective thinking and realized that I have been masturbating pretty excessively over these last few months. It was once a day on average and I spent a good 30 minutes out of my day doing it. So as I was making a weekly goals list for myself, I included a 3 day abstinence period free of faping. \n\nAt first I tried to rationalize it in my head. I justified it by telling myself what I'm doing is normal. I blamed my age (I'm 17) for it, thinking that it's completely normal for a teenager to do it due to all the hormones. But then I did a little self reflection and possibly may have realized that I'm just substituting one addiction for another. Just as I have smoked weed everyday, I resorted to masturbation to give me that hit I'm missing. \n\nI also realized that even though I may not jerk off as often as other sex addicts, my liking for porn began getting more and more absurd. I remember a few years ago, I'd watch what was on the front page of pornhub and be content with that but nowadays it had become much more complicated and insatiable. I'd spend 5-8 minutes searching for the best looking one and it'll all be weird shit like gangbangs and incest. I grew fond of some really taboo fetishes because it seems to get me off the most. \n\nI haven't had an actual girlfriend my entire life. Just a few promiscuous girls that I sort of hung around with for the sake that they were \"easy\" (whom also were prolific drug users). It seems like everything I did in my life was centered around pleasure and that's the only thing that ever driven me. Even after stopping weed for 3 months now and making many improvements within my life, I'm still haunted by the same demons that now get their way with me through masturbation. \n\nI guess I'm just trying to say that maybe it's more of an issue than I previously believed it to be. I did this 3 day thing to see whether I could do it, to practice some self restraint and gain a little boost in self-esteem. I only discovered this thread today and barely even know the benefits of doing Nofap. I'm still not entirely sure whether I want to stop for longer than that but that may just be my addict mind telling me that it's okay. It wasn't too difficult and I'm not obsessing over it as much (at least compared to stopping weed) but I'm definitely experiencing urges and practically just counting down the time till tomorrow, beaming with anticipation. No matter how I try to twist it in my head, that's definitely not very \"normal\".", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/7ri5p0/quitting_masturbating_for_3_days_more_than/", "title": "Quitting masturbating for 3 days. More than halfway there but had a realization.", "social_network": "reddit", "user": "ldamien65", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 176, "down_vote": 0, "creation": 1516366984, "permalink": "/r/DecidingToBeBetter/comments/7ri5p0/quitting_masturbating_for_3_days_more_than/", "nsfw": false, "first_save": 1635435310.9651167, "replies_charged": false}