{"id": "t5_2tand_t3_lumr0v", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Since I got diagnosed with depression and anxiety, I’ve felt very empty. The emptiness hit a new low when I accomplished my dream of 6 years, which was to get into my dream art university. When I learned my acceptance, I felt numb. I didn’t even feel accomplished like I thought I would, which was what had kept me going. I thought everything would magically be good after I accomplished this big, solid goal.\n\nNow I am realizing that it cost me a lot. I gave up on so many hobbies and interests and dedicated so much time to improving my art. Right now I don’t even have art to pass time with, as it has become something toxic for me due to social media. However, I want to change this feeling of emptiness. \n\nNow that I don’t have a great big goal and feel empty without any hobbies or academic preparation taking up my time, I’ve decided to improve myself in small ways. I’ve been reading everyday for the past 31 days, and I hope to keep going as much as I can. I‘ve been brushing my teeth and trying to eat healthy. I’ve been trying to change the way I think about my body and appearance to combat my binge-eating compulsions. I’ve been trying to draw only for my own enjoyment and not for social media clout. I still don’t have any hobbies other than reading and sometimes art, and my brain has gotten so used to being over-productive that I cannot get back into my old hobbies of film and shows as they feel like I am wasting my time. However, I believe I have the power to teach my brain to let itself rest without earning ”the right” to, and I am slowly working on it.\n\nThese are all very small feats, but they somehow feel much more satisfactory and important to my well-being than what achieveing my goal of 6 years felt like.\n\nDid anybody else have a similar experience of feeling empty after achieving something big? I feel like I’m the only one out of my peers who has this post-achievement depression. I‘d also love to hear any ideas on how to pass time/hobbies if anyone wants to offer! :,)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lumr0v/trying_to_fight_the_emptiness_in_small_ways/", "title": "trying to fight the emptiness in small ways", "social_network": "reddit", "user": "nachyycatt", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1614536873, "permalink": "/r/DecidingToBeBetter/comments/lumr0v/trying_to_fight_the_emptiness_in_small_ways/", "nsfw": false, "first_save": 1635438453.3248925, "replies_charged": false}