{"id": "t5_2tand_t3_qe8o7c", "request": ["f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I (30M) have been struggling to get my life on track after a series of discouraging events. At the start of the pandemic I lost my job like many others. During this time I began struggling with depression and anxiety. I decided to see a psychologist and was diagnosed with Borderline Personality Disorder. I also used this time to get clean from opioids and other substances I was using. I started medication and going to therapy weekly. My entire outlook on life had changed. I was making a ton of progress until I was rejected by my on again off again girlfriend. I did not handle it well at all and made a total ass of myself. It's been over a year since we last spoke but I have struggled to let go of her and forgive myself for how I acted. I have managed to stay clean over a year and a half now and continue to prioritize my mental health but ever since the breakup my depression and social anxiety has been through the roof. I have seemed to have lost all motivation and interests. Constant anhedonia. I haven't even been able to take or keep another job because of it. The simplest things are a chore. I have to force myself to do anything. It's frustrating. I cut off all my old friends when I got clean and have put myself in near isolation and spend my days aimlessly scrolling reddit, thinking about my ex and all my mistakes. I have tried roughly a dozen medications and continue therapy but nothing is working. I really don't know what to do anymore. I just want to be able to let go and forgive myself, continue to make progress and get my life together. What should I do?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qe8o7c/picking_up_my_life_after_a_nasty_break_up/", "title": "Picking up my life after a nasty break up, substance abuse and mental health issues.", "social_network": "reddit", "user": "DCMartin91", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1635008176, "permalink": "/r/DecidingToBeBetter/comments/qe8o7c/picking_up_my_life_after_a_nasty_break_up/", "nsfw": false, "first_save": 1635438383.787022, "replies_charged": false}