{"id": "t5_2tand_t3_q8l9ra", "request": ["18281d65-fa68-4991-a4a1-8f37346818f3", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Disclaimer: I have self confidence issues and have always struggled with speaking up when I need to.\n\n\nI had a live-in nanny for 2 years. However I did not have her for luxury, I had her to help with my disabled son in school. It is very hard to replace a nanny here, especially since I was depending on her for attending school with him and she already knew all the ropes. So replacing and starting from scratch would be difficult and would mean my son would have to miss school until I found a good one and taught her everything. Parents are not allowed to attend school with students.\n\n\nBecause of this I tolerated more than I should have from her. Her sour attitude, her eye-rolls when I would ask for help, her rudeness to my kids. She was a very unpleasant person, like even in the morning you would walk into the kitchen and she wouldn't even acknowledge you or say good morning ever.\n\n\nI never overworked her, everyone would see and tell me she is lucky to have such a nice and lenient employer (even other nannies). But she just had no interest to do any more than the minimum requirements of her job. To be honest, when it came to cleaning, she did her tasks and did them well, but she was never willing to give an extra ounce of help over that.\n\n\nCountless times I would be juggling kids and housework and working from home while she would be in her room \"resting\".\n\n\nPlease understand that I never overworked her. I must stress this so that it's not assumed that her attitude stemmed from any form of over-working. She had minimum 3 hours of resting in her room a day. She had a good salary and we provided her with all her needs: food, toiletries, clothing etc. with weekends off.\n\n\nOther than this, 3 times I lost big chunks of cash, I knew she stole it but I never caught her red handed. I stopped carrying any cash to avoid this reoccurring.\n\n\nI never stood up to her. And I really regret it. I am not mad at her as much as I am mad at myself for not confronting her even once or for standing up for my kids when she was impatient with them.\nThe reason I avoided this is because I was afraid that I would stir her anger and she would retaliate by hurting my kids or putting something in our food or harming my family in any way. Or even abruptly quitting and having to replace her, which as I explained is a difficult procedure. For the sake of my kids' and my safety, I was patient and tolerant for those 2 years.\n\n\n When her contract finished, she said she wanted to leave, and I let her go. She showed no emotion when she left, did not even say goodbye to my son who she cared for for 2 years. She was happy to leave, and I never heard from her again.\n\n\nHow can I forgive myself for being so weak and letting this nanny walk all over me. There were times when she would talk to me disrespectfully and I never stood up to her, just ignored her. Was my fear of her harming my family justified as a cause of avoiding confronting her. Sometimes I wish so bad I could meet her just once to tell her everything I kept bottled up.\n\n\nHow can I forgive myself for my silence?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q8l9ra/regretting_not_standing_up_to_my_former_nanny/", "title": "Regretting not standing up to my former nanny.", "social_network": "reddit", "user": "Ill-Mathematician380", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 24, "down_vote": 0, "creation": 1634292264, "permalink": "/r/DecidingToBeBetter/comments/q8l9ra/regretting_not_standing_up_to_my_former_nanny/", "nsfw": false, "first_save": 1635437112.0184236, "replies_charged": false}