{"id": "t5_2tand_t3_p1mufb", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Day 8, here we go! I woke up around 5am today and decided to get moving early. I started the day with some CNBC and will head to the gym in about 45m. I also managed to set up my second monitor, which has honestly taken me 8 months to do. I have a decent workload today, but am looking forward to unwinding at the end of the day. I also want to start focusing on hydration as I noticed my bags under my eyes are getting a little dark. Side note: For those who have not watched outer banks.. holy shit, do yourself a favor and watch it. Season 2 is incredible.\n\nToday, I meditate on the thought that perfection is the enemy of action. My whole life I have taken an all in mindset, which is probably related to my ADHD. In relationships, I have always managed to have an extreme view point. Those who are not 100% all in or are luke-warm, I have often distanced myself from. I am starting to realize that relationships are not perfect machines and can never be perfect machines. In general, things are not going to work out exactly as planned. There are too many variables and influences to meet expectations perfectly. This applies to relationships as well as careers or goals.\n\nIt easy to get caught up in the perfection mindset. and with that, you're bound to be let down and start to dig yourself into a hole. I think this is where I currently am and I need to shift my mindset.  \nI acknowledge that this is where a lot of my toxicity is rooted in, but have yet to determine why.\n\nHoping todays mediation will bring deeper insight to this subject.\n\n&#x200B;\n\nThank you for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p1mufb/day_8_deciding_to_be_better/", "title": "Day 8: Deciding to be better", "social_network": "reddit", "user": "Ohboyburgers", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1628592947, "permalink": "/r/DecidingToBeBetter/comments/p1mufb/day_8_deciding_to_be_better/", "nsfw": false, "first_save": 1635436502.6242564, "replies_charged": false}