{"id": "t5_2tand_t3_oneej3", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "!Mildly Long Post! !Mentions Depression(Some people say I need a TW/CW when I talk about this topic so I’m just putting it here just in case)!\n\n Hello, I guess I’ll just be called ‘Staring’ for the sake of easiness if you want to refer me to something but yeah. Anyways, I came here in search of advice. I’m a teenager with diagnosed ADHD, Autism, and Depression. I have little to no motivation to do anything with myself and get help, and I haven’t seen my therapist who specializes in art therapy ever sense COVID started and I likely won’t be seeing them anytime soon. \n Despite me being diagnosed with Autism and one of the main factors of seems to be having a large sense of empathy(from what my therapist told me) over time I’vs found myself becoming more sadistic and less empathetic as time has gone on. I enjoy making people upset and causing others stress and anger. I have a horrible habit with lying, often making up stories about myself and my life. Anytime I do something wrong I immediately wrap myself in a lie to get out of it and avoid consequences. \n And as I mentioned before I keep making stories about myself, people rarely know the actual me and instead know this fictional version of myself that I keep playing into.\n I constantly change my personality depending on the person and people often notice this. I also tend to lose interest in people and things quickly. I can become obsessed with the specific item or person in a matter for days or even months and than completely loose interest in the said thing and drop it entirely.\n I’ve also found myself terrified of going outside, I hate interacting with people in general and often time the closet I get to that is interacting with my friends on discord. I’ve also have not been able to move on from a relationship I had over 3-4 years ago and I’ve been obsessing over them even though we don’t even talk anymore and I keep fantasizing about them(not in a inappropriate way). \n I struggle with hygiene & over-eating and struggle to get out of bed constantly but I have no motivation to get better and I have no idea on what to do.\n\nI need help and want to change but I have no idea where to start.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oneej3/i_seriously_need_help_long_post/", "title": "I seriously need help.. [Long Post]", "social_network": "reddit", "user": "NewAdhesiveness1185", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1626702495, "permalink": "/r/DecidingToBeBetter/comments/oneej3/i_seriously_need_help_long_post/", "nsfw": false, "first_save": 1635437991.1553757, "replies_charged": false}