{"id": "t5_2tand_t3_fd3k4c", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "*Edit* wow guys thank you so much for your responses and suggestions! I'm still trying to get through them all! I'm making a doc to organize your advice, book jsuggestions, etc. And then hopefully in 2-3 months you'll get a spicy update from me with all my new revelations and changes!! Appreciate it so much \n\n--\n\nOkay this is going to sound shitty and I'm embarrassed to even type this but i really want to improve! The title really says it all... I think in the last 2 years I realized just how smart I am (from others telling me mind you). I LOVE knowing information and I'm not quiet about the things I know. I'm not quite in the  the \"well actually\" territory yet per se but I am pretty dismissive when people are incorrect...\n\n My ego is just loving being right and I genuinely think I know better than some people, most people really. Basically it's rare for me to encounter people who are as well versed as I am in certain topics... And I am aware of this, and I get impatient with people. It's like I'm swinging my knowledge around like a fricken weapon. \n\nOnly problem is, that's not the type of person I want to be. I have so much respect for people who are wise and calm and can be quiet and peaceful because they know there's no sense in spewing off all the facts they know and starting arguments with people just to be right. I KNOW it's fruitless behavior, and frankly pretty unattractive. I know that wisdom is quiet, and only young fools scream about being right. I am acting like a young fool but I want to be chill. I want to be able to hear someone say something I know to be incorrect and have the patience to say nothing. I want to not let my heart rate increase over the comments of a stranger. Does that make sense? \n\nSo I'm searching for a book, or maybe a series of articles or something to help me achieve this. Not sure if I'm looking for ego death or enlightenment or mindfulness or WHAT but I can sense myself being a Know It All and it's not a good look. \n\nThank you in advanced, please be kind :/", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fd3k4c/ive_noticed_myself_getting_a_little_too/", "title": "I've noticed myself getting a little too cocky/jaded/argumentative lately. I'm a fairly intelligent person and love knowing things, but I'm being quite dismissive and cynical lately and I don't like it. Any book suggestions to help me find my way back?", "social_network": "reddit", "user": "motherofcatss", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 845, "down_vote": 0, "creation": 1583277699, "permalink": "/r/DecidingToBeBetter/comments/fd3k4c/ive_noticed_myself_getting_a_little_too/", "nsfw": false, "first_save": 1635438007.2406738, "replies_charged": false}