{"id": "t5_2tand_t3_ozuumu", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "How is your self-talk today? \n\n\nAre your thoughts focused, positive, determined, strong, confident, friendly, and concentrated? \nAre they filled with fear, thoughts of failure, listlessness, unconfident, lost, bored, tired?\nOr are they fluctuating between both at random?\n\n\nDo you make efforts to control your thoughts? \n\n\nControlling one’s thoughts can be life changing. It’s also something that is very difficult to do. It takes effort, internal struggle, concentration, a reason to do it, energy. The situations may not be ideal because we might be busy at work, school, etc. We simply don’t have time to only focus on shaping our thoughts because our thoughts are being filled by our responsibilities. \n\n\nBut sometimes that’s exactly what we have to do. Sit and just listen to our thoughts – sure, meditate. Not a meditation of nothingness, trying to quiet the mind, but rather an active meditation that tries to guide your thoughts into a positive nature. \n\n\nBelieving we are deserving of success, believing we can overcome the issue at hand, believing that *we can change*. \n\n\nPay attention to how your thoughts change depending on the music you listen to, things you watch, environments you’re in, people you’re surrounded by. Do you feel more confident around certain people, and worse around others? Does certain music make you feel sad, others motivated and strong? \n\n\nAll this is exhausting because it takes conscious effort. You don’t get to enjoy the way you normally do because you’re examining yourself actively. Experimenting and analyzing why you’re having these thoughts, then trying to transmute them into something positive.\n\n\nNothing I am writing here is new or novel, but rather is a reminder. A reminder that we can control our thoughts. Perhaps we’ll have stray thoughts of a negative nature that come from nowhere, but how long we sit with them, how much attention we give them, how we attribute them to our identity is something we do have control of.\n\n\nBe conscious of your thoughts. That internal chatter that’s going on all day every day can be shaped to be something you enjoy living with. A person that is lonely and one that is in solitude are the same thing – a person that is alone – the difference is in how they feel by themselves. Different self-talk. One is not dependent on others to take away their boredom, to make them feel better, to help them be motivated, etc. That all starts with the way we think. The thoughts we are having. \n\n\nI am not a lazy person, I had a lazy day, week, month, etc. I am capable of change, and I can make that change happen *right now*. At least mentally, if not physically. \n\n\n\nControl your mind. Pay attention to thoughts you enjoy and discard the harmful one’s. When you experience a negative thought, be conscious of it and at that very moment put effort into changing it into something positive.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ozuumu/are_you_a_slave_to_your_thoughts/", "title": "Are You A Slave To Your Thoughts?", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 895, "down_vote": 0, "creation": 1628348538, "permalink": "/r/DecidingToBeBetter/comments/ozuumu/are_you_a_slave_to_your_thoughts/", "nsfw": false, "first_save": 1635437207.0830986, "replies_charged": false}