{"id": "t5_2tand_t3_qdxqou", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I feel dizzy, I'm having a hard time trying to think or express any emotion. I look like a zombie.A bunch of things I need to do are collapsing with each other in the back of my head but I don't feel strong enough to focus on one thing at a time, it feels too heavy.\nNot working out + bad habits + depression + stressful job +  malnourishment + terrible sleep + social anxiety = hell. And that's where I'm at. Lots of shame but have no power to face it. Writing this text is like trying to move a mountain. The struggle is reaal. Moving my mouth feels weird. I just make sounds to save the energy that is left. I just I- can't even explain what is happening to me. It's too much to explain, but don't even know where to start... there's a huge mess in my mind it always feel heavy. Grabbing something is like running 4 miles, I start hyperventilating, feeling short of breath in every movement. Sometimes I feel pain in my chest from time to time and I think I'm already damaged. My trust issues,  not knowing how to deal with my stressful  job, body dysmorphia and analysis paralysis led me here. I'm 24 gay virgin and I feel old as hell. I wasted everything and I'm dying. I'm too weak now to even start, I hit rock bottom. The walls are slippery and I can't climb my way out. It's all my fault, and I can't forgive myself for the gazillion time. I'm tired of dealing with this person, and fighting with him every fucking day. There's no peace inside of me. There's only shame, intrusive thoughts, anxiety, paranoia, depression and disappointment. I thought I could achieve many things in this lifetime but turns out I'm my biggest obstacle. There's no love within me that I can share since I'm full of self hatred. No wonder why I isolate myself. If I can't tolerate myself how can anyone do that as well? Maybe I'm doing them a favor.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qdxqou/my_depression_has_gotten_worse_now_im_too_weak_to/", "title": "My depression has gotten worse. Now I'm too weak to fix it.", "social_network": "reddit", "user": "Admirable-District-9", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 550, "down_vote": 0, "creation": 1634963141, "permalink": "/r/DecidingToBeBetter/comments/qdxqou/my_depression_has_gotten_worse_now_im_too_weak_to/", "nsfw": false, "first_save": 1635436496.2807558, "replies_charged": false}