{"id": "t5_2tand_t3_oag23d", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Apologies in advance if this is a long post but got a fair bit to let off my chest.\n\nI'm 26. I've been stuttering for as long as I can remember. During uni I managed to somehow get it together and presented my bachelor's thesis, seminars, and reports to entire classes full of people, with little to no issues. So much that I even got top grades in all my presentations. Neither did I feel a block and nor did anyone seem to notice if I had a minor hitch. Even presented my work to a panel of judges at international competitions, without any problems.\n\nMaybe because of deterioration in self-esteem and with increasing insecurities, my stutter got to a big downhill spiral over the course of the last year and a half. At one point it got so bad that I couldn't speak two words consecutively in flow. I was constantly being asked to write down what I wanted to say. It was really gut wrenching, I have no words. Today I had to go to an ENT doctor and I could barely describe my problems/symptoms.\n\nBeen trying self-help books on and off for about a year, but as I said, it didn't seem to work well. Truthfully, I lacked discipline and was hard to really grasp the techniques without professional demonstration.\n\nFinally decided to throw away my shame and registered for sessions with a speech therapist. The first day went smooth. I can feel some minor improvements already. Most importantly I think, acknowledging that I need serious help and trying to do something about it feels weirdly liberating.\n\nHope it all goes well.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oag23d/after_years_of_denial_selfhelp_failure_and/", "title": "After YEARS of denial, self-help, failure and depression, started with speech therapy today for my stutter", "social_network": "reddit", "user": "Animesh_Mishra", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1624996844, "permalink": "/r/DecidingToBeBetter/comments/oag23d/after_years_of_denial_selfhelp_failure_and/", "nsfw": false, "first_save": 1635435102.789785, "replies_charged": false}