{"id": "t5_2tand_t3_p9qqjj", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "I drink to cope with grief, depression, and anxiety. When my mental state is alright, I don't feel the need to drink. But I haven't felt emotionally good for 3 years, and I've drank almost every day since. September is going to be really stressful for me, and I've been ramping up my drinking to cope. As a result, my mood has gradually gotten so much worse and I've become much less functional. So, on Monday I decided to stop drinking until I'm caught up with work and in a good mental space. I saw where I was headed and it scared me.\n\nBut now the shit that drinking helped me cope with in the first place is rearing its ugly head. I'm anxious and I'm depressed and I'm extremely sad and emotional at times. I could easily blot all that out, even if temporarily, with booze. I'm also super tired all the time (which I've heard some people experience going cold turkey), which makes it so difficult to work. I'm coping in other ways, which aren't that healthy (like binging YouTube or sleeping to kill time) but are nowhere near as bad as drinking. Which means I'm more functional but still not super productive. I know that it's still an improvement and less dangerous than drinking would be. But it's so frustrating knowing that even though I'm doing what's best and healthiest for me, I'm not (yet) really that much more productive than before.\n\n(BIG SIGH)\n\nI don't have anyone to tell, but I felt I needed to say this out loud somehow because I was worried I'd drink tonight if I kept silent.\n\nThanks to anybody who read this\n\nEDIT: Holy crap, guys. I woke up to a kajillion notifications and some of the most supportive messages and pieces of advice. I didn't even think anybody would see this or care. I'm trying my hardest not to cry before breakfast lol. Thanks to everyone who responded. I feel really good about today :)\n\nEDIT 2: It's really nice to hear people are proud of me, even if they don't know me. For anybody else that's in a similar boat, [I'm proud of you](https://youtu.be/akQfxhRbPGg) too!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p9qqjj/im_going_on_day_7_of_not_drinking_and_im_really/", "title": "I'm going on day 7 of not drinking, and I'm really trying but also really fucking struggling.", "social_network": "reddit", "user": "jessejamescagney", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1097, "down_vote": 0, "creation": 1629686611, "permalink": "/r/DecidingToBeBetter/comments/p9qqjj/im_going_on_day_7_of_not_drinking_and_im_really/", "nsfw": false, "first_save": 1635437923.9951355, "replies_charged": false}