{"id": "t5_2tand_t3_p5e57j", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "c6df14ee-195b-4e9d-8032-7cca73d46fe8"], "text": "I'm trying to detach myself from someone I love dearly. You know and you will feel it when something has changed. I can feel that he is not into me anymore. It's instinct. Also based on his actions. I've tried to talk to him about it but it did not work. \"People change overtime. I am human. And I will keep changing\" is the response that I've got. I was also told that it is my inability to adapt to changes. But I know and I can feel that something is off. \n\nThis is hard for me. I am trying to adapt to his \"changes\" but sometimes I am losing my shit. I feel ugly and unattractive. Lol. I am trying to divert my attention into loving myself more. But man, loving myself isn't easy either. I want to learn how to let things go and stop stressing about it. \n\nI admit I am  sensitive and emotional and I am trying to think rationally before I speak. The thing that I keep telling myself is \"if this is not going to matter five years from now, let it go.\" I'm trying but this is so sad. I wish I can let things go easily the  way he can sleep at night without us being okay. \n\nI've been reading and watching videos that could help me feel better. I am also considering going to a therapist. I feel bad whenever I speak my mind, when I try to express myself. I've been told I am the worse in terms of speaking and expressing. I want to be better. I want to stop letting myself be sad about this when nothing's gonna change. I want to love myself enough that I wouldn't be bothered whether he shows less affection. \n\nSigh. I just also want to let this out. It hurts. I am so hurt.\n\nEdit: I appreciate all your messages. Thank you. It means a lot to me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p5e57j/how_do_you_let_go_of_a_person_you_know_is_not/", "title": "How do you let go of a person you know is not good for you?", "social_network": "reddit", "user": "ramendate", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 314, "down_vote": 0, "creation": 1629113185, "permalink": "/r/DecidingToBeBetter/comments/p5e57j/how_do_you_let_go_of_a_person_you_know_is_not/", "nsfw": false, "first_save": 1635436267.0902305, "replies_charged": false}