{"id": "t5_2tand_t3_a6cp7a", "request": ["784e259a-673e-4a9b-af7d-ee2cd8efc5ae"], "text": "I'm 24 and just completed my Law degree from outside my home country, and have now returned. I am in the process of writing some conversion exams before I write the Bar exams next year. I have some legal work experience, but nothing major and won't be landing a job until after I qualify as a solicitor.\n\n&#x200B;\n\nEssentially, I have anxiety sometimes + feel a little overwhelmed with life. I can't say I'm the most social person (which I understand is a disadvantage if you're trying to be a courtroom barrister - but I’m not even aspiring to do that, I want to do transactional, corporate work), but I'm not socially clueless either; I guess I prefer smaller / intimate conversations, and definitely don't consider myself as the radiant walk-in-the-room-and-light-it-up kind of person - which is fine! I'm analytical, intellectually curious, and I'd say I'm knowledgeable about global (commercial) affairs enough to be a successful lawyer, however:\n\n&#x200B;\n\nI find myself going down this really bad spiral of self-doubt and can't help but envision every catastrophic idea where I don't end up successful or employed, because I can't talk my way through every chat or won't impress the pants off someone I meet. I will admit I need to network more, and as I become more well-versed in all the areas I'm giving exams for, I am sure I will have more conversation points. I exercise as much as I can, have other hobbies that I devote myself to, yet once I'm back hitting the books, it's the same old story on repeat: *there are other more extroverted people with as much knowledge as you, why would anyone pick you for the job?*\n\n&#x200B;\n\nTl;dr: I'm going to be a lawyer very soon, and have so many self-doubts because I don't possess the textbook traits you envision of a lawyer, any advice on what I can do to reassure myself that everything will be fine and not drive myself nuts until I qualify?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/a6cp7a/need_a_word_from_the_wise_from_any_lawyers_or_not/", "title": "Need a word from the wise from any lawyers (or not)", "social_network": "reddit", "user": "checkchad", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1544851871, "permalink": "/r/DecidingToBeBetter/comments/a6cp7a/need_a_word_from_the_wise_from_any_lawyers_or_not/", "nsfw": false, "first_save": 1635437962.6867354, "replies_charged": false}