{"id": "t5_2tand_t3_8u3y4x", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "There's so much going on in my head and so much I can write here, but I'm gonna try to keep this as short and sweet as possible although it'll probably end up long anyways. Whenever I write these type of things to myself, I try to make them sound as eloquent and majestic as possible, like I finally understand truly and things will without a doubt be different, but fuck it, this one is gonna be colloquial as hell or whatever word fits.\n\nAlso I'm on mobile so bear with me if formatting is all goofy.\n\nSo I've been \"deciding to be better\" for like 4 or 5 years now. I remember about 5 years ago, I was hit with this feeling that I wasn't trying hard enough and that there were things (or really just one thing) that I really wanted to do. That thing was music. I never expected to be the next Beatles or anything (although I'd be lying if I said I secretly didn't wish for that) but really, all I knew that I definitely wanted to do was play music in some capacity. Be in a band. Write original stuff. Prove to myself and others that I could do it. See where it goes if anywhere. At least I could say I tried and whether things were amazing or complete trash, I could say yeah I did that, or yeah I made that.\n\nBut for some reason, I never really put work into it. Like someone who was naturally smart in school or whatever, they can get by doing the minimum because they don't really need to put too much effort in. But if they did, where could they be? That feels like me. Like I'm a pretty decent musician and I had opportunity and potential to be something great (or at least pretty good). Like this thing was supposed to be my everything. Its the only thing I truly loved. I always identified myself as someone capable of achieving these things in my head. But then I never put in a strong enough effort to take it to the next level. And I don't understand why.\n\nWhy if I love this thing so much and its all I want to do, that I don't pursue it with everything that I have?\n\nFear, complacency, apathy, easier road is more enticing, anxiety, depression? \n\nI've struggled with these things my whole life, but not to the extent that they became debilitating. And yet here I am, years older, not any closer to my \"dream\". Its your classic \"I wish I tried harder, shoulda coulda woulda, regret of indecison or commitment\" story that so many of us probably have.\n\nThing is though, I feel like I've been here so many times. I don't know how many times I've said I'm going to be better. And not just with music although I led with that because I feel like its the most important to me.\n\nI'm going to wake up everyday at 7 am. Period. I'll do that for a while and then get up at 7:37 a few days or weeks later.\n\nI'm going to work out following this regimented schedule and nothing will stop me. A month later I'm not working out.\n\nI wanna read this book, watch this movie, travel here, do this, do that, its gonna be awesome. Damn I can't wait. \n\nIt never happens. And if it does, its never sustained.\n\nI also have this perfection thing where for example if I'm working out and I fail a set or if I'm studying music theory and I get sidetracked and didn't retain the knowledge perfectly, I need to start over from the beginning. I get so discouraged if things aren't progressing neatly in a linear fashion, that if theres any hiccup, things come tumbling down and I stop. I know its coming, so it makes me not want to start things meaning so much of my time is hollow because I'm not doing much, or at least not doing anything progressive or substantial. Or if I'm watching a movie, playing a game, hanging with friends, working out, I feel guilty that I'm not putting every second into music. Maybe thats what separates the people who \"make it\" from the people who don't. Maybe I'm not willing to put in that sort of effort. That doesn't mean I'm a failure, its just that for some reason I can't seem to come to a conclusion of what I really want. So a lot of the time because of that, I do nothing but think and think and think. \n\n I've started over so many times. Like I've said no more porn and masturbation trying to do the no fap thing, just to try and discipline myself. And I'll be good for a month and then I'll relapse. And then I'll be good another month. But the way I think is so screwed. I won't look at it like I went 59 days succeeding and screwed up once. I'll look at it like I went 30 days. Cause everything I did before I relapsed is negated somehow because I fucked up.\n\nI don't like this analogy too much because luckily I never got into the drinking or drugging or smoking thing, and I have no idea what addiction is like, but its like if a smoker knows what they are doing is not good for them. They desperately want to stop smoking. They want to change. And yet everyday, they find themselves lighting up. And they hate themselves and beat themselves up for it, but they continue to smoke. Thats how I feel. I know what needs to be done, I know I want to make changes. And yet I don't change. Or if I do its short lived. And I beat myself up to high hell for it. \n\nAnd I'm struggling heavily with these thoughts of what I could have been. Where I could have been by now. How good a musician I could have become. Shoulda coulda woulda whatever. I don't understand how I could want something so badly and not do anything to attain it. Maybe I don't want it as much as I thought. Then who am I? And then I look back at who I could have been had a put in even just minimal effort, and it hurts even though I realistically know that theres no way to know where I could have been. I just don't understand. Old habits die hard I guess. All those cliques ring true. \n\nI'm only in my mid 20s, but I feel like I have the regret of someone on their deathbed. I know that I can say fuck it and change right this instant, but whenever I do that, theres always this thought that I'll never be as good as I could have been, so whats the point in trying now. I can't seem to get over it. Like I'm at a pool party and I keep coming up with excuses as to why I can't or don't want to jump in, and now its late and everyones already gotten out of the pool. Jumping in now feels less enticing. Or I'm in a racecar on a track and I'm spinning my wheels doing my pre-race checks only to find that once I feel ready to race, the race is over. I could go around the track sure, but for what?\n\nI know I have a life ahead of me. I know nothings stopping me from \"being better\" right now. I just don't know why I can't do the things I want to do. And I'm afraid that I'm reaching a point where the desire to actually want to do anything even though I can't seem to do them is fading.\n\nIt goes much deeper than that, but I guess I'm just looking to vent and to see if anyone struggles or has struggled with these experiences and thoughts and how they moved forward. \n\nAppreciate it guys.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8u3y4x/struggling_to_understand_myself/", "title": "Struggling to understand myself", "social_network": "reddit", "user": "FrogToadEye", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1530048967, "permalink": "/r/DecidingToBeBetter/comments/8u3y4x/struggling_to_understand_myself/", "nsfw": false, "first_save": 1635436086.2714932, "replies_charged": false}