{"id": "t5_2tand_t3_plcij9", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "0614cedd-1e86-4144-9fa0-a24c903bac2b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I'll keep this as brief as I can... After dropping out of university, I worked for almost 15 years as a tradie (contractor) and although I made a great income, I was heavily in debt (mortgage etc), overweight to the point where I didn't date seriously for almost a decade, and spent six days a week, 12 hours a day, working alongside a family member who was a violent, gaslighting narcissist. Part of the reason I moved into an apartment was that I felt safer knowing he'd have more trouble breaking in to kill me, than if I lived in a house. Things got that bad.\n\nI was miserable, and there seemed to be no way out. My whole family saw me as a child who never grew up. Nobody took me seriously and people constantly forgot my name, talked over me and dismissed my opinions. The few friends I had were distant. Women were completely uninterested in me. I let myself go, and ate junk food every morning, as well as four or five nights per week.\n\nI'd even started building a depression nest.\n\nThe only logical progression was another forty years of work, then retirement and a slow, graceless slide into death. Completely alone.\n\nOne day I realised that the only person who could do anything about this was me.\n\nBeing in construction, boom times were good, but recessions financially cripple you. So I found an industry which is recession proof. Shortly afterward I found a business that was dirt cheap. Nobody wanted it because it was rural.\n\nI'd just sold my house and was living in a garage until I found something else. Mortgage law had tightened up and my credit was dirt, so when I realised I could afford to buy this place with cash, I drove 1000km to have a look at it. Covid was just kicking off, so flying was out of the question.\n\nA week later I put in a lowball offer and they accepted an hour later. I found out later the previous owner was in a nursing home and they were desperate to sell, so I felt bad but it was nothing personal.\n\n**Fast forward one year:**  \n\n\n* I've already earned more than what I paid for the business & house *net*.\n* I've lost 20kg (45lb) by eating well and exercising regularly.\n* People take me seriously, ask me for advice, and twice I've been told I'm charismatic (which is fucking hilarious)\n* I have more real friends than I even had in high school\n* I only have two nights free per week, due to fun social nights and sports.\n* I've accepted two invitations to sit on community boards, as well as volunteering.\n* I've had more sex in a year than I did in the prior decade.\n* Last but not least; I've met a smart, funny and gorgeous girl who I can be myself around, and she still likes me in spite of that.\n\nA lot of that is likely down to my confidence levels compared to a year ago.\n\nIt's not all roses. I still drink too much, but I'm getting better abstaining and cutting down. I still work 12 hours days, but I walk to work and I'm not killing my body. Living away from my elderly parents makes me really sad, as well as missing my nieces and nephews growing up. Oh and a woman told me my hands were nice and soft, which (having construction hands before) kinda sucked!\n\nBut I have escaped spending 90% of my waking days being belittled, put down, treated like shit and generally being miserable with the single most toxic person I've ever met. Because of the situation I couldn't have just cut them off, or made a change, without moving away. They constantly try to pry the door open and inch back into my life, but now I just tell them I'm not interested, too busy and generally disregard them. Distance, along with no family/business obligations, has made that so much easier.\n\nAlso, being single, I had nobody to convince nor consider when moving, which made it so much easier to completely uproot my life and career.\n\nThanks for coming to my Ted talk. In all honesty, I didn't realise how well I'm doing until I wrote this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/plcij9/moved_1000km_away_changed_career_escaped_toxic/", "title": "Moved 1000km away, changed career, escaped toxic family/work and a pointless life. This is the single best year I've been alive.", "social_network": "reddit", "user": "Dont-Fear-The-Raeper", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 963, "down_vote": 0, "creation": 1631242239, "permalink": "/r/DecidingToBeBetter/comments/plcij9/moved_1000km_away_changed_career_escaped_toxic/", "nsfw": false, "first_save": 1635436759.4911506, "replies_charged": false}