{"id": "t5_2tand_t3_q5uj4d", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "This is the belief: time robs us of our passion. Somehow slowly moves us away from that intense beautiful feeling we have when we first fall in love with someone. More strikingly, the loss of that initial feeling is unavoidable.\n\nWhen put like that, it is quite a scary and negative point of view but it is understandable why this idea is so generalised. After all, we can indeed see relationships changing over time and the change usually goes in that direction.\n\nGrowing up, I heard older people explaining that passion exists in the beginning and then fades away until it disappears completely. Then, the dull thing that is left is what love is actually about. I was even told that the initial feeling that we all have is only craziness, it is not real love, it is not valuable. I didn’t really like this explanation but still I could not ignore what seemed to be the effects of “time” in relationships.\n\nI started questioning if time is really causing couples to lose their passion and eventually it became clear to me that it is not. Passion, just like love, is something that you can attune to, something that it is always available and it’s just a matter of understanding it and actively cultivating it. Another thing that became clear to me was that many couples do the exact opposite of what I just described. There is a lot of confusion when it comes to what love and passion really are, and there is very little action to cherish and cultivate passion. Sometimes couples even quit love and stop any efforts to bring life back to their relationship.\n\nLet me use an analogy. Let’s say you have a brand new plant at home that somebody just gave to you. You cannot believe how beautiful it is. It brings joy to your life, it transforms the environment around it, makes it more alive. This plant really makes you feel good. You absolutely love it. Days go by and you don’t water the plant. In the beginning, you begin to suspect something is strange. “Maybe there is something wrong with this plant”, you might think. As weeks go by, the plant starts to look bad, it loses its beauty. The environment around it is now dull and grey. You start doubting if you ever really loved the plant, maybe it was “broken” from the beginning. Eventually the plant dies. Who killed the plant? I don’t think it was time, I don’t think there was something wrong with it. However, that’s exactly what happens in relationships.\n\nThis is the way we kill passion in relationships.\n\nWe all bring our own issues and limitations to a relationship. However, in the beginning, it doesn’t matter much because we are in love. That spontaneous combustion starts such a fire that overwhelms any other feeling. Then, something starts to happen. Time creates the opportunity for triggers to be pressed, that's all time does. When triggers are pressed, we find ourselves in vulnerable places. If we are not able to deal with vulnerability, fear appears and that leads to contraction. In other words, we start closing ourselves because consciously or subconsciously we are fearful and we try to protect ourselves.\n\nThis fear has many different faces. Fear of exposure, of being hurt, of disappointing the other, of failure, of losing the relationship, etc. This fear leads us to fight or flight, which always involves closure and distance, as a result connection weakens and passion is lost. If it keeps going that way, love is lost too, and then everything else, until the relationship perishes.\n\nPassion starts vanishing at the same time that issues start appearing and, as I explained, that is not a coincidence. However, most problems are brought to the relationship by one or both people, they are not couple problems, they are problems of the individuals. It usually comes back to the baggage each person brings from the past to the relationship.\n\nThrough time, the consequences of these problems start accumulating and people end up beating passion down. So no, it’s not time, it’s fear and resentment in one or both sides of the relationship that suffocate passion and love. Connection might suffer to such an extent that although a couple might be living under the same roof, they live totally separate lives.\n\nWhat appears to be the couple’s problem is just a symptom, and the only way to resolve it is by tackling it from its root cause. To feel passionate again, you need to feel as connected as in the beginning, which means you need to be able to handle emotional openness and vulnerability. Moreover, you need to be able to authentically express yourself. You will only be able to do that if you work on your own individual problems with the aim of resolving or overcoming them.\n\nYes, it takes two to tango but it usually starts with one of the parts knowing that something must be done, taking responsibility and leading by example.\n\nWhen you initiate this process and you get it right, you should notice a sudden deepening in understanding and connection. This should happen in a matter of weeks. Once you can handle openness and vulnerability, you will first feel compassion and empathy, which then will transform into love and passion. You will feel like you know better what these emotions are, it will be like discovering a new level of emotional clarity and intensity. This will mean that your behaviour changes, you will feel more confident, you will have meaningful conversations and your sex life will improve. This will happen, not only because you will have a new perspective on the relationship, but also because you will have a different attitude and a stronger will. Therefore, you will be more certain about what you want in the relationship. That will bring you great stability which will allow you to adventure into unknown territory, exploring new experiences, feeling more joy and more pleasure that you will abundantly share with your partner.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5uj4d/time_is_often_blamed_for_the_death_of_passion_in/", "title": "Time is often blamed for the death of passion in a relationship but is it really?", "social_network": "reddit", "user": "sergio_santos_one", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1633954450, "permalink": "/r/DecidingToBeBetter/comments/q5uj4d/time_is_often_blamed_for_the_death_of_passion_in/", "nsfw": false, "first_save": 1635435352.3974671, "replies_charged": false}