{"id": "t5_2tand_t3_q5vb1a", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I am a college student and I am really struggling. It's not that college is hard, but I just have a lack of motivation and interest to fake school seriously, which is causing me to really have bad future employment if I continue this path. Mostly I am just seriously stuck and I am not really sure of what I want to do in life because it's a seriously difficult time of my life in the early 20s. My own siblings refuse to talk to me, my mother wants me dead because I am such an embarrassment. I am just lost and not interested in anything else. I have tried different skills such as computer programming skills but I am very bad with computers so it's not for me and I struggled very hard in my intro to programming class. Honestly, I am not a very smart individual as I struggle very hard in logical thinking and I struggle to understand things faster than my peers. I also probably have a really low IQ so that's not a good situation. Being 21 and still living with my parents isn't a good thing as that I am seriously trying very hard to move out but I struggle with finding a stable job to leave from my parents house. It's a huge struggle because I don't have any skills or any type of income to live comfortably in NYC. Currently I am about to start junior year in college and my GPA is currently below 3.0. That's tough because of lack of direction and I need to find something fast to graduate college. Blue collar jobs/trades are not for me as that earlier in my life, I was in a car accident which nearly broke some bones somewhere near my body so I can't really do physical labor as that would ruin my body harder and my lungs as that I have asthma. This is not some random compliant as that I have issues that are actually limiting me harder. Is it possible to get out of this mess or not??", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5vb1a/any_advice_on_how_to_change_my_life_for_the/", "title": "Any advice on how to change my life for the better as that it feels like everything is gone??", "social_network": "reddit", "user": "throwaway7492977", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1633957221, "permalink": "/r/DecidingToBeBetter/comments/q5vb1a/any_advice_on_how_to_change_my_life_for_the/", "nsfw": false, "first_save": 1635435992.3526964, "replies_charged": false}