{"id": "t5_2tand_t3_krxu7s", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Song is Debussy’s Arabesque No. 1 for those interested in a pleasant listen. It is a fairly challenging piece that I have been practicing every day for these past 3 months. Progress is slow since I am still such a beginner, but it is incredibly satisfying to sit down for an hour or two each day always knowing that I am improving. Even if I falter in everything else that day, I always have the piano to come back to and know that, in at least one way, I am getting better. It is also an incredible joy to be able to play for friends. \n\nLearning to play has also completely shifted my perspective on learning. Before, when I saw someone do something that looked difficult I always thought to myself “I wish I could do that,” or “they are so talented.” It would make me feel so dejected and inadequate. I had been saying that to myself for years about the piano, had picked it up a few times, but never really followed through because the learning curve was so steep at first. It took me MONTHS before I could even play something that remotely sounded good. \n\nNow my family says to me, “you are so talented,” and it actually irks me somewhat. I was SO wrong to say that before and it held me back for so long. It is not talent but hard work and dedication. Knowing that, knowing that I have the discipline to actually attempt mastery at something, even if only a single song, has given me a much healthier perspective in every area of my life.\n\nSo my encouragement to everyone on this sub, regardless of what it is you are trying to be better at, know that you will fail over and over again when you just start out. That is you learning and it is a beautiful thing. And never write off learning something or meeting some goal that you truly want to. With time, patience and effort I believe that you will achieve it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/krxu7s/i_started_learning_to_play_the_piano_earlier_this/", "title": "I started learning to play the piano earlier this year and have nearly finished learning my first truly challenging song !", "social_network": "reddit", "user": "Professional-Ad-2031", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1071, "down_vote": 0, "creation": 1609969125, "permalink": "/r/DecidingToBeBetter/comments/krxu7s/i_started_learning_to_play_the_piano_earlier_this/", "nsfw": false, "first_save": 1635435404.6935055, "replies_charged": false}