{"id": "t5_2tand_t3_m7tsvi", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "So, hi my name is irrelevant and my location is the magic land of Southeastern Europe.\n\nSince time immemorial humans have been having pretty practical problems. Food, water, staying alive that sort of thing. But as we progress and stop having those problems (not all of us and not wholly, I know) we started reading, hearing many more stories and we progressed to the point of being able to empathise with one another.\n\nI am doing this awkward opening to say that this is the mechanism I am going to rely on in my following \"confession\". \n\nSo, before I get into it, I am seeing a therapist (a systemic therapist) and I have been able to slowly make some, albeit little, progress but due to covid I have not been able to see them for about 6 months.\n\nSo I am keeping this as short as possible:\n\nI grew up with many issues, while I was about 5, I witnessed my mother's suicide attempt. Granted she stopped just before the attempt but seeing your mother on a chair ready to jump off the balcony is not difficult to decode as something that not many people do in a normal state. \n\nMy mother is a brilliant person, a fighter, stronger than nearly anyone I know. She was born with an extremely rare variation of a disease, so from point 0 she was not expected to have lived. She is now well and healthy, smiling and trying. She also has had numerous health problems due to low metabolism, and because of said rare disease. I am prefacing this to make perfectly clear that I deeply love her and I don't hold her accountable for anything that followed.\n\nSo, I will not include much more information as I do not want to divulge any information that she would not be okay with it being public. \n\nMy mother has also been suffering from depression due to family issues, with her family, the one before she had me. I remember coming home from high school and finding her in a state of sleep-limbo almost every day for the better part of 5 years. She then was able to bounce back with therapy and medication and although she sometimes has some bad days and dark thoughts she always manages to bounce back after some time, with me and my family's help. \n\nMy father also has had depression symptoms but has never bothered getting diagnosed, he seems to not believe that therapy is a valid way of dealing with one's problems. I say that he has had symptoms that I see. It may not be so, but I am pretty sure he is a high functioning person and that alone has led to the low manifestation of depressive behaviours. Now, he is in his sixties and has been brought up in a rural area in a very, very patriarchal society so any feelings of fear of opening up are completely understandable. \n\nHaving said that -and if anyone is still reading- I'd like to say I have been suffering from a lot of anxiety, low self-esteem for as long as I can remember, I have had recurring symptoms of what I would describe as mild depressive episodes (sometimes extreme episodes) and I was bullied, sometimes heavily while other times mildly, for almost all of my school years. As to the bullying it included: *puts on glasses* getting beaten by one or more students of my school, getting cursed on in public by classmates, constantly being looked down upon by peers, being pushed aside by the school community(i.e. the whole class),being the center of a bad joke (e.g. being invited to a party by a \"friend\" from school, arriving there and being the only one who was actually there, because haha funny), having sensitive and extremely personal information about my life leaked by my supposed friends and a general sense of not belonging anywhere. I go into this much detail to make perfectly clear that I was constantly invalidated by nearly everyone in my microenvironment. That being said, as I grow older and make progress with myself, I am learning to take responsibility for the person I am now while leaving the victimisation of myself as far as possible but hell it is not easy. \n\nI have had my first panic attack at age 11 because I hadn't done my homework properly. At this point I want to say that while I come from a loving family, I also come from a family that even though it tried to communicate, ended up doing it completely wrong. So, pressure was always a constant force, put upon by my family in a manner that made things worse. It even is now that I am near the end of my university thesis and although the active pressuring has stopped there is still that little voice that has taken it's place. Panic attacks came and went until about 13 months ago when I had an extreme panic attack, one of many that followed and have not stopped, nor has the feeling of impending doom stopped at all, if anything it has become even more prevalent. \n\nI wanted to write that down and if anyone has had similar experience, I want to hear from you dude and dudettes.\n\nTL;DR \nHave problems, child trauma and such, need halp and conversation.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m7tsvi/the_human_or_here_and_here_again/", "title": "The Human or, Here and here again.", "social_network": "reddit", "user": "Either_Neither", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1616082701, "permalink": "/r/DecidingToBeBetter/comments/m7tsvi/the_human_or_here_and_here_again/", "nsfw": false, "first_save": 1635437005.518665, "replies_charged": false}