{"id": "t5_2tand_t3_ncyake", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Want to have more luck in life? Don’t get mad but I’m starting to think every time I work really hard, good luck follows.\n\n**Luck is hard work in disguise**\n\nI feel incredibly lucky to have great friends. They are wonderful people, we lean on each other and make great memories together. But is “luck” why we’re friends? \n\n* I taught myself soft skills with “How to Win Friends and Influence People” by Dale Carnegie (corny title but legit life saver book)\n* I went to Meetup events alone that I was terrified to attend to try and meet people\n* I had to let go of unhealthy friendships to make room for better ones\n* I had to be vulnerable and open up with people so they know it’s safe to do the same and the friendship gets stronger\n\nSo am I lucky to have these friends? Absolutely. But hard work created that luck. \n\n**Get used to falling off the bike**\n\nI’m also super lucky to have a good job with good coworkers. But finding and capturing that new opportunity was like riding a bike - you have to learn some lessons the hard way. It hurts at first but *this is what it feels like to learn to ride a bike*. If you get back up and continue trying you’ll more skillfully exploit opportunities and it will look like good luck. For my job:\n\n* I interviewed and got turned down from my dream job, kept looking\n* I got therapy to learn work-life boundaries when I started to burn out\n* I got more therapy when I realized my self worth was tied up in my job and it made me take things personally and have panic attacks\n* I learned to negotiate raises and ask for things I wanted (transfers, projects)\n\nRelationships are no different. I had to go through the hard breakups, get therapy to work on my baggage, go on lots of bad dates, then later found someone special. Most things don’t start out lucky and perfect. Falling off the bike is okay. It’s literally the only way to learn to shape your life (and figure out what shape you actually want it).\n\n**If you want more luck in your life you need to create it**\n\nYes some people are born rich or are otherwise incredibly fortunate. But we can’t control that. You are responsible for your own life.\n\n* You can try things before you feel ready, it’s the only way to learn new things\n* You can use those new skills to capture new opportunities\n* You can learn from failures and try new approaches. This is essential progress towards your goals and you can’t win without iterating\n* You can create your own luck (it’s just learning from experiments + time)\n\nFurther reading: If this post resonated with you then I highly recommend *Meditations by Marcus Aurelius*. The message most of us need is not flowery. It’s a tough love slap in the face to “stop screwing around, do what you know you need to do, and if you mess up then try it again.” A Roman emperor from 2000 years ago is just what the doctor ordered.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ncyake/the_harder_i_work_the_luckier_i_get/", "title": "The harder I work, the luckier I get", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 41, "down_vote": 0, "creation": 1621083416, "permalink": "/r/DecidingToBeBetter/comments/ncyake/the_harder_i_work_the_luckier_i_get/", "nsfw": false, "first_save": 1635436618.3280625, "replies_charged": false}