{"id": "t5_2tand_t3_qeodtn", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "There are anywhere from 29 to 31 days in a month.\n\nGet done all you need to get done.\n\nDay 1. You fail to do your work.\n\nBoom. Now you have both day 1 and day 2's work to do.\n\nThen you also fail to get done all you need to get done on day 2.\n\nBoom. Now you have days 1-3 to get done.\n\nEnough of this.\n\nStop doing this.\n\nJust get done all you need to get done.\n\nDay 1. You complete day 1.\n\nNice.\n\nDay 2 comes around. \n\nYou complete everything day 2 requires of you.\n\nNice. \n\nDay 3 comes.\n\nYou complete it. Heck, you have time to spare so you complete some of day 4's work too.\n\nAwesome.\n\nDo you see now much better this is?\n\nDo you see it? \n\nOkay. Now we have some questions.\n\n1. What would I have to become to make this happen?\n\n2. What if I'm already so many days behind? What if I'm weeks/months/years behind? What then?\n\n3. What if I'm not that motivated? What if I am too discouraged to scale the intimidating mountain before me?\n\nAnd the answers:\n\n1. You have to become a self-sustaining unit.\n\nYou have to figure out what it is you ought to be doing each day. And plan accordingly.\n\nYou have to figure out how to also be content. How to be happy. How to still have fun. How to rest and recharge. All while still getting everything done each day.\n\nYou have to be disciplined. Hardcore. \n\nImagine the sort of discipline you would have to have to jump out of bed first thing in the morning just to immediately do vigorous exercise till you're sweating from head to toe.\n\nIn fact, if you could get yourself to do that, then you'd by far be disciplined enough.\n\n2. What if you're already behind?\n\nThen you have to account for the fact that you're behind.\n\nThere's no way around it.\n\nEither you get done everything you need to get done each day, or you don't.\n\nDo you want to continue setting yourself back? Or do you want to dig yourself out of the hole you're in?\n\nYeah, it might take some time. Depending on your circumstances, it might take months or years even.\n\nBut you live in the present either way. \n\nMight as well make the best use of your time.\n\n3. What if you're too discouraged? What if you're too lazy? Distracted? Unmotivated?\n\nStart there.\n\nFigure out what's holding you back from giving it your all.\n\nDo you not know what you're doing? Have you not sat down and formulated a plan? Do you need to talk to someone? Where is all your time going? Is there a specific habit you need to quit in order for you tend to your priorities?\n\nFigure it out. \n\nNoone else can do it for you. You have to do this yourself. \n\nGet to work man.\n\nComplete day 1. \n\nComplete day 2.\n\nComplete day 3. \n\nThen feel immense joy in the fact that you completed 3 full days worth of work.\n\nThen just keep it going.\n\nNice and steady.\n\nBoom. Another day.\n\nBoom. Another day.\n\nBoom. Boom. Boom.\n\nFiguring it out as you go.\n\nChallenging yourself when you need to. \n\nMixing it up. \n\nRewarding yourself. \n\nGiving yourself proper rest when needed. \n\nForgiving yourself where you fall short. \n\nPicking yourself back up when you fall down. \n\nDusting yourself off and...\n\nAlways moving forward.\n\nMaking today your priority so that tomorrow can be tomorrows priority.\n\nAlways completing today. Always.\n\nAnd have fun while you're at it. You don't live in the future or the past. You live now. \n\nSo make now your focus.\n\nLearn to enjoy your work. Then enjoy your work.\n\nYou'll be there in no time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qeodtn/a_motivational_speech_or_something_to_that_effect/", "title": "A motivational speech. Or something to that effect.", "social_network": "reddit", "user": "TheShaggyRogers23", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1635065659, "permalink": "/r/DecidingToBeBetter/comments/qeodtn/a_motivational_speech_or_something_to_that_effect/", "nsfw": false, "first_save": 1635436781.2634351, "replies_charged": false}