{"id": "t5_2tand_t3_q3u097", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "EDIT: We are strictly platonic friends and have never been attracted to nor interested in one another.\n\nI feel horrible. While I (26M) was meditating today, I accidentally imagined a world where she (Jay, 25F) did not exist. In that world, I'd have more free time to hang out with other friends, many of whom are much higher quality. I could go on hikes with my other best friend instead of going to the bar twice a week. Not going to the bar would allow me to work more hours.\n\nJay is still in love with a guy she had a relationship with years ago. And because of this, all she ever thinks about now are men, dating, girl drama, and sex. She used to write a lot of songs, be extremely passionate about music, and I could talk to her about deep things. But now it's just dating and girl drama.\n\nInstead? I could be talking to my friend Brian about the stock market. I could go on another date with a woman who just got her CPA license. I could be jamming on guitar with Octavio. I could reconnect with my childhood friend, Alex. I just went running 7 miles with my other childhood friend, Daniela - an athlete who has tried out for the Olympics.\n\nI love Jay and it's hard for me to accept that her influence in my life is negative. We have so many happy memories together. We are part of a larger friend group, and as much as I love these people's company, nearly half of them have been arrested for a DUI at least once. Many are un- or under-employed.\n\nShe and her girl friends ended up pranking the guy she was getting over by sticking a potato in the exhaust pipe of his car. They invited me to join them but I declined.\n\nI don't know what to do. Maybe I should just keep her friendship but keep her at arm's length.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q3u097/im_realizing_that_my_best_friend_of_65_years_is_a/", "title": "I'm realizing that my best friend of 6.5 years is a toxic influence in my life. The realization that I'd be better off without her is heartbreaking 💔", "social_network": "reddit", "user": "Fire_Raptor_220", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1096, "down_vote": 0, "creation": 1633684013, "permalink": "/r/DecidingToBeBetter/comments/q3u097/im_realizing_that_my_best_friend_of_65_years_is_a/", "nsfw": false, "first_save": 1635436929.210602, "replies_charged": false}