{"id": "t5_2tand_t3_q7xsrs", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "802203c7-ca80-4c23-ad08-f571694cfc55", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I've been lurking on this page for a while now, and I just really needed support. I've been dealing with the single woman blues and am struggling with self-esteem issues.\n\nOne of my favorite anime characters said, \"Don't you know? Women need to be strong in order to survive!\"\n\nI'm 28 years old and single, but, am far from \"strong and independent\". Aside from a job (I'm working on my career still and hoping to get a job in my field in 4-5 months. To give you specifics, I went to medical school and am trying to get into a residency program this year - a training program for doctors in a hospital). Unfortunately I just found out that I failed one of my career-determining board exams this morning. So I have to study and retake it again which is very frustrating. My career path has been long. I have failed many exams in medical school. I've had to repeat a year in between and fly back over the summers and retake my exams. It was not the journey I envisioned for myself.\n\nThe truth is, as much as I try to deny the desire, I really do want to be in a relationship. I can't help it. I have been single my entire life. I've never known what it's like to have been on the other side. I've never been asked out on a date either. There have always been guys I've liked, but, at best I was teased and at worst I was severely bullied by guys I've liked. These experiences have really taken a toll on my self esteem. I always struggled with the idea of being \"chosen.\" \"why did he choose her and not me?\" \"I wish I had been with a guy for X years regardless of how the relationship ended because he still chose to be with me in the first place regardless of how the relationship ended.\" \"I hate how my friends complain about being in toxic/unhealthy relationships because they were still chosen by a man.\"\n\nI feel like most women really don't understand how I feel because they have been in relationships before. Most women do not understand at all what it's like to not be wanted. Even if you were in a relationship, you were still chosen in the first place. It's gotten better, but it used to make me feel terribly sad and angry even.\n\nI understand these are terrible thoughts and this is the kind of thinking that I'm so afraid of that could lead me into an abusive relationship. And I'd like to get into why I want to really reframe my thought process.\n\nThe most recent experience (which has lead to this epiphany) I've had was with the son of family friends (they are family friends of my dad's older brother and wife) - so we have known them for many years, not well though.\n\nHe's (he works in the intersection of tech/IT and finance) the son of close friends of my aunt and uncle (my dad's older brother and wife). So we've known the family for a long time. I had always wanted to meet him. His mom had always really liked me too.\n\nSo this guy was going to come over to my house and meet me. He's 31 years old and his family wanted us to be introduced to each other. I actually couldn't believe it. So the day came and he actually showed up to my house and had lunch with my family. We had time on our own to talk. We really enjoyed ourselves. He couldn't stop smiling, even significantly deepened his voice as he spoke to me (compared to the way he was talking with my family). He even wet his hair (to make it more slick after coming back from the bathroom). I had never had a man be this charming/flirtatious with me. The next day, I found out he wanted my number. It was pretty unbelievable for me that this was happening.\n\nI will say though that my dad wasn't happy at all with this guy when he came. My dad made faces the entire time. He didn't like him at all and was adamant that I didn't stay in contact with him. My dad kept saying after that there was something off about this guy. I thought he was exaggerating. Because at the time, I received a proposal from another family (that is filthy rich) and this guy that I liked, his family is quite frugal. They have a small home and old cars). So I thought my father was just being an elitist.\n\nSo this guy and I were texting back and forth every day (this was very new to me - I had never received any kind of male attention before). Things were great and I was beginning to grow fond of him. He described himself as \"robotic, pragmatic and very rational.\" He's 31 and has no friends. All of his friendships faded away (He lied to me initially and told me that had had friends all over the country when we met). He's only close to his parents and his cousin (whose like his older sister). He has an older brother who he is not close to at all. I don't think they get along (his brother lives a very boujee lifestyle, travels, eats out fairly often, and owns his own house in an expensive city)\n\nHe started asking me questions (it sort of sounded like an interview - that if it was an issue that he'd been in previous relationships, what my ideal family situation looked like - and with this he was specifically asking about how many kids I wanted, if I'd want nannies for them, what about medications, my views on our kids having a psychiatrist, etc.). I said I'd probably want a nanny (since I grew up with one) and he said he would want to have his parents watch our kids (I'm assuming to save money). He said he would work from home because he didn't believe in subscribing to traditional gender roles. I told him I would probably work part-time and he asked what about all that school I had plus exams? He then wanted to identify areas of conflict in a relationship (I just thought it was kind of odd but went along with it - this was all through text, btw). So we talked about our love languages, communication styles, etc. The biggest difference was finances. I grew up comfortable and he didn't. He said that his family was hand to mouth (but his parents did work hard) and that he never wanted to be hungry for money in his adult life. He also makes 200K+ a year and owns 3 homes, so he's doing really well for himself.\n\nI explained to him that I go out to eat with my family once a week (I mean that's a normal thing, right?) and that when I start earning, I will spend my money how I'd like and shouldn't have to give any explanations to my partner (like treating myself within reason, or buying a nice piece of jewelry that I've been eyeing). He said that no one has to justify themselves but if one partner if saving for the children's college fund while the other is going out to eat once a week, then there is an imbalance.\n\nThe truth is, that comment did upset me a bit. I didn't understand why he would even bring imaginary kids into this when we hadn't even spent any time together yet (just the way he was going about this was bizarre - it didn't feel like a budding relationship but an interrogation). So again I explained that I was really starting to like him but I felt upset by his comment. I explained that my dad worked very hard to give me, my mom, and siblings a very comfortable life. That going out to eat was something that I'm used to and have done all my life. It was something that I was used to. I explained that my family instilled respect for money in me and that I'm not thoughtless about money or an impulsive buyer/spender. I did tell him that my dad always does take my mom out and he pampers me as well (again, this is the life I have had). I gave him a compromise....why not go out twice a month? it would be something different to do along with hiking/biking (which he really loves). I asked him: What if I wanted to spend some money on decorative items for our home or buy a lovely dress and get dolled up for myself and him? I said that since he brought up finances, then a \"yours, mine and hours\" should be discussed later, because otherwise, the line lets get blurred. I also mentioned that as long as everything else is taken care of financially, why not set aside money for things we enjoy? (along with both of us contributing to the child's college fund)\n\nHe said he would have a chance to get back to me later over the weekend, but I didn't hear from him for 4-5 days. This was unusual because we were talking everyday before this. I felt very bothered. And finally, when he did respond, didn't apologise for making me feel upset or acknowledging anything that I said. He was basically talking past all my points and asked me if I've heard of a minimalist lifestyle (but he supposedly had no intention of going all the way), asked me if I had a rainy day fund because he was still in the process of building his and will likely be for many more years. He said he was concerned about my expectations of a future partner pampering me. And with my example about buying decorative items for our home, he said I could either buy a table for 1000$ or 20,000$. When I mentioned the part about getting dolled up, he said he's known people who do things for appearances sake and wholeheartedly disagrees with this kind of thinking (I mean, who doesn't want to look good for themselves and their spouse?).\n\nHonestly, that message sounded very patronising, judgmental, and even insecure.\n\nSo I started off with the fact that he left me hanging and didn't even send me a text. If he needed time and space, to please say so. Again I reiterated all my previous points (about setting aside money and taking care of everything financially) but explained that you don't have to cut corners. I told him that I knew how to be financially responsible since I lived on my own for a few years so I know how to budget and mind money. I told him that having a wife and kids has expenses. Going out, treating yourself, etc. That's all part of normal, healthy relationships. There's nothing wrong with pampering your partner (and I clarified that when I meant pampering, I meant not in a \"waiting on me hand in foot\" but lavishing each other with lots of love/doing/saying loving things/and occasionally buying a gift on special holidays. I said there's nothing wrong with rewarding yourself with a nice treat or enjoying a hard-earned vacation (he travels as well, but, he does a lot of solo hikes in remote places, which I think would have been fun to have gone with him). I told that I really liked him and that we keep going back and forth about this. But this whole money thing...seems like something he's unwilling to compromise on, like its a non-negotiable for him. I felt unsettled by his unhealthy relationship with money. I also brought up the fact that he only briefly glossed over what happened (actually didn't tell me anything at all when he said he'd give me some high-level points) in his last relationship (which was 2 years and ended a year ago).\n\nI told him that this makes it hard because I liked him and I thought he was wonderful..that... I was open and willing to make this work, but, he had to meet me halfway if he felt this was a relationship worth pursuing. I asked him to help me understand him in this way and give me the same grace. That we could find an option that works for us both. I even gave him a way out if he really wanted it. I asked him if getting to know each other was what he really wanted.\n\nHe replied immediately after and said that he definitely wanted to keep talking and believed that all my concerns should be minimised. He apologised for essentially ignoring me for those few days. He told me no more excuses and that I deserve attention, respect, and respect with the level of communication. He said that my unsettled feelings (about his view of money) shouldn't be ignored and that he did not wish to cloud me with sweet nothings. He called me amazing and said he felt lucky to have met me (He even acknowledged that we really did hit it off when we first met). He said I possess strength of character, the integrity to stand up for my beliefs, and the ability to be myself (which was what he was looking for in a partner). He said that he really does enjoy talking to me and truly hoped that I felt the same.\n\nI said that I did feel the exact same and that I meant it. All I said about the concerns I had (the previous relationship and his views about money) - I understood those were sensitive topics that we can absolutely talk about them later if he feels comfortable. I also did ask him about what made him want to pursue a relationship/marriage at this point in time. I asked him just to be honest and upfront with me (as I have been with him) instead of me thinking that maybe he's hiding something. I told him that I am eager to get to know him, etc. It was a kind message, nothing more to it.\n\nI didn't hear from him for 3 days. and I felt extremely bothered.\n\nHe then ended it with me and I couldn't bring myself to respond. So I deleted his number. I was so upset and couldn't hold in my tears. Just the way he went about the whole thing was very disappointing. We didn't even get to spend any time together just as I was hoping. He did not give it a chance and this bothered me so much. It's not the fact that someone else won't come around or that I'll never get married. I know that's untrue, but, it's with this man specifically.\n\nI was gracefully allowing and loving in my responses to him, with the potential for growth and evolution. I wanted to see him again. I am so distraught that he will never come back. That I will never have my chance with this person ever again when I really wanted it. There was so much more I wanted to say to him. So much more I wanted to know about him.\n\nIt bothered me because I was not asking for much at all. The bare minimum actually. I wanted to show him that I am a communicative, open, respectful, and loving individual (which I would imagine are ideal qualities in a partner). I know that I did nothing wrong. It was just....him that made me feel sad and confused. I couldn't understand why he didn't try.\n\nI was showing his texts to my friends and they thought something was off about him - even my mom thought the same. They all thought he was being incredibly controlling and felt like I was already heading into an abusive relationship. My cousin told me to stop talking to him but I didn't listen to her. My parents called him selfish. They said if I had married him, it would have been a tragedy and he would have made my life hell. My younger brother (who is 17), asked me why i didn't have any self-respect. He said, \"You realise what he did to you, right? You know, you could have married an abusive psycho. There was something wrong with him. I can't believe you didn't see that. He actually had a long discussion with my about it yesterday as I was driving to pick up food for him. My brother also said that this guy would have ruined my life.\n\nThere was so much expectation...and hope. All of this was building up over the years, I was waiting in anticipation and that was it (this lasted for a month). I just couldn't believe that he left just like that. He didn't care. After 14 years...that was it. It's been very hard dealing with my grief. I wanted him to give me the chance to show him who I could be and it didn't happen which devastated me. It was the first time someone wanted to get to know me (something I had never experienced in my life, because I always felt like an invisible wall to men or was the target of their bullying). Then when I thought something was finally going to work out (especially with the one guy I really wanted), it didn't. It was just too good to be true. Around the time he broke things off with me, his father was diagnosed with gallbladder cancer. Then he passed away last weekend.\n\nI have been thinking about his family. I've been turning to prayer a lot because prayer comforts me. So I've been praying for his dad and I did say that I would have loved to have been a part of his family as his daughter in law. All I wanted was to to know and love his son. I had no agenda. That was it....and now...I will never have that chance ever again with him. I wish I could have been there to even comfort his son during this time of grief and mourning if we were in a relationship.\n\nI heard now that his mom has been introducing him to other people. After hearing that, it made me feel so bad. I felt jealous, even. It's been very painful for me. I have been waking up most mornings with a terrible ache in my chest. My dad told me I should not feel bad that he's talking to other people because I've now seen his true nature. I mean...would you all agree? Am I not missing out on much? Again, I know none of it is my fault. I just wanted to understand him and his thinking. He just left when we didn't even get a chance to explore a relationship together, which is what I was really hoping for. I can't believe he is never coming back.\n\nDespite all this...I still agonize over it at times. I do need counselling at some stage once I am able to afford it.\n\nYou probably read that scenario and thought to yourself, \"this guy doesn't sound like he's much of a catch.\"\n\nI have always had this desire to be loved by a man. After this experience, my eyes have opened. There is something I really need to fix here. I can't keep living my life like this. I know I'm worth more. I think the only thing is...I'm terribly sad that he didn't see it.\n\nI have so much love to give...I know I'd make a wonderful wife. I would lavish my man with with so much love and affection. I would want to nurture and pamper him as much as I can.\n\nI know that I have many goals and dreams. Settling would be painful and (according to my friends) many women do settle for mediocrity early on in life for the fear of being alone. But I know the world needs me. I know I can do so much. I don't want to feel disheartened and held back by this. And honestly, someday, I do hope I can meet someone who can match the best version of myself (and I'm not there yet - I've got a lot of work to do). I try and reframe my thinking to be the main character of my own story. Some days I do feel inspired but most times I am always thinking about men, romance, dating...\n\nI look at Amal Clooney who is truly amazing. She didn't settle and waited and married George! She is the definition of a badass.\n\nAny strong, independent ladies who can shed some light on this issue? Should I feel devastated? Am I missing out? Everyone in my family says its his loss entirely. I have trouble convincing myself. I had a long lecture earlier today from my mother saying that as a woman, I need to be strong and she didn't understand what she did wrong in raising me that I turned out this way (that made me feel bad). But she's been married to my dad for 31 years and before meeting my dad she was in a relationship for 5 years with another man. So she doesn't know how I feel.\n\nI did have a long discussion with a friend the other day, who said that as women its so important to be independent (not just financially, but emotionally, etc.) because there are no guarantees in life about anything. Your significant other could die, leave you (even for reasons not having to do with cheating, etc.) and in the end, you only have your self to pick up the pieces. You can't plan your life around a man. You just can't. I thought she did raise a valid point there.\n\nAt the same time, I know being single really does afford me so much...time and freedom.\n\nMy biggest dream actually is to become a child psychiatrist. And I want to publish a book one day (before I turn 30!), start my own podcast, go into jewelry design as well (take gemology courses), learn languages, painting/sculpture/flower pressing/calligraphy, etc. So much I want to do! I try to think of all the amazing possibilities.\n\nI think the part that really hurts is...it's not that I'm in a rush to get married...its just I feel so sad that I've lost my chance with that guy forever. He's never coming back. I feel devastated. There was so much more I wanted to know about him and now I never will have the chance to.\n\nI'm just tired and frustrated...I think I really need to do some reflection and self-loving...\n\nI hope you all aren't disappointed in me. It's been such a painful experience. I am now trying to reframe my unhealthy and love-starved thought processes into completely de-centering romance and relationships (that's practically all my life). I need to find a way...\n\nApologies, I know this was very long. Would really appreciate your thoughts on this post. I need help", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q7xsrs/how_can_i_stop_putting_romance_and_dating_on_a/", "title": "How can I stop putting romance and dating on a pedestal? (LONG)", "social_network": "reddit", "user": "futurehero622", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1634211089, "permalink": "/r/DecidingToBeBetter/comments/q7xsrs/how_can_i_stop_putting_romance_and_dating_on_a/", "nsfw": false, "first_save": 1635435814.6901133, "replies_charged": false}