{"id": "t5_2tand_t3_oe0n7f", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "b69cf201-6737-4217-b486-9096135546b8", "1a213df6-3f71-466c-9762-ace119e0102e", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "So I’ve been working at kicking this horrible addiction for a year now. I used meth for maybe two years, about one year daily. It stole my soul, there isn’t any other way to put it. I made 2-3 months then relapsed- rinse and repeat  for a year. Lost everything, including my amazing ex who stuck with me through it all. Until she couldn’t. She moved back home to the province where we met, I moved back in with my parents at 34. I ended the relationship because I couldn’t deal with the guilt of the shitty things I did while using. I take full responsibility for my actions, however I know deep down I wouldn’t have done these things sober. Meth gave me this drive for evil, it took my morals and turned them on their head. It made me animalistic, fully driven by impulse and obsession. I’m not sure how to covey this properly, maybe those who have experienced it know what I’m trying to say. Regardless, I did shit that disgusts me. It also drove me as close to suicide as I’ve ever been. I was a cocaine addict prior to being introduced to meth, but that shit pales in comparison, to me anyways. At the risk of sounding dramatic, it was like a demonic possession. \nAnyways, today I’m 40 days clean from everything, except occasional weed vaping. I found out that my ex is pregnant with my child, and upon hearing the news, something clicked. I had a purpose for life. I had a reason to not give up. I stopped feeling sorry for myself and started actually facing my issues head on. I got a job, I’m applying for college (mental health and addiction) I go to meetings, found a therapist, started exercising, and most importantly I’m going easy on myself. After all the shit i did, I hated myself. It’s a work in progress, but today I believe I have worth and deserve happiness. Things are looking up. I’ve got a long road ahead of me but I’m embracing the challenge. If anyone is struggling with addiction problems, please feel free to message me. Connection is essential in recovery. Take care everyone 🤘", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oe0n7f/40_days_clean_from_meth/", "title": "40 days clean from meth", "social_network": "reddit", "user": "Jolly-Pirate-6856", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2474, "down_vote": 0, "creation": 1625463271, "permalink": "/r/DecidingToBeBetter/comments/oe0n7f/40_days_clean_from_meth/", "nsfw": false, "first_save": 1635436269.0407155, "replies_charged": false}