{"id": "t5_2tand_t3_ne8bc8", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1"], "text": "My freshman year was 50lbs overweight, messed up teeth & and in a poor mental state. I used to hate going to school got into 3 fights (fist) all of who were my former friends, got terrible grades & got picked on... honestly i thought life couldnt be any worst. After freshman year I saw my GPA & ranking, I got my shit together immediately started studying almost doubled my GPA from my previous year, but I was still fat & depressed. So that summer i looked in the mirror and was unhappy with myself who hit an all-time high of 205 pounds, that summer I made a plan to run 3 miles a day at my local park, which was horrible because I had the worst shin splints and could barely walk but I kept pushing, did Epsom salt baths 2x a day \\* finally found these shin sleeves that prevented them and made the pain 95% more tolerable. Soon I was on a daily workout regimen where I wasn't sore by the end of the day, finally the summer ended, and I dropped 30 pounds,  PS: also I had a very strict diet of 1400 calories a day + (500 burned in the workout). However, junior year began I felt great about my life, the first day of school I got like 15+ compliments,  girls started to be more friendly but that summer just set off a chain reaction, next thing u know I'm at the gym running 5 miles a day + doing weights for 30 minutes. dropping an additional 30 pounds, I finally saw my jawline become sharp, but the cherry on top was my mom who finally got me braces because she was so proud of my weight loss. by the time the first semester of my junior year ended I was a whole different person. I was 70 lbs down, braces, fixed my hair & I actually had girls flirting with me & somehow lost my virginity (lmao). Then covid hit, then it was just me hanging with myself and playing video games, but honestly, it was pretty chill, but it went by too fast next thing you know I was taking my SATS and applying for college, now a few weeks from graduation and my high school journey is ending and I'm here thinking about how much my life has changed since the beginning of high school to now, and its just makes me so proud of who I became. To whoever is reading this, sometimes to better yourself you need to separate yourself. I know it might be a little lonely at first but once you see that progress it changes your outlook on life. (lmaoo ik im just a teenager). Also, i kinda shed a tear while typing this :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ne8bc8/i_cried_today_thinking_about_how_far_i_have_come/", "title": "I cried today thinking about how far I have come from the old me", "social_network": "reddit", "user": "SneakaFindaaaa", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1541, "down_vote": 0, "creation": 1621231579, "permalink": "/r/DecidingToBeBetter/comments/ne8bc8/i_cried_today_thinking_about_how_far_i_have_come/", "nsfw": false, "first_save": 1635436128.3245842, "replies_charged": false}