{"id": "t5_2tand_t3_m4uafb", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55", "311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "“I’m a failure because I don’t have a good job. Because I haven’t found a special someone yet. Because my body isn’t the right shape. Because I’m poor. Who I am is not good enough.”\n\nWhy do so many people relate to those words? Why is the default mental narrative of so many people “I’m a failure and I have no hope of getting better”?\n\nWho put those poisonous words in your head? Who taught you to feel so much shame? I don’t think this is you. I think you’re trying to live someone else’s life, walk in someone else’s shoes and stumbling because they don’t fit right.\n\nBecause society has a lot of expectations about your life. Society has a scoring rubric about what a good career looks like, or a happy relationship, or a flawless body. Society projects a lot of ideals onto us about the “right life.” And I think you’re breaking your toes trying to fit into a shoe that was never made for you.\n\nI’m not trying to tell you that you’re a special star in your own way and you’re better than society’s stupid ideals. If you’re anything like me, you’ve got issues, you have scars, and there’s a lot you want to do better. And it’s good to try and get better. But you’re not going to go very far while you keep hobbling in that ridiculously poor fitting shoe.\n\nYou are not a failure just because you don’t fit the mold life tried to force onto you. Everyone has different experiences growing up, different skills, different passions, different fears. How insane is it that we could all turn out the same way? The mold society has is just a guide that helps society survive. \n\nIf everyone in a society tries to be healthy and climb the ladder at work then the society will have a good economy and prosper. That’s the point of the mold. It’s not designed to make you happy, it’s not designed with an individual in mind, and it is impossible that more than a handful of random people could fit it perfectly. That’s why we glorify workaholics and people that volunteer and successful entrepreneurs. These are all individuals that happen to benefit the economy or their community. Society teaches us to value the things that are good for society - not us.\n\nYou are not a failure. You are just trying to wear someone else’s shoes. So stop tearing yourself apart. Stop saying “I’m a failure because X” and ask if X is actually important to you or if society just said it was. Ask yourself what is really important to you, and focus on that. \n\nI spent so many nights hating myself because my career was mundane. I felt broken because I was introverted and didn’t like going out. I thought I was hideous and ugly because I didn’t have a six pack. I thought something was wrong with me because I didn’t know how to be what society wanted.\n\nThat’s horseshit. Working 80 hours a week isn’t actually important to me. Going to bars or clubs wasn’t important to me. And I could be perfectly healthy without having a six pack. So why did I treat those like failures? \n\nI don’t know you. I don’t know things about yourself you really want to change and which parts simply don’t match the blueprint society gave you. But I need you to think about it. I need you to ask yourself what is really important. Ask yourself who you want to be. Because society doesn’t know what is best for you. And life won’t get better until you figure that out for yourself.\n\nThe best you is someone who enjoys each day. Someone who doesn’t tear themselves apart because their values are different than society’s. Someone who learns what is important to them and tries to be a better version of themself - not someone who tries to be someone else.\n\nAccepting who you are doesn’t mean you’re perfect and shouldn’t try to improve. It just means **you’re not a failure for who you are today.** We’re all works in progress. And if we stop hating ourselves for 5 minutes we can look around and enjoy taking one step forward today even if there’s a lot of steps left. \n\nWhen you get to the end, it’s over. When you get to your last step you’re going to wish you had taken your time and smelled the roses along the way. You’re never going to be perfect. So don’t wish away the days that you’re getting better. Try to accept who you are and enjoy them. \n\nStop trying to live someone else’s life. This is your life, and you can’t get it back once it is gone.\n\nFurther reading: If this resonated with you then I highly recommend “The Alchemist” by Paulo Coelho. It’s a short novel about finding what is important to you, and it’s helped a lot of people disengage from the society life gave them that they never wanted. You will never be happy while living someone else’s life. Take off those horrible shoes. They’re causing you so much pain, you’ll go much farther when you live the life that fits you. (p.s. if you've already read that book then read Awareness by Anthony de Mello next, it's incredible!)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m4uafb/how_to_hate_yourself_less_stop_living_someone/", "title": "How to hate yourself less: stop living someone else's life", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 770, "down_vote": 0, "creation": 1615724292, "permalink": "/r/DecidingToBeBetter/comments/m4uafb/how_to_hate_yourself_less_stop_living_someone/", "nsfw": false, "first_save": 1635437223.4240134, "replies_charged": false}