{"id": "t5_2tand_t3_aqkin4", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "I've been studying self-improvement, self-discipline, self-growth for a little while now. It's an interesting topic, and an important one. What has really captured my interest lately is this question: Why is it that we don't do what we know we ought to do?\n\nAll of us know what we *should* be doing. Suppose it's going for a run every day. We've tried going for daily runs, it worked for a bit and then it stopped. Why *did* we stop? It doesn't really make any sense from a certain perspective. We know it's good for us, we know it's worth it. But it seems that there's some other aspect of us that wants to NOT to change... just as much as DO want to change.\n\nSo NOW we're in this situation where we both 100% want to run daily, (or quit smoking or whatever) and 100% want to keep the status quo. Energy is being expended in both directions. Like rowing a boat *really hard* but with the oars going opposite ways and us just spinning in mad circles.\n\nIt seems to me that self-mastery is the ability to get ALL of you moving in one direction, under one leadership, toward one outcome.\n\nSo how to attain this self-mastery?\n\n### Stop creating divisions in yourself.\n\nAs people we tend to divide ourselves into two categories:\n\n1) Aspects about ourselves that we approve of, and  \n2) Aspects about ourselves that we do not approve of.\n\nThis applies to our bodies, our personalities, our behaviours, our belongings... everything. There are things that we approve of and things that we don't.\n\nAs a result, we find ourselves constantly *at war* with that which we deem \"not okay\" in us. We attack it, and in the process we attack ourselves, creating suffering and inner conflict.\n\nWe also - if you'll allow me to get 'a little weird' - become so divided that even our very *consciousness* seems to get divided. This is why we start asking questions like \"How do I *get myself to* go for daily runs?\" or \"How do I stop sleeping in?\" See? Aren't these particularly fucky questions? What if I asked you, \"How do I get myself to my pinky finger?\" The answer is: \"There's no method... you just do it.\" But when it comes to putting good habits in place, there really seems to be two of us now, one dedicated or progress and the other dedicated to avoiding progress.\n\n### Unify yourself back into one. This is self-mastery.\n\nSo in order to become better people, we must stop condemning ourselves. We must learn to approve of all aspects of ourselves.\n\nWe can still change! People sometimes put up a fight at this point and say \"well if I just love and approve of myself as I am, what motivation will there be to improve as a person? I risk just staying as I am.\"\n\nThe falsity is that we believe we need cruelty and punishment in order to progress. It's not true. By creating a warm, supportive, approving, loving environment in yourself, you are able to think much more clearly and creatively about how to change yourself and your life for the better.\n\nIn fact it's loving and approving of yourself that allows you to coalesce back into one, undivided consciousness.\n\nSelf-mastery is not whipping yourself into utter submission so that you can bark orders at it and make it do what you want it to do. Instead, self-mastery is when you listen to and serve all of your aspects. You go on runs to make yourself healthy. You also make sure to satisfy the part of you that wants instant gratification. You work hard for your future, and you also sit around, watch TV and be lazy.\n\nAs you do THIS, all the parts come together and work together harmony. Now you are unified. Now you may proceed in one direction without self-sabotage.\n\nI hope this helps!\n\nBrent Huras  \nPersonal Coach\n\n*If you feel you have tons of potential that you wish to manifest in reality, it's important to receive the right support. Shoot me a DM if you'd like to learn if personal coaching is for you.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/aqkin4/you_grow_as_a_person_by_being_unified_not_divided/", "title": "You grow as a person by being unified, not divided.", "social_network": "reddit", "user": "brenthuras", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 545, "down_vote": 0, "creation": 1550155858, "permalink": "/r/DecidingToBeBetter/comments/aqkin4/you_grow_as_a_person_by_being_unified_not_divided/", "nsfw": false, "first_save": 1635437129.7913725, "replies_charged": false}