{"id": "t5_2tand_t3_o4i2r2", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I have depression and anxiety, I've had a rough life filled with traumas, abuse and insecurity. The pandemic hit me hard and I've isolated myself. I took therapy for a while and although it helped me at first, it took me downhill in the end so I didn't continue. I don't enjoy the things I used to love and I don't have energy for anything. I had my second suicide attempt too in this time. But I want to get better, I really do.\n\nA month ago I did a declutter of my bedroom because I was asphyxiating mentally with all the stuff and the memories. I revisited 30 years and cleaned my mind and my space. I Marie-Kondo-ed it, if it didn't spark joy, I put it away. Guys, I'm thriving, I finally have a space for me and the things I like. I know where my things are and I have only the things I can take care of. I have less clothes, less papers and files, I donated tons of toys, I tore apart letters and painful memories. \n\nI got a little plant and I'm determined to keep it alive.\n\nAnd now I decided to do the 75hard. It will be rough and I know I will fail multiple times, but I want to be healthy and I want to start reading again because I used to love it, it was one of my passions. I'm excited, but also kind of scared.\n\nAlso, in June 29th I will know if I'm accepted to a Masters program that I've been dreaming of for years, that would change my life completely for the better.\n\nPlease, wish me luck!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o4i2r2/i_know_i_can_be_the_best_version_of_myself_i_will/", "title": "I know I can be the best version of myself, I will be the woman I'd always dreamed to be", "social_network": "reddit", "user": "lemalduporc", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 27, "down_vote": 0, "creation": 1624232494, "permalink": "/r/DecidingToBeBetter/comments/o4i2r2/i_know_i_can_be_the_best_version_of_myself_i_will/", "nsfw": false, "first_save": 1635437301.5725312, "replies_charged": false}