{"id": "t5_2tand_t3_e8lszs", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I feel like I don’t have anyone to talk to about this except my sister who is experiencing the same feelings. Our parents are divorced and got divorced at a young age so it was a routine part of our life. We would switch between houses weekly so we could see our mom and dad an equal amount and this continued into high school. Ever since we graduated high school it’s like we both don’t know our dad anymore. \nUpon starting college my dad decided that he would not support us through school and would not co-sign loans, take out loans, or provide any type of material or monetary support. This is not uncommon but my dad had never told us this before spring of our senior year so my sister and I couldn’t save properly and had no financial plan. This left the responsibility to my mom and stepdad who so graciously took it on completely. With that being said, it felt like he abandoned us. My freshman year my dad visited me a total of one time at school (I go to school 25 min from his house) and I only saw him at family events of which my aunt or stepmom invited me to. I moved out of his house and began living full time at my moms which only moved us further apart. \nWith the start of my second year we actually talked because I needed advice about a living situation and was worried about being able to afford it, I asked for help but he stated that he was in no position to do so. I understand that he has two other kids with my stepmom and supported us through the first 18 years of life but is it wrong for me to feel like I was pushed aside? He stated he had to save for retirement and listed so many other reasons but I’m still his kid and he signed that contract to support me when he had me. \nThe icing on the cake was when he bought a new house. His family moved to a new home that is much larger and much nicer than the one they used to live in. By looking at the house you wouldn’t think he couldn’t support his two girls in college. \nIn all reality, I don’t even want monetary support. I just want my dad to take interest in my life; in my hobbies, studies, friends, etc. \nSo my question to you all is: should I tell him how I feel? \n\nIf you took the time to read this, thank you. I know these are what most people would call “privileged person problems” but it has constantly been on my mind for the past couple of months.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/e8lszs/lifting_a_burden/", "title": "Lifting a burden", "social_network": "reddit", "user": "mantlehraeb", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1575952631, "permalink": "/r/DecidingToBeBetter/comments/e8lszs/lifting_a_burden/", "nsfw": false, "first_save": 1635437861.5067892, "replies_charged": false}