{"id": "t5_2tand_t3_hl63s5", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "From the time I was a kid, I have always loved writing and it was my focus in college, but once I entered the workplace, that passion was lost. My writing became solely related to work endeavors, and then some different publications and blogs I contributed to, and along the way, I began to hate it. For the longest time I just assumed I had broken up with writing, which was hard to process.\n\nA good friend on Reddit suggested fan-fiction for an IP I really love (The Witcher) a few months back, and against every preconceived belief of how crazy fanfic was, I gave it a try.\n\nI am in love.\n\nMy passion for writing is back! I no longer waste time browsing on social media I truly couldn’t care less about, but am creating characters and stories and having a blast. I cannot believe it took me this long to realize that it wasn’t that I had lost my passion for writing, but I wasn’t passionate about the things I was writing about. I feel like the spark that I was missing for too long has been reignited, and I am beyond grateful. I’ve even begun working on an outline for a novel, my dream since I was little! \n\nI guess what I’m trying to say is if you had a passion for something and have lost it, don’t be afraid to look in an unexpected place to find it again. You just might, and it’s like welcoming back a long-lost friend.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hl63s5/i_rediscovered_my_passion_for_writing_in_the_most/", "title": "I rediscovered my passion for writing in the most unexpected of places...fan fiction...and it has been the greatest gift", "social_network": "reddit", "user": "LozaMoza82", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 76, "down_vote": 0, "creation": 1593880128, "permalink": "/r/DecidingToBeBetter/comments/hl63s5/i_rediscovered_my_passion_for_writing_in_the_most/", "nsfw": false, "first_save": 1635436831.454624, "replies_charged": false}