{"id": "t5_2tand_t3_3ksrdx", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "I am a 25 year old Bangladeshi male. My issue is that I can't seem to stop obsessing about the fact that my *physical attractiveness* is low. \n\n**Physical Attractiveness:** I am only 5 feet 4. I have a crooked nose and I wear thick glasses due to high myopia. I have only a slight moustache and no other facial hair. My face is not that good looking and recently I have started going bald. I believe that I am a 3/10 in terms of physical attractiveness when compared internationally. I know that with a score of 3/10, I will never get a girl who is 8/10+. Infact my experience has given me this view and now I value physical attractiveness very highly. \n\nI did not care about my physical attractiveness until a few years ago, when women started judging me, stamping a value and avoiding and rejecting me. I am frequently told to \"date in my league\" by most women who are 8/10+. I always thought that when you are in love, all these external qualities don't mean anything. But I was wrong. People fall in love and match up with those with the same physical attractiveness score as theirs. \n\nAccording to research people with the same physical attractiveness score match up with each other and consciously and unconsciously people \"score\" themselves and their potential mates to facilitate the match. Research also says that the majority of physical attractiveness is *culturally universal* and the rest is shaped by culture and personal differences. \n\nEven if I improved in other areas (charm, social skills etc), my total value in the \"marriage area\" will never increase over 6/10 and hence I will never get a girl who is an overall 8/10+. I also compare myself with other men and women and feel jealous and inferior to those whom I consider above me. \n\nMy goal is to *accept the fact that I am a 3/10 in physical attractiveness and that I will never get a girl above 8/10*. Any suggestions on how to do this? \n\nPS: Yes, this might seem very shallow, but that is the problem I am having. If you can't help, then please don't judge. Also excuse my grammatical errors as English is not my native language. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3ksrdx/how_do_i_accept_the_fact_that_i_am_ugly_looking/", "title": "How do I accept the fact that I am ugly looking and that no matter what I try I will never be able to be really attractive to women?", "social_network": "reddit", "user": "secretstorm", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1442162086, "permalink": "/r/DecidingToBeBetter/comments/3ksrdx/how_do_i_accept_the_fact_that_i_am_ugly_looking/", "nsfw": false, "first_save": 1635435843.0492933, "replies_charged": false}