{"id": "t5_2tand_t3_oo14sk", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Felt severely in the dumps and really needed to vent a little bit.\n\nI'm (M19) a very anxious person who tends to overthink things to an unnecessary level, so I ended up just... not doing things because I'm terrified of failure. And as a result, I now have no idea what self motivation even means. It doesn't matter how much I want something, I never seem to be able to do it.\n\nSo to tackle this problem I decided I needed to sign up for activities that will require me to show up at places, on time, and participate - external motivation, you know?\n\nTried to volunteer at an animal shelter because I'm good with animals and can meet new people. Tried to sign up for a gym and ate healthy so I could get in shape. Started meditating and trying different study methods...\n\nAnimal shelter? Lockdown, no new volunteers allowed.\n\nGym? Too expensive, parents aren't willing to put that much money into it (can't blame them, rlly)\n\nStudy methods? Ended up binging Season 1 of Psych\n\nWell, I wasn't going down that easily: find another gym, find another animal shelter, I thought - well this morning I just got the news that the only mode of transportation I have (which is a hand me down) is needed again by it's original owner who lives a couple states over so... no dice.\n\nTried waking up early and going for a run on my own: got chased by strays a couple blocks and had to stone them to get them to leave.\n\nAnd as if that wasn't enough, I just got rejected on my college applications.\n\nI'm not saying I'm going to give up, never going to do that, it's... frustrating, to feel pushback on the baby steps.\n\nStill I need to focus on the positives, I've picked up where I left off on that new language, and sometimes I play the guitar again. I even got some very helpful responses from this very sub on how to learn new things, which I've been following! I haven't thought of any of those depressing thoughts in almost two weeks!!\n\nNot really expecting much of a response to this, since it's not a cry for help or anything. Like I said, it's just a vent, and this sub has always lent me a listening ear, so thank you if you made it this far. I really appreciate it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oo14sk/feels_like_life_is_blocking_every_step_i_take/", "title": "Feels like life is blocking every step I take.", "social_network": "reddit", "user": "PanacottaCat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1626784339, "permalink": "/r/DecidingToBeBetter/comments/oo14sk/feels_like_life_is_blocking_every_step_i_take/", "nsfw": false, "first_save": 1635437501.972923, "replies_charged": false}