{"id": "t5_2tand_t3_ewla3t", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "I feel like my brain is really focused on finding new things all the time, and I must say this has some benefits, since it makes me a good researcher, I'm usually the person you go when you need to find something. The problem is that keeps me from committing to things because I lose the enthusiasm very quickly and practice becomes a chore, making me eventually quit it. Some examples:\nI pick up my guitar from time to time, half-ass the learning of some songs and eventually will stop playing for months.\nI have lots on unfinished online courses, because eventually I turned to some other thing\nIn Civilization I would discover the whole map and the other civilizations and the game would lost interest for me because there was not much more to find out\nSometimes when I want to learn something new I quit after getting a general knowledge of how it works\n\nI want to change this because although I have knowledge about a wide range of subjects, I don't feel like I'm any good at any of them and I want to dedicate time and practice in order to do so.\n\nSo, how should I approach this? This week I decided to set a goal of practicing a song on guitar for at least 10 minutes everyday. I set some time to draw and to practice some cardistry flourishes as well. Even if the others fail, I want the guitar to last. Do you have any other suggestions I can use to improve?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ewla3t/i_get_really_focused_on_new_things_or_the_early/", "title": "I get really focused on new things or the early phase of something new, but most of the time I can't keep my enthusiasm past that. I want to change that", "social_network": "reddit", "user": "ihavesixmagikarps", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1580458626, "permalink": "/r/DecidingToBeBetter/comments/ewla3t/i_get_really_focused_on_new_things_or_the_early/", "nsfw": false, "first_save": 1635436551.067667, "replies_charged": false}