{"id": "t5_2tand_t3_7nh6i7", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I lost myself over the course of 2017. I graduated halfway through 2016 from college and found myself back at home after this. I found a job pretty quickly at my at-the-time girlfriend’s dads company. I took the job because he offered it and I didn’t think there was any reason to be picky. \n\nI lost myself since that time. Since that day I haven’t grown as a person. At the time I had been with my girlfriend for 2 years and I loved her a lot. I wanted to marry her. The relationships with my friends suffered because of how much time I was spending with her. I only spent one or two days a month with them, even if that. I started to lose all the close friends I had and only hang with my girlfriend. \n\nShe ended up moving into the city near our hometown about 6 months after we were first back from school. It’s about a 40 minute drive from where we were and I didn’t think it was that big of a deal. \n\nFast forward 6 months from then and I gained 25 pounds since college, I don’t hang with any of my friends, im addicted to porn, I’m in 5k credit card debt, I live at home with my parents, and then she decided to break up with me. The things is, I don’t blame her. Im a shell of who I used to be. I lost who I was. I lost everything I’ve loved and I’m here in a pile of shit. I still haven’t found it back. \n\nI’m two months out of my ex dumping me. I’m starting to get my head in a better place than it has been but progress has been hard to come by. I’ve been trying to rekindle friendships with some people out here but it hasn’t been going that well. I feel like they all have their own lives and then I’m just here trying to squeeze my way into them. I feel like I have to force everything. I have to force myself to go to the gym, force myself to go hang with people, force myself to be pleasant around them, force myself to not watch porn, force myself to not spend money, it’s an endless list of forcing myself. \n\nI miss loving life. I miss not having to force it. I miss being in shape and being around people who care for me and want me there. I miss having the financial freedom to not have to think about it all the time. I miss being in harmony with myself. I’m in such a dark place and I’m having a hard time seeing the light. It’s nothing I would ever act on, but I’ve had thoughts of killing myself.\n\nWith all that said, here is the moment I’m deciding to take it back. I’m crying in my car as I write this because I need to take my life back. I won’t let myself keep going down this path. I don’t quite know how to take it back but the best I can do is live my life day to day working to make progress. I don’t know how to fix the things I’ve created but sitting here wallowing in my pain is no way to do that. I want to do anything else. I don’t even care what it is but I just need to get out. \n\nHere is the moment where I finally make the decision to put all this shit behind me. I don’t care if I put this weight on, I’m gonna work my ass to get it off. I don’t care if my ex left me, I’m going to be happy without her. I don’t care if I’m addicted to porn, here’s to being porn free for the rest of my life. I don’t care if I’m in debt, here’s to working my ass off to get out of it. I don’t care if I still live at home, I’ll find friends to move to the city with. I don’t care if I haven’t hit rock bottom yet. I’m making the choice right fucking now to change my life and to get back on the path I need to be happy.\n\nHere’s to making the choice to get my life back. Here’s to a better year than last. Here’s to finding harmony in my life and the world around me. Here’s to keeping my head up and working with everything I have to get what I want. It’s a choice to get it back and one I’m capable of making. \n\nEdit: Thank you so much everyone for the support. You have no idea how much it means to me after yesterday. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/7nh6i7/my_life_fell_apart_this_past_year/", "title": "My life fell apart this past year", "social_network": "reddit", "user": "Rattl3me_throw-away", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 80, "down_vote": 0, "creation": 1514836585, "permalink": "/r/DecidingToBeBetter/comments/7nh6i7/my_life_fell_apart_this_past_year/", "nsfw": false, "first_save": 1635437132.7057636, "replies_charged": false}