{"id": "t5_2tand_t3_dx201e", "request": ["5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Recently decided to do a little “mental maintenance” and discovered life had become so busy, robotic and repetitive with the day-to-day errands of keeping up with Jones’s I was beginning to forget who I was, what I loved doing, the people I loved being around, and neglected what made me authentic. It affected my most important relationships, and the most important one being the one I had with myself. It sounds cliche and a little daggy but lets face facts, it really does start with a healthy relationship yourself first, so the decision was made to do some soul searching, dig deep and re-align myself with what made me fall in love with waking up every morning full of beans and grabbing the bull by the horns!\n\nFor as long as I can remember I have always been fascinated about self discovery, creativity and really learning what makes people “tick” and fall passionately and deeply in love with life, what they do, and the people they choose to surround themselves with. You know, those stories you hear of those rare people discovering their true identity and purpose in life. So being fortunate enough to enjoy the company of so many different and unique people, professionally and personally, I decided to explore and genuinely get to know, learn and really understand what made these people authentic.\n\nWhat I discovered was there was one re-occurring theme - the more someone was totally and absolutely free to immerse themselves in what makes them truly who they are, the more they attracted the right crowd, right type of people, people who were on the same page, same chapter actually just in the exact same book. Don’t get me get me wrong they all had and still have their challenges, we all do. And it’s damn hard sometimes to follow that heart of yours in this noisy and contradicting world, but it seems to me life truly is a confidence game, and what goes around comes around, especially when it comes to the way we handle and treat other people. Now I’m not spinning some self development fluff here, or comparing it to the law of attraction, but you’ve got to admit, whether it’s they way mother nature, or the universe intended it, there’s an uncanny connection with being truly authentic, like really not giving a shit what other people think of your biggest, most boldest pursuits and the type of people, and relationships you attract and build along the way when you’re totally in tune.\n\nMaybe it’s just the lens I’ve chosen to see life through, either way it’s definitely built much stronger more meaningful connections and overall happiness both personally and professionally. Whether its just creative pursuits like writing music, being more present with my partner, or professionally in meeting and surrounding myself around the right people, no matter how I look at it, the more authentic and true to myself I am the deeper more genuine my relationships become.\n\nWould absolutely love to hear thoughts and feed back on this topic, maybe even some personnel experiences.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dx201e/has_anyone_else_thought_about_how_real_genuine/", "title": "Has anyone else thought about how real genuine authenticity helps create deeper and more meaningful connections and relationships?", "social_network": "reddit", "user": "write_your_own_story", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1573877323, "permalink": "/r/DecidingToBeBetter/comments/dx201e/has_anyone_else_thought_about_how_real_genuine/", "nsfw": false, "first_save": 1635436737.1939976, "replies_charged": false}