{"id": "t5_2tand_t3_avyr09", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "My car got towed today. \n\nThis has never happened to me before, I’m getting rid of the car in two weeks, going on a mini vacation very early tomorrow, and had to get some stuff for work done before I left. \n\nNot ideal timing. But I guess there is no ideal time for a car to get towed. \n\nAnyway, I was holding a few boxes as I am moving and wanted to bring them to my other place with me to pack more stuff. Was strolling along with my boxes and then realized my car was not where I left it on Sunday. My new apartment is in Queens so I never drive anywhere, haven’t seen it since Sunday. It was 6:15AM and I had planned to drive back to Long Island before work to drop off my car at my old place and would come straight back to queens after work so I can leave for my trip early tomorrow morning. \nPlans got diverted a bit. \n\nMy initial response was panic - I knew no one stole it because my car is very old and not appealing. I was wracking my brain for a while because the outlines on the road showed I was in a parking spot and there was a car exactly where mine had been, and I’ve seen cars there before too. I backed out of range and there was a no-standing sign. I hadn’t seen it and my boyfriend and I had gone to the car on Sunday to bring things up and he didn’t notice it either (plus he’s been living there for over 2 years and has seen cars there a bunch). \n\nAfter the panic I went into fixer mode- researched what to do as I don’t know protocol, called 311, gave them my license plate number and the automated system told me exactly where it was (I thought that was kind of cool and figured I’d share that for anyone in the NY area who might find themselves in this position). It was 7:05 at this point and the place doesn’t open until 8AM. \n\nSo I sat there thinking for a little bit, beating myself up for not being more thorough in checking out the parking spot because if I had, I would’ve realized - and was getting myself quite stressed because I had a very specific plan for the day that was ruined: wake up, drive my car back to Long Beach before work (because i can’t leave it in queens with alternate side parking since i won’t be here), take the train to work from Long Island, work, go to pick up the rental car straight from work with boyfriend, go to sleep early, wake up at 4AM for snowboarding trip tomorrow. \n\nThis really fucked with that plan. But I’ve been growing and learning how to handle things that are unexpected (meaning everything as things never go as we plan) and not needing to control everything. This was a perfect time to apply my practice. I stopped the thoughts and then I decided to meditate before I hopped on the subway to work. \n\nMy car is currently comfortably home in Long Beach and I’m on the train back to Queens, getting there earlier than I had expected had everything gone “the right way”. I got to work early and told my boss about the situation when she arrived later in the morning and she laughed and said, “I’ve been to that exact towing spot” go whenever you need to go, go now if you want, very sincerely. I stuck around for a little while as I wanted to finish up some things and knew I didn’t have to go so quickly, as I spoke to the person at the towing place and she assured me I wouldn’t be charged more if I left it until the end of the day. \n\nThis isn’t really a story about my car being towed. It’s a story about how we can create mountains out of molehills and spiral down a terrible rabbit hole, making the situation worse than it has to be. I used to do that a lot. I’m not thrilled about having to pay a towing fee or the (3) separate parking tickets I got on 3 different days for the same exact thing but it could be worse. I’m fortunate enough to have a car. It’s the car my dad taught me to drive on. It’s old and beat up and has 156,000 miles on it but it’s a trooper. My dad is very sick and in hospice and every time I’m in it, it reminds me of him and how he never let my mom drive the car but taught me to drive on it. I’m sad to let it go but also know that a car doesn’t hold memories, only I can. \n\nI grew up very privileged (nice way of saying spoiled and enabled) and always was the one who got the new car. When my parents moved to Florida over two years ago, my mom and I mutually agreed no more hand-outs. Whenever she gave to me it came with a price, me not understanding or taking ownership or responsibility and her resenting every penny she spent on me. I’ve grown more in these two years than the 25 prior ones I’ve spent on this planet. \n\nI used to spend my days victimizing myself. When I did this, one bad thing led to a bad day, and a bad day meant a bad life. I didn’t know how to get myself out of it. I was stuck in so much bitterness and pity for so long  and if this happened even 2 years ago I would’ve made it into the end of the world. \n\nToday wasn’t the best day but I chose to look at the good in it. I rescued my dads car on an adventure - rode in a cop car for what I hope is the only time (they take you in the cop car to get to your car - which shocked me haha), I got to leave work early, I’m getting home earlier than expected, on the way home I was detoured in a route I NEVER go on and it took me passed the hospital I was taken to after I hurt myself on hunter mountain because my ex boyfriend wouldn’t take me to one nearby and insisted we go back to Long Island and I was reminded of how far I’ve come from that day. It was 3 years ago to the weekend. I had a very spiritual experience on that Mountain after I got hurt, my ex and I broke up shortly after, and my entire life has only changed for the better from what I thought was one of the top 3 worst things I’ve ever experienced at one point. \n\nWe can choose the type of experience we have. I’ve chosen both the negative side and positive side. I’ve been resistant and I’ve enabled allowance. \n\nAllowance and positivity have always worked in my experience. They’ve healed things I thought were forever broken. They’ve made situations better. Resistance and negativity, not so much. \n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/avyr09/my_car_got_towed_today_and_i_was_forced_to/", "title": "my car got towed today and I was ‘forced‘ to remember that sometimes I can’t control things and peace exists no matter the circumstance", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1551403257, "permalink": "/r/DecidingToBeBetter/comments/avyr09/my_car_got_towed_today_and_i_was_forced_to/", "nsfw": false, "first_save": 1635437866.1160192, "replies_charged": false}