{"id": "t5_2tand_t3_mogatc", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I've tried meditation, organizational tools, alarms, pomodoro, boards in my dining room, post-its, watching/listening to stuff while doing chores, advanced pomodoro for the lazy, color codes, basic conditioning, journaling in all fkn shapes or forms, all these mental tricks and strategies\n\nEckart Tole, Viktor Frankl, David Goggins, Steven Pressfield, Jordan Peterson, Tim Ferris, Alain de Botton, Dale Carnegie, Kristen Neff, you name it, on top of all sorts of niche shit, actual academic manuals about CBT and everything that you can think of relating to ADHD and so many other things\n\nAll the fuckin' self-help, psychology YouTube videos that get thrown around these circles, an insane amount of Reddit threads, psychology today and the like articles, podcasts, bruh\n\nMy life is this stupid, ridiculous cycle of periodic 20% \"shit, this might actually work\" where I get into these surges of being hopeful and am doing shit to get out of the mud, and 80% \"I'm fucked for life\" where I can't even get out of bed, talk to people or be a normal person, and would rather stare at screen or the fuckin ceiling than doing something\n\nThis has been going for 7 years; I managed to drop out of school twice, lose all possible friends I had, getting stuck at the bottom of the professional ladder with no hopes of having a real job, and am holding on to university because of that one year I crammed so hard I managed a one-year 4.1GPA average\n\nI was really hoping for my ADHD diagnosis to help me shed some light on all of this, but I'm stuck exactly where I was.\n\nI know globally what the fuck is wrong with me (I'm a perfectionist, I'm super hard on myself, I got big trust issues, I compulsively rely on my coping mechanisms, I'm incredibly volatile etcetc) but no matter what I do, I can't seem to be able to change, and as the years pass I keep losing hope and motivation to do something about it.\n\nI feel so fucking useless that I grasp on any opportunity to feel useful only to realize I'm just letting people down again. Some people learned to take real good advantage of that and it really doesn't make things easier.\n\n&#x200B;\n\nIf someone can relate to that and has figured out a way, yo, **please** tell me your story. I just want a way out of this; I'm tired of feeling lost and confused, and I can't rely on the outside world to help me with this.\n\nEDIT: You're all awesome. Taking this time to read all your comments and respond to everyone is genuinely insightful. I'm grateful for all of you and for this sub. Thank you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mogatc/ive_been_trying_to_not_be_a_lazy_loser_for_years/", "title": "I've been trying to not be a lazy loser for years. I read, watched and listened to hundreds of hours worth of self-help, I spent years building coping strategies that failed, I got put on Vyvanse, emptied my savings for therapy, and I'm still lazy and unreliable. Where do I go from now?", "social_network": "reddit", "user": "DramaticPapayaEater", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 54, "down_vote": 0, "creation": 1618099978, "permalink": "/r/DecidingToBeBetter/comments/mogatc/ive_been_trying_to_not_be_a_lazy_loser_for_years/", "nsfw": false, "first_save": 1635435087.6275277, "replies_charged": false}