{"id": "t5_2tand_t3_8qut23", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "I wasn't really sure how to title this, and I also don't know if this is the right place to post this, so bear with me. I've been really thinking a lot today about something that happened when I was in around 15. Short story: My mom wasn't able to give me a ride home from school one day so one of my classmates mothers offered to give me a ride home. So here we are, myself, my classmate ( a girl who had a pretty big crush on me) and her mom, all driving to my house ( 20 minute drive from school).\n\nHeres the thing, for some reason, during the entire ride home I felt more layed back and relaxed than I have ever felt in my entire life. It was literally like I suddenly became I completely different person, and I don't mean that lightly. The difference was jarring. I have never felt that calm in my entire life, I have no idea where that came from. I'm normally a very anxious person; I'm constantly worried about what other people think of me, often jealous of others, depressed, antsy, my brain is constantly thinking about 20 things at once (thanks adhd). \n\nThis was the complete opposite. I was totally and utterly carefree in that moment, it was beautiful. Even my classmate's mom mentioned how \"layed back\" I was. No one has ever said that to me before. I just felt so humble and down to earth, how did this change happen so quick and why can't I figure out how to be like that now? Soon after I arrived home I went back to how I normally am, the change went as fast as It came. The whole thing felt like I was on drugs, like I had just taken a handful of Xanax or something. I read somewhere on reddit that true bliss comes from letting go of your ego and simply being \"conscious\". Maybe that's what I did without realizing it? Has anyone experienced a sudden personality change like this? Could someone explain what could have caused such a drastic change in demeaner? Is it possible to feel like this all the time? How? Lots of questions, sorry.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8qut23/i_experienced_a_drastic_personality_change/", "title": "I experienced a drastic personality change", "social_network": "reddit", "user": "14thCluelessbird", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1528914740, "permalink": "/r/DecidingToBeBetter/comments/8qut23/i_experienced_a_drastic_personality_change/", "nsfw": false, "first_save": 1635435652.0660262, "replies_charged": false}