{"id": "t5_2tand_t3_qgejw3", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "c6df14ee-195b-4e9d-8032-7cca73d46fe8"], "text": "\nI don’t know how to love myself…\n\nI hate my anxiety\n\nI hate my anger\n\nI hate my shyness \n\nI hate how I’ve grown so insecure with myself that I can’t even stand the thought of being complimented or even look at myself in the mirror.\n\nI hate how jealous I am towards the people around me and it has taken a toll on my relationships\n\nI hate that I cry so much that it is deemed as  a distraction towards people\n\nI hate how I cry so much and so often that even my own friends won’t comfort me\n\nI hate that I’m a difficult person to handle\n\nI hate how inexperienced I am with social interactions \n\nI hate how I can’t form meaningful connections\n\nI hate how I can’t make friends or maintain friendships\n\nI hate how I absent I am with the people in my life and that I cannot see them often outside of school (I have strict parents)\n\nI hate how I expect people to care about me when I haven’t been so present emotionally\n\nI hate that I’m the reason people develop trust issues\n\nI hate that I’m the reason people cry\n\nI hate how toxic I’ve become that people had to remind me through their actions (my bf cheated on me with my best friend and they didn’t tell me for two months)\n\nWhen I see myself, I see a horrible, disgusting human being who will never amount to anything in life. Someone who will never change for the better. And I don’t want to feel that way anymore.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgejw3/i_hate_the_person_i_have_become_and_i_cant_sleep/", "title": "I hate the person I have become and I can’t sleep knowing that I’ve hurt the people I love", "social_network": "reddit", "user": "mini_bunn", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 93, "down_vote": 0, "creation": 1635277655, "permalink": "/r/DecidingToBeBetter/comments/qgejw3/i_hate_the_person_i_have_become_and_i_cant_sleep/", "nsfw": false, "first_save": 1635435945.2961323, "replies_charged": false}