{"id": "t5_2tand_t3_nb90ur", "request": ["cbd1933a-caaa-464d-8e4c-373318982c62", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I changed my major from engineering to atmospheric science today. I just finished my fourth year of college in the US and I was planning to push through and finish my engineering degree next spring. I had a heart to heart with my mom today and told her how miserable my classes have been making me. I’m really good at engineering but I have no interest in my major classes (core stuff like thermo and fluid mechanics was fine) so this past semester in particular has been so hard. She asked me if I could change my major; I’ve been thinking about it, but I didn’t think my parents would approve. I was so pleasantly surprised. \n\nAtmospheric science won’t be any easier, but it’ll be so much more interesting. I’ve been doing atmospheric science research this semester and after four years of floating listlessly through school, everything fell into place. I knew I wanted to pursue a career in this field, and I started planning for grad school. One major problem though is that I can’t get rec letters. I was going to have to suck up to professors this next year and take a gap year. \n\nBut now I can actually go make connections in person. I won’t have to fake being interested in my classes. I’ll be able to get my rec letters. I’ll have more research experience under my belt when I apply for grad school, and I’ll be able to apply directly to PhD programs, and good ones, with a much stronger application. \n\nI’m not excited about an extra year in school because I do not like my school. However, it’s all so worth it. The thought of taking the engineering classes I was registered for in the fall honestly made me feel suicidal. My depression has been so bad this semester and it was never going to improve if I didn’t change my situation. I’ve also been dealing with problem drinking for years now and I hope that this is a catalyst to help me fully quit (after cutting back significantly this year). Hopefully I won’t feel the need to drink excessively to cope. \n\nIf you read this far, thanks. I had to get it all out. I feel nearly euphoric. I cried in the car driving home from lunch with my mom because I was so damn relieved. I feel so much more hopeful than I have in a long time. There are so many other aspects of my life I need to work on, but hopefully this helps bring me back to life after two years of being a zombie.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nb90ur/i_changed_my_major_today_after_two_years_of/", "title": "I changed my major today after two years of school wreaking havoc on my mental and physical health", "social_network": "reddit", "user": "AStruggling8", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 69, "down_vote": 0, "creation": 1620882606, "permalink": "/r/DecidingToBeBetter/comments/nb90ur/i_changed_my_major_today_after_two_years_of/", "nsfw": false, "first_save": 1635436404.2391675, "replies_charged": false}