{"id": "t5_2tand_t3_e4waqu", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "2019 has not been a particularly good year for me. I failed to get my preferred research position, broke contact with a few really close friends, gained like 10 kilos, missed too many classes while in college, messed up my sleep schedule, drank and smoked up much more than I did last year, didn't manage my finances well, was severely paranoid and depressed for a few months, and felt like a real asshole at times. I did graduate though, and am starting a new job next week in a new city (my current job is fine, just doesn't pay well enough). I'm moving into my own rented apartment for the first time, and have decided that I'll have to sort my life out. Here are few things I've decided I'll start doing from the next week onward:  \n\n\n1. Wake up early (I used to wake up at 10:30 for almost the entire year).\n2. Maintain my room, buy some quality furniture, take care of my posture while sitting, will get a few houseplants and take care of them.\n3. I will cook for myself, and start a high-protein diet. No more delivery pizzas.\n4. My office is 3km away from my apartment. I will not rent a cab/bike unless it's an emergency, and will jog to and from office every working day. Also, I will not spend a single extra minute in office than is required. My work-hours will be productive and free of Reddit scrolling.\n5. I will re-establish connections with people I've unwittingly broken ties with. This might take a while, but I will do it.\n6. I will manage my finances better, and abstain from spending all my savings. If and when the savings pile up, I will decide what I need to do with it. \n7. Marijuana will have to gradually wear off from my life. The 2 hours of bliss are not worth all the overeating and drowsiness that carries on until the next day.\n8. I will read more (both technical and non-technical material), pick up some of my old hobbies (playing the keyboard, sketching, plantkeeping), take up a few freelancing projects to keep myself productive!\n9. I will not get terribly upset if the team I support loses a match. However, I will keep watching matches as a means to socialize with my friends.\n\nI hope the positivity on this sub keeps me going and help me become a better person overall. I hope I do well enough to post an update in a few months. Thanks for reading, and wishing all of you the best for success in your ascends!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/e4waqu/i_will_change_myself/", "title": "I will change myself!", "social_network": "reddit", "user": "DeadRootsStirring", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 24, "down_vote": 0, "creation": 1575276253, "permalink": "/r/DecidingToBeBetter/comments/e4waqu/i_will_change_myself/", "nsfw": false, "first_save": 1635435636.4986486, "replies_charged": false}