{"id": "t5_2tand_t3_kfkz1u", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I've had a strong desire to receive tantric or erotic massages by male massage therapists who are also nonconformists and LGBT allies (not one or the other - if so, I won't work with them).\n\nI'm also understanding of some who may be attracted to me and want to get to know me first.\n\nAs a 7 time dating abuse survivor, Munchausen's by proxy survivor, and time domestic violence survivor, LGBT abuse survivor and countless-times-over domestic violence survivor, I wanted to figure out how I could use my love of sexual privacy, alternative lifestyles & nonconformity to lead me toward a safe and positive bond & experience.\n\nIs this something I should do?  \nIf not, what are some other methods of healing I could try?  \nI am well aware that it is America's second lock down, and I need to socially distance - and my living situation is not ideal to host anybody - whether they're friends, lovers, or even online pen pals I want to invite to my house.\n\nI'm also in the later stages of moving out, and am on a budget if $680 per month and have to stretch every cent out for 30 days - except for all my annual bills (which are paid for 1-3 years, in various capacities); food, which I receive separate income for; and health insurance, which is also paid for by one of my abusers.\n\nI've spent my entire life being told how I wouldn't amount to anything because I'm a YouTuber; being told by every race in the book (who I either flirted with or swapped photos with) that I can't date them because I'm ugly and was sometimes subjected to sexual racism because of it (I'm a black, 24 year old man).  \nAs I write this, I've written a list of all the people who \"committed domestic violence & LGBT abuse toward me\" - and have 35 people documented in my notes, who are all former friends, family members, exes, \"almost relationships (people who were attracted to me and when I brought up dating, they cut me out their lives and never spoke to me again)\".\n\nI just want to find a way to meet free thinkers who hate toxic masculinity and antifeminism as well, who are open to being my friend and seeing where it goes - and also a way to always be able to reach out to them if I need help with my family - almost like needing an ally or liberator against my own family.\n\nI've always wanted to create a round table web series where I'm the host and I interview free thinkers and people who used to be set in their ways (who are young, like the free thinkers) and are now open to exploring neutrality, due to some type of circumstance that led them to knowing me personally, and doing my show.\n\nI am also a major supporter of astrology, tarot, psychics and numerology, and am someone who rebelled against my family and religion at an early age - I've been an atheist since age 13 (I'm 24 now).\n\nI dated 4 addicts in the past + having 2 addicts hide their romantic feelings for me, and then all that be taken (without my knowledge) the moment I join their Facebook Live show & their whole focus be toward me, so I refuse to date an addict who isn't in rehab or hasn't been vulnerable with themselves about their addiction - so if they can't be vulnerable enough to admit they're an addict, then they'll never break any barriers with me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kfkz1u/im_destressing_from_my_familys_racism_misogyny/", "title": "I'm destressing from my family's racism, misogyny, homophobia & transphobia by seeking a welcoming & open, male massage therapist (for long term sessions).", "social_network": "reddit", "user": "Expert-Spend", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1608297536, "permalink": "/r/DecidingToBeBetter/comments/kfkz1u/im_destressing_from_my_familys_racism_misogyny/", "nsfw": false, "first_save": 1635438322.5400972, "replies_charged": false}