{"id": "t5_2tand_t3_cvol51", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I've always struggled financially. I work from home as a freelancer and some months I make barely enough to pay the bills. I have a lot of problems with focus and motivation (and diagnosed mental illnesses), which I've been working on, but progress is slow.\n\nCurrently, I live with my girlfriend. She has a job in IT, makes more money in a month than I've made all year, and is pretty constantly hit on by well-off, successful people. I frequently find myself worrying that someone better will catch her eye and she'll realize I'm not worth it. I do a lot of the house chores and cook and so on, but that only goes so far. It's hard not to feel extremely inadequate.\n\nBut I've realized that allowing myself to continue to indulge in that emotion is self-defeating. I end up convinced that I can't offer or accomplish anything of value even when I know that she values what I do contribute. And I'm sure it can't be pleasant for her to hear me repeatedly voice worries about that feeling.\n\nSo I'm making a promise to myself, and posting it here so I know other people have seen it and I can't go back on it.\n\nI'm not going to keep wallowing in those negative feelings. I'm going to trust my girlfriend when she tells me that I'm worth having around. I'm going to believe that I am enough even on the bad days, and focus on improvement and success instead of dwelling on failures. And maybe one day soon I'll have my shit together enough to actually take my girlfriend out on a nice date.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cvol51/deciding_to_stop_feeling_inadequate/", "title": "Deciding to Stop Feeling Inadequate", "social_network": "reddit", "user": "TheHouseYouBuilt", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1566828565, "permalink": "/r/DecidingToBeBetter/comments/cvol51/deciding_to_stop_feeling_inadequate/", "nsfw": false, "first_save": 1635437700.4336014, "replies_charged": false}