{"id": "t5_2tand_t3_q35hy2", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "If you are anything like me and judging by a lot of the posts around here you are, you most likely have certain goals and are failing to achieve them. You procrastinate, you haven’t gone to the gym since that one time two months ago when you were just too tired and you clearly have a problem with discipline and motivation.\n\nI’ve been at the same place for years, constantly trying to stick to something and then feeling bad when I consequently gave up. But I have found a good way to get out of that slump, that I want to share with you. Try it out for a month, you have nothing to lose.\n\n&#x200B;\n\n**1. Don’t have goals**\n\nMost of the goals people have are not actually their real goals. People try to go to the gym to look better, they start programming with the goal to become a great programmer, etc. But everyone likes the idea to look better or be a great programmer or be a great pianist or be extraordinarily successful. These are not special or unique goals of yours. If you constantly fail at sticking to the required practice to get there, it is not your fault. You actually shouldn’t stick to it, since you most likely do not enjoy the process and are therefore wasting your precious time.\n\nInstead, goals should evolve out of your enjoyment of the process. First of all, you might never achieve your goal but you at least had fun on the way there. Second of all, only when you enjoy the first step can you be sure to enjoy the place at the end of the journey.\n\nSo for one month throw all of your goals out of the window and don’t think about them. Everything you start, you do without any goal in mind.\n\n&#x200B;\n\n**2. Try out new stuff**\n\nNow, since we got that out of the way, we are trying to build days that you enjoy. A lot of people go to work or uni, come home, and watch TV or video games to just get the day over until they are overcome by a surge of motivation “to turn things around” and start on an unsustainable routine for 2 weeks until giving up again. Of course, this is not an enjoyable lifestyle. Instead for the next month, try to find activities you truly enjoy to fill out your days. How do you do that?\n\nFirst of all, try out a lot and give yourself permission to give up at any point. Going to the gym, but find it boring? On to badminton, it is. Or football, or basketball or playing piano, or drawing. You get the idea. If you don’t enjoy it, don’t do it. Without any goals in mind. Eventually, you will find one or two things you are looking forward to doing the next day again. Then you know you found yourself a new hobby.\n\nSecond of all, don’t make it a chore. If you are like me and try out new things, you are probably inclined to create a good practice routine. For example, when starting piano, you look up the subreddit and check out their beginner routine. 10 minutes of scales, followed by 30 minutes of practicing a beginner piece. Don’t do this!\n\nInstead, try it out without any plan. If you are trying out piano, pick a simple song, look up the chords and try to play it. If you are trying out drawing, don’t start drawing a bunch of circles as many places suggest, but pull up DeviantArt and just copy some pictures you think are cool. You don’t have a goal, but to try it out, so nothing has to be perfect. Not the end result, nor the practice itself.\n\nSlowly you’ll have a bunch of building blocks for creating enjoyable days. You're gonna come home from work and play basketball and then come home and play some drums before going to bed. The next day it is having dinner with friends and then drawing a bit to wind down. But every activity is something you enjoy and are not doing to achieve some arbitrary goal. You are building a balanced life, that you truly want to live.\n\n&#x200B;\n\n**3. That’s it**\n\nWell, that’s it. It is simple, but I do think a lot of young people like myself are chasing wrong goals, consequently fail to stick to them and feel bad about themself. If that's not the case for you, that’s great, otherwise, you have nothing to lose to try this out for a month.\n\nThis way of thinking about my life, as a space, that I want to fill with things I truly enjoy, changed how I live my life more than any self-help book or youtube video I’ve watched the past 5 years. I started playing basketball, found a gym buddy, so going to the gym is a lot of fun now, started producing music and started doing a lot more with friends, which I previously only did on the weekends, and started hiking. Out of these things, simple goals have evolved that I have no problem sticking to since I enjoy the process itself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q35hy2/dont_have_goals_build_your_life_around_the_things/", "title": "Don't have goals. Build your life around the things you truly enjoy and goals will come out of it.", "social_network": "reddit", "user": "MarcoSander567", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 36, "down_vote": 0, "creation": 1633599739, "permalink": "/r/DecidingToBeBetter/comments/q35hy2/dont_have_goals_build_your_life_around_the_things/", "nsfw": false, "first_save": 1635435220.7513406, "replies_charged": false}