{"id": "t5_2tand_t3_fuildc", "request": ["8461abc5-2740-47d4-9b1f-f9a34c328cd4"], "text": "# Why does one have to suffer before becoming successful?\n\nWhat do you see here?\n\n[(picture of coal)](https://i.redd.it/iwrj5whxkoq41.jpg)\n\nThe literal answer is coal: an unassuming blackish brown sedimentary rock that is primarily made up of carbon.\n\nAnd to the untrained eye that’s all there is.\n\nThe experienced person, however, knows to look beyond the immediate and also sees **a beautifully crafted diamond.**\n\n[(picture of a diamond)](https://i.redd.it/t8rax7zlloq41.jpg)\n\nFor with enough heat, pressure, and time, the ugly and unassuming coal becomes the epitome of elegance and grace that we call a diamond. **This is natural law.**\n\nHuman suffering and growth operate in much the same way: suffering precedes growth just as coal precedes diamond.\n\nIn other words, without the human equivalent of “heat” and “pressure” your weakness will likely never become strengths and thus you will never grow.\n\n**So, yes, strictly speaking you have to suffer to grow in life.**\n\nThe most important thing to remember, however, is that suffering is only suffering if you choose to acknowledge it as such.\n\nSure there is “real” suffering, the kind that comes from war, famine, and natural disaster, but that’s not the kind we’re talking about here.\n\nOur suffering is more accurately described as **struggle**.\n\nMarcus Aurelius said:\n\n>**“our life is what our thoughts make it.”**\n\nSo next time you’re suffering take a moment to pause and ask yourself:\n\n**\"am I really suffering, or am I merely struggling?\"**\n\nIf the answer is struggling then persist with all the force of a great typhoon because eventually that struggle will turn your inner coal into beautiful diamonds...\n\n**and you will find that you have indeed grown.**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fuildc/why_does_one_have_to_suffer_before_becoming/", "title": "Why does one have to suffer before becoming successful?", "social_network": "reddit", "user": "ALefty", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1585955110, "permalink": "/r/DecidingToBeBetter/comments/fuildc/why_does_one_have_to_suffer_before_becoming/", "nsfw": false, "first_save": 1635436337.144452, "replies_charged": false}