{"id": "t5_2tand_t3_p3ekp4", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "*I hope this is the right kind of post for this sub.* 😢\n\nIntense emotions, negative rumination and low self-esteem (especially in terms of my body) are some of the things I'm working on.\n\nMy deep empathy causes me to take on the pain of others, even strangers and feel like it's happening to me personally, and I allow it to snowball and ruin my day (sometimes days). \n\nNegative labelling as well, for instance - I often use terms like \"I'm so stupid\" and \"I'm such a loser\" to myself. I smile when I'm saying it, and though I feel like I mean them wryly and light-heartedly, I think I might be reinforcing such labels on myself and I am trying to replace them with kinder thoughts.\n\nMy body disappoints me repeatedly, over and over again. I can't bear to look at myself, sometimes. I've always been big girl, for many reasons (I coped with food when things got tough). But that had led to me having a body and body parts that I feel are not up to par and might be quite 'sad'. It feels unbearable sometimes and I wonder what my future partner might see in me.\n\nI notice that when I'm feeling 'down' sometimes, I tend to seek out more negativity to consume (usually the stories of others) and make myself feel worse (it's like some twisted way of misusing empathy to validate and worsen the negative emotions I'm feeling). Sometimes, just my thoughts are enough to push me down further.\n\nSometimes, I feel like I'm leading a double life because I'm usually so jovial and bubbly, nobody would guess I'm dealing with such things. :(\n\nAll that said, recently, I've been trying to be mindful of my thinking, and proactive in 'catching' myself before my thoughts run away and carry me into a worse headspace.\n\nI've gone particularly heavy on that this past week and it has helped!\n\nYes, there have been moments when my thoughts have run amok, but I have put effort into either reeling them in, or, at the very least, not allowing them to get worse.\n\nI remind myself not to compare, that I'm on my own journey. I've pretty much disengaged from all social media except reddit for quite some time now, which also helps.\n\nI remind myself to be kind with myself and I curate, carefully, what I take into me in terms of content - especially when I'm feeling out of it.\n\nThere have been hits and misses, but I have been conscious about trying, as my comment history recently attests to and I actually go back and read my recent comment history when I want to remember that the effort is worth the effort.\n\nI'm still going to have to find a way around the negativity I feel around my body.\n\nI've recently started eating better and my appetite has improved tremendously (I've not been using food to cope for about 2 weeks now).\n\nBur when I think about and read things about how a big body can be further wrecked by weight-loss appearance wise, I wonder if I should even take the chance (which is a ridiculous though in the face of improved health, which is the goal here, but it is a thought nonetheless).\n\nI regret plenty. \n\nI regret not taking better care of myself and my body. \n\nI fear the unknown and the lack of control I will have in that area.\n\nSigh.\n\nBut I intend to continue persevering in what I've been able to, thus far.\n\nI've lived by faith all this while. I'll continue to have faith that there will be a way for me through the present challenges too.\n\n***Edit: After typing this out, but before posting it, I was researching an insecurity and go very very carried away and spiraled by digging into other people's negative experiences. I just extricated myself, but I feel worn out and tired. Nonetheless, it's only 12.37pm now and I shall try to change the tone of this day. At least I'm aware :) I'll try to not give in to the spiraling again. Got to remind myself that I'm living my own life and not the lives of others. There's a difference between empathising and absorbing. It's not fair to expect my mind and heart to take on things they shouldn't have to.***", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p3ekp4/trying_to_be_mindful_with_my_thoughts_while/", "title": "Trying to be mindful with my thoughts while countering negativity & low self-esteem.", "social_network": "reddit", "user": "WhimsyQuodlibet", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1628822088, "permalink": "/r/DecidingToBeBetter/comments/p3ekp4/trying_to_be_mindful_with_my_thoughts_while/", "nsfw": false, "first_save": 1635436459.4104993, "replies_charged": false}