{"id": "t5_2tand_t3_oorlqp", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "After coming to the realization that this has to be the last time I take someone back who doesn’t want to better themselves, I’ve decided to focus on bettering myself. \n\nThe past 4 years I feel like I’ve grown a lot and tried really well to change small habits to become healthier. However, self care was still lacking due to the constant worry in the back of my mind of my exes actions/behaviors. I think it really hit me when he realized we were done instead of reflecting and learning anything he yet again was just looking some female, again. Some people jus won’t change. It really hit deep that he was looking up a young female that of course has no kids and dresses up really cute make up hair and clothes. I haven’t had the time to care for myself like that since I had my first child. I felt like I was the one carrying most of the adulting/responsibilities and so when we broke up and I saw the girl he was focusing on it was a huge slap in the face and just really registered for me that I cannot live this life any longer. And instead of obsessing over the countless hurts he’s caused and replaying them over and over in my head, I’m choosing to focus on changing myself and practicing better self care that I let go. Well, I’m sure I’ll still have struggles with that part but my goals are:\n\n1) shower every day. Also make sure the kiddos do. \n2) waking up early for workouts (5AM) to give myself time to shower and do my hair after (I rarely had time to do anything for myself like hit or makeup I was always getting the kids ready I just stopped caring about me) and have breakfast with the kids before leaving the house. \n3) washing my face every night\n4) turning this house into the home I want it to be, because I refuse to let the unexpected break up ruin this home for my kids. If I have to work two jobs then I will. \n5) more hikes, outings to new places, and hanging with friends. I realize I lost a lot of relations since I got with him and I miss them. He never cared to go hiking only on a guys trip that involved alcohol and who knows what. So actually getting out to do things with people (that also enjoy it) will be nice.\n\nJust for starters, speaking it into existence", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oorlqp/post_break_up_goals_im_making_for_myself/", "title": "Post break up goals I’m making for myself", "social_network": "reddit", "user": "Illcomeupwithitlater", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 18, "down_vote": 0, "creation": 1626879535, "permalink": "/r/DecidingToBeBetter/comments/oorlqp/post_break_up_goals_im_making_for_myself/", "nsfw": false, "first_save": 1635437987.4691856, "replies_charged": false}