{"id": "t5_2tand_t3_o0w1p3", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I made lessons, not necessarily mistakes. I cussed out people on the internet, I hated people who were different from me because I was told to do so. Then I somewhat met those people and hated them less and less until I didn't anymore. For now, I can say I see the beauty that I didn't see in all people before. But before that, people who looked a certain way bullied me because I looked a certain way, and even if I knew everyone who looked that way was not like that, I hated them all for it. I spewed hate for them constantly, like it was a mission of mine to cuss out every person on the internet. To start unnecessary arguments and type with a vengeance to say, \"OH! I'M RIGHT AND YOU'RE WRONG!\", \"YOU'RE THIS AND YOU'RE THAT\". For every hateful comment I spewed, I got plenty of them in return. This was a lesson I learned, I paid the price for it and I might even pay it again someday. I don't remember what I said, 12, 13, 14, or 11 years old I was. I was also alone, with nothing else to do so I went and did that. I talked to people on the internet, cussed em out, said racist things to em. They reciprocated the favor, and my heart beat very fast whenever I got a reply in a heated argument that I was so desperate to respond to. Like I said, I learned that the hard way and it might even come back to bite me in my tooshie (ah heh, I would say another word you know) one day. If it does, I'll travel back in time, beat my 13 year old bottom up, and take my phone or tablet away.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o0w1p3/i_hated_people_who_hated_me_then_i_hated_everyone/", "title": "I hated people who hated me, then I hated everyone", "social_network": "reddit", "user": "Inconspicuous_Igloo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1623815528, "permalink": "/r/DecidingToBeBetter/comments/o0w1p3/i_hated_people_who_hated_me_then_i_hated_everyone/", "nsfw": false, "first_save": 1635436504.4975908, "replies_charged": false}