{"id": "t5_2tand_t3_cc3o01", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Grant Cardone “100 Ways to Stay Motivated”\n\nSection 1 Potential\n\nWork to your potential not your quota.\n\nNo one can tell you what your capable of. Quotas are just numbers based off by other people's expectations.\n\n1.Write down what your potential is and compare it to a current “quota” in your life.\n\nShoot for Extraordinary\n\nOrdinary means average. Extra means above. Make other people jealous or amazed at what you do. Shooting for extraordinary because it keeps you motivated and driven.\n\n2.Write down five extraordinary people in business or life. Determine qualities or actions they implemented in their lives to become EXTRAordinary. Use this list of people to keep you excited,motivated, and driven to be extraordinary.\n\nGo the Extra Mile Even After You Have Satisfied Basic Requirements.\n\nAdd a little ten percent to everything. If you have a job or task it doesn’t hurt to put some more effort.\n\nIt creates discipline and increased belief in self. If I can’t do it for myself, I can’t do it for others.\n\n3.The two questions I ask myself when I go the extra mile is\n\nDo What Others Refuse To Do\n\nOpportunities lie in the place where people refuse to go. If everything was pleasant there would alot less average people. So if you want to excel do the things people refuse to do.\n\nIt makes you motivated and inspired. While keeping competition intimidated.\n\n4.Make a list of what others around you are unwilling to do. Choose three actions and do them today. What happened?\n\nBe Willing To Fail Knowing Failure Is Impossible\n\nFailure is impossible. The only way you can fail is if you quit.Rework what you think about failure. If you persevere through the game then you really can’t fail.\n\n5. None\n\nBe The Most Reliable Person You Can Be\n\nYour word is you bond and so is your dependability\n\n6.Write a list of three ways you can be dependable and implement them today. What Happened?\n\nLet People Know that your unique by your actions\n\nDon’t be like everyone else. Do little things that make you unique. You will motivate yourself when you think of ways to be unique.\n\n7.Write down five actions you can take that are unique to you and would differentiate you from others in your personal and professional space.\n\nGet challenged. Do something that challenges or pushes you. When you are pushed you will feel anxiety, but it will motivate you. Conquer your challenges and it's a win win situation. If you win you get motivated, but if you lose it gets out of the way.\n\n8.Make a list of five things that would most challenge you and do at least one today. How do you feel afterwards?\n\nGive people more to the point where they are guilty. Give of yourself it doesn’t mean money or product wise for instance with time and knowledge. Give enthusiasm or ideas or just you in general and you will be rewarded\n\n9.Make a list of three simple ways you can give more than is expected of you. Do those three things you wrote down.What happened?\n\nSection 2 personal development\n\nGet In a Mastermind Group\n\n10.Surround yourself with winners. Your condition is very similar to who you hang around. People can tell a lot by who you hang around.You don’t need buddies you need winners.Always reach out and make new winners.\n\nMake a list of your five closest friends and write what you have in common with them. Are all of these similarities optimal? Now find a mastermind group of winners in your field of interest or\n\nbusiness and join it.\n\nRead a Book a Week\n\nIf you want to stay motivated always read.1 book a week 52 books a year.The average american reads 1 book a year. They don’t even needed to be finished. If you want to be motivated to read a book. Look for 1 to 3 things to learn, after you get the gold nuggets of knowledge from the book you can go to the next book. 52 to 1 lead.\n\n11.Chose eight books that are beneficial to your growth in life or profession and list the book titles and authors. Choose one and read it this week.\n\nCut Out Negative People\n\nNegative People attract negativity. I don’t really have people in my life that bring negativity yet.\n\n12.Make a list of all the people you are frequently in contact with in your life and determine if they are positive or negative. What occurs when you are in contact with the negative people?\n\nStay uncomfortable and meet new people\n\nBe the first to socialize. Forget context because your moving through the discomfort. It’s for your personal sense of self.\n\n13.In a group of people, or just out in public, introduce yourself to three people you are uncomfortable or tentative to approach. What occurred?\n\nDo things your fearful of.\n\nHumans are scared of things. The more things you can overcome the more motivated, determined, and reliable you will be. Courage is an action.Bad and fear are two different things don’t mix them up.(Don’t do anything illegal pls :).T.K) Motivation is something you can pick up the only person who can refill it is you.\n\n14. Make a list of five things you are fearful of doing. Knock one of these things off your list today! How did you feel afterwards?\n\nSurround yourself with positive reminders\n\nControl your environment.Think about the future and use it as motivation to surround yourself with positive messages like dreams and goals that's how you stay positive.\n\n15.Control your environment. Chose a positive reminder to represent each: your goals, dreams, and current life. The reminder can be photos, signs, pictures, objects, etc. Name each reminder and explain the meaning behind that particular positive reminder.\n\nReach up for new friends\n\nIt’s easy to get friends it’s harder to get dependable friends and supporters. Get classier friends. Reach for people outside of your social standard. (Don’t try to be someone your not make friends no matter their social standard that accept you for you.-T.K)\n\n16. Write down things you can do, places you can go, etc. where you can reach up for new friends. Choose a couple of these actions and do them.\n\nAsk those more successful than you for guidance.( This is kind of self-explanatory, but remember successful doesn’t mean just monetarily, but rather based on your definition of success-T.K)\n\n17.Identify two people more successful than you that you can go to for guidance and advice. Arrange to meet or speak to them for guidance.\n\nMake continued and regular investments in yourself.\n\nMake investment in yourself it’s the only guaranteed return. 1 in 1 million understand inflation. The best way to fight inflation is investing in yourself. Once a year is not regular or continued. Look at new techniques and strategies year round.\n\n18.Make a list of three ways you can continually invest in yourself. Commit to making one of these ways a continued and regular investment in yourself.\n\nGo to workshops and learn and connect\n\nStay motivated even on your time off. Always stay improving. Bill Gates reads 13-14 books during a 3 week vacation period with his wife.Go to 3 or 4 workshops a year.\n\n19.Make a list of three workshops that would be ideal for you to learn and connect at. List the names and purpose of the workshops. Chose one to enroll in today.\n\nAvoid those who don’t assume responsibility for every outcome\n\nIf they can’t see the light of day don’t try to make them see it.There are 7 billion people on this earth and you're looking for the right one.Every deal you make is not a good deal.Every client you have is not a good one.You will have to make the decision to get rid of something to make room.\n\n20.Write a list of people in your life that don’t assume responsibility for every outcome. What is your decision regarding responsibility?\n\nSeek to be exceptional in every aspect of your life.People who are looking for balance are not motivated. Always look for the best and it will come. Be greedy because that’s the difference between successful and average people.\n\n21.Write down exactly what it would mean for you to be exceptional in every area of your life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cc3o01/grant_cardone_100_ways_to_stay_motivated_summary/", "title": "Grant Cardone \"100 Ways to Stay Motivated\" Summary 1-21 incomplete", "social_network": "reddit", "user": "terrorist_kid", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1562891123, "permalink": "/r/DecidingToBeBetter/comments/cc3o01/grant_cardone_100_ways_to_stay_motivated_summary/", "nsfw": false, "first_save": 1635436990.4715586, "replies_charged": false}