{"id": "t5_2tand_t3_izrvmj", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I often struggle with this concept. I grew up a people pleaser my whole life. I had two parents with angry tendencies & I lived in fear of them being mad. I was never abused physically but emotionally I can say a lot of my upbringing was toxic mixed with abandonment issues from a few hard circumstances, I always felt it was needed for people to like me so they would stay around. \n\nI’m recently discovering that self love isn’t necessarily what I thought it was. I think main stream makes it this pretty package of bath bombs & face masks & affirmations that say “I love me!”. \n\nWhile that’s all beautiful & it can be really great at times, it’s also a shallow picture of what self love is. \n\nMy self love journey has been really gritty recently. It’s actually looked a lot darker than people make it out to be. It’s literally going into the dark corners of my mind/body I repressed for years and seeing what exists there. It’s scary and it hurts sometimes. I’ve been in a little black hole of old stuff lately and while sometimes I want to shy away from it - I know that is really not an option anymore because on the other side of this is freedom from mountains I’ve been carrying for way too long. \n\nAlong this journey I’ve also found that I’m willing to be disliked in order to stay true to myself. This is huge because I’ve always thought that one of my biggest “assets” was being agreeable & well-liked because I’m typically cool-mannered on the outside. I can be crumbling internally but I’m usually very aware of my interactions with others because I had a traumatizing experiencing in my early adulthood of being completely rejected of a group of girls pretty publicly that I vowed I would never do that to someone else after that since growing up I wasn’t kind to a few individuals due to internal battles which I don’t excuse but am working on forgiving myself. \n\nI recognize that everyone has their own judgments and opinions coming into situations. Something I say or do might trigger people. Sometimes I’m ignorant and while I do my best to keep an open mind and lean into learning instead of conforming to old mindsets I might fall short in that. I can’t take to heart that while I have best intentions in mind that I sometimes just don’t know enough. I can’t keep letting everyone’s opinions of me hold more weight and allow them to back me into a corner of a room I didn’t want to be in the first place. I’ve found myself in so many situations because I said yes when I wanted to say no, out of fear of someone else not liking me. I’m done. \n\nI’m choosing to be ok with my words and actions that are authentic & aligned even if they disappoint, trigger, or are not acceptable in someone else’s world. I’m understand more each day that each time I take action out of fear of someone else’s reaction- I am typically more likely to forgo my own desires, wants, values, and authenticity in the process which is something I am unwilling to participate in. \n\nI’m tired of living through the lens of someone else. It’s time to live my life - regardless of whether another can accept it or not. This is how I can practice self love with myself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/izrvmj/self_love_means_being_disliked_by_someone_else/", "title": "Self love means being disliked by someone else doesn’t matter much if it means staying true to yourself.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 75, "down_vote": 0, "creation": 1601067431, "permalink": "/r/DecidingToBeBetter/comments/izrvmj/self_love_means_being_disliked_by_someone_else/", "nsfw": false, "first_save": 1635436844.843744, "replies_charged": false}