{"id": "t5_2tand_t3_fgiw9u", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I (26F) was officially diagnosed with depression back in 2016. It was the hardest, darkest time of my life. I didn’t want to keep going because I was thoroughly exhausted, hopeless and unmotivated. Silly as it sounds, having a bachelors in Neuroscience made me completely deny having depression at first. I believed that if I knew all the mechanisms and the science of the illness, it couldn’t happen to me (yes, I realize this is silly). I used to call it “my monster”, because I felt like this dark monster inside of my was consuming all the things I loved to do and all my energy and motivation. \n\nNow, in 2020, I have a much better handle on my depression. Figured out the right medication for me, went through lots of therapy, and developed self-awareness when it came to my symptoms and what triggered them. \nBut what I came here to say today, is I am much better because of my dog. \n\nIn December of 2015, my bf (now ex)‘s golden retriever had a litter of 12 puppies. I fell in love with this smol gentleman, who I would later name Oberyn Martell (for you GOT fans out there, it’s because he was so cute I wanted to squish his face). \nI’ve been with this dog since the day he was born, and have hardly separated since. \n\nWhen my depression is particularly bad, I cuddle into him and cry into his giant chest (the boy is 125lbs, he’s a monster). When my panic attacks hit, I focus on stroking his soft fur and look into his giant brown eyes, and it grounds me. I got into hiking and backpacking, because it sounded amazing to go out into nature with my new adventure buddy. \n\nI can’t stay in bed all day and wallow, because Oberyn lays his giant face on my bed and lets me know he really needs to go potty. I can’t sleep for hours and hours during the day because Oberyn really wants to go for a walk. There’s no point in not eating all day, because I have to get up and feed Oberyn anyways. It’s really hard to become lost in stress, worry, and hopelessness about my whole life,  because Oberyn just brought me his absolute favorite toy and he wants me to appreciate this little thing, which brings him all the happiness in the world.\n\nLong story short, I am extremely fortunate to have a built-in support system and best friend. This guy has no idea how he keeps me productive, active, responsible, calm, and appreciative of the little things. \n\nOberyn decided to make me better. My dog makes me better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fgiw9u/my_dog_makes_me_better/", "title": "My dog makes me better", "social_network": "reddit", "user": "danicabrynne", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1583866530, "permalink": "/r/DecidingToBeBetter/comments/fgiw9u/my_dog_makes_me_better/", "nsfw": false, "first_save": 1635436652.1296446, "replies_charged": false}