{"id": "t5_2tand_t3_lwamj5", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Lately I have been getting better at dealing with the issues that are currently a part of my life and everything is just good and can get a whole lot better if I put in more effort and if I'm more persistant about staying on the right track. The only reason why I can not adapt to the RIGHT lifestyle and make the right choices more often without any hesitation is the \"WHY Am I doing this?\"\n\nWhen I started on this self help journey I told myself that I'll figure out the why sooner or later if I stay at it, even if I don't the changes in my life caused by me making poor choices which I would be correcting will do the trick of convincing me. But I've been proved wrong time after time now, I cannot function without a reason to do it. I have come a really long way from last year and have made some changes I thought I would never be able to make in my life and things have been better as a result but the thing is, the question has not changed, why do I want to get better? Why is the self satisfaction in the long term worth more than the quick dopamine hits that I'm depriving myself of?\n\nThe difference between knowing something and understanding something has never been clearer to me, I know I must get better but I don't understand the reason. I have a plane without an engine if you will. I'd appreciate it If I could get some advice from the more experienced people in this sub.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lwamj5/the_biggest_why_i_have_hit_on_till_now/", "title": "The biggest WHY I have hit on till now", "social_network": "reddit", "user": "Treckerrr", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1614713998, "permalink": "/r/DecidingToBeBetter/comments/lwamj5/the_biggest_why_i_have_hit_on_till_now/", "nsfw": false, "first_save": 1635438126.3350408, "replies_charged": false}