{"id": "t5_2tand_t3_ovsw0b", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "First, a little backstory, i have (had?) a best friend (I will call her T) that i met ~9 years ago in the city where i spend my summers, we were inseparable and always present for each other.\nTwo years ago, i broke up with my girlfriend and without any expectation after one month me and T started teasing each other, and after two months we had sex for the first time.\nInitially it was only this, we keep all the story hidden from all our friends, she insisted with this and it was okay for me, meanwhile she eventually went out with other men (always only sex) while we continued to have this sort of situation where we were friend but had sex and these sort of things. Sometimes i got jealous of the other men, but never said anything except rare occasions.\nAfter other 2 months i met a girl (S) , i had several dates with her the things went quickly very good. Initially my bf said nothing in particular.... but then the things changed, summer passed and between me and T something started to grow. In January, one night T said to me that she kissed another guy, and then another  one again after few minutes, and I exploded. I said to her that I was jealous, that i felt something for her and that i wasn't happy for these things. And she said that she felt something for me too, and that she had done various things to make me jealous. From here the things went always worst. We decided to continue like we have done until then, but this wasn't a good idea. Keep in mind that we live in different regions, so we saw each other only few times during the year and in August.\nMeanwhile S was still in my life, and my bf hated this thing.\nThe next summer T wanted to try a relationship between me and her, but i was not sure about that, i liked her very much but I wanted to stay free, she insisted, we tried but she wanted also that I leaved S. I didn't want to leave her, and we had a lot of discussion over this. She also had a boy that wanted to date her, and with which she messaged almost every day. \nI hated this thing, but never said to her to leave him.\nOne day she did it, i had complaints about that, i said that she should have not leave him because our situation was nothing in reality, but she did it anyway.\nWhen I returned home form vacation, i returned to go out with S, this caused a lot of discussion with T, she always remarked that she had leaved the boy she was talking to, even if i had never said to her do it, and in October she decided that was better to have a break between me and her, and we stopped to message each other, and all the other things.\nDuring the last year I heard her somethings like 10 times in a year, during these times she said that she loved me, and I thought to love her too, influenced by the things she said. But this situation was very heavy to me to carry on, I liked S but didn't want to hurt my bf. Around two months ago, I heard again T, but she had a lot of complaints about my behaviour, she said that I was changed (it was not the first time she said these things), and that I was too different form the guy I was time ago, moreover a lot of times she made me presents of how much i had made her feel bad during these times. Again, I didn't wanted to hurt her, but I was happy that I was changing some aspect of me. Things went on like this for a while, but one month ago I decided to stop this situation, I stopped to hear S and came in my bf's region for vacations and said to her that I wanted nothing more than restoring our friendship. She got mad, but had to accept my decision.\nHowever, during these weeks I continued to think about the girl I stopped talking to, S. Everyday, I found myself continually thinking about her until I had enough. I decided that I had to think for myself, and that I can't always sacrifice myself to not hurt other people.\nI said to T that i started to missed to hear from S, she got mad again but i wasn't very interested anymore, i didn't want to hurt her, but I preferred to put me first.\nAnd then I did a thing that I didn't thought i was capable of.\nI was about to lost S forever and this thought was driving me crazy.\nSo the next day i took a train, a ship and another train to S region, took a b&b here (she also live far away, but during the year she live in my city for university) without saying anything to S, and contacted a friend of her to organise a surprise. I never have done anything like this before. When i finally met her, i had almost tears in my eyes. We spend 4 beautiful days together, the last one i slept at her house and meet his parents, we also had a dinner all together outside. \nNow I'm in the train that is taking me to my vacation's home again, I feel bad for my (ex?) bf, T, but I feel finally free to be whatever I want to be, and to stay with a girl I really love.\nI never feel so good in the last two years, and learned that one cannot always avoid making someone suffer, because it ends to make everyone suffer, and that cannot always let things happen passively, like i did during these years, but have to take control over his life. Someone should avoid to make other suffer but only if this is possible, because if avoiding other people sufferings is the only way someone move, it ends only to the suffering of the subject, and this is bad.\n\n(Sorry for my English, and in case of other errors, this is my first reddid post)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ovsw0b/finally_got_out_from_the_worst_period_of_my_life/", "title": "Finally got out from the worst period of my life", "social_network": "reddit", "user": "Hosow", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1627827350, "permalink": "/r/DecidingToBeBetter/comments/ovsw0b/finally_got_out_from_the_worst_period_of_my_life/", "nsfw": false, "first_save": 1635435406.2110736, "replies_charged": false}