{"id": "t5_2tand_t3_fuwslj", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "Hello there, \n\nI also posted this question/story in the subreddit u/selfimprovement and I decided to post it here too ( If I'm not allowed to do this please tell me so I can delete one) \n\nFirst of all very nervous about sharing this question/story\n\nI made a different reddit account to share this with you because it's very personal, also, I don't really know if this is the right subreddit to ask this question but I really wouldn't know where else to ask, because it IS about life-improvement and selfimprovement.\n\nSo long story short, I am twenty two now, in my first year of my studies ( I did uni before but took two years off), I wasn't in the right place emotionaly for a very long time and I took the gap years to fix myself, go to therapy, make sure I was stable enough to face the future and all the responsibilities life and personal relationship carry. I took responsibility for my own mental health, and I am happy I did. Now that I lost A LOT of emotional bagage, grudges, insecurities, toxic traits. I have completely opend my eyes to who I truly am in the core of my being, but I can't help but feel that I have wasted my young years. Until I was 20/21 I have been so busy with my emotional bagage, because it was so present that I couldn't ignore it. I've always been keen to study, to learn new things and to push myself forward in life. But still when I was in that bad place life seemed to be lived one day at the time.\n\nNow that I'm twenty two, I'm stable, good relationship, everything seems to be going alright. Always trying to be the best version of myself, there is one thing I seem to be struggling with constantly: I just CANNOT figure out what I wanna be in the future, what I want my major to be, what I want my job to be and what I want my future to look like. When I think about it my thoughts paralize and I get a incredibly stresesd. How do I figure this out? I am so desperate. I study very hard and I'm a smart kid, But if only I knew what my passion is so I can fully focus on that and give back to the world. The thought of having one thing to focus on, to have a future picture in your mind and to work towards that is such an absolute delight. But the fact that I cant figure it out is making me stressed out the past couple weeks. I really wanna selfimprove, be passionate about my studies and focus on a subject.\n\nWhen someone talks about a subject or something very passionate, like they really know what direction they are going, which path they are taking, where their heart lays, I get a sick feeling in my stomach and I feel so much stress ( I also feel happy for them) , I start to think about how incapable I am in life and it gives me a lot of anxiety thoughts. I really don't want this feeling to stay my entire life. I feel like I wasted the years in which I should've figured out what to be in the future. \n\nSo I'm asking you... where do I start? How do I figure out which path I have to take in life?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fuwslj/deciding_which_path_to_take_in_life_after_leaving/", "title": "Deciding which path to take in life after leaving bad things behind", "social_network": "reddit", "user": "Zarathustr101", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1586018482, "permalink": "/r/DecidingToBeBetter/comments/fuwslj/deciding_which_path_to_take_in_life_after_leaving/", "nsfw": false, "first_save": 1635436207.1043096, "replies_charged": false}