{"id": "t5_2tand_t3_pl3gkz", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "This’ll be long, but everything needs to be said to understand what I have to sort out.\n\n\nSo, my main issue is, I overthink. I have (undiagnosed, but mum has, and we share loads of “symptoms”) ADHD. I also think I might be on he autism spectrum (my mum also thinks that she may be, and a lot of my friends, autistic or with siblings that are autistic, agree I might). So, I get really overwhelmed with the smallest of things. I often have really bad hypochondria, worrying I have rare conditions because I’m fatigued, or match a lot of their symptoms. I am also a perfectionistic procrastinator, so I won’t do stuff unless I can do it perfectly, or won’t in case the way I would do it isn’t the best way. This mostly relates to my habits and studying. Most days I won’t brush my teeth in the morning because executive dysfunction is a mofo. I have awful heartburn really often, and also have an upset gut a lot of the time, and that coupled with emetophobia means I’m worried about being sick. And as well as this, the sensory overload of a sore stomach or acid in my throat is just so overwhelming. A lot of the time I can’t sleep because I get overwhelmed my something, last night it was this random sensation I kept getting, I think it’s because I was too hot. I’ve started getting a fuzzy sensation sometimes on either side of my head. I also just don’t have good habits. I lie around doing what’s easiest and gives me the most amount of short term dopamine, be it TikTok, Gaming, YouTube, Pinterest, or a combination of two of those. So I’m really unfit, and I’m quite overweight. I don’t eat well, but would love to. I have a few rarer allergies, all of them are fruits/veg, and I avoid others because the texture is so awful for me, or because there’s a chance of cross reaction with some of my allergies (OAS). I’ve never been in a relationship, and I’m 20. I’m too scared to be in a relationship when I hate my body and mindset, so I really need to overhaul so I can love myself, and eventually be able to love someone else.\n\n\nSo, to what I want to sort out. I want to set in place habits that I need to be doing, like certain hygiene habits, eating habits or some form of activity. I also want to try to stop overthinking, but it’s easier said than done when you’re the sort of person that overthinks the fact that they overthink. I basically need a step by step guide of what to do in my day, but without strictness so I can adjust to whims I may have (I know, structure without structure, it’s a total oxymoron. My whole life is, I adore productivity and study content on all social media platforms, but rarely do I adapt my life and take advice from the content)\n\n\nOk, so what I’m asking is how, how do I figure out my life and add such structure.\nI’d love if you could share some resources/apps/tiktokers/books/podcasts for sorting out your life in this way. I just want to become a better person, because I can’t live a life without living, if that makes sense. Any questions, please do ask!!!\n\n\nEnd note- I have read atomic habits, make it stick, you mean I’m not lazy stupid or crazy, the smart but scattered guide to success. I have watched loads of productivity youtubers, but don’t hesitate to suggest some!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pl3gkz/i_need_to_sort_out_my_life_but_i_dont_know_how/", "title": "I need to sort out my life but I don’t know how", "social_network": "reddit", "user": "IonicAc", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1631211753, "permalink": "/r/DecidingToBeBetter/comments/pl3gkz/i_need_to_sort_out_my_life_but_i_dont_know_how/", "nsfw": false, "first_save": 1635437985.929067, "replies_charged": false}