{"id": "t5_2tand_t3_lefcd6", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "My recent life has put me in a lot of stress. I am 33 years old. I work full-time and go to school full-time, and I have a 1 year old son. I am even doing overtime to recoup some time I had to take off for a family emergency. I still make time to exercise and meditate, trying to maintain good habits more consistently. I have a job that allows me to listen to lectures and podcasts while I work, so I am constantly learning on top of school. I am investing and saving as well for my kid's future. I provide for my family and tend to my domestic duties. In what little spare time I have, I'm getting into Game Development because it is what I truly want to do with life and have wanted for two decades. I let naysayers and my own fears and laziness stop me. I barely play games anymore. I obviously spend some time on Reddit, but I have done away with all other social media, and follow subreddits that benefit me and bring me up. I barely look at my phone otherwise. \n\nThis all sounds like bragging, but there is a point. I have never been so stressed and had so little time to myself in my life. Yet, I have never been so personally fulfilled. Life is truly what you make of it. The more you put into life, the more you get out of it. These sound like typical self-help cliches, but they stand true. And the more I do, the more I find I am capable of doing. Idle activities bore me. I am so sick and bored of consuming; I want to create!\n\nTake on a burden willingly and move your life in the direction you want it to go, toward the person you want to be. Develop skills and gain knowledge. It feeds the Confidence-Competence Loop. Give your life meaning by putting meaningful action into it. Smile and be grateful. \n\nTLDR: do more with life to get more out of it.\n\nEdit: probably should mention that 2 years ago I spent 90 days in jail for a felony, for being a piece of crap. We can turn things around.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lefcd6/life_is_better_with_purpose_create_yours/", "title": "Life is better with purpose. Create yours.", "social_network": "reddit", "user": "Pinkie0314", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 114, "down_vote": 0, "creation": 1612672225, "permalink": "/r/DecidingToBeBetter/comments/lefcd6/life_is_better_with_purpose_create_yours/", "nsfw": false, "first_save": 1635436721.24864, "replies_charged": false}