{"id": "t5_2tand_t3_j9gdmg", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Feel like I've been high functioning and depressed for a long time now. I have a career in a good industry I have low effort relatively high paying job, with flexible hours, good health care etc., I'm not passionate about it at all. I'm living with my parents (mid 20s) for the time being, originally because I was going to move cities, but now I don't know where I want to live, and I've been here for 6 months, and they don't care they are happy to have me. I felt this way when I was living on my own too. I've been fortunate to be able to travel a lot and pursue hobbies. I even started a small business. I have a good support system of close friends and family. I've been fortunate enough to have some long lasting romantic relationships. I don't have any real problems, yet I feel utterly empty. I will temporarily get excited about something, but when that fades I'm left feeling the same as always. Empty. I feel like I'm living just to live. I have the financial means to take a risk, but I don't know what risk to take or what change to make.\n\nIf you asked me right now where would I live, or what would I do if I could do anything I would have no answer. To some extant I have that freedom. I don't deserve it, because I'm not doing anything with what I have. I have no drive or urge. I get very short lived enjoyment out of things. I'm in therapy and despite having a good therapist I'm making no progress.\n\nI don't really have a reason to try or not to try. I feel like sometimes if I could light a fire under my ass I could motivate myself to make something of myself. I wish I had a tangible passion so I could chase it. I've got nothing. I'm just a privileged spoiled kid, I don't deserve any of this, there are people with much less who deserve this a lot more. People who have goals and desires.\n\nWhat do I do? Other than pumping myself full of happy pills what do I do? I've been working towards arbitrary goals from family/friends/society/the internet etc. and I am utterly unfulfilled.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j9gdmg/my_lifes_too_easy_its_ruining_me_how_do_i_get/", "title": "My life's too easy, its ruining me, how do I get excited about life?", "social_network": "reddit", "user": "Efficient_Lettuce415", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1602460736, "permalink": "/r/DecidingToBeBetter/comments/j9gdmg/my_lifes_too_easy_its_ruining_me_how_do_i_get/", "nsfw": false, "first_save": 1635436306.3202605, "replies_charged": false}