{"id": "t5_2tand_t3_qbx2td", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "Update: I rang my doctor and I am booked in for an ADHD/depression evaluation next month!!!! :D\n\nI (22F) am a professional at cutting corners. In all aspects of life, I only ever do what is compulsory, or what I need to do to avoid getting into trouble. \n\nAt university, I do my coursework the day before it’s due, settle for below average grades and don’t bother with any extra work - just turn up to class, don’t listen, leave, submit a half assed essay and repeat.  \n\nOnce upon a time I was an ambitious teenager wanting to be a doctor or a teacher, get a first class degree and make lots of money. Now I can’t be bothered with anything more than the bare minimum. ‘Why waste time trying so hard to get to places I probably won’t reach, when I can enjoy my life by playing video games and drinking with friends’ \n\nI don’t know what happened, but somewhere along the way I lost my drive. I used to write stories in the hopes of publishing a book one day in the future (my ultimate life goal), but I have since stopped bothering because ‘it’ll take too long to get there… what’s the likelihood it’ll actually happen anyway.. I’m wasting my time on something that likely won’t happen’. It’s the same with learning guitar.\n\nPlease help me. I saw a post recently from someone resenting their child for being the successful person they wish they were. I feel like that will be me in 20 years.\n\nEdit: I REALLY appreciate all of the lovely comments and tips and stories and books you guys have shared. Seriously. Wow. Thank you so much, I’ll hopefully eventually respond to everyone, but for now please take my THANK YOU!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qbx2td/im_terrified_of_my_extremely_average_and_lazy/", "title": "I’m terrified of my extremely average and lazy lifestyle, but how do I change?", "social_network": "reddit", "user": "Silliest-Goose", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1069, "down_vote": 0, "creation": 1634722742, "permalink": "/r/DecidingToBeBetter/comments/qbx2td/im_terrified_of_my_extremely_average_and_lazy/", "nsfw": false, "first_save": 1635436922.9785051, "replies_charged": false}