{"id": "t5_2tand_t3_lgo2p5", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "Asking for a friend (obviously not).\n\nTo paint a picture of what I'm even talking about, I'll say that I've been struggling mentally ever since I was like 11 years old. 1 1/2 years of self-isolation, then dove headfirst into substances of all forms - I have a job, I am going to graduate soon, I'll be finishing my apprenticeship within the next few months - I've managed to sustain myself on a lot of weed and by the help of some (not so) occasional other drugs.\n\nAnyway, I was in a really bad place this time last year. My then almost two-year-long relationship was absolute shit, the guy I was with was even worse. He reinforced a lot of the trauma I had already carried with me from my childhood/past relationships, and honestly it feels like he pulled the rug I had laboriously crawled onto out from under me - the only reason I finally managed to break things off with him was the guy I met last march.\n\nIt was a bit of an ordeal, but I finally decided to leave my boyfriend and got with the new guy - this makes me sound like a cunt but honestly, it doesn't matter. The 'new guy' doesn't even really deserve to be called that anymore, seeing how we're going on almost a year together now. Anyway, he's a lot different than my ex.\n\nWhere my Ex looked at me funny when I was talking about something I was interested in, he listenens. When I have one of my breakdowns and can't physically speak anymore due to my anxiety overriding my conscious, he doesn't put me down for it or berate me. When I cry every single time we have even the slightest of altrications, he doesn't get mad or huff at me, doesn't turn away or gets irritated at my emotions.\n\nHe's good.  \nHe really is.\n\nBut my head doesn't seem to get that.\n\nWe're in a long-distance relationship, seeing each other every weekend. Each time I visit him, it takes me at least a few hours until I can finally actually *speak* to him again, until I can converse and tell him what happened throughout my week, until I can actually *let go* and *feel safe*.\n\nMy ex never physically abused me, as did no one, but I've been emotionally put down and ridiculed for what feels like my whole life. It has left scars, obviously. And maybe this was highly immature of me to think, but I honestly had the hope that all of it would leave me as I realised that this guy was different, that he wasn't like my ex. But apparently, that's not how things work, and for the first time in my life I actually kinda get the saying 'you can never love anyone before loving yourself'. While my love for other people has always been incredibly strong, my self-hatred has enough of a grip to taint that, to make me irritable, to make me angry or sad at the most miniscule things, to sabotage my relationships.\n\nI can't describe it fully without writing another paragraph, but I've recently actually started noticing my self-sabotage in small ways - I get hung up over the smallest things, if something isn't perfect then it isn't good at all, if he gets irritated or frustrated over this one thing oh then that MUST mean that he'll also get mad at this and oh my god that means he will start being just as overbearing and territorial as my Ex and oh my gOD- it's bullshit. But I can't help it.\n\nAnd so I'm asking, for my own sanity, whether or not you guys have managed to get over your-goddman-selfes and lead an actual fulfilling long-term relationship when you're struggling a lot mentally? I'm just so damn scared of ruining this good thing with my antics, my anxieties, my fears, my traumas...\n\nAnyway, this got way longer than intended, thanks to anyone who reads this, have a good one.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lgo2p5/can_anyone_with_mental_issues_actually_lead_a/", "title": "Can anyone with mental issues ACTUALLY lead a fulfilling relationship?", "social_network": "reddit", "user": "Lilith_K", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1612940072, "permalink": "/r/DecidingToBeBetter/comments/lgo2p5/can_anyone_with_mental_issues_actually_lead_a/", "nsfw": false, "first_save": 1635436697.4022768, "replies_charged": false}