{"id": "t5_2tand_t3_bmmhow", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "For the last several years, I've worked with spiritual teachers, and self-improvement authors to turn their work into online courses. In my work in personal development, I've had the privilege to meet many of the world’s most remarkable teachers and luminaries who are pushing the boundaries of our human potential.\n\nBut there is one teacher who is truly in a league of his own.\n\nHis name is Ken Wilber, and, although he doesn’t spend much time in the limelight, he is probably one of the 2 or 3 most influential thought leaders alive today.\n\nI’m not the only one who holds Ken in such high regard.\n\nIn fact, many of the world’s most respected thought leaders and luminaries stand with me in this assessment. Ken has been called “The Einstein of Consciousness” and been hailed by world leaders, changemakers and visionaries. Marianne Williamson calls Ken “The teacher of teachers.” She asks, “Who among us can be serious about the work of transformation without understanding his remarkable work?” Tony Robbins says, “Ken Wilber is a genius. I don’t think there is anybody alive who has developed a more comprehensive theory of life, psychology and spirituality.\"\n\nAlthough Ken's work has had a profound influence on most of today's luminaries, you won't find him speaking on the conference circuit or in the media.\n\nIt is therefore with great pleasure that I’m writing today to let you know about a rare opportunity to learn directly from Ken in a 7-Part online training he’s offering starting this week at no charge.\n\nHis new course is called “The Science of Self-Actualization: The 5 Essential Truths of Your Full Potential” and you can enroll at no cost until May 15th.\n\n[https://signup.self-actualize.com/](https://signup.self-actualize.com/?orid=28458&opid=95)\n\nIn this inspiring new online training, Ken shows us what the latest research into human development reveals about how we can cultivate and ultimately actualize the highest reaches of our potentials.\n\nIf you’re interested in unlocking the full scope of your highest human possibilities, I strongly encourage you to reserve your space here: The Science of Self-Actualization with Ken Wilber.\n\nOne essential difference between Ken’s work and that of many other teachers is that while most show their students a particular path, Ken’s shows you a complete map—a comprehensive map that embraces and includes all paths, Eastern and Western, ancient and modern.\n\nYou may have heard the metaphor that there are many paths up the mountain, yet they all take you to the same summit.\n\nIn some way, nearly all teachers act as a guide, helping seekers to navigate the slippery slopes of these mountain paths to reach the elusive summit of our highest potential.\n\nKen, on the other hand, is a cartographer of this mountain, a master map-maker of our psychological and spiritual evolution.\n\nHis work illuminates the complete map of our inner terrain, while also skillfully guiding us past the pitfalls, to the most effective paths for us to reach the summit of our highest self.\n\nThis is why he is in a league of his own. And it’s why I agree with Marianne that Ken Wilber’s wisdom is vital for any seeker who wants to ascend to their highest potential.\n\nWhile I do love and support a great many luminaries, there is no one that I am more proud to recommend than Ken.\n\nIf you’ve never had a chance to listen to Ken’s extraordinary teachings, I encourage you to learn more about his upcoming complimentary online 7-part training at the link below:\n\nThe Science of Self-Actualization with Ken Wilber\n\n[https://signup.self-actualize.com](https://signup.self-actualize.com/?orid=28458&opid=95)\n\nThis work may very well change your life, so I hope you can join him online for this powerful new course offered at no charge.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bmmhow/teacher_of_teachers_ken_wilber_teaches_the/", "title": "[Teacher of Teachers] Ken Wilber teaches the Science of Self-Actualization", "social_network": "reddit", "user": "Lion_the_Ryan", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1557422333, "permalink": "/r/DecidingToBeBetter/comments/bmmhow/teacher_of_teachers_ken_wilber_teaches_the/", "nsfw": false, "first_save": 1635437870.8310905, "replies_charged": false}