{"id": "t5_2tand_t3_e6urk2", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Okay so this might be a bit of a rant, but if you're terrified of dates like I am I implore you to read through it.\n\nTo set the scene, first know that this was not necessarily my first date. It was, however, my first \"first date\". In high school, I started seeing a girl that I would go on to date on and off for 5 years. We were friends for a few years before that, and eventually grew into best friends, and somehow I managed to make her fall for me. Of course we went on dates, but we had the luxury of starting out with a strong friendship, built over the course of our high school career. Long story short, that all ended one day in a fireball, but thats not important. \n\nA few years into college, I moved into a big student house with 5 of my friends. We lived there for a year or so until one of my roommates had to move out, at which time we found a new roommate online. Another long story short, this new roommate and I got to know each other pretty well (We lived together, so of course we did), and ended up dating for 3 years. I thought she was the girl I would marry, but the love faded away over the years until we decided to move on. We're still in each others lives and I consider her one of my closest friends, but whatever, thats life.\n\nSo here I am, 23 years old, and realizing that even though Ive been with a number of girls, Ive never gotten to know somebody on a date, it always happened organically through friendship. Over the years Ive developed a pretty severe anxiety disorder, and it left me with a very low self esteem. I feel ugly, boring, useless, and unworthy of love. Ive been crawling back out from the pits for a year now, and although Im doing a lot better, the idea of putting myself out there romantically absolutely terrified me.  I could literally make myself shudder and cringe by simply imaging myself on a date with a girl. The idea of sitting in awkward silence with a girl who probably only agreed to go out with my because she felt bad was something that haunted me, and I knew that I would never find the courage to try. Because of this, I sort of convinced myself that I would die alone unless I married one of my friends or future roommates, so I could avoid a \"first date\".\n\n2 weeks ago, I went to my friends Christmas party. I just moved to a big new city, but one of my childhood friends had moved a few years ago and carved out a nice little life for himself, and he liked hosting parties like this. At this party, I ended up meeting a beautiful, blonde friend-of-a-friend who was very outgoing and friendly. She had a long conversation with most people at the party, and everyone seemed to like her by the end, she was just one of those people. After the party died down a bit I found myself chatting with her more. Well, she was chatting with me, while I was awkwardly laughing at everything she said and trying to keep up with her energy. She was really cool, but after a while she left the party. I would go home later that night with a smile on my face thinking \"that girl was kinda into me, thats cool\". \n\nThats pretty much how Ive always lived. Knowing that I could have ***potentially*** done something with my life if I had chosen to act was enough to satisfy me. I spend my life daydreaming about all the girls who have ever showed interest in me, and think to myself that if I had wanted to, I could have dated them, and that made me feel good. It was always enough. These thoughts are kind of like porn for the heart. Its fake, and no amount of pride and daydreams could ever be a substitute for a real human connection. Ive been aware of this flaw for a while, and Ive been trying to work on it by \"taking more risks\", but I always ended up going back to doing what made me comfortable.\n\nThat is, until  a week ago, when this girl from the party added me on Facebook. It seems insignificant and teenager-ish, but the fact that she added me a week after the party showed me that she was thinking about me, at least enough to search for me on social media. I was nervous, and to be honest a little annoyed with the situation. If she had just forgotten about me after the party like she was supposed to, I would never have to make myself uncomfortable by accepting her friend request and starting a conversation. But whatever, my plan was do to what I always did. Message her for a little bit, have a boring conversation, then never message her again, and go on living with the satisfaction that she was interested in me and I could have asked her out if I had chosen to. More porn for the heart.\n\nLike I said, Ive been trying to eradicate this way of thinking for a while now, and for the first time ever, I felt myself take a tiny, pinky toe step out of my comfort zone. After sending her a message about how I had fun at the party and it was nice meeting her, her followup ended with a question: \"How are you?\". My normal response would have been vague and dismissive, as to avoid any further conversation, but this time I felt a surge of adrenaline take over. Without even thinking of the consequences, I typed out \"Im doing pretty well, I just wanted to ask if you want to get a drink with me next wednesday.\".\n\nWhat the hell, why did I do that? Im such an idiot!\n\nMy heart skipped a beat what she responded instantly with \"Yeah, Id like that :)\".\n\nThe next week leading up to the date was the most stressful stretch of days of my life. I had no idea what a first date entails, I didnt know what I was going to talk about, and I didnt even know any good places to get a drink. Does a drink mean dinner? Does it mean we go dancing? Does it mean we go back to somebodies house after? The whole idea of it physically and mentally exhausted me. I just wasnt somebody who goes on dates, I had to cancel. Ill be ready for it one day, but I definitely cant handle a date right now. \n\nBut as the week went on, I never cancelled. We had a few more conversations over text, but it was more like \"20 questions\". I could tell she was trying to find out something interesting about me, but I couldnt give her anything. Im just a boring, ugly, useless guy who doesnt deserve love. \n\nWhen the date was 1 day away, I knew it was too late for me to back out. This is when the reality of the situation dawned on me, and I was terrified. I was literally sick to my stomach for the whole night, and I only got 4 hours of sleep. At work the next day, I was incapable of staying focused. I knew that when the clock struck 5, I would pack up, leave work, and take the subway to a random bar I chose the night before to meet this girl. Anyone who has social anxiety or just gets nervous in general knows exactly how I felt in this moment. It felt like the 30 minutes before a big interview dialed up to 1000. \n\nI made it to the bar 30 minutes early to mentally prepare. Damn, this place is a lot fancier that I thought it would be. I look totally out of place. The girl started texting me when her bus was 10 minutes away, and I became violently ill. I went to the bathroom, threw up, and prayed that her bus would pop a tire and would never show up. 10 minutes later, however, she walked into the bar. I had no idea what I was going to talk about, I was exhausted from the night before, and I felt too sick to drink. She sat down, and for the first 5 minutes, I was having the worst time of my life. It was awkward, I wanted to leave, and I could feel how beet red my face was because of the nerves.\n\n&#x200B;\n\nThen..\n\nBefore I knew it, we were talking about school. Then work. Then friends. Then family. \n\nTravelling. Dreams. Feelings. The city.\n\nThe conversation was flowing so naturally, I didnt even have to try. We were laughing at each others jokes, asking questions about each other lives, and whatever else happened to come up. We finished our drinks, then ordered another, and another, and then shared our last one. 3 and a half hours passed in an instant, as she had to get home to sleep before her early shift. We went outside and she told me she had a lot of fun, and how her face hurt from smiling so much. Being the outgoing person that she is, she said she really wants a second date, if I was interested. I told her I had a lot of fun too, and that Id message her soon about another date. She gave me a big hug that lasted 1 second longer than I expected, and when she pulled back, I leaned in to kiss her. I never though I could do that, but the moment just felt so right and came so naturally. She kissed me back, and when we finally broke apart, she smiled and told me that she'll see me soon.\n\nI walked home in the snow smiling to myself the whole way, at times even laughing out loud. \n\n&#x200B;\n\nSorry for the long story story, but I just had to share it for all the people out there who are as terrified of the idea of a first date as I was. In the end it left me with so much confidence that even if I never see this girl again, it changed the trajectory of my life. I know what Im capable of now.\n\nIf youre too scared to put yourself out there, FORCE YOURSELF, and deal with the consequences later. If you really want to, you can always flake and cancel at the last minute. If, however, you suffer through the dreaded first date, I PROMISE you will leave a better, more confident person than when you went in. Please, trust me.\n\n&#x200B;\n\nGood luck everyone, thanks for listening!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/e6urk2/went_on_my_first_ever_date_at_24_years_old_and_i/", "title": "Went on my first ever date at 24 years old, and I cant believe how it left me!", "social_network": "reddit", "user": "NagsTA", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 546, "down_vote": 0, "creation": 1575612899, "permalink": "/r/DecidingToBeBetter/comments/e6urk2/went_on_my_first_ever_date_at_24_years_old_and_i/", "nsfw": false, "first_save": 1635438130.113097, "replies_charged": false}