{"id": "t5_2tand_t3_mcorfh", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "The book **\"Better Than Before: What I Learned About Making and Breaking Habits\"** by Gretchen Rubin was such a good read and I need to recommend it to all of you. The gist of it is know thyself—know your likes and dislikes, know what motivates you, and use that to make it as easy as possible to make a habit.\n\nFor instance, I'm an \"Obliger\", which means I'm generally good at following expectations/rules/instructions/requests set by other people yet terrible at holding myself to self-imposed things. So if I know I want to create a habit of writing in my journal more often, that's going to be hard because it's all self-imposed... so maybe I'll decide to abridge my journal entries at the end of every week and send out an email update to my family across the country. Or maybe I'll sign up for a subscription service to daily journal prompts. Or maybe I'll buy the same notebook for a friend and we'll compare to see who can fill it up faster.\n\nI also know I should:\n\n* write at night (\"Owl\" rather than \"Lark\" - I enjoy the evenings more than mornings)\n* write a little each day (\"Abstainer\" rather than \"Moderator\" - I find it easier to do/not do something all the time, rather than making the decision day by day)\n* buy a few thin notebooks rather than one big thick one (\"Finisher\" rather than \"Opener\" - I get a hit of satisfaction when I use things up)\n* buy a pen that's a pleasure to write with (\"Underbuyer\" rather than \"Overbuyer\" - if unchecked, I tend to make habits miserable by not giving myself the proper tools to accomplish them)\n* write in my favorite spot on the couch every night, maybe make a tradition of having a cup of tea with it (\"Familiarity Lover\" rather than \"Novelty Lover\" - I thrive when I get cozy in a routine)\n\nThere's no one-size-fits-all for self help books. That's what I found really valuable about this one. **It didn't prescribe things or preach Pinteresty platitudes, it showed me how to think critically** about what's working and not working, it alerted me to the loopholes I use to get out of keeping a habit, and it taught me some neat psychology tricks and foundational practices.\n\nHope you all enjoy it as much as I did!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mcorfh/better_than_before_helped_me_understand_why_i/", "title": "\"Better Than Before\" helped me understand why I have such a hard time keeping habits, even ones I enjoy", "social_network": "reddit", "user": "abc_123_youandme", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1616642743, "permalink": "/r/DecidingToBeBetter/comments/mcorfh/better_than_before_helped_me_understand_why_i/", "nsfw": false, "first_save": 1635437763.2133331, "replies_charged": false}