{"id": "t5_2tand_t3_p5w2wv", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "My diagnosis from many therapists MA, shrinks MS, psychologists PhD and PsychD, clinical social worker LSW, and psychiatrist MD: I have ptsd, ocd, intermittent explosive disorder, depression, anxiety/panic attacks, racial tics, and ADD/ADHD.\n\nI have bounced around many mental health experts due to moving, financial constraints, and some close the sessions due to my lack of progress. I want to be better. I really do.\n\nMy problem: I kept recurring flashbacks of being bullied and a petty incident at McDonalds which make me angry! (More elaboration below) It makes me have angry faces, scream out tics that are racial slurs (which I understand is wrong but why does my mouth say things?), and start punching the wall, sofa, mirrors, and air.\n\nBackground: growing up as a kid with immigrant parents I had language barriers. I could not develop social skills, and elementary school kids were mean to me because I was ethnically different. Therefore I never had friends and I was so awkward and weird. I suffered from depression and loneliness as a little kid. Parents were always working rather than bonding with me.\n\nIn middle school I got bullied because I never had elementary school friends. I got physically bullied and verbally bullied. In high school, I got physically bullied and beaten up too for being so annoying. I also got verbally harassed by my teachers too. They wouldn’t believe me. They also called me annoying to my face and killed my self esteem.\n\nIn college, I didn’t get physically bullied. People thought I was annoying and avoided me. They also spread rumors about me too and told the incoming freshman not to be my friends.\n\nThus I developed lots of PTSD and depression and anxiety.\n\nIn my first job, I made a bad first impression for being lazy and unfocused. I couldn’t listen and do the work because I couldn’t focus (ADD/ADHD). I also have OCD when I was a kid and I always wanted things to be perfect - lines needed to be straight, constantly looking up and down to see if something was there, and always running back to make sure my door was locked 10x (OCD). The flashback to the petty McDonalds incident was also described as a compulsion in the OCD.\n\nEven tho I didn’t have good friends or a good relationship with my parents, my boss Dave was my biggest inspiration and father figure. He actually sat down with me, communicated with me, actually wished me success, and was fair with punishment and disciplined. He actually wanted me to grow and he noticed my behavioral issues, and sent me to therapy instead of firing me. He was great. He gave me so many second chances.\n\nEventually, I was fired from work because people spread false rooms that I was using drugs and pushing drugs at work. This wasn’t even true. I hate when people spread rumors about me. It started with coworkers joking that I looked like I was on drugs. Then eventually people and rumors spread and it grew into the grapevine. People went from he’s “probably a drug user and seller” to he’s “actually a drug user.” It was such BS. I never did drugs, drink coffee, drink alcohol, or smoke. Dave didn’t fire me. Dave’s boss Ross fired because many people complained. I think about Dave everyday. He was such a great man, a great boss, and patient and kind church loving man.\n\nI am just hyperactive and stupid. The hyperactivity, fidgeting, jumping around (not metaphorically- literally jumping and skipping around) are results of ADD/ADHD.\n\nAfter all of this stress, i decided to apply to graduate school. I got accepted, during my wait time from 1 month of getting the acceptance letter to the first day of school- I went to McDonald’s.\n\nSo in my 1 month of free time, I was at McDonald’s- a quiet day as normal until I sat down in an empty seat. All of a sudden a man (from the X race) came and invaded my personal space. He started touching my shoulders and demanding that I move from the seat. He wanted to sit down on it. He was so annoying that I got up and left anyway. I moved on with my life. The McDonald’s incident was 10 minutes. It was annoying and stupid. I thought I could move on as and adult. But for some reason, my brain is fixated on this memory for more than 1.5 years now.....\n\nI went back to grad school, and I couldn’t focused. All the online lectures flew over my head. Even after I rewatched the recorded lectures 2 times, I still couldn’t focus or absorb the material. I was also having traumatic flashbacks of being physically bullied in middle and high school. I also got flashbacks about the 10 minute McDonald’s incident.... I started to curse the F word! I started to unintentionally say tics with racial slurs about the X race.... it was so messed up and I don’t know why.\n\nMy compassionate boss Dave was also from the X race, and yet why was I saying racist things about X race in response to the Mcdoanlds flashback?\n\nIt’s so petty and dumb. I also say the racial X slur to flashback memories of bullies who aren’t even in Race X. It doesn’t make sense.\n\nSo my psychiatrist diagnosed me with ADD/ADHD and PTSD after a 5 Hour long assessment and history and evaluation. She then prescribed Zoloft which didn’t work. And then she prescribed Wellbutrin which somewhat worked in helping me focused on my online classes in the Covid pandemic. However I still suffer from the racial tics and physically fitting the environment.\n\nMy issue is: I still get mad, flashbacks, and I still remember the 10 minute mcdoanlds incident and start punching and fighting the walls, sofa, mirrors, and start screaming racial slurs!!!! Sometimes there aren’t even triggers. I could be alone in bed, chair, or walking. And my PTSD/IED would explode on the memories and flashbacks. Then all of a sudden, I’m screaming and punching.\n\nWhat do I do? How I can stop my ptsd? How can I stop my mouth from unintentionally screaming racial slurs? I’m so scared. During online classes, my camera and mic are off so no one could see my body automatically going into rage mode without any triggers.\n\nNow my classes are going back in-person classes and I’m worried that my OCS/PTSD/IED will get out of my control, I’ll unintentionally scream out racial slurs, and I’ll start punching the desk and air randomly and uncontrollably. I don’t want the grad school to think I’m crazy and kick me out of grad school. I also don’t want people to think I’m a racist when I’m not.\n\nI have tried magic mushrooms. They didn’t work, I tried 3 large dosages in different occasions. I went on many hallucination trips. I still was not cured. And I stared ticking racial slurs and physically hitting the environment for no reason.\n\nI tried 10 mg of street MDMA because I because the FDA have some clinical trials where molly could cure PTSD. The one pill was good that it made me calm and not go on ptsd rage for 3 days.....\n\nUnfortunately i can’t find any street Molly since I can’t find anyone to sell me. Also street molly is dangerous since I don’t know if it’ll be pure.\n\nHow can I stop my ptsd and outbursts, unintentional racial screams, and fighting?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p5w2wv/ive_been_diagnosed_with_ptsd_ocd_ied_depression/", "title": "I’ve been diagnosed with PTSD, OCD, IED, depression, anxiety, and ADHD. How do I focus in class and not scream outbursts, not physically fight the environment, and not scream racial tics?", "social_network": "reddit", "user": "hopeedyx", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1629171942, "permalink": "/r/DecidingToBeBetter/comments/p5w2wv/ive_been_diagnosed_with_ptsd_ocd_ied_depression/", "nsfw": false, "first_save": 1635435790.614534, "replies_charged": false}