{"id": "t5_2tand_t3_ashv75", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "It is easy to get caught up with what we haven't achieved yet, but it is just as important to keep in mind what we do have, at this exact moment.\n\n&#x200B;\n\nFor example, for me a struggle is I am a very introverted student at a large university, and often feel like I don't have that much of a social life. Last night, on a piece of paper, I wrote down what I do with all the friends with whom I interact with regularly, and what I enjoy about being with them:\n\n&#x200B;\n\nFriend A - share my geeky hobbies (anime, video games, puzzles) with\n\nFriends B, C, D - sit together with during lecture & always save a seat for me when I run late\n\nFriend E - goes out with me when I feel social\n\nFriend F - studies with me and we laugh together to cynical jokes \n\nFriend G - I can chat up when I need a dose of humor and sarcasm\n\nFriend H - goes to the gym with me\n\nFriend I - listens to me when I struggle and I feel comfortable sharing my darker emotions with\n\n&#x200B;\n\nAfter I wrote it all down, I realized how much my friends really meant to me, and how blessed I really am. We can appreciate ourselves and everything we have achieved, no matter how big or small, without becoming complacent. Quite the contrary, we become more motivated to keep bettering ourselves to overcome our weaknesses. \n\nGood luck.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ashv75/advice_when_you_are_frustrated_take_a_step_back/", "title": "[Advice] When you are frustrated, take a step back, remember everything you do have and how far you have come", "social_network": "reddit", "user": "marshmerino", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1550624407, "permalink": "/r/DecidingToBeBetter/comments/ashv75/advice_when_you_are_frustrated_take_a_step_back/", "nsfw": false, "first_save": 1635436079.4950128, "replies_charged": false}