{"id": "t5_2tand_t3_qftopw", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I know that sounds a little dramatic, but hear me out.\n\nI have a terrible relationship with being alone. When the pandemic cut me off from life as I knew it, my hobbies and interests dwindled to doom-scrolling and laying on my couch. (I do have a history of depression, and some other traumatic things that have happened---some recently, but that's tangential to my dilemma).\n\n&#x200B;\n\nI have been trying to take up meditation as a way to connect with myself, live more fully in the present, and have more control over depressive spirals. At first, I would try to meditate (usually with a guided meditation on the headspace app) and focus on my breathing, for some reason this would cause my eyes to water, and before I knew it I was sobbing. The first few times this happened it had very little connection to emotion - almost like a sneeze, my body decided to start sobbing on it's own, but when I was done meditating  I would generally be done sobbing.\n\nThen, when I persisted and continued to try meditation, even if I started off feeling perfectly alright, the sobbing would begin, and then the emotionless sobbing itself started to bring up painful emotions. Lately, I have started to avoid mindfulness practice altogether, because the last few times I meditated, it sent me into a paralyzing depressive episode for the rest of the day.\n\nI would REALLY appreciate some guidance here. I know meditation has been helpful to so many, and I still believe there MUST be some way for me to be mindful... but how do I avoid these catastrophic emotional responses that meditation creates for me?\n\n&#x200B;\n\nPS -- not sure if this is worth mentioning, but generally focusing on my breath makes me a little anxious, and sometimes creates a breathless, panicky feeling, which generally leads into the \\[generally emotionless\\] tears which lead to the \\[small emotions building at this point\\] sobs which lead to a full meltdown/me being unable to do anything at all but cry for hours...any advice?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qftopw/meditation_is_ruining_my_life/", "title": "Meditation is ruining my life?", "social_network": "reddit", "user": "ManicPxieDreamGoblin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1635205763, "permalink": "/r/DecidingToBeBetter/comments/qftopw/meditation_is_ruining_my_life/", "nsfw": false, "first_save": 1635438170.6924295, "replies_charged": false}