{"id": "t5_2tand_t3_mvzhno", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I wasn't a happy child, for a number of reasons. Ever since I was 8 (around there), my entire life has been online. Pretty much all of it. I went to school and did other stuff occasionally, but it's all been a giant screen-filled blur, from one dopamine hit to another. It was a crutch for my emptiness, or maybe it created my emptiness (it's a chicken or the egg question). I've had no motivation to really do anything else, short spurts aside. I've avoided all of my problems, never thinking about the future, never striving to be anything other than mediocrity. I fantasized about being successful, and I almost felt entitled to it (everyone said I was smart and that I would change the world when I was a kid), but I never took active steps. It all felt so underwhelming. So I just escaped online, and into my daydreams.\n\nNo hobbies, no personality, nothing. I'm pretty much still a 12 year old, even though my 19th birthday is coming in a few days. I'm gonna probably fail this college semester. I can motivate myself a little bit, but only temporarily. It all comes crashing down, and I retreat back to my old habits. It's been that cycle for pretty much my entire adolescence: I felt an intense pressure to be perfect, so I adopted certain habits (exercising more, eating better, reading more), only to then leave them behind. Rinse and repeat, regression to the mean. I felt like time was always running out, and because of that, I never got to be a kid, or really enjoy life.\n\nI almost want to throw away my laptop. I know it's my fault, not the laptop's, but I feel like I've tried everything yet tried nothing. It all still feels like I'm repeating the same mistakes over and over and over again, without really learning from them. Maybe it's because I can just use the internet as a safety blanket, and not really have to deal with the consequences. And yes, I know, I'm gonna get fucked over eventually, you don't have to give me your hackneyed tirade about how you gotta pull yourself by your bootstraps sonny and be a \"man\" (ugh!), or tough love stuff (yes, I get it, I need to get off my ass, but for what? Life's a bitch anyways and then you die. If I've felt this emptiness since I was a child, what would getting a college degree, getting a decent job, anything, do to fix it? Money can't buy you happiness. Children starve yet they can retain their dignity, something that my privileged ass apparently can't. I feel like I lack a fucking soul, just a walking zombie devoid of any real persona, that's the real problem). If it were that easy I would just do it, but it's a recurring pattern of behavior. Then again, I need my laptop to do homework to begin with. COVID's just made my problem even worse because I have literally nowhere else to go (24/7 I'm pretty much in my bedroom, I don't have any friends or any reason to go out aside from walking every so often).\n\nSo I don't know. I want to change. I don't want to be like this. But maybe I enjoy being like this. After all, why do I keep returning to my habits? Tomorrow, I could go for a run. I'll still be back in this bedroom doing nothing. I could even start running every two days. But for what purpose? If I fail, I'll just beat myself up and return to the only thing I can really do, which is shut up and stay on the computer. So I must like it this way. But I don't. I'm unhappy, and I loathe myself.\n\nI don't know what to do, that's all. I haven't accomplished a single thing in my life and I don't see that changing anytime soon, despite part of me hoping that I can change. I don't know if it's possible, really. Can a zebra change its stripes?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mvzhno/ive_been_spending_everyday_of_my_life_plugged_to/", "title": "I've been spending everyday of my life plugged to my laptop or phone to the detriment of... well, everything", "social_network": "reddit", "user": "depressed_sack2", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1619076062, "permalink": "/r/DecidingToBeBetter/comments/mvzhno/ive_been_spending_everyday_of_my_life_plugged_to/", "nsfw": false, "first_save": 1635437847.3309958, "replies_charged": false}