{"id": "t5_2tand_t3_n390k1", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Hi everyone! I've always struggled with low self-esteem and self-confidence in my young adulthood (I'm a 26 year old female), and only recently have I been purposefully seeking resources on self-improvement. \n\nI watched [a YouTube video](https://www.youtube.com/watch?v=xGHe5V8qW68) today by Mrs. Midwest that talks about how to overcome low self-esteem, and she said something that kind of opened my mind. I wanted to share about it and hear what you think! \n\n*(\\*Note: I know some people will have opinions on certain creators especially if they hold controversial political views, and if she is one of those creators, I'm not going to discount her or her perspectives just based on that. I'm just happy I heard something that would help me in my journey of self-improvement!)*\n\nOne of her points was that becoming too self-absorbed and introspecting can get in the way of raising your self-esteem. \n\nFor example, being \"too introspective\", or obsessively focused on your emotions and your flaws all while trying to accept yourself is not ideal. It's important of course to be introspective to a degree, but being too absorbed by it and doing *only* that wouldn't get someone far. She says that instead of focusing so much on self-esteem, **focus on self-improvement**. That way, you're not solely absorbed by your emotions; you're also empowering yourself to become better.\n\nI connected to this idea because I'm a naturally introspective person, but I've been going through heartbreak on top of my already low self-esteem for almost 3 years. I can't help but feel like I bear some responsibility on how long I let myself feel so down - and her message made me think, maybe I was being *too* introspective and too self-absorbed. \n\nI felt like her video validated my decision to pursue self-improvement purposefully, and I'm grateful for it! \n\nWhat do you think about this perspective? Do you think she has a point about obsessive introspection?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n390k1/a_new_insight_on_raising_selfesteem_not_being_so/", "title": "A new insight on raising self-esteem: not being so self absorbed. Thoughts?", "social_network": "reddit", "user": "kalalika", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1619970141, "permalink": "/r/DecidingToBeBetter/comments/n390k1/a_new_insight_on_raising_selfesteem_not_being_so/", "nsfw": false, "first_save": 1635437253.7360575, "replies_charged": false}