{"id": "t5_2tand_t3_mj7160", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "What if you didn’t have to do the things you’re putting off right now? What if your job, weight, finances, and number of followers suddenly didn’t say anything about you? What if you were good enough and those were optional side quests but there was nothing “missing” about you that you needed to fix?\n\nI think many of us start with the premise of “I’ll be happy when I accomplish my goal.” The problem is that the goal post constantly moves. We’ve unconsciously decided that we’ll never be happy, and these unfinished goals are excuses. “I’m unhappy because I’m overweight. I’m unhappy because of my relationship. I’m unhappy because of my job.” Well, at some point you’re unhappy because you’ve decided to be unhappy.\n\nI’m being direct about this because I want to stop doing it. I’ve worked incredibly hard and made a lot of progress in my life, but it is never enough. Always chasing something I don’t have, and never happy until I get it. What would it feel like if this endless hamster wheel of unhappiness was over?\n\nLet’s imagine what that feels like. Someone who had climbed the mountain or finished the race or crossed the last item off of their to-do list.\n\nThey would feel peace. The voice telling them to do X or Y would be silent - everything is done already. They would feel gratitude. Their hard work had probably earned them some comfort or blessings, which they would feel thankful for. They would be mindful, enjoying the moment and taking it in, now that they could catch their breath and not be rushing to and fro. They would soak in the little details of the moment. Their warm coffee in their hands, the softness of their chair. I think they would have little curiosities in the moment. Wonder what a duck was thinking as it paddled across a lake, or wonder where a plane had just come from that was soaring overhead. Add your own details to what someone would feel like if they had “made it.”\n\nWho is to say we don’t deserve that peace and gratitude and mindfulness now? Because most of the time I think we’re the only ones telling that to ourselves. Maybe we internalized too much media that said you have to be rich or work 100 hours a week or have a six pack. Maybe we’ve heard that narrative so much that we think it’s our own. Maybe it’s time to stop.\n\nYou are the only one who can decide what is important to you. But I do want YOU to decide. I want you to look closely at the script you’re following right now and ask yourself if you wrote it or if society did. Because you can waste a lot of time putting off happiness chasing someone else’s goals, and you might never get there. How would it feel if you were good enough right now? What emotions and peace would you feel? How relieved would you be?\n\nBecause if you would feel way better than you feel right now….then we need to investigate where you really stand. Life is really short. When today is over you cannot get it back.\n\nI’m not saying we shouldn’t strive to improve. Growth is good for people and accomplishing things feels great. But it’s not a precondition for enjoying life. Happiness is not a reward you have to earn. If feeling “good enough” is a stark contrast to how you typically frame life, then maybe that tells you it’s time to stop waiting for the life someone else said you should want. Your life is here now. You can choose to accept where you are as worthwhile. You can choose to find meaning in the life you have and have gratitude for the things around you.\n\n“Good enough” doesn’t have to be a fantasy. If you’re the only person saying you’re not ‘there’ yet then ask yourself why not. You can choose a better script to follow than the one society gave you. If you can’t find peace where you are now then you won’t find it you get where you’re going.\n\n\\--------\n\nFurther Reading: If this post resonated with you then I think you’d get a lot out of Awareness by Anthony De Mello. He does an incredible job of separating the labels and scripts we put on life from what is really important. His work really helped me inspect the sources of my anxiety and pain and demonstrated I was chasing the wrong things. I found a lot of peace when I started separating out the scripts society gave me vs the things I truly value. I think it could help you a lot too.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mj7160/how_would_you_feel_if_you_were_finally_good_enough/", "title": "How would you feel if you were finally \"good enough\"?", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1617450680, "permalink": "/r/DecidingToBeBetter/comments/mj7160/how_would_you_feel_if_you_were_finally_good_enough/", "nsfw": false, "first_save": 1635435590.4273138, "replies_charged": false}