{"id": "t5_2tand_t3_pm9suu", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "Well, I have severe jealousy and trust issues. I have PTSD and BPD from abuse and neglect during very impressionable years. So, my fear of abandonment is very intense. I am aware and transparent about my issues and have been on meds and in therapy for years.\n\nI just got dumped the other day. And while I know we weren't compatible,  I know my behavior was just not okay.  I was paranoid about being cheated on or him being inappropriate with other women. I felt hurt when I saw him call another woman beautiful on Instagram, when I found out he was doing acroyoga with other girls on the beach, and when he went to the nude beach. When he would go to music fests, I would have such intense anxiety I couldn't eat or sleep. I would ask him for reassurance that hes not flirting with or dancing with other girls. I realize maybe this came off as accusatory, although I tried to word is as nicely as possible and just wanted to know what his boundaries were.\n\nObviously, this led to another failed relationship.  I tried so hard to not let the anxiety get to me, but it envelopes me and I cant think or act clearly. I'm tired of being insecure. I'm tired of enforcing boundaries that may be too strict. Deep down, I want my partner to feel free. I just want to feel sure and secure enough with myself so that these little things don't bother me. How can I work towards this? Any personal experiences and advice is appreciated.  Thank you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pm9suu/realizing_im_the_problem_in_my_failed/", "title": "Realizing I'm the problem in my failed relationships", "social_network": "reddit", "user": "Snoo_78815", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1631375399, "permalink": "/r/DecidingToBeBetter/comments/pm9suu/realizing_im_the_problem_in_my_failed/", "nsfw": false, "first_save": 1635435358.9554536, "replies_charged": false}