{"id": "t5_2tand_t3_o37qrv", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "I'm 21 now and it happened when I was 9, but I'm just generally really happy with life. I was in a pretty abusive and unstable environment from ages 5 to around 19 or so if I'm being generous, maybe 16-17 or so if I'm being more accurate. \n\nAnd now...nothing seems insurmountable. I'm really, really happy. I believe I'm going to have a good life. I *know* I'm going to have a good life. I have healthy coping mechanisms, and not everything is perfect - I still have a complicated relationship with my abuser, as one would imagine, but like...that's really it. \n\nI love my job, I *love* what I'm studying at my dream university, I love the family I have now, I love my friends, I'm more confident in myself and my abilities, I'm beginning to learn to trust myself. Compared to being in survival mode my whole childhood...I mean, this is totally unrecognizable. I never ever could have even *imagined* my life as it is now. You just never, ever, *ever* know what life has in store for you. And I used to be kind of jaded when people would say that, but oh my *god* if it isn't true! \n\nI don't have anything too wildly profound to say here other than I love life. I was reading a book just now and it mentioned the smell of \"brittle air of mornings in winter\" and I found myself thinking *oh yeah, I love that!* and it really is the things like that. I go for runs and I love the way the light dapples through the trees, I find myself not second-guessing things I say in conversations in fear that I'll be reprimanded and instead find myself being accepted and liked and *loved,* I get too hot or too cold and I think how amazing it is to be able to feel it at all and end up sort of relishing in it and enjoying it, I eat a particularly good slice of cheese or something and find myself savouring every second of it...and this all sounds kind of pretentious and a *lot* but these are things I catch myself doing sometimes without even thinking anymore. It really is the sacredness of ordinary things. \n\nI'm just happy to be around to experience it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o37qrv/proud_of_myself_for_not_committing_suicide/", "title": "Proud of Myself for Not Committing Suicide", "social_network": "reddit", "user": "akkyla", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 151, "down_vote": 0, "creation": 1624075521, "permalink": "/r/DecidingToBeBetter/comments/o37qrv/proud_of_myself_for_not_committing_suicide/", "nsfw": false, "first_save": 1635437921.1723962, "replies_charged": false}