{"id": "t5_2tand_t3_mptex0", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Hello,\n\nI am a 29 year old man and am trying to figure out what should I do. Let me take you through my background and current life, I'll try to keep it short. I apologize if its a bit long and thanks for reading and responding if you do.\n\nI finished my masters degree in 2015 in biological science, was trying to find for jobs after but couldn't find in my field. Worked in administration for two years while doing research on the side seeking for PhD opportunities. Couldn't find any and as a result started another masters degree to get more research experience. I am at the the end of this masters degree, I already submitted my research thesis and got feedback from external supervisor in July 2020. Its almost another year and I need to submit a revised version soon. There is no fail in research unless its absolutely trash and in this case, Its not.\n\nLong story short, I have been applying for PhD again since last year September, well tbh wasn't fully committed in applying until Jan 2021 but I have applied for several and still nothing that reached the interview phase. What I am struggling with is, I have known always that I am a very average student, and all these PhD's seek in like the top cream layer of the research era. While I am sure I am way better than most scientists at my stage in statistics and R language, that is not enough to secure a PhD. Everyone seeks for a First Authored publication while I have two co-authored and none first authored.\n\nAs a result, I am struggling to even finish the thesis. Its been 2 weeks since my professor sent me comments on my thesis draft and I haven't even worked on it. This also makes me a bit depressed and makes me play games more on my computer with an aim to improve myself in the game and get a better ranking. I know I am running away from my responsibilities here but I really hate doing things which I don't want to do, and as a result of the pandemic and everything going on, I get a chance to escape into the virtual world and I am good at doing that. Today I went through all the comments but my strive to get better at the game overpowered my need to finish my thesis.\n\nEven if I finish this thesis I am not sure if I want to be in science anymore. Today I even started looking for jobs in my field but there aren't many. I am at a very weird point where, I don't know what to do, I feel lost, I feel like I just want to end this once for all, its been dragging me a lot. When I sleep, I am scared to see an email from my professor next day morning asking me an update and I am afraid to respond to it. I need some encouragement and advice. \n\nThank you once again for reading this and any words of encouragement or any advice will do wonders in my life.  Thanks again for all your kind words of encouragement, I know I'll get through it with people like you in the world helping.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mptex0/29m_i_have_no_idea_what_i_should_be_doing_with_my/", "title": "29M I have no idea what I should be doing with my life, any advice or suggestions of what I should be doing would be welcome.", "social_network": "reddit", "user": "RantiNasha", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1618281733, "permalink": "/r/DecidingToBeBetter/comments/mptex0/29m_i_have_no_idea_what_i_should_be_doing_with_my/", "nsfw": false, "first_save": 1635438311.8126965, "replies_charged": false}