{"id": "t5_2tand_t3_aaofoo", "request": ["57b83cd3-2bac-4e44-9f00-1308d0d0140f"], "text": "Two years ago on this very day, I was stuck in a secretary job for several ungrateful and extreme micromanagers.  \n\n\n\nThere was no training, just \"read our minds.\"  Constant movement of goal posts.  Outright gaslighting and contradictions. \n\n\n\nThere was no feedback on performance - I had to ask multiple time for a performance review, and when we sat down, they said \"so what do you want to talk about?\"\n\n\n\nThere was nowhere to progress - just promises of big paydays in the future based on their professional achievements, which were untrackable and vague.\n\n\n\nThere was no HR.  Just them.  There was no one to befriend or commiserate with.  I felt defeated pretty much all the time, and I was very, very lonely.\n\n\n\nIt was my first job after having my son - leaving to go to work in this environment every day when I could have been home with him was soul-crushing.  I had to work to provide for my family, and I wanted to work, progress, and succeed; but I didnt have a degree, corporate experience, or relevant job experience in the industry that I wanted.  I had taken this job because it was the only job that would take me at the level of pay I needed.\n\n\n\nMy one year anniversary at the office passed unremarked.  Even after being with them for a year and going above and beyond to give them my best, I was belittled and blamed for their oversights and failures as managers.  I went home after a particularly discouraging day and made a list of all the big companies in my city and began applying to open jobs.  Any jobs.  All jobs.  Several jobs per company. I wrote custom cover letters, made as many follow-up phone calls as I could (working business hours meant that I made a lot of lunch break calls from my car), and asked all friends and family members to keep me in mind for a job referral. \n\n\n\nOne particular company called back after a few months of rejections and non-responses.  The recruiter had a few openings across several departments.  Some were a good fit, others weren't.  All involved a pay cut of some kind, mainly (unfortunately) because I lacked a license/degree. I had no experience, but it was entry level with a broad subject base to learn.  \n\n\n\n\"All I need is a foothold.  All I need is to get in the door.  All I need is to put in the work and show them what I can do.\"\n\n\n\nAnd I did.  I arranged three interviews at the company for one day and snuck away.  I was presented with an offer, paying 15% less than I was paid in the job I had.  It would mean that we would have to adjust our living choices, food choices, and daycare choices.  It would mean that we would have to pay strict and careful attention to our spending. And I took it. \n\n\n\nAll I need is a foothold...\n\n\n\nGolly it was tough.  Several times during my first few months, I just stared at the wall of my cubicle and thought about how inadequate I was and how I didnt belong there.  I hyperventilated a lot.  I cried a lot.  I screamed in frustration in the privacy of my own home a lot.  I freaked out a lot.  But I asked questions.  I took notes.  I put in overtime. I did outside research on personal time.  I leveraged my resources, meager as they were at first. I leaned on my family. I made it work.  I spoke up.  I gave voice to my ideas and confusion, and received guidance in return.  I made friends.  I volunteered for projects.  I became a resource to my colleagues.  I became depended on by my managers.  I earned \"political capital.\" I introduced myself to people in other departments and made connections. \n\n\n\nAnd less than a year later, I was a subject matter expert in several aspects of my department.  I was promoted, and earned back most of the 15% I lost when I left my old job.  And I had infinitely more respect and support, which made up for whatever I lacked financially. \n\n\n\nI left my soul-crushing secretary job in early 2017.  I earned the promotion and raise in early 2018.   And just yesterday, I received an offer for a leadership position  on another team in my department, beating out multi-year veterans and people with licenses and degrees.  I'm going to be leading people, coordinating initiatives that matter to me, and earning more than I was in my old job, plus incentives that I have the tools and knowledge to attain.  I'm going to be able to start putting money in my 401k, you guys.  I'm going to be able to bolster my family's lifestyle and save money for the first time in my professional life. \n\n\n\nI'm sharing this for two reasons. First, because I can't tell any of my friends at work about my new position yet, and I am bursting with excitement, joy, and pride. \n\n\n\nSecondly, because I think a lot of people are where I was at the start of 2017, feeling inadequate and completely fed up.  I want to talk to you for a minute.  I see you, and I know how you feel.  You're feeling like you're treated poorly.  Feeling like you have no options.  Feeling like you should be grateful for the BS you put up with because that's the best you can hope for.  \n\n\n\nI think that these feelings are just about the biggest hurdle we can face when we have to start at \"the bottom\" and work our way up.\n\n\n\nI've got news for you.  Feeling the way you feel is unacceptable.  You dont deserve to be miserable.  You deserve to be able to prove yourself.  You deserve to give yourself a chance to make it. \n\n\n\nIf you are miserable in your job, and there is no hope for change, get out.  Take the hit and move on to something new.  Move industries, if you must. Lean on your support.  Make a fresh start, and make it work.  Make the long commute.  Adjust your lifestyle to take a pay cut.  Commit to the extra work.  Leverage your experience, no matter what it is, and make them say, \"now here is someone with potential.\"\n\n\n\nIt will not be easy if you're doing it right.  It will not always be fun.  It may even be discouraging at times.  But not all the time.  If you try, if you put in the work, if you do what must be done... you're going to see some wins, too.  \n\n\n\nNever, ever, ever resign yourself to misery and mistreatment.  Do what you can to get out, no matter how long it takes.  Give a name to your strengths and leverage them in whatever way you can.  \n\n\n\nDecide to put in the hard work.  Decide to take the risk. Decide that you deserve it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/aaofoo/when_persistence_pays_off/", "title": "When persistence pays off.", "social_network": "reddit", "user": "DONTTELLMEshowme", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 224, "down_vote": 0, "creation": 1546113763, "permalink": "/r/DecidingToBeBetter/comments/aaofoo/when_persistence_pays_off/", "nsfw": false, "first_save": 1635437650.3510776, "replies_charged": false}