{"id": "t5_2tand_t3_eoni7c", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "I was always a smart boy, that was all the way up to high school. But then things changed, I had smoked some marijuana from my sister’s pipe, and since have been smoking nearly daily up to this point. It was in fact three years since that first high, but ever since the addiction has stuck to me. I know they say that marijuana isn’t a gateway drug, but after smoking it I went on to try much harder and worse drugs chasing dopamine highs, and trying to make up for the lack of excitement in my life, although I was the reason for it. Surprisingly, I never got hooked on any of the other substances I’ve tried like molly and cocaine. Weed however has turned my life into a boring unfulfilling haze where the only satisfaction comes from lighting up another bowl. I’m tired of this life, I’m tired of the mediocrity, I’m tired of not living up to my full potential. Another thing I forgot to mention is my girlfriend, she’s my everything and she’s only smoked weed a few times before we started dating. Inconveniently, I also escalated her addiction with weed, and now she can easily trigger me into a relapse or the other way around when we’re together. So these are some of the more important reasons I want to stop smoking weed. Another is the feeling that I’m disappointing my parents, they helped me get into the apartment I’m living in today. And I haven’t shown nearly enough gratitude, nor have I put in enough work to be able to sustain the rent for long. (I work a shift a week). All in all, my quality of life has been severely effected by this addiction, and I’m tired of sitting around and smoking weed instead of doing things, and making memories. I am 19 and I’m turning 20 in February. I want to be clean and let my brain develop properly for another five years so I can be my best self, and secure a great career to support myself and my girlfriend.  \n\nThis is literally it. There’s no right time to quit, I’ve had about a hundred “last smokes,” each one progressively making me lose confidence and self-respect. Weed may not be a big deal to some of you, but I know for a fact that it has stopped me from being my best self, and instead made me content with being an anxiety-riddled shell of myself. I am fucking done with this addiction. \n\nTLDR: I started smoking weed three years ago, I did find a girlfriend during my addiction, but also got her hooked on weed, and I believe it’s hampering her motivation as much as mine. (Anxiety has also been unreal, and my performance in college plummeted)\n\nEDIT: I do pay my own rent, I just haven’t been able to find a job and my savings are steadily declining. This is because I can’t hand out resumes until I update my car insurance, or until the weather gets better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/eoni7c/deciding_to_quit_weed_heres_my_story_and_how_weed/", "title": "Deciding to quit weed, here’s my story and how weed has affected me the past three years.", "social_network": "reddit", "user": "yuhman457", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 555, "down_vote": 0, "creation": 1579019233, "permalink": "/r/DecidingToBeBetter/comments/eoni7c/deciding_to_quit_weed_heres_my_story_and_how_weed/", "nsfw": false, "first_save": 1635438119.3764865, "replies_charged": false}