{"id": "t5_2tand_t3_5afvp9", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Sometimes I can’t think of anything to say. And sometimes what I do say doesn’t land. People don’t quite catch my meaning so they look at me funny, laugh awkwardly and turn to the next speaker in the group, dismissing my comment... Ouch. Great job, social skills.\n\nI start doubting myself and overthinking what to say next. I blurt out something else… awkwardly because I’m unsure of myself now. It misses the mark. I feel like I’m on a different wavelength to the rest of the group so I overthink some more and gradually retreat into my mind.\n\nI’m still looking around at everyone, but am scared to say anything. I even struggle to listen to the conversation because I have a more pressing conversation going on in my head: “Why can’t you think of anything good to say, dumbass? Be funny!\"\n\nHere’s what I notice physiologically:\n• My throat gets tight and holds air in;\n\n• My teeth grit together;\n\n• My stomach clenches into a knot;\n\n• My face goes red;\n\n• My eyes go wide, my pupils dilate;\n\n• My head lists the ways in which everyone has probably \ninterpreted my mouth’s comments negatively;\n\n• My head decides that the others now think I'm dumb, or shy, or antisocial, or selfish, or mean, depending on what my mouth has said;\n\n• My head freezes up from running too many programs;\n\n• My hand plays with my beard.\n\n**Practice social skills with real people… WHAAAT?!**\n\nNow, pretty much everyone will tell you that the only way to develop social skills is to go out there and practice… with real people.\n\nThis is good advice, EXCEPT:\na) Talking to people is scary;\n\nb) I suck at it;\n\nc) They’re going to think I suck in general;\n\nd) I don’t know what to say because I don't have social skills;\n\ne) etc. etc. etc.\n\nIt takes a ton of willpower to push through all that mental horse-shit. And on top of that, you have to make it a habit and do it again and again and again. Maybe you’re a willpower juggernaut who smashes through mental resistance all day, but if you ARE you’ve probably already solved your social skills dilemmas, or you will pretty soon anyway on your own.\n\nIf you’ve read this far, chances are you’re still working on them.\n\n**You CAN improve your social skills without speaking to anyone.**\n\nThe mind is a crazy-powerful tool. Let me explain.\n\nMost of us spend a good chunk of our time living in the past or the future rather than the present.\n\nFor instance: you’re living in the future when you’re feeling anxious about an upcoming job interview. You’re living in the past when you’re feeling frustrated about an interview you messed up. You’re living in the present when you put your attention on what you can see, hear, smell, touch, taste.\n\nI say *living* because whatever you place your attention on triggers reactions in your mind and body which combine to become what you consciously experience.\n\nFor the sake of this article, think of ‘mind’ as your thoughts, and ‘attention’ as the thing that observes your thoughts. You can put your attention on an object and have no thoughts, or you can put your attention on your mind and watch your thoughts.\n\nIf you put your attention on that upcoming interview (future) you’ll trigger a bunch of thoughts in your mind - probably “Fuck, fuck, fuck.” Those thoughts then trigger physiological reactions in your body much like the dot-points listed above. You’ll recognise that particular combination of thoughts and body-reactions as \"feeling anxious\".\n\nIf you put your attention on the other interview that you already messed up (past) you’ll trigger some different thoughts in your mind - probably “Fuuuuuuuuuck.” (notice the difference?). Those thoughts then trigger some different reactions in your body and you’ll recognise the combination as \"feeling frustrated\", or \"feeling depressed\", or whatever.\n\nThe body-reactions then amplify the thoughts which amplify the body-reactions even more. You might be sitting on a bus on your way to the cinema, but you’re not experiencing the bus ride at all if your attention is focused on your job interview. You’re quite literally living in the past or the future, if ‘living’ is what you’re consciously experiencing.\n\nIn summary: A situation doesn’t have to be physically real for your body and mind to experience it. So as far as your mind and body know, if you imagine yourself in a certain situation you ARE in that situation.\n\nYou’ve heard of [basketballers improving their free throws with no practice](http://expertenough.com/1898/visualization-works), just by thinking about it, right? Well you can do the same with your social skills.\n\n**How to improve your social skills without speaking to anyone...**\n\nHave you ever walked away from a conversation and then later come up with something brilliant to say?\n\n\"Why didn’t you fetch the information when I needed it, brain?!\"\n\nBecause your brain is a lazy ass. If you ask it for the lyrics to Bohemian Rhapsody or an Arnold Schwarzenegger quote it knows the shortcuts to get that information because it’s used that information several times before. It’ll fetch it at lightning speed.\n\nBut if you ask it for a good response to your interviewer’s “Tell me about yourself...\" you get crickets, so you panic and blurt out a list of boring, generic adjectives. Then later that night, probably when you’re in the shower sulking, your brain fetches the brilliant “Sure, there’s so much to say that I’m not sure where to start. Is there anything specific you’d like to know?”.\n\nThe good news is that you can train your brain to fetch that sort of conversational social skills brilliance in a flash, and you can do it without speaking to anyone initially (though of course that IS the goal in the end, isn’t it?)\n\nIt’s true - going out and talking to people and failing, and doing it again and again is a great way to improve your social skills. It absolutely works BUT it’s bloody hard to do and keep doing, because of the mental horse-shit we discussed earlier.\n\nIf your level of resistance to real conversations is high, and you’re banking on your motivation to get you through the grueling process of making this an effortless habit, then you might be setting yourself up for failure.\n\n[See this graph](http://beardstrokings.com/wp-content/uploads/2015/08/Screenshot-2015-08-08-17.29.061.png)\n\nAs your social skills improve, your resistance will decrease, true. But motivation fluctuates (as shown above), so you can’t rely on it. Notice how by Day 5 my resistance is higher than my motivation? ARGH! Guess I’m not talking to anyone today. Day 6 will probably be the same because hey, I deserve a break. Day 7 something will get in the way and by Day 8 I’ve forgotten about this whole social skills thing and given up.\n\nSo what do you do to get the social skills you want?\n\n**Hitting the social skills gym (in my imagination)**\n\nImagine yourself in a place you sometimes go where there are some people you don’t know.\n\nImmerse yourself in your visualization of that place. What do you see? What do you hear? What do you feel? Imagine those things.\n\nPicture yourself from a third-person view (looking at yourself from outside yourself) throughout this process. It’s a hack to bypass the fears you’d normally have about starting/having a conversation with someone. You’ll notice how much harder this is from a first-person view if you try it.\n\nNow picture someone you’d like to talk to in that situation. Choose 1 person rather than a group for now, because 1-on-1 conversations are more linear than group conversations which jump all over the place.\n\nStart a conversation with that person and continue it. Play both sides of the conversation. Try out responses, reset parts of the conversation and replace your responses with better alternatives.\n\nTry to get to a point where your juices are flowing (not literally). You’ll eventually find a topic and a level of depth that you can speak at length on and explore. Something that you’re genuinely curious about, or that genuinely interests you. See my example below, then read *Here’s why this exercise works* even further below.\n\n**I’ll do it right now and see what comes out:**\n\nI went to a Growth Hacking talk by Ryan Holiday at Google Campus in London a little while back. It was super inspirational. He had some great ideas and I really wanted to talk to the guy after he finished but I couldn’t think of anything good to say. I promptly left in case I actually DID come up with something to say, because then I’d have to say it… to him.\n\nSo I’m visualising myself in that mingling crowd after the talk has finished. What could I have said to Ryan?\n\n> Pete (that’s me): I loved your talk, man. I learnt a lot.\n\n> Ryan: Thanks.\n\n> Pete: How did you meet Tim Ferriss? (a hero of mine that Ryan has worked with)\n\nNope, reset. Make it about Ryan or his talk, not Tim Ferriss.\n\n>Pete (cheeky smirk): Have you had dinner yet? I’ve got a buy 1 get 1 free at Busaba Eathai down the street?\n\nRidiculous thought that popped into my head, right? I was going to reset it, but lets see where it goes. This is an imaginary conversation after all and I have all the charm in the world in my imagination.\n\n> Ryan: Ahhh, thanks but I’ve got plans.\n\n> Pete: Hahah, worth a shot. I actually just wanted to really quickly pick your brain about 1 thing from your talk if you’ve got like 30 seconds?\n\n> Ryan: Yeah of course.\n\nSee, the dinner thing was ridiculous, but it didn’t kill the conversation, and now the energy is actually a bit higher.\n\n> Pete: I was just wondering how the hell you manage to read so many books? I struggle to read 5 or 6 over the course of a year.\n\nHe reads a shit-ton of books. Something I’m genuinely curious about, and something remarkable about him so he’ll probably have something to say about it.\n\n> Ryan: I just made it a priority, man. Anytime I get 5 minutes free I squeeze in some pages. That’s the secret. I actually read quite slowly.\n\nI know this from reading some articles he’s written.\n\n> Pete: Really? Wow. Because I’ve tried speed reading before and couldn’t really work it out, so I figured I was just a slow reader and that I’ll just never read all of the books I want. Damn, Ryan. You’ve made my day. I’ll try that.\n\nThese are all real thoughts that I’ve had before. Talk about shit that means something to you.\n\n> Ryan: Glad to be of service. I meet so many people who say the same thing. The speed-readers out there consume books as fast as possible because they’re busy and want to know  about everything, but they don’t realise that they're often missing out on deeper level understanding. If you’re a slow reader your brain is probably connecting more dots in the background… that’s where the real learning happens.\n\nWoah, now we're getting deeper, Ryan. The juices are flowing.\n\n>Pete: Yeah I hear you. It frustrates me that I’m slow but I think you’re right, it does help me understand things more deeply. So how about that dinner?\n\n**Here’s why this exercise works**\n\nI’ve now spent a good 10-20 minutes in the mental headspace of a genuine conversation (both sides of it), trying things out, resetting them and replacing them with better alternatives.\n\nThis primes my brain to continue working on these problems in the background while I'm doing other things later. I know this because I notice imaginary conversations randomly popping up in my thoughts when I’m on the bus, or lying in bed, or whatever. No conscious effort on my part. It’s a nice change from the negative self-talk that used to pop up before.\n\nWhen I did this exercise regularly I found myself coming up with better imaginary responses faster and faster. It was also really useful to push on with responses that I thought were bad and see where I could take them. You can almost always turn them around, which is also the case in real life.\n\nAnd the point is not to guess how the other person might respond. You can’t know that. The point is to get the aforementioned juices flowing and give you ammunition for future conversations you'll have in real life. You’re essentially putting yourself in your shoes AND the other person’s shoes, so you get to practice social skills from two perspectives.\n\nYou’re not preparing a script either. You just want to spend some time in the \"coming up with good things to say\" headspace. That’s all. When you actually speak to people in real life later you’ll probably say completely different things, but those different things will come to you faster because you’ve done this exercise regularly.\n\nDoing this imagination exercise also lowers your resistance to real conversation, without actually speaking to anyone. You’ll sharpen your wit and reduce your resistance to a point where eventually your motivation is greater. You’ll find yourself happily chatting to strangers and loving it. The graph below is just an example.\n\n[See this other graph](http://beardstrokings.com/wp-content/uploads/2015/08/Screenshot-2015-08-08-17.35.321.png)\n\nRemember that motivation fluctuates so you’re bound to see it fall again. Don’t worry about it. Just use the imagination exercise as a fallback for those days when it’s too hard to push through the resistance and talk to real people. You’re better off **taking imaginary action** towards your goal consistently than **wanting to take real-world action** and giving up.\n\n**Action step**\n\nIf you have 10-20 minutes now, do the exercise above, otherwise schedule 10-20 minutes before you go to sleep today to do the rest of the exercise.\n\nAnd if you want to learn more about how to genuinely connect with people through conversation check out [Upgrade Your Social Skills](https://beardstrokings.com/social-life-coaching/?utm_source=r-d2bb&utm_medium=improve-soc-ski&utm_campaign=redd-c). You'll learn what to say, how to say it and why it makes a difference.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5afvp9/how_to_improve_your_social_skills_without_talking/", "title": "How To Improve Your Social Skills, Without Talking To Anyone (Repost)", "social_network": "reddit", "user": "magnett77", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 60, "down_vote": 0, "creation": 1477957266, "permalink": "/r/DecidingToBeBetter/comments/5afvp9/how_to_improve_your_social_skills_without_talking/", "nsfw": false, "first_save": 1635435842.018716, "replies_charged": false}