{"id": "t5_2tand_t3_qglfxd", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "I'm in a crossroad situation in my life... time is ticking and I have to decide quickly but I can't decide and it's eating me alive, the anxiety wont let me sleep, it is making me go bald, it had fucked up my brain cause I can't think or talk normally, it's ruining my routine, it's making me do compulsive things that hurt me, it's making me lose focus at work and other areas, it got me overthinking and I feel like I'm going INSANE. What can I do in this situation? I can't relax, and I'm constantly feeling drained. I picked a college degree that I hate, feel stuck in an industry that in the future will disappear and I don't even like, I'm pressured to leave my country because the future for myself as a gay man that I want can't be found here, I try to look how to change my career but there are too many options and I don't have the time to study and learn every single one of them to figure out if I like it or not, I'm also full of student loans and I don't want more debt and I don't feel like going back to college, I'm desperate, I feel lost, trying to keep it all together at work for 8 hours in a row EVERYDAY, I am going insane. There is pressure around me to get a masters degree but nothing about this field interests me and if I try another field it will be so hard to understand with no previous formal knowledge or experience. I've hit a dead end. What can I do? I can't stop ignoring this compulsive thoughts, I can't live in the present moment knowing I'm stuck and I currently have no future.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qglfxd/im_stuck_and_lost/", "title": "I'm stuck and lost :(", "social_network": "reddit", "user": "Admirable-District-9", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1635298411, "permalink": "/r/DecidingToBeBetter/comments/qglfxd/im_stuck_and_lost/", "nsfw": false, "first_save": 1635438037.7445447, "replies_charged": false}