{"id": "t5_2tand_t3_hrmsma", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": " I used to party a lot every weekend and even during the weekdays. I smoked pot everyday for months and barely passed my exams. Till the end of HS i had toxic, bitchy friends who either used me for something or just brought me down. I started smoking cigarettes too cuz everyone around me did. Never worked out or was careful with what i was eating (I'm blessed with a fast metabolism). Wore skanky clothes and really had no self worth and would let people walk all over me. \n\nI went through something towards the end of senior year where i lost a bunch of \"friends\", and turns out that incident helped me a lot to get on this path to find myself. I realised how lost I've been throughout my life and one day decided to write everything down on a piece of paper and forget about it. it worked! i wasn't sad about my friends leaving me and instead decided to focus on myself.\n\ni quit smoking cigarettes cold turkey, started to go to the gym regularly, eat healthy and fixed my sleep cycle! i started to meet school deadlines and somehow did well in my IB finals. Quitting weed was a bit hard at first and i kept making excuses but one day got the courage to throw away my stash and start fresh. \n\n I realised how much i hated smoking weed and till now never got the urge to do it again despite people around me smoking. i take care of my body and skin which is good and started to meditate! I'm also learning a new language and completely cut out most of my friends and quit social media. It was the best decision of my life thus far.\n\nThe one thing i need to work on is consistency. I work out still, but not as often. and don't get the motivation to do it everyday. I eat healthy and on time but punish myself and feel extremely guilty every time i eat even a potato chip or a slice of cake. And i get let down when my family don't acknowledge or appreciate how far I've come :(\n\nIs there anything i could do to motivate myself to stick to my routine? to be consistent? I've heard journalling helps ,kinda hate journalling but if it really helps any tips on how to do it or what to write would help too!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hrmsma/17f_finally_quit_smoking_and_toxic_friends/", "title": "(17f) Finally quit smoking and toxic friends working on loving myself and improving my lifestyle", "social_network": "reddit", "user": "Dogmomgodmom", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 195, "down_vote": 0, "creation": 1594816742, "permalink": "/r/DecidingToBeBetter/comments/hrmsma/17f_finally_quit_smoking_and_toxic_friends/", "nsfw": false, "first_save": 1635435585.500139, "replies_charged": false}