{"id": "t5_2tand_t3_bbtwab", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "This year I began measuring my own wellbeing across three dimensions:\n\n1. Psychological Wellbeing\n2. Life Satisfaction\n3. Global Physical and Mental Health\n\nI was inspired after watching a psychologist named Robert Cloninger’s fascinating lecture on wellbeing titled “East-West Connections: Cultural Patterns, Cognitive Patterns and a Good Life”.\n\nImmersing myself in Cloninger’s research gave me the idea to create a framework for my own personal development that would not only help me identify opportunities for learning, but provide me with feedback on the efforts I make to improve my situation — I want to know how I am progressing over time.\n\n[Here's a link to his presentation on YouTube](https://www.youtube.com/watch?v=hT_VcUcHVdk)\n\nThis led me to create a simple Google Sheet-based tool that I have used for the past three months to better understand myself as I progress on my personal development journey.\n\nAlthough I intend to write and share more about all three aspects of this reflective framework — including how I am using this to inform my personal development efforts and my work at [Open Dialogue](https://www.opendialogue.ai) — I thought I'd encourage anyone who is interested to simply experiment with one of the scales I use: the Flourishing Scale (which informs my “Life Satisfaction” measurement from above).\n\nThe Flourishing Scale was created by Ed Diener, Professor Emeritus of Psychology at the University of Illinois, and consists of eight items describing important aspects of human functioning ranging from positive relationships, to feelings of competence, to having meaning and purpose in life.\n\nReflecting on these eight simple statements in the Flourishing Scale has been tremendously impactful for me.\n\nWhen I first filled it out, each item seemed to be linked to dozens of different thoughts, ideas, relationships, hopes and concerns. I felt like it provided me with a structure I could use to think a bit more mindfully about my entire life situation and the things that matter most to me.\n\nIt also highlighted areas in my life that I truly want to improve, and even sparked new ideas and potential actions I could take to begin making progress towards a greater sense of satisfaction.\n\nI'm now taking deliberate actions to improve each dimension, and using the survey each month to track my progress.\n\nIf you’re interested in exploring the Flourish Scale, [you can access a version that I made here](https://www.opendialogue.ai/life-satisfaction-survey).", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bbtwab/i_started_measuring_my_wellbeing_this_year_and/", "title": "I started measuring my wellbeing this year and it's been inspiring", "social_network": "reddit", "user": "edblunderfield", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1554944138, "permalink": "/r/DecidingToBeBetter/comments/bbtwab/i_started_measuring_my_wellbeing_this_year_and/", "nsfw": false, "first_save": 1635436556.9955082, "replies_charged": false}