{"id": "t5_2tand_t3_mtj858", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "2170e8f5-f784-48b1-a4db-f3b547d87da6", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "When it comes to anxiety there is a tendency today to view one's childhood merely as an episode of psychological conflict and trauma, which later has to be resolved. Ironically enough, for most of us our childhood was the period in which our lifes were the least dictated by caution and anxiety.\n\nIn the words of the great Austrian poet, Rainer Maria Rilke, life *was never again so filled with meeting, with reunion and with passing on.* For Rilke childhood was a central topic. Central to the point where many scholars would call it an obsessive interest.\n\nIn his poems he speaks about childhood with a deep-felt nostalgia and fascination. Despite the fact that his own childhood must have been very difficult. Reading about his early biography leaves no doubt that his struggles later in life were connected with his problematic upbringing.\n\nLou Salome, his famous fiance, once said about him that he was totally lost as a person. He often felt trapped in a corset of anxiety and doubt, unable to act freely and overwhelmed by everyday life.\n\nHere, I think, lies part of the reason for Rilke's obsessive interest and fascination for the subject. Childhood in general must have appeared to him like an oasis in the desert, like an antidote to his life struggles.\n\nWhile he felt inhibited in his actions, children use to engage fully in most of their self-chosen activities. Without any kind of worries about later responsibilities or potential failure. There is no \"But later..\", no \"What if..\" disturbing their minds from being fully present.\n\nIf they want to do something, they go for it - even if it is for the very first time. Doing so, children tend to fail quite a lot. Trying to take their first steps or simply by drinking out of a bottle. But this doesn't make them anxious beforehand. They don't mind to fail and to look stupid.\n\nAnd this is how they learn so quickly, while beeing filled with so much joy. Everything is in flow. Their life is filled with *passing on,* as Rilke said.\n\nA quote I stumbled across last week, puts this mindset of growth and fearless engagment once more beautifully in contrast with the anxious mindset of an adult: *If the adult brain was put into the mind of a child, it would take that child into their 80's before they learned to walk. This is because they would be so focused on the fear of falling or stumbling instead of being focused on learning.*\n\nSo our anxious adult minds should focus more on exploring new things, on learning and on what we really want to do, not so much on our potential failures and the opinion of others.\n\nThe fact that our lifetime is limited and that we don't know when it will end, should motivate us to not allow our anxieties to steal away moments of children like engagement and flow.\n\nOf course, there are advantages of being an adult and to mind consequences. It allows us to engage in deep and meaningful relationships and to take on responsibility for our actions. But if we want to find fulfillment in life, we have to accept, maybe even embrace, the fact that being alive is to be at risk. The (extreme) alternative - a general and strong risk adversity - ultimately leads to isolation and to an empty and unlived life.\n\nBut even if you are already isolated, living a life that feels somewhat paused, but also too much to handle - there is still hope for change.\n\nIn this sense I would like to invite you to try the following exercise, which I personally found very helpful:\n\n**Summoning your inner child in the face of anxiety**\n\nThe next time when you feel anxious and on the edge of avoiding something you would really like to do - like singing out loud or doing a workout in front of people - try to summon your inner child and focus on your wish and on what you could learn. Expose yourself to the anxiety. This won't be easy, but step by step your anxiety will shrink, while you are nourishing your new mindset inspired by childhood.\n\nRemember that every risk comes with an opportunity. Or in the words of the American poet Erin Hanson:\n\n*There is freedom waiting for you, on the breezes of the sky, and you ask: \"What if I fall?\" - Oh, but my darling, what if you fly?*\n\n&#x200B;\n\nP.S. If you liked this exercise, I have written more lessons like that. Just in case you **are curious to explore more**, let me know and I will share the link to **other lessons** in DM.\n\nThe themes I cover are: getting disciplined, reducing anxiety, learning about your life values, decision-making, the art of happiness, and being present in the moment.\n\nThe lessons are based on the primary sources of wisdom from more than 2500 years of history of philosophy: Plato, Aristotle, Lao Tzu, Carl Jung, Stoics, and many others.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mtj858/reduce_anxiety_by_aspiring_to_live_like_a_child/", "title": "Reduce anxiety by aspiring to live like a child", "social_network": "reddit", "user": "Sviat-Hni", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 86, "down_vote": 0, "creation": 1618772975, "permalink": "/r/DecidingToBeBetter/comments/mtj858/reduce_anxiety_by_aspiring_to_live_like_a_child/", "nsfw": false, "first_save": 1635435154.247046, "replies_charged": false}