{"id": "t5_2tand_t3_dzyetl", "request": ["cbd1933a-caaa-464d-8e4c-373318982c62"], "text": "About 10 months ago, I cut off a toxic friend from my life(someone I considered a best friend) and the journey since then has been difficult but also rewarding.\n\n[4 months ago I posted](https://www.reddit.com/r/DecidingToBeBetter/comments/c8mmms/i_finally_let_my_anger_go_and_i_moved_on_properly/) about reaching a cusp and learning what it means to forgive, and since that point I think I set myself on the right path to healing. And between then and now I learned a lot and grew a lot. First, I realized that healing is not a linear path. It's very up and down in that you'll have days where you're stuck in a low point and relishing about the past, and days where you're euphoric you're past it.\n\nI started crying today, as it started on an off note and ended in a darker one. I was thinking back to my feelings(have been all week) only this time I sort of pretended like I was talking to the person. It led to me revealing how I really felt, how what she had done still felt like a major betrayal, and how it's so hard to say \"I don't want you in my life anymore\" when you wish they were still there even though it'd be bad for you.\n\nBut something about saying it made me think past the negative thoughts and fall onto positive ones.\n\n**I started to remember all the good that I had accomplished in my life because I moved on.**\n\n10 months ago, I felt so insecure and lost because of that relationship that I didn't think even think a fraction of what I've done these past 4 months was even possible.\n\nI've made new friends. Become kinder to myself and my image. I took classes that were challenging and didn't back down, rather worked harder and it showed I was capable. I fixed a different friendship I'd damaged after the incident and we still talk to this day now. I laugh a lot more and tell jokes(I never did this because I was so anxious I'd annoy someone). I'm even letting myself get excited over crushes(haha tomorrow I even plan on asking for his number just to see\\~).\n\nHealing is not a linear process. That is a fact. It takes a lot of time, and a lot of energy, and a lot of trial and error on your part. But the fact still remains that you are healing. And every day, the wound will ache less and less. And the good in your life will grow to be much more than what was hurting you.\n\n10 months ago I wasn't sure if I could keep living, and yet today I don't think I've ever felt more alive. Healing is still healing, no matter how long it takes.\n\nAnd if you're in a rough spot today, or you're in a rut during your healing process, take a heart from me and know I believe in you and you've worked so hard to get to this point! Be kind, patient and gentle with yourself! You can do it! <3", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dzyetl/healing_is_not_a_linear_process_but_dont_forget/", "title": "Healing is not a linear process, but don't forget that it still means you're healing.", "social_network": "reddit", "user": "PineappleGetaway", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1574412878, "permalink": "/r/DecidingToBeBetter/comments/dzyetl/healing_is_not_a_linear_process_but_dont_forget/", "nsfw": false, "first_save": 1635436407.788794, "replies_charged": false}