{"id": "t5_2tand_t3_q2kh4v", "request": ["1a213df6-3f71-466c-9762-ace119e0102e"], "text": "# I'm losing my mind, please let me know what help I can get\n\nI don't know what's going on with me. Im forgetting things. My bike was stolen. I was in a motor accident 3 weeks ago that took me out of school/work for 2 weeks. I can't get my assignments done. I have insane medical debt now cuz of lack of insurance. I haven't done any assignments in two weeks. I only got a days worth of work done at my internship this week. I have to pay for my little brother's tuition. I have to help with my parents mortgage cuz they raised by $500 a month cuz of a stupid tax thing. My life isn't mine. I have so many responsibilities and people counting on me. I set up therapy sessions at University Health Services but those are 3 weeks out, not even a phyciatrist. I can't open up about my depression with my friends/family because I come from a background that ridicules mental illness. I don't want to kill myself because I CAN'T. It isnt my life to take, just the thought of my my loved ones losing me is a thought I can't bear. I just feel trapped. I have a good future ahead of me, 4.0. with a good internship and enough credit to graduate as a junior. I know success and happiness are just around the corner but I feel like if I don't get out of this fit of depression I will cause irreversible damage to my life. I don't care how much it costs anymore I just need help please.\n\nUniversity of Texas at Austin Junior, currently in Austin\n\nAny tips on how to get legitimate mental health help will be greatly appreciated", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q2kh4v/im_losing_my_mind_please_let_me_know_what_help_i/", "title": "I'm losing my mind, please let me know what help I can get", "social_network": "reddit", "user": "Mufazaaa", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 26, "down_vote": 0, "creation": 1633526917, "permalink": "/r/DecidingToBeBetter/comments/q2kh4v/im_losing_my_mind_please_let_me_know_what_help_i/", "nsfw": false, "first_save": 1635437079.5558577, "replies_charged": false}