{"id": "t5_2tand_t3_26fsna", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "I was talking to my closest friend yesterday, and she delivered a piece of feedback that devastated me.\n\nBefore yesterday, I saw myself as a funny guy that everyone liked. I was cheeky, and said things that everyone thought and that may have been a bit insulting, but got away with it because of my charm, wit, and looks. People loved being around me, and everyone that I knew actively sought out my company.\n\nI don't think I was more wrong.\n\nMy friend told me that, although people do like me, they do not enjoy my company, because the things I say about them make them feel horrible and hurt them. It drove people away, and made them nervous when I joined a group.\n\nThat alone hurt. But the thing she said which devastated me the most was, \"When I see you, I get scared, and I cannot emotionally trust you anymore.\"\n\nInternet, I'm not going to lie to you. This is one of the lowest points in my life. My whole self image has been shattered. I have gone from feeling like the coolest guy in the world, to actually being the biggest piece of shit that has ever walked this planet. I realise that she is right, and I've been the worst friend, for her and for everyone else, that could possibly be.\n\nI've made commitments to myself to be a better me by just shutting up, and not having to be the dominating contributor in each conversation. However, in the few conversations I've allowed myself to have since, I've realised that it's really hard.\n\nWish me luck, not for my sake, but for the sake of everyone I know.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/26fsna/yesterday_i_received_the_worst_feedback_ive_ever/", "title": "Yesterday I received the worst feedback I've ever received.", "social_network": "reddit", "user": "feelslikeow", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 159, "down_vote": 0, "creation": 1401015204, "permalink": "/r/DecidingToBeBetter/comments/26fsna/yesterday_i_received_the_worst_feedback_ive_ever/", "nsfw": false, "first_save": 1635435833.93838, "replies_charged": false}