{"id": "t5_2tand_t3_ojm1vd", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "PS: I didn't know what flair to use, please kindly inform me if I used a wrong one. If my post is against the rules, please tell me. I'll take it down.\n\nIt's not too bad so you're free to ignore this since it's probably a waste of time. \n\n I'm jealous of my friends for having everything I didn't (ex: Experiences, wealth, an actual life in real life instead of being an online addict like me, friends they relate to in real life which I don't have because in real life, there is absolutely no one in my school or anywhere that I met that was ever the type of friend I want and need. Better than me in every way. Much better countries. More freedom.) even though I know I'm in the wrong. They have problems in their life too, and I act like not.\n\nTo elaborate on the friend part, I'm from a 3rd world country and there are generally no people like me or my friends I'm talking about. Even these are long distance friends, because I certainly have no real life. I'm useless in real life. I'm pretty much a good for nothing. Ofcourse it's not as bad as I make it sound, I'm pretty happy and all. It's the jealousy taking over me. I just cant seem to get over it like everything else. \n\nMy friends are much better at everything and more privileged than me. They've had all the experiences I want, but can't get. I know, my life isn't bad. I'm privileged compared to others, but it feels meaningless, my friends might become something but it feels like I can't. I know I can, I'm just fucking lost at this point. They're better in every damn single way. I feel like a good for nothing.\n\nSorry if this sounded like a vent. I'm pretty self aware and I know I should stop the self pity and jealousy before it takes over me. I know the problems I think, I just don't know how to fix them. I hope someone can help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ojm1vd/jealous_of_my_friends/", "title": "Jealous of my friends.", "social_network": "reddit", "user": "hitelio", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1626201917, "permalink": "/r/DecidingToBeBetter/comments/ojm1vd/jealous_of_my_friends/", "nsfw": false, "first_save": 1635437844.0150013, "replies_charged": false}