{"id": "t5_2tand_t3_otno2u", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I've struggled with astonishingly low practical intelligence my whole life. I'm kind of clueless. I've always been \"the slow one,\" I don't really know how to use my head. I do stupid things and make stupid mistakes CONSTANTLY to the point where others have also noticed and pointed it out. No matter how hard I try, or how well thought-out I believe something to be, it's stupid. I don't think as well as most people and it shows in my day-to-day life.\n\nI'll provide some examples: I can rarely figure out how to use items I'm unfamiliar with (like new appliances) properly, however intuitive they're designed to be. When playing chess, I blunder pieces constantly and in stupid ways, often overlooking better moves and just playing weirdly/poorly in general (I've been playing since I was a kid). I have difficulty with assembling things. I've tried computer programming in the past and I lack the logical problem-solving skills it requires. Also, in general, I'm a dumb person. I'm unable to complete minor tasks that others find easy - the daily, trivial challenges and tasks that most people don't even notice - although I can't think of specific examples of this atm. \n\nI am the moron who just can't seem to figure anything out. I am the guy at work you get frustrated with for incompetence that makes you wonder how they even got that job. The crappy driver in front of you that you silently curse. As my name indicates, the garbage teammate in your video game. The guy who keeps annoying you with stupid questions that anyone above the age of four should be able to figure out the answer to. (Maybe I do have some examples after all). On behalf of all the idiots you've encountered, I'm genuinely sorry. But I'm not any happier with this arrangement than you are, if not less. If you meet an idiot, you're frustrated for the time you're around them. If you are the idiot, they follow you EVERYWHERE. So I need a solution.\n\nThis problem is worse than it sounds. It's truly awful. I've searched my whole life for a solution, to improve, because I'm desperate not to be like this anymore. But after a lifetime of trying and failing, as well as recognition of the nature of the problem itself as more of an \"attribute\" I have than a fixable issue, I've given up and deemed it impossible, just something I'll have to live with forever.\n\nBut I have some free time and today I'm in a hopeful mood. So I'm willing to try out whatever tips I'm given. I'd really like to be like everyone else. Tell me your secrets, tell me what I'm missing and how to get it.\n\nEveryone else just seems to intuitively understand how to do things. How to make good decisions and come up with good solutions to everyday problems. Common sense. Please teach me how to use my head.\n\nAlso: not really looking to accept my current situation. If you think improvement is impossible, tell me, but I don't want to be happy with what I have or the way things are. I want to be better and am primarily looking for tips on how to achieve that.\n\nThanks for any advice!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/otno2u/how_do_i_build_common_sense/", "title": "How Do I Build Common Sense?", "social_network": "reddit", "user": "HardstuckBronzeRank", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1627522047, "permalink": "/r/DecidingToBeBetter/comments/otno2u/how_do_i_build_common_sense/", "nsfw": false, "first_save": 1635437986.6555343, "replies_charged": false}