{"id": "t5_2tand_t3_nadfr7", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Reddit, I am looking for advice. In order to become a better version of myself I am acknowledging areas in my life where I am weak, accepting them, and actively changing them. I have made strides in many areas, and the one I am most proud of is my self-awareness. \n\nI currently work as a line cook with a vision of becoming a head chef. (Prior to this I was in the Marines and worked as a heavy equipment operator on the civilian side.) Military training has been useful in many ways in regards to the culinary world. I know how to move with purpose, move quickly, take commands, and respect hierarchy. I leave my ego at the door and work hard everyday, with the mindset of “you are only as good as your last at bat”. \n\nPrior to the military I was reserved, quiet, and a bit of a push over. I had my pride, but I was a people pleaser, I allowed myself to be bullied, and I was not a leader. As an adult, I don’t tolerate bullies anymore, but I still find myself people pleasing, and not being the leader I know I can be. \n\nYesterday, while at work, there was confusion on the line and chef came over to me to see what was going on. He asked me if this plate was what I needed and I said yes because I could tell we were behind and needed to get the food out. I allowed myself to get overwhelmed because there was a lot going on, and I didn’t think it through. So the ticket got messed up twice. I froze under pressure because I wanted to please chef instead of being honest by admitting I didn’t know, or saying I needed time to figure it out. \n\nI am not ashamed, just aware of it, and want to change it. I have been in this position for three weeks now, I have no culinary experience prior to this, and it was during peak hours where we had a lot of tickets coming in. I want to know if anyone has any advice for dealing with high pressure situations, being a leader, having confidence, and not freezing up. The military helped a lot, but clearly there is still a lot I need to work on if I am ever going to accomplish my dreams. At the end of nearly every shift chef thanks me and says I am doing a terrific job. While I agree that I am learning quickly and working hard, I am holding myself to the highest standard, in order to be great. Thank you, I’m looking forward to talking this out.\n\nPS: Any general culinary advice would also be appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nadfr7/landed_a_job_as_a_line_cook_my_goal_is_to_become/", "title": "Landed a job as a line cook! My goal is to become a head chef one day. Would love some help!", "social_network": "reddit", "user": "throwawaayyyyy19", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 368, "down_vote": 0, "creation": 1620783723, "permalink": "/r/DecidingToBeBetter/comments/nadfr7/landed_a_job_as_a_line_cook_my_goal_is_to_become/", "nsfw": false, "first_save": 1635438221.149633, "replies_charged": false}