{"id": "t5_2tand_t3_85n22q", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I had an emotionally neglected childhood and I feel like I don't know how to bond with other people.\n\nI know this is bias and narcissistic but I want to explain how I feel about myself, even if it is delusional, and hopefully someone can see my blindspot or call me out for my bs.\n\n* I find it easy to make 'friends'. I have lots of people in uni and on campus that I can get along well with. \n* I participate a lot in class and have a friendly relationship with most of my professors. \n* I'm easy-going and relatively smart (law school). \n* I'm quite creative - I'm musical and into literature and writing. \n* I've traveled a lot and lived abroad alone. \n* Based on the attractiveness and confidence level of the girls I've slept with (not that many, not a boast) I think I'm average+ in presentation and social skills. \n* Random people start conversations with me in the uni library because they've seen me in the same spot a few times. Baristas, bartenders, cashiers randomly start conversations with me.\n* I'm outgoing and enjoy meeting people, and I don't shy away from going to clubs (I've even went alone twice) and parties. I generally am interested in people. \n* On top of this I'm quite quiet and soft/relaxed in disposition - I don't think I'm intense or obnoxious and most of my friends have always been women so I'm probably a bit on the feminine side (I'm a straight guy).\n\nIn essence, I feel like I'm likeable and that people do notice me.\n\nAnd yet I somehow waste all of that good fortunate because absolutely no one wants me. I have never had anyone in my life who wanted me when I wasn't present or when they weren't drunk. I'm quite introverted despite being outgoing (it's mostly the chronic loneliness that makes me outgoing) and it's absolutely exhausting to constantly be in 'social mode' and have nobody to relax with. \n\nI have quite a fractured self-esteem. The first thing I do when I wake up is focus on the fact that no one has ever wanted me. I've never celebrated a birthday, or had a relationship, or felt naked with anyone. I hate hooking up because it wrecks my self-esteem when they leave. I think I'm experienced enough to notice negative thoughts and self-destructive/ counter-productive behaviour, and I know this self-pitying is counter-productive but my life is so silent and the pain is so pervasive that the thoughts roam free. \n\nI know it sounds very needy and no one is going to sign up to be the caretaker of someone with self-esteem issues. The thing is is that even though I'm chronically lonely with my idiotic echo-chamber of negative thoughts I am confident (somehow) and when I talk to people face to face I never feel the need for them to like me (I kind of just assume they will). I suppose law school and being able to make superficial friendships easily boosts my ego and takes away the pedestals of others (yay for arrogance).\n\nBut I need something deeper than friends and I just don't understand how no one out of all the people I've shared laughs and fun times with hasn't expressed any interest in being open to something more than friendship. I'll always be working on myself but law school is soul sucking and it feels like salt on a wound to know that it doesn't take anything special to be in a relationship or to have someone care about you, and often I wish someone would just show some affection to me.\n\nEverything in my life is the way I want it to be or better than I had expected. Apart from the fact that no one wants me. \n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/85n22q/i_cant_seem_to_make_any_sort_of_connection_with/", "title": "I can't seem to make any sort of connection with people. Nobody has ever wanted me. Help?", "social_network": "reddit", "user": "10PercentSodium", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 189, "down_vote": 0, "creation": 1521493518, "permalink": "/r/DecidingToBeBetter/comments/85n22q/i_cant_seem_to_make_any_sort_of_connection_with/", "nsfw": false, "first_save": 1635438278.3880935, "replies_charged": false}