{"id": "t5_2tand_t3_pgetfr", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "**Edit**: Wow thanks for all the amazing feedback guys, I'm really glad that these ideas seem to of helped you in some way. I have a youtube channel where i discuss and explain things such as this i.e. mental health, self-improvement, anxiety etc. I'm not sure if this goes against the promotion policy but worth sharing if it can help anyone navigate this old river of life! **Keep building those boats!**\n\n[https://www.youtube.com/watch?v=7fGbPwrC5Gg](https://www.youtube.com/watch?v=7fGbPwrC5Gg)\n\n\\-\n\nHere's a coupe of philosophical ideas that have really helped me over the years with anxiety (which at one point was completely overwhelming for me). I hope it can help someone else.\n\nAnxiety is prevalent in society, especially amongst the younger generations. Anxiety is a future facing thought pattern. It is the over contemplation on what could happen.\n\nCombine this with most people also having an overactive mind from too much stimulation from screen, the internet, social media etc. and you have a very overly stimulated *and* active mind that is very anxious. Less than ideal.\n\nYou spend so much time worrying about what could happen, what might happen, if this does happen, what if this happens….\n\nYou drive yourself crazy. Continually worrying about all of these impossible to know outcomes. It’s not like the more you think about it, the more accurate your idea of what will happen will come true, but your mind cannot stop.\n\nThe more you cling onto a desired outcome for the future, the more you will suffer when that desired outcome does not become reality.\n\nThink of it like this:\n\nYou have been born and are alive for the blink of an eye in terms of the cosmic reality that we find ourselves in.\n\nThere is infinity stretching behind you and infinity stretching ahead of you.\n\nEven with this understanding of being such a minor (not negative but factual) part, such a small role in this endless cosmic drama, you think that you should have a say in what happens. You enter into existence for this tiny amount of time and spend so much time thinking about how you would like the future to be and how you want the world and the movement of time to fit into your desired outcomes.\n\nAnd then when it doesn't, you suffer. As if you have been wrong or robbed of something that you are owed.\n\nThe world doesn’t owe you anything.\n\n\\-\n\nBut I get it, you want a good life and you don't want to suffer. Who does?\n\nThe way to do this is to let go of your expectations of what you want your life and your future to be like. Surrender to the future, rather than obsess over it.\n\nThe only thing that you have any claim over, is your own life. What you do, how you are and how you feel.\n\nFocus solely on these and you wont need to worry about the future.\n\nTo use a metaphor,\n\nYou are a boat and life is the river.\n\nThe river is long and unpredictable\n\nThere is no point spending all of your energy looking ahead and trying to figure out where the next bend is, if there will be a waterfall, how long the rapids will last. You have no idea. It is futile and wasted energy.\n\nInstead, focus on how well you build your boat. A well built boat will be able to travel well down the river and any unpredictable rapids or waterfalls will be a challenge that a well built boat will overcome.\n\nYour job in life becomes very simple then.\n\nDon't worry about the future, but spend time everyday making sure that your boat is well built. (exercise, reading, meditation, gratitude etc.)\n\nEverything you do, changes the boat in some way. Some habits and behaviours make the boat worse, and some make it better.\n\nIf you focus on doing the things each day that make your boat better then you wont need to worry about anything else - the river ahead.\n\nYou can live presently with the confidence that whether there are good times ahead or bad times ahead, I have built a robust boat and I can handle it.\n\nYou do this, everyday, and you will soon find all of those things in the future you used to worry about, will float away.\n\nPeace and love.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pgetfr/dont_focus_on_the_river_focus_on_how_well_you/", "title": "Don't focus on the river, focus on how well you build your boat - my philosophical take on mental health and self improvement", "social_network": "reddit", "user": "yusefsanei", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 683, "down_vote": 0, "creation": 1630577060, "permalink": "/r/DecidingToBeBetter/comments/pgetfr/dont_focus_on_the_river_focus_on_how_well_you/", "nsfw": false, "first_save": 1635437206.446697, "replies_charged": false}