{"id": "t5_2tand_t3_6ba27k", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Hi there,\n\nI'm a 27 year old male. I've been unemployed for a few months, live at my parent's house, have no money, have mild to moderate anxiety, haven't had a girlfriend for eight years and basically feel stuck, clueless, don't know what to do with my life.\n\nI am unable to decide what I really want to do career wise. I have been considering this question for so long, and still don't have an answer. I honestly think I've considered this question more than the vast majority of people. One thing I know is that I want to do something I enjoy, regardless of the money.\n\nBasically my life consists of taking my dog out for long walks, reflecting a lot, I mean A LOT and writing. Since I've been unemployed, I've spent a lot of time thinking of who I am, what I want, what I don't want, ways to improve myself etc, but nothing ever goes anywhere. My motivation burns out pretty dammed quickly.\n\nI'm a very deep thinker and sometimes I feel like I think too much and analyse too much. However, introspection and reflection are important to me and they usually bring me clarity. I'm increasingly feeling like I struggle to connect with society or people in general. I feel like nobody is on my wavelength. I'm a very real, authentic person and like to think about the deeper things in life, philosophy, spirituality, politics etc but all that kind of stuff just seems to put people off.\n\nIt's getting to the point where when I go out and try to socialise, be out and about, negative emotions come flooding to me, my anxiety flares up, and I just feel extremely disconnected from society in a general sense which is hard to put into words. I see all the fakeness, self-absorbance etc. This reinforces in my brain that I would in fact prefer to be alone.\n\nThe thing is, I do genuinely enjoy my alone time, thinking, reflecting, writing etc and to be honest, I often feel happiest when I'm doing this.\n\nI'm also starting to question all aspects of society and basically all the hidden traps and shackles of society and whether what society deems to be good etc is what I really want. This all brings me to a situation where I feel disconnected from society and have no real motivation to find a job. It's not just that I feel a bit lazy and don't want to apply for a job, it's that I feel so very detached from the whole job market in general. I don't know. I just feel so at odds with the whole career thing.\n\nWhat's more, for many reasons, I've always felt like the odd one out. I am different, a bit weird in a way, but not obviously so, if that makes sense. I'm real with my emotions and I try to be open. Feeling like the odd one out, combined with my anxiety, makes it very difficult for me to socialise. I seem to intuitively know that if I socialise and improve my relationships I'll feel better, but another part of me feels better when I'm just by myself.\n\nIn the past I've worked customer service type jobs. I always tried to be pleasant and polite but to be honest, people were often just rude, unfriendly and sometimes just downright obnoxious.\nI used to be addicted to porn and masturbating, but I've got over that now. However, I have not had a proper connection with a woman for some time. Even if there is some initial attraction, after a while I can sense that the woman is not interested. Sometimes I feel like it's because I'm real and authentic and not some egotistical 'lad' or whatever. It's getting to the point where I feel like I'll never get a girlfriend.\n\nThe thing is, I know my situation needs to change. I'm not really happy and I feel unhealthy. I just have a lot of issues. I'm sorry about the rant and I know this is kinda all over the place.\n\nAny advice you guys can give me would be a great help.\n\nThanks", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/6ba27k/not_sure_what_to_do_i_need_help/", "title": "Not sure what to do. I need help.", "social_network": "reddit", "user": "Designed987", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1494851037, "permalink": "/r/DecidingToBeBetter/comments/6ba27k/not_sure_what_to_do_i_need_help/", "nsfw": false, "first_save": 1635437721.5162706, "replies_charged": false}