{"id": "t5_2tand_t3_8nk4j1", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Lately I've been really struggling to be present and pay attention. It's happened over the past few years, but I can no longer read books or watch movies. I just can't focus long enough. I forget things all the time. If there is an object that I need to bring somewhere I will forget it. It's not just the occasional walking into a room and forgetting why you are there, I do that every day. If I need to remember to grab my camera, or some paperwork before leaving the house I will invariably forget it. a few days ago my gf asked me to change the laundry over when it's done washing, then she reminded me 3 times. I had forgot by the time she reminded me each time, I finally decided to set an alarm for myself in 15 minutes so I would do it.\n\nAs of recent, I basically cannot hold a conversation. I forget words all the time. Last night I was at a friends house and I would just trail off and do the whole \"umm, uh, what is that thing, oh yeah \\_\\_\\_\\_\\_\\_\\_\\_\\_.\" I actually was hoping I would give an example but quite frankly I cannot remember any.\n\nI live by a calendar for work, with reminders set all the time so I won't forget things. I can't pay attention at all, it takes me an hour to write an email. I'll end up staring at the screen or get distracted with a call or a text. I'm privileged to have a sales job where I work alone with a boss that mostly leaves me alone. This has not impeded my work enough to cause issue at work, but I feel strongly I've missed opportunities due it it, included losing the contact info for a client that would have netted me a couple grand.\n\nHow do I get out of this this slump?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8nk4j1/cant_seem_to_get_in_focus/", "title": "Can't seem to get in focus", "social_network": "reddit", "user": "ObviousShape", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1527786422, "permalink": "/r/DecidingToBeBetter/comments/8nk4j1/cant_seem_to_get_in_focus/", "nsfw": false, "first_save": 1635437871.1323984, "replies_charged": false}