{"id": "t5_2tand_t3_kwey5a", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "883794f3-030f-4844-8950-6e28281dfa3f", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "In May 2018 I felt so sick for 2 days that I decided to go to hospital for a check up. I couldn't walk up straight due to abdominal pain and decided to go to the hospital to get it checked out. \n\nThe doctor sent me home after taking bloods and told me to monitor the pain. The next morning at 7am we received a call from the hospital telling me to come in as soon as possible due to my kidneys not functioning properly. They did tests and turns out I had a colitis (severe inflammation in the colon).\n\nI was rushed to ICU as the pain was getting worse, I had reactions to the medication and eventually they ended up using as they call \"Rolls Royce Medication\" which is the best of the best. \n\nThankfully that slowly started helping and without explaining the whole after process of operations to remove fluid buildup etc. I ended up leaving the hospital after 1 week and 5 days. \n\n(Fun fact. I entered weighing 85kg and left at 72kg).\n\nI avoided soda as recommended by a gut doctor specialising in the gut microbiome. Recovery was 6 months to get rid of those abdominal spasms.\n\nI then started to drink soda again for about a month before the spasms started coming back. I got so fearful of going through the process again that I gave up soda completely and now I am 2+ plus years strong of just drinking water with the very rare beer every blue moon. \n\nWhat I Learnt:\n\n1. **Fear is a great motivator**. Apparently we are more motivated by the fear of loss than the promise of gain.\n2. **It's all in the identity**. You don't have to consider yourself a health nut that avoids all junk but for a time in the beginning I was. I had to be. I only ate gluten free. I drank apple cider vinegar at night with part water to aid digestion. I ate chia seeds as they are a super food that helps digestion. I avoided FODMAP foods that promote internal bloating. I drank water either 30 minutes before or after meals because drinking during meals actually dilutes the enzymes in your stomach that help break down your food! (If you read this part, I hope you learnt something) Anyway.. The identity was that I was healthy and not someone that eats junk? Why? Because I was applying all the above. It's hard not to consider yourself healthy when you are putting in the work/action. That has an inverse effect. If you are doing things that are unproductive then It's only natural that you won't think of yourself as a productive or efficient person. It starts with changing the identity and slowly the actions in order to build momentum to your desired destination/goal.\n3. **It's doable in a shorter amount of time than you think.** If you stay consistent for at least 2 weeks, it becomes incredibly easy to keep going. Even with a setback thats no problem. You now know you can do 2 weeks easily and your next step is continuing past that. It's the same with pornography, if you watch it and do the deed once then the next few days it will be hard to resist but If you make it past a week, 2 weeks, it becomes much easier to resist. The next step is to have a great enough motivating force to be your voice of reason in times of temptation. Eg: When someone offered me a soda I would say no thank you I don't drink that. I dare you to say that 5 times consistently. From then on it will be an automatic response and voila! A new habit/lifestyle choice has been nurtured to fruition.\n4. **Location and familiarity** is another great way at stopping negative habits that occur routinely. If you go away for a week somewhere unfamiliar without your usual routine, it takes much less mental thinking to avoid those negative desires. Eg: If you are in an environment where soda/ pc gaming etc. isn't as readily available. // Note :This is just a small tip that helps the larger goal. Your goal isn't to break a bad habit. Your goal is to make a healthy new identity change. You are changing an identity remember and your old pattern or guilty pleasure no longer serves your new identity as someone who is \"healthy\" etc. \n5. Last but not least, **it helps to hate**. Now soda isn't bad. Lol. Ok but seriously. Be objectively hateful. Like know that you obviously don't hate soda, but you hate the way it makes you feel, you hate the reaction it has on your skin (note that these are specific reasons) the main hate is that it negatively impacts your health, joy and well being. Soda is literally poison for your gut and is a kick to the gut. Every time you experience the delightful sensation of bubbles your body experiences poisoning. Your body is strong and it can take the blow without you noticing but if you drink more then you should or have some other negative consumption habit, your body will eventually start becoming less and less effective at recovering. I don't expect you all to be as committed as myself or have as big a streak as me off the bat because then again these things take time and I've gone through agonising pain to slap me on the right track (arguably this is the right track for my body at this moment in time and not yours, but then again I think implementing healthy habits that love your body rather than hate it is better done sooner rather than later).\n\nHopefully this post helps someone and note that this can be applied to bust almost any negative desire as well as reconstructed to build good habitual identities.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kwey5a/2_years_since_ive_had_soda_and_what_ive_learned/", "title": "2+ Years since I've had soda and what I've learned in the process", "social_network": "reddit", "user": "Karma_Kazze", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 35, "down_vote": 0, "creation": 1610538803, "permalink": "/r/DecidingToBeBetter/comments/kwey5a/2_years_since_ive_had_soda_and_what_ive_learned/", "nsfw": false, "first_save": 1635436201.6570992, "replies_charged": false}