{"id": "t5_2tand_t3_oeahli", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Hey guys.\n\nSo here goes a month without me playing any video games. I realize that it might not sound as serious as some other posts in this subreddit but it I used to play for 10 - 14 hours a day during recent years. I'm struggling with depression and anxiety and games were a huge shelter for me. After every social situation, stressful day, etc. I would just immerse myself in gaming and well... escape  \n\n\nIt's tough for me because I love games. Always did, even before it became such an unhealthy mechanism of mine. Sadly I cannot trust myself to try and play them responsibly, not for a long time, maybe never.\n\nI had breaks from games but usually it involved me going on vacation, changing places etc. Then I didn't feel the need for games and I was telling myself that I don't really have a problem because I'm not missing them at the moment - but as soon as I got home again, to my normal habitat, I was back at it again.\n\nSo this is the first time when I don't play video games while being at the place where I used to do nothing but it. It's tough because my brain is trying to find any excuse to say that \"I deserve some off time, something to relax, come on, just for an hour or 2\". After a stressful day, to unwind, or a productive day, as a reward. It's a battle.\n\n&#x200B;\n\nOn a bright side, I'm more productive than ever when I'm at home. I'm trying out new hobbies and started working on projects that I was thinking about for years. I started exercising and I'm working on new habits to replace that old black hole. \n\nI like these changes a lot and it was long time overdue anyway.\n\nIt's just hard at times, today was a particularly hard day and I just wanted to share.\n\nHope everyone's doing well, see Ya guys", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oeahli/a_month_without_video_games/", "title": "A month without video games", "social_network": "reddit", "user": "Czekierap", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1625501275, "permalink": "/r/DecidingToBeBetter/comments/oeahli/a_month_without_video_games/", "nsfw": false, "first_save": 1635438046.564549, "replies_charged": false}