{"id": "t5_2tand_t3_koe66k", "request": ["7fde63f7-407d-4821-90f0-161dfc11df39"], "text": "I don’t like to brag but I’m so proud of myself right now. I’ve been in toxic living situations my entire life and I finally decided I just needed to take the plunge and go to school. My father said i was going to end up a pregnant drug addicted teenage runaway, but uhhh I don’t think so buddy! I’m only 21 so I’m young, but I dropped out of high school at 17 due to family issues and had to get my GED. I didn’t think it was going to happen. Of course covid turned my on campus classes into online classes , which was easier in a way but also harder.... anyway even though I managed to get myself into ANOTHER dysfunctional living situation with a boyfriend, and being under an ENORMOUS amount of stress every day, I got a 4.0 for my first semester. I almost dropped out a couple times because I just could not do it anymore but I always managed to get my work done even if it was a week’s worth of work in one day. And I was working full time for most of the semester! Now I’m in a healthy environment and I’m ready to continue the year and pursue my degree and I’m just so happy. I also started my workout plan today and I’m taking care of my health, I got back on antidepressants... let’s go, 2021!\n\nMandatory edit: thank you everybody for your love and support, it means the world to me and thank you to the person who gave me awards:”) I’m filled with appreciation for you all.\n\n2 hugz too? So sweet.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/koe66k/i_got_a_40_gpa_after_almost_dropping_out/", "title": "I got a 4.0 gpa after almost dropping out!", "social_network": "reddit", "user": "doobster0000", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1550, "down_vote": 0, "creation": 1609518961, "permalink": "/r/DecidingToBeBetter/comments/koe66k/i_got_a_40_gpa_after_almost_dropping_out/", "nsfw": false, "first_save": 1635438079.0301206, "replies_charged": false}