{"id": "t5_2tand_t3_q8xhk5", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "c67213dc-0eed-4cac-a781-9bc082742908", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "I'm 20 and for most of my life I have been lying to myself and to others about my well-being, my academics, and my general life. Starting now, I will not let this affect me.\n\nI will do my own work. In academics, I have always tried to find the easy way out. I procrastinate on my work I watch a whole bunch of youtube (hours and hours on end), then I cut corners by copying my work from others and learn nothing as a result.\n\nI will submit all of my assignments. I will make sure that all of my assignments are submitted AND they are submitted before the due date, and I will go to office hours and seek help, even if I do not need it at that time. If I can submit the assignment more than a day in advance? Even better because to hell with procrastination.\n\nI will go the gym more consistently. I have been lying to myself forever about getting up in the morning and going to the gym. When I do its fantastic and I feel amazing, but when I don't I lie to myself and say that I will do better tomorrow (which is most days, and I don't go the gym the next day by the way). This lying to myself has made me lose all of my gains, but this will no longer affect me.\n\nI will be social. Spending time in my room is only when I have to sleep. Otherwise I will be outside and walking about and spending more time with others rather than staying hunkered down in my room. When I am not social, I feel terrible, and I feel lonely (obviously). I do not want to feel this way anymore!\n\nAt the end of each day, I will journal how my day went. These are a lot of big changes, but by finally stating my goals to anyone other than myself, I feel like I am held accountable for my actions. If I can make at least one of these changes happen, I know that I will be happier. In one month, I will give you all a progress report, because I know that whenever I do these tasks, I feel happier and much better about myself. But since the beginning of this year, I have fallen into this terrible rut that I've always wanted to change but always procrastinated on making that change. I would lie to myself and push things off for later. But I won't anymore!\n\nAny advice?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q8xhk5/making_positive_changes_to_my_life_starting_right/", "title": "Making Positive Changes to My Life Starting Right Now", "social_network": "reddit", "user": "emperor_02", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1634331922, "permalink": "/r/DecidingToBeBetter/comments/q8xhk5/making_positive_changes_to_my_life_starting_right/", "nsfw": false, "first_save": 1635435075.1385984, "replies_charged": false}