{"id": "t5_2tand_t3_ly7u95", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "1a213df6-3f71-466c-9762-ace119e0102e"], "text": "TW: eating disorders.\n\nThe photo was from about 4 years ago, when I was in uni. I was overcoming an eating disorder at the time. I was obsessed with eating healthy and exercising. I went to the gym and my body looked, by society's standards, half decent. On the outside, I looked like I had it all together.\n\nHowever, my calorie counting and gym obsession was an escape and distraction from the crap relationship that I was in, the lack of friends I had at uni, and being generally unhappy with life. I threw myself into schoolwork as well as a way to cope. Essentially, I was just surviving.\n\nFast forward to now. That relationship is long gone. My ex was emotionally abusive and cheated on me. No loss there. I am now with someone who treats me like I deserve, who wants to do fun things in life, and who encourages me and motivates me every step of the way. I suppose it took a learning curve of being treated like shit for me to learn my true worth, unfortunately.\n\nI graduated from uni with the highest degree classification. I worked odd jobs for a few years but then I decided to stop putting it off and start training to a teacher.\n\nI have been offered my dream teaching job this week and it is the biggest accomplishment of my life so far. I feel like I have really found myself with teaching, as cheesy as that sounds!\n\nAnd then, my body. I am in such a healthy mindset with my body. Yes, I have put weight on. Not loads, nothing drastic, but I have. This can be heartbreaking for a 20- something girl. Instead, I realise that not obsessing over your body, but rather focusing on what nourishes your soul and your mind is so, so important. I know that I can lose weight if I put my mind to it. But right now, I'm busy with my studies, and I have nurtured old hobbies like reading and journalling. My body has gotten me through all of these years. Just because I don't eat carrot sticks for breakfast now does not mean it is going to fail me.\n\nI'm not advocating that gaining weight or not caring about your body will make you happy. But not obsessing over it, not waking up thinking 'How many calories will I eat today?', knowing that I can have a glass of wine or a chocolate bar and not feel guilty. That is living.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ly7u95/i_have_just_seen_an_old_photo_of_me_from_a_few/", "title": "I have just seen an old photo of me from a few years ago where I was slimmer than I am now. Yet I am SO much happier now than I was then. I have just been offered my dream job, I'm in a loving relationship, and I feel fulfilled in my life. Losing weight does not equal happiness. It really doesn't.", "social_network": "reddit", "user": "lizardqueen123", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 116, "down_vote": 0, "creation": 1614934586, "permalink": "/r/DecidingToBeBetter/comments/ly7u95/i_have_just_seen_an_old_photo_of_me_from_a_few/", "nsfw": false, "first_save": 1635436693.1321084, "replies_charged": false}