{"id": "t5_2tand_t3_lb17qy", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Hello kind strangers. I had a few weight gain and weight loss cycles. Went from 105kg to 75kg , then from 75- 90 , then from 90-80kg. I was constantly on diets and as soon as I stop sticking to them I start gaining weight. I am physically active with my delivery job , occasional workout and my dancing classes.\n\nThis time I decided to take a different approach to my situation. Reading about habit change and \" Atomic Habits\" by James Clear and I decided to try and go slowly. With workouts and eating. So I managed to build a working out habit, currently I am doing basic home workouts , building good habits and building muscle. But the main problem is eating. I took my calorie count and macro count and I still havent put together a menu of some sort. But I am trying to eat less , because I am currently 93kg and I do a hard delivery job working from very early morning till afternoon. And weight is beginning to be a dangerous problem to me, because some mornings when I wake up I have sooo hard lower back pain that I cant straighten up. I am 23 years old and I am a man.\n\nI am aware that many people have the same problem. I am going to fight and I am going to change my diet so that I can look and feel better and get stronger and become more capable man.\n\nI want to be a father , and I want a lot of kids ( like 10 of them )  ,and I need to be there for them. For that I need to be as strong as I can. So I have my goal I have the means I just need to break the bad habit.If you have some advice or simply want to cheer on a complete stranger just know that I appreciate your comments and good will.  \n\n\nEDIT: Thank you for my first reddit award !", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lb17qy/i_will_succeed_with_changing_my_diet_for_good/", "title": "I will succeed with changing my diet for good this time :D", "social_network": "reddit", "user": "EmploisMuswashans", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 26, "down_vote": 0, "creation": 1612286927, "permalink": "/r/DecidingToBeBetter/comments/lb17qy/i_will_succeed_with_changing_my_diet_for_good/", "nsfw": false, "first_save": 1635435891.6165936, "replies_charged": false}