{"id": "t5_2tand_t3_d1ktic", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7", "9065d046-0977-4ea5-b8e4-e37cd42605ed", "311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "&#x200B;\n\nGrant Cardone “100 Ways to Stay Motivated”\n\nSection 1 Potential\n\n1. Work to your potential not your quota.\n\nNo one can tell you what your capable of. Quotas are just numbers based off by other people's expectations. \n\nP1. Write down what your potential is and compare it to a current “quota” in your life.\n\n2.Shoot for Extraordinary\n\nOrdinary means average. Extra means above. Make other people jealous or amazed at what you do. Shooting for extraordinary because it keeps you motivated and driven.\n\n2P. Write down five extraordinary people in business or life. Determine qualities or actions they implemented in their lives to become EXTRAordinary. Use this list of people to keep you excited,motivated, and driven to be extraordinary.\n\n3.Go the Extra Mile Even After You Have Satisfied Basic Requirements.\n\nAdd a little ten percent to everything. If you have a job or task it doesn’t hurt to put some more effort.\n\nIt creates discipline and increased belief in self. If I can’t do it for myself, I can’t do it for others.\n\n3P.The two questions I ask myself when I go the extra mile is \n\n4.Do What Others Refuse To Do \n\nOpportunities lie in the place where people refuse to go. If everything was pleasant there would alot less average people. So if you want to excel do the things people refuse to do.\n\nIt makes you motivated and inspired. While keeping competition intimidated.\n\n4P.Make a list of what others around you are unwilling to do. Choose three actions and do them today. What happened?\n\n5.Be Willing To Fail Knowing Failure Is Impossible \n\nFailure is impossible. The only way you can fail is if you quit.Rework what you think about failure. If you persevere through the game then you really can’t fail.\n\n6.Be The Most Reliable Person You Can Be\n\nYour word is you bond and so is your dependability\n\n6P.Write a list of three ways you can be dependable and implement them today. What Happened?\n\n7.Let People Know that your unique by your actions\n\nDon’t be like everyone else. Do little things that make you unique. You will motivate yourself when you think of ways to be unique.\n\n7P.Write down five actions you can take that are unique to you and would differentiate you from others in your personal and professional space.\n\n8.Get challenged. Do something that challenges or pushes you. When you are pushed you will feel anxiety, but it will motivate you. Conquer your challenges and it's a win win situation. If you win you get motivated, but if you lose it gets out of the way. \n\n8P.Make a list of five things that would most challenge you and do at least one today. How do you feel afterwards?\n\n9.Give people more to the point where they are guilty. Give of yourself it doesn’t mean money or product wise for instance with time and knowledge. Give enthusiasm or ideas or just you in general and you will be rewarded\n\n9P.Make a list of three simple ways you can give more than is expected of you. Do those three things you wrote down.What happened?\n\nSection 2 personal development\n\n10.Get In a Mastermind Group\n\nSurround yourself with winners. Your condition is very similar to who you hang around. People can tell a lot by who you hang around.You don’t need buddies you need winners.Always reach out and make new winners.\n\n10P.Make a list of your five closest friends and write what you have in common with them. Are all of these similarities optimal? Now find a mastermind group of winners in your field of interest or\n\nbusiness and join it.\n\n11. Read a Book a Week\n\nIf you want to stay motivated always read.1 book a week 52 books a year.The average american reads 1 book a year. They don’t even needed to be finished. If you want to be motivated to read a book. Look for 1 to 3 things to learn, after you get the gold nuggets of knowledge from the book you can go to the next book. 52 to 1 lead.\n\n11P.Chose eight books that are beneficial to your growth in life or profession and list the book titles and authors. Choose one and read it this week.\n\n12. Cut Out Negative People\n\nNegative People attract negativity. I don’t really have people in my life that bring negativity yet. \n\n12P.Make a list of all the people you are frequently in contact with in your life and determine if they are positive or negative. What occurs when you are in contact with the negative people?\n\n13.Stay uncomfortable and meet new people\n\nBe the first to socialize. Forget context because your moving through the discomfort. It’s for your personal sense of self.\n\n13P.In a group of people, or just out in public, introduce yourself to three people you are uncomfortable or tentative to approach. What occurred?\n\n14.Do things your fearful of.\n\nHumans are scared of things. The more things you can overcome the more motivated, determined, and reliable you will be. Courage is an action.Bad and fear are two different things don’t mix them up.(Don’t do anything illegal pls :).T.K) Motivation is something you can pick up the only person who can refill it is you.\n\n14P. Make a list of five things you are fearful of doing. Knock one of these things off your list today! How did you feel afterwards?\n\n15.Surround yourself with positive reminders\n\nControl your environment.Think about the future and use it as motivation to surround yourself with positive messages like dreams and goals that's how you stay positive.\n\n15P.Control your environment. Chose a positive reminder to represent each: your goals, dreams, and current life. The reminder can be photos, signs, pictures, objects, etc. Name each reminder and explain the meaning behind that particular positive reminder.\n\n16.Reach up for new friends\n\nIt’s easy to get friends it’s harder to get dependable friends and supporters. Get classier friends. Reach for people outside of your social standard. (Don’t try to be someone your not make friends no matter their social standard that accept you for you.-T.K)\n\n16P. Write down things you can do, places you can go, etc. where you can reach up for new friends. Choose a couple of these actions and do them.\n\n17. Ask those more successful than you for guidance.( This is kind of self-explanatory, but remember successful doesn’t mean just monetarily, but rather based on your definition of success-T.K) \n\n17P.Identify two people more successful than you that you can go to for guidance and advice. Arrange to meet or speak to them for guidance.\n\n18.Make continued and regular investments in yourself.\n\nMake investment in yourself it’s the only guaranteed return. 1 in 1 million understand inflation. The best way to fight inflation is investing in yourself. Once a year is not regular or continued. Look at new techniques and strategies year round.\n\n18P.Make a list of three ways you can continually invest in yourself. Commit to making one of these ways a continued and regular investment in yourself.\n\n19.Go to workshops and learn and connect\n\nStay motivated even on your time off. Always stay improving. Bill Gates reads 13-14 books during a 3 week vacation period with his wife.Go to 3 or 4 workshops a year.\n\n19P.Make a list of three workshops that would be ideal for you to learn and connect at. List the names and purpose of the workshops. Chose one to enroll in today.\n\n20.Avoid those who don’t assume responsibility for every outcome \n\nIf they can’t see the light of day don’t try to make them see it.There are 7 billion people on this earth and you're looking for the right one.Every deal you make is not a good deal.Every client you have is not a good one.You will have to make the decision to get rid of something to make room.\n\n20P.Write a list of people in your life that don’t assume responsibility for every outcome. What is your decision regarding responsibility?\n\n21.Seek to be exceptional in every aspect of your life.\n\nPeople who are looking for balance are not motivated. Always look for the best and it will come. Be greedy because that’s the difference between successful and average people.\n\n21P.Write down exactly what it would mean for you to be exceptional in every area of your life.\n\n22.Look to Control Time Rather than Manage It\n\nYou would want to time and condense as much as you can.I want to eat minutes.\n\nYou don’t want to manage the traffic you want to control.\n\n22P. Start thinking with the mind frame of controlling time not managing time. What are three ways you can CONTROL time rather than MANAGE it?\n\n23.Schedule Your Day in 15-Minute Blocks\n\nDo what you want, do as much as you want. Focus on the activity not the time management part.Schedule your day in 15 minute blocks\n\nDon’t don’t think of time as hours, but look at as 15 minute blocks to reduce wasted time. Eat little pieces of the pie for motivation, it helps you stay focused. Do it every moment like the gym or at events. \n\nPRACTICAL: Make a schedule for your day cramming as much as you can into 15-minute blocks then adhere to it for one day. What happened?\n\n24.Make Quality Time for Your Family Everyday\n\nTake moments to figure out how you want to spend quality time with someone. Don’t take pieces or bits when you can figure out the whole thing. You can have money, but not have a quality life at home.If I can make time for relatives or the commitment to family then what's stopping that from happening to my clients or myself even.\n\nPRACTICAL: Evaluate your daily schedule and block off quality time to spend with each member of your family each day. Note schedule changes below\n\n25.Keep Statistics on Everything Important\n\nEverything that can generate value should be monitored and you should keep it’s stats for example in graphs or whatever your choosing.\n\nKeeping stats keeps you logic and unemotional. Mystery is not a good thing.\n\nPRACTICAL: Make a list of everything that is important to your success. Keep a statistical graph on all of the above for a week. What happened?\n\n26.Keep a Full Calendar\n\nIf you want to stay motivated make sure your always have something your calendar.  Say yes to everything possible to make sure your calendar is full.\n\nPRACTICAL: Slam your calendar for the next seven days from every hour-to-hour and day-to-day including weekends and non-business hours. Note one day’s schedule below.\n\n27.Go to Bed Early\n\nGo to sleep earlier. At 9 to 10 o ‘clock. If you can control when you go to sleep then you will have better mornings. If you stay up at night it often leads to misfortune.The longer you stay up the more you burn up. It will never lead to positive effects.Go bed an hour earlier on monday. Go to sleep at 9 o’clock\n\nPRACTICAL: Tonight – control the time. Go to bed an hour earlier than you usually do. Write what you noticed about your production and energy compared to the previous day.\n\n28.Be The First One Up in Your Neighborhood\n\nIf you go to sleep at 9 then by 12 you have 3 hours of sleep by 4 you have 7 hours now you have 2-3 hour head start compared to the average human. By the time someone has their cup of coffee you have already finished your daily routine.Your motivation will be unbelievable.\n\nPRACTICAL: Tomorrow set your alarm one hour earlier than usual and force yourself out of bed. Note how much more you got done. What advantage did this give you?\n\n29.Stay So Busy You Are Running Everywhere You Go\n\nStay so busy you are running everywhere .Having too much in between events are killing you.\n\nWhen you are winning why take a break that's stupid why not continue while you are hot.Use and keep that energy from the last win.If you want to meet the devil do nothing.Not being busy is a bad thing you lose inspiration and focus.\n\nPRACTICAL: Why is it you won’t burn out running from event to event, but you will burn out when you do nothing? Give an example.\n\n30.Schedule Short Breaks\n\nTake 45 second breaks. Watch the 45 seconds go away. Watch it’s motivation help you.I can take a break 45 second break between every 2 classes and one last break when studying.\n\nPRACTICAL: Schedule four short breaks today. Write what the breaks did for you.\n\n31.Get Things Done Long Before Required of You\n\nDon’t wait till the deadline. If you wait the deadline then your not accomplishing much. You can always produce just make sure your getting it done because your always have the time to fix it.\n\nPRACTICAL: List five ways you can change your personal habits to become better at getting things done before they are required. Get something done much earlier than expected today. What occurred when you did this?\n\n32.Break Your Life into Priorities and Win at All of Them\n\nBreak your life into Priorities in your life and win at all of them.Make sectors of your life like physical, spiritual, and financial After that's done win at all of them\n\nPRACTICAL: Write down ten priorities in your life. Then, going down the list, mark them on a scale of 1-10 based on how well you are doing with them. The number 10 meaning you are a champion at a life priority, and the number 1 meaning you are not doing too well at a life priority. Then make a commitment to the lower rated priorities that you will become a champion at those specific life priorities.\n\n33.Write a Daily Battle Plan\n\nWrite a daily to do list. It allows you to be motivated and prepared. It allows you to prosper and think of it as a battle.\n\nPRACTICAL: Write a battle plan for today then complete all the tasks you have laid out. How do you feel after completing the battle plan?\n\nSection 4 Self Esteem\n\n34.Be Honest with Everyone Especially Yourself\n\nIf your honest with everyone be honest with yourself.Get completely honest with yourself and your potential and capability. If your not real with yourself, you won’t be able to achieve as much as you want.\n\nPRACTICAL: Be honest with yourself and write the answers to the following questions: a. What is your potential? b. How much can you do in one week? c. In one day? d. In one hour? e. In 15 minutes? f. What do you need to do to provide for yourself and your family?\n\n35.Stay Involved with Your Community—Be Social\n\nYou need attention, people need to know you\n\nYou need to do something great not good\n\nYou need to meet strangers be involved in the community it never hurts to know and talk to everybody.\n\nBe more friendly at school\n\nBe involved in more events\n\nBe more active outside of school\n\nPRACTICAL: Write down three ways you could become more involved with your community. Choose one and do it this week.\n\n36.Be the Most Professionally Dressed Person in Your Space\n\nMotivation is an inside job. The clothes you put on your back will make you feel better and have people place good expectations on you.\n\nPRACTICAL: Go to your closet and put together at least three professional outfits. Why is it that being dressed professionally is important not only to others, but also to you?\n\n37.Take Enough Time Off to Fulfill Your Desire For Time Off\n\nIf you need time off then take enough time off to stop taking time off. Go off long enough that your sick of it. The most successful people don’t take time off. (T-K you should view work as something you enjoy, find a job you don’t want to take time off from.)\n\nPRACTICAL: Write down what would be enough time to fulfill your desire for time off and why that would be enough time.\n\n38.Get Out of the House and Try New Things\n\nGet out of the comfortable and try something new.Get out of the house there's nothing beneficial for you being stuck in your house. You need new material not just the same repetition.\n\nPRACTICAL: This week get out of the house and try something new. Write down what happened.\n\n39.Drama TV and Radio\n\nAvoid things that grab your attention from something fictional. Your being influenced by TV and Radio. They aren’t reporting news they are making opinions for you to make you think a certain way.\n\nPRACTICAL: For two days avoid drama TV and radio. Did you feel more or less productive?\n\n40.Have Rewards for Accomplishments That Compliment Your Potential\n\nDon’t reward activity below your potential.Reward yourself for accomplishing things up to your potential. Make it big rewards for big actions that are congruent to your potential. Tie rewards, with achievement and see how much motivation you get.\n\nPRACTICAL: Define the words potential and accomplishment. Make a list of five rewards for accomplishments that are congruent with your actual potential.\n\n41. Cut Out All Behavior That Lowers Your Self-Esteem\n\nCut out everything that doesn’t make you feel good about yourself cut it out. Quit doing the stuff that makes you feel bad. It’s not a moral conversation. To determine if something is lowering your self esteem see if makes you feel bad afterwards.\n\nPRACTICAL: Make a list of all behaviors that lower your self-esteem. For three days cease all of the behaviors you listed. What happened when you did this?\n\n42. Everyday Look for Opportunities to Help Others\n\nHelping someone can be something as small as saying hi or feeding someone.Can you make someone feel good or make them better.If you can help someone then it motivates you. Solving other people's problems, may provide a perspective that can help you solve yours.\n\nPRACTICAL: Do exactly what Grant says, “Look today to help someone else out.” Whenever an opportunity arises today, help someone. Write down what you experienced.\n\n43. Stay in the BEST Hotels\n\nMoney is not your problem. It’s your connection so if you want the best opportunities you have to be near the best.\n\nPRACTICAL: Why does Grant say to stay in the best hotels?\n\n44.Fly First Class\n\nIf the plane is going to run into a building. Go all the way. If you want to do something go all the way. Treat yourself the way you want. Create a life that allows you to live first class. If you sitting somewhere get the best seat or don’t go. Use lower class as motivation.\n\nPRACTICAL: Explain why Grant states to fly first class and the advantages of doing so.\n\n45.Overcommit to Your Family, Clients and Community\n\nUnder Commit and overdeliver is not enough. When you overcommit it makes you motivate and allows your creative juices to come too. When your absolutely pushed when it comes it allows you to excel. When you overcommit see how well you do.\n\nPRACTICAL: Write at least six ways you can overcommit AND overdeliver to your family and clients.\n\n46.Be the Most Positive Person You Know\n\nThis one is kind of self explanatory in nature, but see how much more motivated you are and the people are you are, when your positive.It makes a big difference.\n\nToday, be the most positive person in your environment. What Happened? How did people react to you?\n\n47. Avoid Ads that treat depression as a disease \n\nYou are being made to think there’s problem with you. Just accept that your human. Not all your problems is a diseases. \n\nPRACTICAL:Practice this today: Avoid ads that promote depression and disease. What did you notice?\n\nSection 5: Stay Energized \n\n48.Exercise a Little Everyday\n\nIf you exercise a little everyday it’s gonna make you in control of your body which will motivate you.Exercise is never bad for anyone. The hardest part of exercise is getting started.Most people are motivated because they are consistent \n\nPRACTICAL:Get in charge of your body! Exercise for 30 minutes today. Formulate and commit to an exercise schedule. Note schedule below and track completed exercises.\n\n49.Eat the Healthiest Foods You Can Afford\n\nThe fuel you put in your body controls what you think and feel. It has apart of how you do. Carry as little weight as possible. Heavy foods rob you of energy.\n\nPRACTICAL: Write a list of unhealthy food that you eat. Eliminate one of them from your diet today. What was your energy level like after you eliminated that food?\n\n50.Avoid Foods with Sugars\n\nJust because you love something doesn’t mean it is good for you. One is never enough it causes more problems because it causes a crash. It hurts your focus.\n\nPRACTICAL: Sugars in your body effects what aspects? For one day, avoid all foods with sugar. Write down the result.\n\n51.Increase Your Water Intake\n\nWater is good for you. The more hydrated you are the more motivated you are.\n\nPRACTICAL: How much water do you consume every day? Today, drink two 8 oz. glasses more than you usually do. What happened?\n\n52.Be Energetic Even When You Don’t Feel It\n\nFake it till you make. Practice it because it’s like a muscle. Quit using excuses. Motivation is about motivating yourself to energize.\n\nPRACTICAL: Grant compares being energetic, excited, and enthusiastic to being like a \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_. Take an opportunity at some point today to take action or get involved, even if you “aren’t feeling it” or “are lagging.” What happened?\n\n53.Take Power Naps if They Help You\n\nTake a quick 20-30 minute. A nap does not mean tuck in. Power naps don’t mean get getting comfortable it meant to recharge.\n\nTake a power nap today. How did it help you?\n\n54.Write Down the Successes You Are Having\n\nWrite down where your improving, where are you winning, where are things getting better. Communicate because it causes motivation\n\nPRACTICAL: Write down the successes you are having in your life right now.\n\n55.Listen to Music That Pumps You Up\n\nLast 10% of your drive to listen to music and listen to something that pumps you up. Get some technical content, then get some jack up music.\n\nPRACTICAL: Ten minutes before work, listen to some of your favorite music. What effect did this create on you?\n\nPRACTICAL: Ten minutes before work, listen to some of your favorite music. What effect did this create on you?\n\n56.Say YES to Life\n\nSay yes to everyone. Say yes to life & opportunity.Once you say yes everything to everything it makes you motivated,Don’t say yes to bad things(T-K:Like drugs:)...)I was aiming for a winking face, but that’s not really working)\n\nPRACTICAL:Say yes to anything that expands life. Write down at least three things (ethical and pro survival) that you have been saying “No” to and just say “Yes.” What happened once you started doing this?\n\n57.Move with Speed and Urgency\n\nMove with hunger. You want to operate with the motivation. When you get urgency people get brighter and more creative unleashing your potential.\n\nPRACTICAL: Write down three ways you can start operating with speed and urgency in your life through emails, communicating with people, completing activities, etc.\n\n58.Stay Hungry and Act Hungry with Everyone You Meet\n\nYou want them to know you are hungry. Don’t suppress desire. It decreases motivation. Move against the grain. Let everyone know your different.\n\nPRACTICAL: Act hungry with one person you meet today. What occurred?\n\nSection 6:Purpose\n\n59.Approach Success as Your Duty\n\nSuccess should not be an option. Connect success and obligation. Make success something that you have to do not something you get lucky with.Success is something fulfilling. Being successful is a duty.\n\nPRACTICAL: Make a list of at least five things you have to be successful in. (Business, personal, etc.) Why is it not an option, but a duty you are successful in these areas?\n\n60.Approach Success as an Ethical Issue Not a Financial One\n\nSuccess is a moral code. Don’t think about success and money basically, think about it more like I’m successful and have money and doing the right things with said money.It’s not ethical to be not successful and not have money. Tie your success to your ethics and moral.(T-K-He is using a different definition of Ethics)\n\nPRACTICAL: Write a short essay on how being successful ties in with your personal moral code. After seeing how being successful ties in with your ethics, how do you feel about going after your target goals?\n\n61.Be the Most Ethical Person You Know\n\nYou being an example. It doesn’t mean being honest or spiritual. Real ethics mean producing results. How are you going to be honest with others, but not with yourself. Ethics mean completing the job. How are you going to be honest, but you can’t complete the job or be reliable.Being reliable is correspond to being ethical.Your honest and you do whatever it takes to get the job done and you do fair and square.\n\nPRACTICAL: List four ways, besides being honest, you can become the most ethical person you know. Write how you can implement this in your life.\n\n62.Have a Higher Purpose than Just Money\n\nThere’s nothing wrong with being motivated by money, but you need a higher purpose than that.\n\nWhat is the thing you want money for?\n\nIs it for a big house or car then\n\nWhat do you want said object?\n\nDrill down and look for the purpose\n\nDon’t get lost in the numbers, look for the higher purpose.\n\nWhat is it that you want, when you say you want money. It’s going to make you motivated\n\nWhatever goal you have you are underestimating your potential. If you have a goal beyond money then you will achieve more.\n\nPRACTICAL: Take a couple of minutes to reflect on what your purpose is. What do you want money for? Write down your answer.\n\n63.Never Settle for Good When You Can Be Great\n\nQuit settling for good, when you have greatness. How can you have a great life not a good life. Just because your striving for greatness doesn’t mean you have to do it in one day or that one instance.\n\nPRACTICAL: Write an example of something you strive to be great at. How did you do? Write down a time when you know you settled for less than your potential. What decisions have you made with regard to this?\n\nWhen you settle for good you will get results below good and underestimate yourself, but when you set great as the goal then will get more good results and reach your potential more easily. \n\nDissatisfaction is a motivator. If your gonna do something do you want to have good or great.\n\n64.Get Great Partners\n\nEveryone in your social status needs to be great. They have to bring the idea of greatness. You want your partner to always be aiming for the next level. Great people achieve more together.\n\nPRACTICAL: Make a list of five qualities that would be necessary in great partners in any aspect of life.\n\n65.Be Deaf When Someone Says You Can’t\n\nGreat people are able to have selective hearing. Be deaf when people says it's impossible.\n\nDon’t let others impose their limits on you.People not trying to not purposely hurt is worse, because their disbelief hurts more than random strangers.\n\n21. PRACTICAL: For one day, be deaf to all negativity around you. What happened? How did you feel? Grant states the great salespeople form what attribute to deal with the negativity?\n\n66.Create Daily Rituals That Put You in Charge\n\nThis is a self explanatory one, make rituals that are meant to improve you.\n\nPRACTICAL: Create two daily rituals that put you in charge and implement them tomorrow. How did you do throughout the day?\n\n67.Never, Never, Never Compare Yourself to Money\n\nNever value yourself less than money. It’s demoralizing because you’re worth more than that. Don’t reduce yourself to an object of a certain valueTell yourself i can’t afford it yet but it’s not worth more than me.\n\nPRACTICAL: Write down six ways in which you are more valuable than money.\n\n68.“Never Lower Your Target Mentality”\n\nNever lower target.Don’t lower your goals just to hit.Keep your goals unreasonable so you stay motivated\n\nPRACTICAL: Develop a list of three unreasonable targets and go for accomplishing them this week. Do not lower them. What happened after going for these targets this week?\n\n69.Make Sure the Whole World Knows You\n\nMake sure you get everyone on earth to know youOnce you aim to get the world to get to know you then your local market place will know you too.\n\nPRACTICAL: Describe two ways you can aim for a bigger audience or client base to make sure the whole world knows you.\n\n70.Dominate Your Space, Don’t Compete in It\n\nCompetition is for sissies and wannabes. It’s for the little whiner bitches of the universe. Champions dominate, don’t just compete in the space win it. Don’t try to keep up with everyone else try to achieve domination.\n\nQuit Spectating in it and Playing in it\n\nDominate every aspect neighborhood, home, and work.By domination he means express yourself and own the space.\n\nI can always strive to win and perform at my best.\n\nPRACTICAL: How can you dominate your space?\n\n71.Get So Much Attention You Are Criticized for It\n\nWhen you get attention to a certain level then criticism is bound to come in.\n\nFly above the radar not under it.\n\nWhy wasting energy trying to hide when you can use it to jump higher.\n\nStop suppressing yourself over someone else's approval\n\nNo matter what you do you are bound to get criticized, so do things the way you want to.\n\nSpeak louder and more firm\n\nDon’t get scared, get bigger.\n\nPRACTICAL: Write three ways you can get more attention. What can you expect when more attention is coming to you?\n\n72.Make the News Don’t Watch It\n\nToo many people sitting on their sofa watching tv not thinking of ways to make the news.Spectators pay and the players get paid\n\nPRACTICAL: List three ways in which you can make the news in your community or profession. How can making the news benefit you?\n\n73.Become a Celebrity in Your Space\n\nBecome the go to guy in your space. Become the top 3 people in your space. Get the admiration and criticism. Admirations are deals.\n\nWrite Grant’s definition of a celebrity.\n\n74.“Get Some Big New Juicy Problems Rather than the Old Boring Ones\n\nIf you want to get motivated to get big and overwhelming problems. Always get new ones things that have or will excite. \n\nPRACTICAL: Write down five examples of big new juicy problems that will freak you out, excite you, and motivate you.\n\n75.Be So Big in Your Space Everyone is Talking About You\n\nBe a giant in your spaceBig is betterSize does matter.It’s a noisy world because you have to drown out the voices of others\n\nPRACTICAL: Write three actions you will do and how you will do these actions to become a giant in your space.\n\n76.“Write Down Your Goals First Thing Each Day\n\nFirst thing you do write down your goals when you wake up.\n\nIt’s not a battle plan or a to do list. It’s what drives you and motivates. If you don’t have time to think about and write down your own goal then you will live your life helping others reach their goal before you own.\n\nPRACTICAL: Get a note pad or start a document in your computer and for three days write down your goals first thing each day. Write down what happened in those three days.\n\n77.Write Your Goals Down Again Before You Go to Sleep”\n\nBefore you go to sleep, write down your goals.Write down your targets and your life changing goals.The more you project into the future the more happier you will feel.\n\nPRACTICAL: Now, for three more days, as well as writing your goals down when you first wake up, write them before you go to sleep. Write down what happened in those three days.\n\n78.Have a 30-minute Finance Meeting with Your Family\n\nMost people don’t have money because they don’t look at it.So then discuss your income,expenses, and investment with your family.Why is it people with no money are so prone to tell you money isn’t everything. Your not motivated because you're working too hard for too little money. The reason your not making more money is because your miseducated about it. Don’t attach money to failure.\n\nPRACTICAL: This week have a 30 minute financial meeting with your family. What happened? What did you find out?\n\n79.Have a Monthly Goals Meeting with Your Family\n\nNo goal is silly. Encourage people to self develop too.\n\nPRACTICAL: Have a monthly goals meeting with your family. What occurred when you did this? How do you feel about your goals and those of your family? Have everyone in the family align and support each other in pursuit of the goals.\n\n80.“Identify What You Are Passionate About”\n\nIdentify what your passionate about.\n\nWhat your passionate about might change tomorrow.\n\nIdentify the things that get you jacked or motivated.\n\nDon’t let anyone step on them.\n\nPRACTICAL: Write a list identifying what you are truly passionate about\n\n81.Picture What You Want at the End of the Deal\n\nLook at the end of the deal, not the beginning. Look at the end of the deal, not the mechanics. This does not be ignorant, but use end to motivate the beginning.\n\nPRACTICAL: Visualize what you want to accomplish at the END of your next deal. Write it down. Then go about the rest of the steps to accomplishing it. What Happened? See what you want first before the mechanics!\n\n82.Focus on the Future Not the Past\n\nThe past is for psychos\n\nPeople who spent their time talking about the past are psychologically imbalanced.\n\nWhere you want your attention is in the future that’s where sanity is.\n\nThe sane people have their attention in the future.\n\nFocus on the next play and predictions.\n\nPRACTICAL: Think of one moment you always focus on from your past. Write down three ways of how you can get yourself out of the past or present and into the future. Put these ways into practice today.\n\n83.Keep Images of What It Is You Want in Your Environment\n\nMotivation isn’t about what happened in the past achievements, but looking forward to your future ones. Keep physical images of what you want in the future, but keep it in your environment. \n\nPRACTICAL: Collect images to represent each: your goals, dreams, and life that you want. Put these images in your space.\n\nSection 9:10X\n\n84.Be a Maniac at Your Career and Life”\n\nPRACTICAL: Write a list of three ways in which you can become a maniac in your personal life and in the workplace.\n\nThere’s nothing wrong with being a maniac\n\nWhat is wrong with being a maniac\n\nBe a maniac with ethics and good for you and people.\n\nDo things that enhance you life and be a maniac\n\n85.Do a Little More than the Day Before\n\nDo whatever you did yesterday, do a little more than yesterday add 1 oe 2 things.\n\nIt stretches your potential. \n\nMotivation isn’t something you think about the more you are motivated\n\nPRACTICAL: Review what you did yesterday and do two more things today than yesterday. What happened when you did that?\n\n86.Do So Much That You Are Criticized for It\n\nGet attention. Start thinking about how much you do. Pushing you toward your goal. Do so much that people are criticizing for you.Society nowadays is anti-work.Become a standard of work or a model.Take everything you do to another level.\n\nPRACTICAL: Choose an activity today and keep doing it to the point you are criticized for it. What occurred while doing this?\n\n87.Take Everything You Do to Another Level\n\nIf something isn’t innovated then it sucks.Don’t let other people set the standard so think and take what you do to the next level.Ask yourself good questions and you be motivated. \n\nPRACTICAL: Write an example of how you can take something you are doing now to another level.\n\n88.Stay Around Hitters and Winners\n\nStay around winners and hitters.\n\nYou want all-stars. You want super winners and champions. Quit settling for the people that are just around you.\n\nFind people who find anything below great unacceptable. \n\nNever compromise your potential for being satisfied\n\nYour not looking for satisfied. It’s like shackles and is keeping you down. If god was satisfied he would have quit with butterflies.\n\nBe true to yourself and it will keep you motivated.\n\nPRACTICAL: Identify at least three hitters and winners in your life and work out how you can get yourself around them more often.\n\n89.Never Compromise Your Potential for Being Satisfied.\n\nPRACTICAL: Write down your own commitment to never compromise your potential for being satisfied and how you will avoid compromise.\n\n90.Look at How Things Are Possible Rather than Impossible.\n\nThink about ways how things could be done rather why they can’t be done.Break it down think of ways how the impossible is possible.Flip the verbiage.\n\nPRACTICAL: Write about a task that you consider impossible. Now write down at least three ways it can be possible.\n\n91.“Look to Accomplish Those Things Others Say Can’t Be Done\n\nLook to accomplish those things other say is impossible. Those people say it can’t be done. Leads to motivation for you. Look for the impossible and your motivation will skyrocket.\n\nPRACTICAL: Make a list of two tasks that others around you say cannot be done. Today put them on your to-do list. What happened?\n\n92.Stay Focused on the Daily Target\n\nPRACTICAL: Write down your daily target for today. What happened during the day with a target to focus on?\n\nHave some daily targets\n\nIt can be anything from what I did or what time you wake up at.\n\nIt fuel to feel good about yourself.\n\nDon’t focus on your losses, but your wins\n\n93.Do the Most Difficult Things First\n\nPRACTICAL: Write your battle plan for today. Look over your list and identify your most difficult tasks and do them first. How did this affect your day?\n\nProcrastination is not a good thing it hurts more in the long term than in the short term. Procrastination leads to negativity. Do the most difficult thing because once you complete that your onto your next task with more motivation. \n\n94.Push Yourself to Do More than You Think Possible\n\nPRACTICAL: Write at least three examples of ways you can push yourself to do more than you think is possible. Do you need someone else to help you? If so, identify that person.\n\nMany times you can’t push yourself hard enough. Push yourself to do more than you think is possible. To realize you can do more than you will do more. It leads to a road of possibilities. \n\n95.Visit Your Customers in Person\n\nMake contact with people. It’s not enough to be in the machine age you have to be in touch. Meet people and add them to your social, it’s a motivating experience when you speak to someone.\n\nPRACTICAL: Meet at least two customers, clients, potential employers, etc. in person today. Write down what happened.\n\nCall them often. The people who are a problem are grabbing your attention and time. They are wasting your motivation, so it’s better to call them quickly and often so you don’t develop a habit of avoiding people or problems, Handle the problems first. \n\n96.Call Every Problem Customer Personally and Quickly\n\nPRACTICAL: Make a list of problem contacts in your life right now. Contact them and resolve the issue as quickly as possible. What happened?\n\n97.Bring More to a Presentation than You Could Ever Use\n\nPRACTICAL: Write four examples of how you could bring more to your next presentation than you could ever use and how this would be advantageous.\n\nBring more to everything. Load up on everything you need like data, information and ammo. It leads to motivation because you have everything to back it up.\n\n98.Complete Every Task Once Started”\n\nHaving uncompleted tasks start sucking at your creativity. Whatever the task is, no matter how small or minimal the task is complete it right there and then. It gives you the closer mentality. \n\nPRACTICAL: Every task you start today, finish it. Write down what happened.\n\n99.Respond to All Social Media Likes and Comments”\n\nRespond to every comment and acknowledgement you get. Respond to feedback. Keep the loop going. It’s gonna motivate you to communicate and touch the world. Respond to every comment even  the negative.\n\nPRACTICAL: Today respond to all communication you receive. (Facebook, phone calls, e-mails, etc.) What occurred when you did this?\n\n100.Make a List of Contacts That Would Change Your Life\n\nThis was Self-Explanatory so here’s how to be consistent and implement this into your life. Review Constantly.\n\nReview 2 a week \n\nReview 4 times a month\n\nReview 48 times a years\n\nKeep timestamps of reviews.\n\nPRACTICAL: Before you go to sleep tonight, make a list of at least five people that, if you contacted them it would change your life. What would be the first step in making contact with one of them?\n\n101.Show Up Early for Everything\n\nPRACTICAL: Write down a time when you did not show up early enough to prepare for a work meeting. Did everything go as planned for that meeting? How can you change your actions to become more prepared and show up early?\n\nIf you want to be motivated then show up early. It’s better to be early then late. It leads to negativity. Don’t waste time lying or waste your time. Excuses lead to hyperbole or lies.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/d1ktic/grant_cardone_100_ways_to_stay_motivated_summary/", "title": "Grant Cardone “100 Ways to Stay Motivated” Summary", "social_network": "reddit", "user": "terrorist_kid", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1567996323, "permalink": "/r/DecidingToBeBetter/comments/d1ktic/grant_cardone_100_ways_to_stay_motivated_summary/", "nsfw": false, "first_save": 1635436988.3800163, "replies_charged": false}