{"id": "t5_2tand_t3_ooaqv3", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Lately I’ve been on this downward spiral… it usually happens during the summer time. Not sure if it’s because I know I should be out enjoying the warm summer sun on my skin, doing the the things that I love but I’m consistently working, or if it’s just a bad habit I’ve developed (or force this to happen because I’m used to this never ending cycle). \n\nI stopped doing ‘general maintenance’ things like brushing my teeth before I go to bed, saying I’ll just do it in the morning. \n\nI’ve been doing my best to get back on track so I can actually enjoy things that I used to enjoy. Now all my hobbies seem to be a chore. \n\nI’ve just been so overwhelmed with trying to do the right thing; making sure my finances are in order, having the food in the house, taking care of the animals that I have. \n\nI don’t know how to decompress. I don’t know how to relax and ‘take a breather’. I’ve tried meditating. I started walking my dog every night to get that breath of fresh air and take my mind off something for 20 minutes, but it only lasts 20 minutes. I only feel good while I meditate, not after. I don’t know how to make my hobbies hobbies again. I don’t know how to enjoy life. I’m only 24 years old and I don’t think I’ve ever felt this lost. \n\nI feel incredibly guilty because I have everything I’ve ever wanted, everything I’ve worked so hard to get, yet I’m more miserable than I was before. \n\nI’ve come to Reddit because posting this stuff on my personal Facebook account is super out of the question. I don’t want everyone I know, know that I’m suffering as badly as I am. It’s nice to use something like this to seek help. I know the correct answer is to go see a therapist, but the one I saw since I was 13 is now retired, and the thought of completely starting over with someone new is overwhelming. Plus I’ve been in between jobs so waiting for health insurance is a huge pain… \n\nI’m just hoping to relate to someone, or that someone can give me some advice… \n\nThanks in advance x", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ooaqv3/tryingtobebetter/", "title": "TryingToBeBetter", "social_network": "reddit", "user": "DesperateConcern3899", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1626814034, "permalink": "/r/DecidingToBeBetter/comments/ooaqv3/tryingtobebetter/", "nsfw": false, "first_save": 1635435106.0758364, "replies_charged": false}