{"id": "t5_2tand_t3_bmmcza", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "I am new to this sub, so hi! I usually post on r/raisedbynarcissists and r/JUSTNOMIL regarding my frustration with my Nmom's treatment of me (in addition to Edad and semi-Nsister) (I am an ACON). While I still struggle with them and personally, I recognize I am in a much better emotional position, than say, three years ago. I am right now a little bit in the thick of it again with my family, but that's just how it is. I am on the cusp of a new phase of bettering myself. I've done the really hard initial work to decipher my situation, but there's a still a lot to be done on my end to put good work into consistent practice.\n\nI recently have started actual therapy for the second time. The first time was several years ago around I was in a really confusing headspace having just spent a year living with my parents after losing my first high-paying job (my job was phased out and turned down another position at the same place because it was also an unhealthy work environment to begin with, and it was a good excuse to get out and try to regroup). I didn't get a lot of out the sessions as I wanted, and the therapist might not have been the right fit for me-- but it still felt good to be able to say a lot of things for the first time freely and without judgement.  But, the years after I left therapy I did a lot of self-improvement on my own and with the help of my FDH. I don't want to toot my own horn too much, it has all taken a long long time just to reach this point but enough where I can see different small little thinking patterns forming and handling difficult junctions a little differently, to my delight. I'm not perfect at it all the time, but there are small moments when it does succeed that it gives me hope and encouragement that I might be moving in the right direction.\n\nI entered therapy to get better tools to deal with my family (Nmom in particular), figure out how to manage my own trauma so that it doesn't take hold of me in daily life, so that it doesn't affect my relationship with my partner. Also, I am on the fence of wanting kids (after being on the hard side of the fence of NOT wanting children for a very long time-- after doing this self improvement, I've changed my mind a little bit) I mentioned to my therapist that I would like to not just work on myself for the sake of my own well being and my relationship, but I do not want to repeat or transfer any of my upbringing and trauma to my potential new family of my own-- if we end up having a kid. I want to be ready to be the best/healthiest  spouse/parent I can possibly be, to be a self reflective spouse/parent, a giving spouse/parent, a listening spouse/parent, a lovingly guiding spouse/parent  (vs a dictator) Or at least, have therapy help me decide if I am even fit to be a parent in the first place, if that is something I truly am capable of doing all that. I want to do it because my partner loves kids, and I love my partner, and I know he would be the best parent of all time. I know he feels that way about me, but I want to feel that way about me-- I want to be as confident as he is in my abilities. I'm still a bit unsure of myself.\n\nI think we can give a new little person a good life and a better start if we are our best selves, even if we don't have much in the way of money. The only thing holding me back, my biggest worry is the feeling that I will repeat what I experienced, even by accident-- which I would never want to do to him or to a future child. I would not be able to live with myself if I did such a thing.\n\nI am here because I cannot afford to go to therapy as consistently as once a week, but I would still like to put in the work to get me where I want to be in life. What is the best way to use this sub? is this the place to do that? What kind of advice do you have for me? Thank you in advance! I am extremely happy to be here. To post on in a place like this makes me feel like I'm moving forward, I would not have been able to this even when I first went to therapy all those years ago :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bmmcza/i_started_therapy_to_deal_with_family_issues_so/", "title": "I started therapy to deal with family issues so that I do not repeat them going forward (new to the sub!)", "social_network": "reddit", "user": "sueysuenutt", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1557421678, "permalink": "/r/DecidingToBeBetter/comments/bmmcza/i_started_therapy_to_deal_with_family_issues_so/", "nsfw": false, "first_save": 1635436213.6375597, "replies_charged": false}