{"id": "t5_2tand_t3_p0byal", "request": ["b69cf201-6737-4217-b486-9096135546b8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "e234981c-b061-4d83-8134-70d441847f74"], "text": "This post is going to be a mess, I’m 18 Male i’ve been wanting to do this post for a while and i’m kind of on my last straw, i’ve been considering suicide for months and haven’t done anything because of how it would affect the few people that are forced to be in my life, especially my dog whom i dread and cry about dying yet i’d be somewhat relieved so i can leave. \n\nTo start with I have no passions, i’m usually thinking and for seeing conversations with people and wondering what to say so i never think of productive things, only how to make people laugh, and it makes me fucking depressed when i can’t, or say something stupid or nothing at all because i can’t think of words. I’ve lost all my friends, or isolated myself from all of them because after an acid trip or two i started seeing conversations differently and ANALYZE THE FUCK out of all of it, how i say things, or what to even say or what joke to make, it scrambles me. On top of that i don’t do anything fun, i’ve had people introduce me to things i like but i end up only ever doing it once and forgetting about it, such as physical activities or anything. Like i said i don’t get to do anything fun except pay for bowling but the entire time i’m wondering what to say to make it fun for the other person, i’m literally always on edge. I can’t make my girlfriend laugh anymore like when we first met because i’ve forgotten what made her laugh and i change humor a lot for some reason. Ever since i was a kid i made people laugh in the classroom and it’s what made me happy and when i can’t it ruins my entire mood u til i can actually make someone laugh but i haven’t had a deep laugh like those ones that turn your face red since i was a kid wit my dad or something. I never know what to talk about with people and makes me come across as extremely awkward. When i see my future i see it empty and my house being lonely and i know these thoughts lead to bad things but i can’t help it. I used to hang out in groups of people but i’ve since distanced myself from EVERYONE and just smokes weed in my room alone for months. Because when i’m with friends i’m the butt of jokes and don’t know what to say to people and i was supposed to go to party tonight but i haven’t seen anyone those people in like a year and i haven’t nothing new to myself i haven no interests or fun parts to my personality. I usually just agree with people because they say something i agree with but i  was too focused on what to say or how to make that other person laugh. It’s a horrible loop i cannot live with anymore. I steal stories from other people or google, i literally good everything or to reddit for all my problems. I can’t remember what people tell me or anything interesting about them because my head is filled with all this garbage. I don’t have any original jokes i steal them all from google and write them down in m phone because i can’t remember those either. I try and use these jokes in my relationship with my girlfriend who now hates me as well as her father because i gave her covid. And as soon as somebodies mood changes i change and start being very insecure and everything worsens. Besides that i don’t know where i’m going in life my mothers an alcolhic 60 year old who’s stuck at a minimum wage job wasting her life . i have no knowledge of the world or the ability to retain any info, i feel retarded most of the time and can’t co tribute to conversations hardly. I get jealous when i hear other people conversing and having a good time because i can’t. I get jealius when other people get a laugh from people and i can’t freestyle regardless of the hours dedicated to it and speaking is just as bad. I don’t know how to take control in bed and be dominant and it makes for an awkward time. i OBSESS OVER EVERYTHING AND IM TIRED OF IT. I’m poot and don’t know how to get money and i wish i could say i just want to do something that makes me happy and makes a difference in the world but i don’t know what that is in me. I’m a moron with money and did horrible in school and just showed up high everyday, i still haven’t graduated and my girlfriend in college wants me to move out and figure out what to do in my life but i’m so stuck, yet i waste every single day doing things i don’t want to do and just being depressed. i end up obsessing over jokes and how to make people laugh. Just so they like me again, i it i end up forgetting how to be funny and forget jokes so i wrote them all down it’s insane. and don’t even get started with texting it’s even worse and even more boring especially when i’m getting bad vibes from that person. SOMEBODY PLASE HELP I CANNOT LIVE LIKE THIS. Sorry if typos my phone cannot handle all these words and is glitched.\n\n\nThank you all for the replies, i’m going to go through them tonight when i’m off work and reply to them all, I deeply appreciate it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p0byal/i_dont_see_myself_ever_being_happy/", "title": "I don’t see myself ever being happy", "social_network": "reddit", "user": "LooseToday110", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1628416580, "permalink": "/r/DecidingToBeBetter/comments/p0byal/i_dont_see_myself_ever_being_happy/", "nsfw": false, "first_save": 1635436447.9349334, "replies_charged": false}