{"id": "t5_2tand_t3_kat3fw", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "e234981c-b061-4d83-8134-70d441847f74"], "text": "I think I wasted 3 years straight just smoking weed in my room. For those three years I had dreams and aspirations but I guess I was kinda hoping they would just happen without me having to do anything. I had the hardest time staying motivated, finding passions, getting my head straight, but turns out that was just weed. I was always chasing an imaginary high, one that would last hours and I could trip out on Beatles songs and maybe jerk off after a while if the weed made me horny.\n\n\n\nBut I never could. The more I smoked the more I needed to smoke the next time for a fraction of the effects. It got to the point where I would take 10 hits to barely feel anything. I spent so much money looking back, like wtf was I thinking, I'm poor as shit, I shouldn't be treating myself to those luxuries. \n\n\n\nAnyway, I can't believe weed clouded my vision so much. Everything is so clear now. Too fat? Watch what you eat. Too sad? Watch what you think. Too overwhelmed? Just make a list. Holy fuck I literally feel like a little kid. There's so many possibilities I didn't know of. \n\n\n\nI don't have a lot of big life goals, for now I just want to start a few YouTube channels and a clothing brand. For three years I've wanted to start each one of those projects, and for three years I told myself I would, right after I reached that perfect high. Which again, isn't real and never came. I wrote some videos for the channels and made some mockups for the brand these past couple of days. I can't believe I wasted three whole years of my life. Sad\n\n\n\n\nEdit: \"I can't believe weed clouded my vision so much\" was originally \"I can't believe people go at life sober and still have problems\" which was too negative and I didn't wanna bring anyone down", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kat3fw/finally_cut_off_marijuana_now_life_is_on_easy_mode/", "title": "Finally cut off marijuana, now life is on easy mode", "social_network": "reddit", "user": "Kmart_Layaway", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1604, "down_vote": 0, "creation": 1607651749, "permalink": "/r/DecidingToBeBetter/comments/kat3fw/finally_cut_off_marijuana_now_life_is_on_easy_mode/", "nsfw": false, "first_save": 1635436246.2639203, "replies_charged": false}