{"id": "t5_2tand_t3_lehvol", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "  \n\nI want to first point out I have failed 10+ times so far, not like this but in pursing my goals, I will never stop I will have to die before I let this world hold me back from being the greatest me I can be. But am insight as to why I do this is I have never been truly happy with myself; I lie amount small scenarios to make myself seem better than I am. I wanted to believe I was separate from the pack, but I am afraid of how others will treat me because of my difference. I am sick of this I want to be a leader and I need to stop being afraid of what others think, I cannot keep wanting to be the alpha when acting in line with the sheep. I want to, from here on, stop caring about what others will think of me and purely act in the way that I want and disregard those who dislike my decision to be me. I constantly have anxiety of how others are looking at me from how I walk, to how I look, I feel small and insignificant, I want to feel like I am living my life and everyone else is living their own lives too. I wrote down a list of things I want, and specifically why I want them, to remind myself the importance of each task.\n\nBigger Build – I want a larger chest, to be more confident in myself and stop relying on reassurance from others approval.\n\nCompletely cut off masturbation – I want to stop being controlled by my dick and make decisions that are beneficial not only to me right now but me of the future.\n\nReach 25k in stocks - I want to be able to maintain a steady investment in my financial future.\n\nCut off gaming completely – It is a waste of future me’s time and only benefits my short-term stress without addressing the problem.\n\nReplace time wasted on phone with time in books – I am recognizing that I am becoming dependent on my phone not only to fill the blanks spaces of my time but to get me through the day and not think about what I need to do.\n\nSpend more time outside/with other people – I have been putting socializing as a waste of my time because I could be grinding better gear or new levels in videogames. I want to make memories not better my fictional character.\n\nMake my classes top priority to break the habit of procrastination – I have been waiting till near the due date or the deadline to start working on schoolwork to keep my self-motivated, but I want to rely on my discipline not my energy.\n\nFix my sleep schedule – I want to maintain above an 8-hour amount of sleep per night regardless of weekends.\n\nClean room – I let myself get messing and instead of putting things away I pile them up and leave them till it gets bad enough that I have to do a large amount cleaning rather than just preventative cleaning throughout the week.\n\nI will make an excel spreadsheet making sure I follow each of these daily and I will update this post monthly or quarterly. I have waited too long to start and I'm ready for myself in 5 years to be grateful to the me of today that I finally started after years of failure.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lehvol/20_years_old_and_dissatisfied_with_my_life_i_will/", "title": "20 years old and dissatisfied with my life. I will change. No matter what it takes.", "social_network": "reddit", "user": "Youngster-", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 138, "down_vote": 0, "creation": 1612682838, "permalink": "/r/DecidingToBeBetter/comments/lehvol/20_years_old_and_dissatisfied_with_my_life_i_will/", "nsfw": false, "first_save": 1635435447.4361026, "replies_charged": false}