{"id": "t5_2tand_t3_g3g6v6", "request": ["5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "That thought popped in my head earlier this week and it felt like such a revelation. \n\nWhile I have been fortunate with everything going on in the world (healthy, employed, fed, loved), I have been struggling emotionally. The past month has felt like an uncontrollable tilt-oh-whirl. I’ve struggled regulating my emotions because I’ve been cycling through them so quickly and so intensely, which has left me feeling exhausted more often than not. \n\nTo make matters worse, my anxiety has sent my brain into comparison overdrive when looking at social media. So many people are doing this quarantine thing better than I am.  “How does she have energy to make that gourmet meal when it took everything in me to make a hot dog for lunch??” “Wow, she’s posted intense yoga workouts every day this week. I applauded myself for walking my dog...pathetic.”\n\nI started getting a panicy-hard-to-breathe feeling and have had trouble sleeping, which are both out of the norm for me. They’re also my cues to try and right my own ship ASAP. I can’t commit to a long list of things to do each day because sometimes even one task feels insurmountable and not completing my list makes me feel bad. But I have realized I can decide to be better in at least one way every day, which has lead to some successes that I’m proud of.\n\nHere’s see some things I’ve done this week that have made me feel pretty good:\n- Deleted IG, Twitter, and FB apps from the phone. I still have my accounts, but access to them is harder. \n- Used a break from work when I would usually look at social media to do some stretching. \n- Had a Zoom happy hour with some old friends. \n- Recorded a birthday message for a friend. \n- On the days when I was feeling really low, I made sure to write in my gratitude journal. \n- Listened to all the music I loved in high school. \n- Hugged my husband - usually for at least a few seconds “too long”. \n- Made a simple but delicious breakfast featuring actual vegetables. \n- Went for a run - this one I am SO proud of because it sucked and I didn’t want to but I did it anyway and it felt so good. It also lifted a weight off my shoulders and led to my title epiphany/new mantra...\n\nI’m not doing well, but I’m doing my best. And that’s good enough for today. :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g3g6v6/im_not_doing_well_but_im_doing_my_best/", "title": "“I’m not doing well, but I’m doing my best.”", "social_network": "reddit", "user": "fandog15", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1587178279, "permalink": "/r/DecidingToBeBetter/comments/g3g6v6/im_not_doing_well_but_im_doing_my_best/", "nsfw": false, "first_save": 1635436735.8968906, "replies_charged": false}