{"id": "t5_2tand_t3_ehgoz1", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Good evening folks. I only recently found this sub and I see so many people in similar situations as I was and am currently in in relation to having problems in ones life and feeling like positive change is needed. I started seriously on my path of self improvement in September of 2018 and now I feel like I've made a lot of positive change and overall I feel more proud about where I am and where I can go. I figured I'd use this post as a sort of checkpoint/ journal entry (I dont really track my thoughts in text often) and maybe give some people some hope/ advice about their own problems going into the new year/decade.\n\nI'm M/22, I have 2 years of college done (was studying engineering) and am currently taking time off school living at home with my parents working as a night time grocery stocker. \n\nEnding my senior year of high school there was a lot about my lifestyle that made me happy and I was proud of the progress I had made up to this point. I graduated in the top 8% of my class, I earned my eagle scout, I was doing track, cross country, competitive bowling, I had a solid group of friends I was hanging out with. Overall just had good prospects going into college and was (in my mind) set to do well academically. \n\n\n**My Problems**\nMy time in college was not all puppies and rainbows like people will like to lead you to believe it is. I gained a serious addiction to video games, my diet was very poor (gained 35 lb over 2 years), my anxiety was at an all time high about my grades being worse as time went on and I didn't make any new friends so I was essentially a shut in and my consumption of media (netflix/youtube/ twitch) was way too damn high. In addition I had a bit of an addiction to porn and this definitely sapped me of otherwise necessary energy to get useful things done. I also pretty much stopped running during this time which used to be one of my favorite hobbies and helped keep me in shape.\n\nAll in all these things really started to weigh on me by my second year in college and in addition to being 25k in debt and not being interested in my major or making any serious strides toward graduating in a good position to be attractive to people who would hire me I decided that it was time to go home and get my shit sorted. \n\ntldr:(bad diet, no exercise, video game addiction, high anxiety, too much media consumption, porn addiction, bad social skills, in debt)\n\n**Solution**\nSo I went home after spring 2018 and essentially wallowed in pity for a good 4-5 months. I stayed home playing video games, eating shitty food, and sleeping for 9-12 hrs a day. I'm not sure what particularly helped me figure out my shit but the starting point for me was buying a new running gps watch (had lost my old one at college). I immediately started being religious about tracking my running/ biking and I think those first few months I hit around 30 miles per week. I lost around 20 lb and come December my first bills for my student loans were starting to be due. I specifically chose a night time physical labor job because I was a night owl at this time and I wanted to be in a position where I was essentially forced to get myself into good shape (without getting myself in the military or somewhere higher commitment). So I started stocking at a grocery store for $15 an hr at 40+ hrs a week. A big step I also took prior to this around September-October was writing down a lot of things that needed to be put to paper. All of my problems ,exactly how I should solve each problem, my goals for the short term, my goals for the long term, what books I had read up to that point, what books I wanted to read. It was weird how therapeutic it was but It made me feel more organized about getting myself to a better position and coming up with a basic blueprint of what my day to day life should look like in a 100% ideal world really made me see how I was missing so many marks (even just simple shit like remembering to cut my toe nails monthly, brushing teeth twice a day, folding my clothes after doing my laundry). The kind of little things that when your life is going down hill you kind of let fall by the wayside. Something great about doing brainless physical labor is that you have a lot of time to think so in addition to being able to listen to music (one of my favorite pastimes) I was able to get back into reading via audiobooks. I can proudly say that in less than a year I have listened through 57 books (I half started but didn't finish around 10+ books) which was around 800 hours dedicated to reading and in addition I spent around 1,800 hrs listening to music. In addition to working out at my job I made it a point to try and run around 30 miles a week and get in 3-4 hour long strength training sessions which I have also been able to maintain. I've since put down 5k towards my student debt, I have bought a new wardrobe, I bought new guitars to rekindle my love for playing music, I've been fairly successful in working on my caffeine/ sugar addiction, I have fixed a lot of the problems in relationships with family and have been able to reconnect with old friends I haven't spoken to in a few years. I've also since put serious work into limiting my gaming and can proudly say that I've averaged less than 8 hrs per week over the last 6 months (easily used to grind 8+ hrs a day). I have had a string of 2-3 day streaks of no fap/porn but this is easily one of my biggest problems that I am still having problems completely quitting or getting to a place where I think it is controllable. In any case I have reduced it from fapping a minimum once per day to maybe only 30-40% of that over the past year so I am quite happy in that progress. My diet has gone through great improvement over time, I have limited myself to eating fast food only once per week, and I tend to go towards healthy foods like fruits and vegetables for snacking and as big parts of meals. I also over the last 4 months or so have tracked 80-95% of all the food that I have eaten via under armor fitness tracker app(My Fitness Pal). I have also tried to track my water consumption over the last 4 months but it has been a lot more sporadic and not as accurate. Soda by and large is gone from my diet and I have replaced it with my new favorite beverage lemon flavored sparkling water (I easily drink 6+ cups of water a day so I seem to be meeting expectations in this area where before I definitely was letting myself get dehydrated). I have put serious effort into getting my finances in order I track my purchases via mint and I'm definitely working towards paying down my student debt/ making sure my credit card is paid off monthly. Spending is becoming a new problem I've had with my new income but I'd say probably 75-80% of my income has gone towards worthy things like food/gas/ clothes/debt so overall I don't feel terrible about it but still I would like to be at a point where I'm not spending any money on stupid things that don't add value for me. I've also since put sleep as my number 1 priority so I always make it a point to schedule my sleeping/ napping and making sure I am meeting my sleep needs (My watch lets me get an accurate look at my sleep and if I getting enough deep sleep).\n\n**Advice**\nFirst get all of your body related problems in order (physical fitness, diet, clothing, sleep, water consumption). It is amazing how many problems this will solve in your life and when you truly have a body that is being treated how it should then your whole day just becomes like 30% better. A big thing that helps is looking at scientific data and doctor recommendations and taking a lot of that stuff to heart. Keep your bodies healthy and they will work like they're supposed to. Get your finances in order. A man who is financially independent has peace of mind and isn't worried about things like unexpected expenses and if he has enough money to eat this month. Fixing your finances is extremely important to living your best life and is down right necessary to getting your goals done in a reasonable time frame. Fix your relationships with your friends/ family. A big part of life is the people we interact with and if you treat the people around you shitty then they are not going to like you and not going to want to be around you. You gotta grease the wheels a bit when it comes to these people in your life and sometimes it means putting them before yourself but it is amazing how little favors can pay off later when you need these people to help you. Figure out your goals and figure out steps to get there. I feel like this is the ultimate part of doing amazing things in life. I see it time and time again in my heroes that the thing that they did before they did that amazing thing was sit down and really decide what they want. After that they took systematic steps toward achieving that goal.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ehgoz1/over_a_year_of_self_improvement/", "title": "Over a Year of Self Improvement", "social_network": "reddit", "user": "dontwigout", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1577678057, "permalink": "/r/DecidingToBeBetter/comments/ehgoz1/over_a_year_of_self_improvement/", "nsfw": false, "first_save": 1635436532.3162994, "replies_charged": false}