{"id": "t5_2tand_t3_8vcc58", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Sometimes I question what is it that I constantly desire escape from. Coming up on 9 months of sobriety, I'm still battling with my addictive personality. Relentlessly seeking out and exploiting any external thing I can derive even a modicum of pleasure from. Whether it's my newfound girlfriend, video games, incessant listening of music, food, pornography, sports, sex, etc. all of it provides a distraction. A means of temporarily alleviating some sense of discontentment within my life. Albeit substances have now been eliminated as a source of escapism, the familiar thought patterns and behaviors still persist. \n\n8 and a half months, I got expelled from school. 4 months of sobriety vanished within an instant as soon as an acquaintance offered to smoke a joint on school grounds. The same day, I was asked to leave the school and within 10 days was back in rehab. Since then, I diligently worked a 12 step program and managed to obtain some sense of stability in my life. I now live in Singapore and study psychology in a private uni, the equivalent of a community college. \n\nThe last month and a half, I began slipping. Not in the sense of relapsing but small and not-so-small cracks in my program. When I first got out of rehab, I took the \"rigorous honesty\" aspect of the program to heart. I refrained from saying anything that can remotely be considered a lie and in the odd times I caught myself saying something that wasn't true, I possessed the integrity to admit it. Nowadays, my dishonesty has become much more predominant in my life. Here's a list of things I've recently lied about:\n\n-Told my sponsor I had stomach problems to avoid going to my home group meeting\n-Lied to my sponsor about making a certain amount of calls to other people in the program\n-When asked how many girls I've been with by my gf, I lied by stating a significantly higher number to seem more experienced and fit the cocky/charming persona I've adopted around her\n-When telling people stories, I'd recite something relevant I read off Reddit but pawn it off it as personal experiences\n-I'd lie about how much time I spent playing video games \n-Lied to my parents about my recent exam scores, saying I got 2 As and a C when in fact I got 2 Cs and an A. \n\nThere's plenty more that loom below the surface at the moment but that should suffice. Just pondering some of these lead me to believe I have the same tendencies of a pathological liar but majority of these lies are made out of fear. Fear of repercussions, fear of judgement, fear of losing something that I value. \n\nOver the past month and a half, I've been a horrible student. During many of the lectures, I'd be on my phone, hardly paying any attention. I'd take excessively long smoke breaks and miss out on a huge portion of the class and sometimes just blatantly leave the room. I procrastinate the fuck out of doing my work and most of my assignments were embarked on last minute. I'd hang out with my girlfriend up until 4 am, knowing I had a class at 8:30. \n\nThis brings me to the next topic, which is my recently acquired need for female attention. Since arriving to Singapore, I've gradually developed a proclivity to pursue an abundance of romantic interest in my life. In the first week I've arrived to Singapore, I hooked up with a girl from my class. I became slightly attached to her but because our intentions didn't align, we went our separate ways although the craving for affection persisted. This unsatisfied yearning drove me to download tinder and since then, I've become involved with 3 girls', one of whom I'm currently dating. I see her on a daily basis and it's not as sex fueled as one might think. Her parents are home most of the time which makes sex a pretty uncommon occurrence. I'm reluctant to say it's lust that drives me to do this but it definitely does play a role in it. I speculate that it's the need for affirmation that fuels this behavior, to derive some sense of worth from the affection these girls provide me with. Shows to say just how low my self esteem is to this day. \n\nI'm not particularly sure where this is going to be honest. What I'm trying to say is that although my life seems to be on track and is a hell of a lot better compared to what it was like a year prior, I still feel restless, irritable and discontent when left with my own thoughts. Each day, I try my hardest to keep myself occupied. Reading Reddit, listening to music, playing video games, whatever it is that keeps my mind busy. But once I stop for a minute and just think, I feel that sense of desolation looming within me. That sense of gloom and distress constantly gnawing at me. I try to keep it at bay but it never fully goes away. I still feel so directionless. My life still lacks purpose. Although I go to 4 meetings a week, chair one of them, work as a secretary for another, keep in contact with multiple people in recovery everyday, and currently in the process of obtaining my degree, I still have no clue where I'm headed in life. Just like during my using days, I still live life on a day to day basis. Nothing planned ahead, no ideas concerning where I'm going, what career path I'm planning to choose, what I'll do once my course ends, nothing at all. I can't even think of what I'll be doing a year from now. All I can hope for is that I'm sober because I've had enough of that life already. I turn 18 in the following month and I still can't fully comprehend what it's going to be like being an adult. I just feel so lost at the moment and I don't know how else to express this. I really have no clue where I was going with this rant but I felt like I had to write it out and articulate the negative emotions I've been repressing for a while now. Thanks to whoever read this.\n\n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8vcc58/my_life_feels_so_directionless_i_keep_running/", "title": "My life feels so directionless. I keep running away from my thoughts using any means of escapism. How do I find purpose in my life?", "social_network": "reddit", "user": "ldamien65", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 225, "down_vote": 0, "creation": 1530472977, "permalink": "/r/DecidingToBeBetter/comments/8vcc58/my_life_feels_so_directionless_i_keep_running/", "nsfw": false, "first_save": 1635435827.482444, "replies_charged": false}