{"id": "t5_2tand_t3_gdsxif", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I went to a park with my boyfriend, there were so many people there despite the world being at a standstill, guess we all had the same idea. As we’re walking around, a group of young girls on bicycles shout to each other “watch out!” as they were coming up behind an older man jogging with dumbbells in his hand. One of the girls I guess didn’t know what to do or couldn’t stop and ran into him from behind and they all toppled over. It happened right in front of us. The man stayed down as the young girl started to shyly apologize and freak out. She didn’t know what to do as the man laid there disoriented. I remember thinking “ah fuck” as I knew I had to do something even though I had no idea what to do, I couldn’t just walk away as this young girl was freaking out and not knowing what to do either, naturally. I walked over, got the man to sit up, calmly talked to him as others started to circle him. I had my boyfriend call for an ambulance because part of his hand and forehead was swollen like an egg and bleeding, I think he hit himself with the dumbbells while falling but also it was a nasty crash to begin with, it wasn’t a soft crash. When asked for our location we didn’t know because it was a huge park. I looked at the stores near us and told them what was near us, then after a minute or two, waited by the road to flag down the ambulance. As they were taking care of the man, I went to talk with the young girl. She was so freaked out and in tears still, I tried to tell her that its not her fault and accidents happen. I told her it was better to feel this kind of empathy than nothing at all over a situation like this, that its ultimately good to feel this way but its a hard emotion to handle and deal with. If there wasn’t a child involved I don’t know if I would have taken the leadership role in this emergency situation, I feel like I would have waited for someone else to step in and do something. But maybe not. \n\nThese two stranger’s scary moment has been oddly reassuring to my overall self esteem and confidence in myself. Knowing I can handle dire situations even if I have no idea what to do, I’ll figure it out along the way. I thought I’d find my confidence again else where, just goes to show how odd life can really be sometimes. With that many people in the park, I feel like statistically something was bound to go wrong. I so happened to be there right at the very moment. This moment has overall made me realize again how I’ll never know what will come my way, if I’ll be on the receiving end next time. But I can handle it either way, no matter what, I’ll handle it..", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gdsxif/i_found_my_confidence_in_a_moment_of_emergency/", "title": "I found my confidence in a moment of emergency", "social_network": "reddit", "user": "furrysurender", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 62, "down_vote": 0, "creation": 1588662158, "permalink": "/r/DecidingToBeBetter/comments/gdsxif/i_found_my_confidence_in_a_moment_of_emergency/", "nsfw": false, "first_save": 1635438258.3205655, "replies_charged": false}