{"id": "t5_2tand_t3_h78nel", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I've noticed a pattern of behaviour in myself that I really dislike, and I genuinely want to change. But I don't know why I do this, and so I was wondering if anyone could relate and/or could offer any insight.\n\nBasically, when everything seems to be going well in my life, I sabotage things - to a degree even subconsciously. Examples of this:\n\n• Even though in education settings I perform extremely well (I have always been in the top of my class from school to college), I have handed in around 90% of my assignments late. I am bad for procrastination, but even when I literally start something on the day it's given I find it extremely difficult to get it finished in time. \n\nIt's typically a mixture of anxiety and being overwhelmed by the task and unable to narrow down my ideas. I find it basically impossible to plan out things or break down tasks no matter how hard I try. It's extremely frustrating because I'm genuinely passionate and interested in what I'm learning, but I always end up doing my assignments in a very short space of time where I don't eat/sleep/do anything until its done.\n\n• I am working my way up in a very competitive industry, and although I'm still in the early stages of my career, I have been fortunate to get some really great opportunities.\n\nEverything always seems to be going great - I get on great with my colleagues, I perform really well at my tasks and take on extra work because I enjoy it. Then I'll do something very stupid - e.g. the day before I know I have an important work meeting, I go out all night taking drugs. Or it can be more subtle than that - I just reach a point where I stop caring as much and lose all motivation to do well. Or I'll just persistently think I'm in out of my depth and that I don't deserve to be there. \n\nI recently had a job interview for a role that would have been a perfect opportunity for me but right before the interview I started to feel apathetic, guilty, and just stopped caring and couldn't muster any enthusiasm for the role. Needless to say, I didn't get it and I felt relieved - but also disappointed at the same time?\n\n• Dating wise, I can be casually seeing someone for a while, and then one day, out of nowhere I'll just suddenly lose all interest. Paradoxically, I'll harbour unrequited crushes for literally months, but usually if someone reciprocates interest in me I get bored which I know means I inadvertently end up hurting people.\n\nI just feel like I go between the extremes of super passionate and motivated, to apathetic and reckless all the time. I don't know why I continually mess things up for myself - I don't want to throw a pity party at all: I'm just genuinely at a loss and want to change. Is it immaturity and lack of discipline? ADHD? Low self esteem? It is actually just nothing deep and I'm creating a false narrative from selected unrelated poor choices? Burnout? Imposter syndrome?\n\nAnyway if anyone can relate or maybe has some sort of insight any thoughts are appreciated lol. Thank you for reading.\n\n**TL/DR: I self sabotage my success in multiple areas of my life and I don't know why. Do you have any insight? What steps do I need to take to change for the better?**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/h78nel/why_do_i_self_sabotage_and_how_can_i_stop/", "title": "Why do I self sabotage, and how can I stop?", "social_network": "reddit", "user": "rosealoe", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1591916248, "permalink": "/r/DecidingToBeBetter/comments/h78nel/why_do_i_self_sabotage_and_how_can_i_stop/", "nsfw": false, "first_save": 1635436643.828442, "replies_charged": false}