{"id": "t5_2tand_t3_3p9p0u", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "It's really late over here now so apologies if this sounds messy\n\nBut basically I have had my anxiety disorder holding me back in some form or other for the past 5 years, and it has seriously depressed me (as in semi-clinical depression and social anxiety.)\n\nThere are certain concrete steps that could make things better for me from my perspective. Sort my sleeping pattern out. Get a job. Learn to cook. Do a bulk and workout to build muscle. Go out and socialise. Eventually, move out. I keep holding myself back on ALL of them. Now I hold myself back even on rudimentary hobbies such as reading or watching movies, irrationally worrying what my parents think of me.\n\nThe origin of this obsession with 'what my parents think', I believe, was my behaviour when I first had a nervous breakdown. It manifested in a 'minor' (generally non-life threatening) eating disorder, orthorexia, and over-exercising. In practice I became very picky around what I ate. Of course 'picky' trivialises the nature of it; I would have physical panic attacks around 'unsafe' foods (yeah I did the safe/not safe false dichotomy), sometimes having to eat anything at all, and in some cases engage in compensatory exercise (effectively restriction). Some of this was a little unhealthy, e.g. I nearly cut out dairy as a food group including milk, without providing any alternative source of calcium etc.. Likewise with iron by cutting out red meat, when there was a risk of my becoming anaemic; my mom already was. I was under the delusional belief that I was dying, specifically that I had heart disease and was at major risk of dying of a heart attack if I wasn't very careful. After having a panic attack and fleeing to hospital for an ECG/EKG, I was later diagnosed with left incomplete bundle branch block.\n\nAll of this led to a very troubled and stressful time living with my then mom and sister, on top of the usual A Levels stress. My parents had divorced in Year 11 so that was a factor in the manifestation of my anxiety. To make matters worse I am Dyspraxic which has stunted my confidence in learning practical skills such as cooking, due to the 'butter fingers' effect that's a consequence of poor gross motor co-ordination skills. My mom did her best to cook for me despite my often contradictory rules and rituals to prevent my 'imminent death'. We have, I found out, a familial history of depression/anxiety/ostensibly OCD, which it seems I triggered, as she went onto anti-depressants at some point in this time. I felt immense guilt which to this day, despite multiple reassurances by my mom that there were other factors contributing to her depression such as the aftermath of the divorce, the menopause and her hating her job, I have struggled to let go of.\n\nIt has now been 4 years since that time, but throughout university and even now afterwards (to a lesser extent) my behaviour has struggled to change. As the fear of immediate death began to fade, the thoughts of personal growth, making new friends, networking, careers, dating, relationships and sex grew. But of course fear consumed me.\n\nFor example, I have always sucked with women, and until recently had few even as platonic friends. I would like to attract them and be able to build better relationships with them too. However I equally worry that I'm placing an unhealthy amount of attention onto the pursuit of their approval and validation. Realistically I do not believe 'getting laid' is going to cure this ongoing existential crisis, nor do I like viewing people as objects or means to an end. I have had one long distance 'secret' relationship of sorts with a former close friend, a crush I had during high school who became a good friend, indeed a guardian angel, a life support during my mid-to-late university years. The relationship failed due to cultural differences, as she warned from the outset, ending on mutual terms...but the friendship failed when I became paranoid that she had been lying all along, cheating on me/interested in one of her other guy friends, etc. I miss this woman, my friend, a lot, she was my first love.But it seems the more I try to cling on to her, the more I hurt her.\n\nWhen I was younger, the way to be liked and thought of as attractive was simple: be one of the hot guys on TV/in the movies. Be really good looking, get in amazing shape, make lots of money, work hard, be a Prince Charming. In practice, this was a failure. I tried in vain to achieve this superficially perfect standard, and it seems that at the final hurdle what failed was my social skills, conflict resolution skills, communication abilities and, well, self esteem.\n\nI've had the common social anxiety/low self esteem worries throughout uni: What if people don't like me? What are they thinking about me? Are they talking about me? Am I good enough? Will I say/do something stupid? Can I handle this course? etc. But I've had more severe ones too: What if I'm a rapist? What if I'm a pedophile? What if God is going to strike me down [harking back to the heart attack] What if my girlfriend [now ex] is cheating? What if she finds my illness funny and wants me dead? In the case of my diet and fitness, I had 2 worries:\n\na) My family are historically overweight. By bucking the trend abd being a 'health nut'/'fitness freak' (notice how I felt compelled to frame my passions as pejoratives), I am betraying the family.\n\nb) If I got in great shape, what if I started becoming really aggressive/dominant/abusive towards my mom, my sister, my family? What if I turned into an asshole?\n\nThis extended to most personal development lists. In particular, how can I not be sure that change that I consider positive isn't going to hurt my friends? How can I not be sure I'll turn into some narcissistic, obnoxious, arrogant asshole who they don't want to be friends with anymore?\n\nFor these reasons, I engaged in a lot of self sabotage. I would hide behind computer screens and lurk Internet forums. I would stuff myself with junk food to gastronomic proportions (pun intended). I would stay up until silly o'clock so I never got the proper rest. When I tried to break out and 'just do it', I'd feel compelled to ask for my parents' reassurance-especially if it was diet/fitness related. In their absence, anonymous Internet strangers. In their absence, there would be no action; in their presence, I'd argue and make excuses for why I was avoiding things. In worst case scenario, I had a severe depressive episodes where I self-harmed and attempted suicide, back in late 2012. \n\nIn practice, I spent most of my university experience sleep-deprived, with way above average stress (regular headaches) and lonely. It was difficult to make friends when so tired and uptight all the time. Some days I just wanted bed. I made a handful but not nearly to the degree of connection someone deserved from me.\n\nI was talking to my friend today about how I feel that I have missed many opportunities and am beginning to crave for something better than my current lacklustre experience. Just today, a girl was sheepishly looking over at me and playing with her hair on the train, possible signs she was interested…yet I chickened out. I'll probably never meet her again. How different could my life have been if I spoke to her?\n\nBut again it's not just limited to dating, although that is a major area I want to work on. In the time I have been ill, my friends have grown up. One best friend is now living and teaching in Japan, his life-long dream. My mom has remarried, my dad been with a new girlfriend for 5 years. My sister has given birth to a beautiful niece. My brother has now very nearly completed his phD. Many of the people I have gone to school with are now bodybuilders, pilots, engineers. They are going places, and they have seen corners of the world that I being unemployed cannot. Realistically I don't think I'm ever going to be one of those top guys with the high flying careers, but it would be nice to achieve something. To grow.\n\nAs it is, I am still irrationally worried about what my friends think of my going swimming tomorrow, and what my parents think of my starting to bulk-exactly the question I asked 3 odd years ago.\nIt was my failure to grow which has hurt me the most, and others too such as my ex. I am determined to correct this but at the same time it's scarily hard and I don't think I'll be able to do it without medication.\n\nI'm wondering if anyone has experienced similar difficulties with their thought processes here, and/or if you could offer me some tips and how to point me in the right direction. Many thanks in advance :)\n\nI may edit this in the morning\n\n> tl;dr I am afraid of change, growth, adulthood and the freedom to do what I want. For some reason I often believe that the changes I want to implement in my life, which I believe would be positive, would in fact make me a nastier, more selfish and self-absorbed person. Other times I believe that there is something defective about me right now which needs suppressing. These thoughts hold me back from accessing my true potential or even being a force to serve others; ironically in trying to protect others from my own 'badness', I have hurt some.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3p9p0u/fear_of_change_i_genuinely_seem_to_fear_that/", "title": "Fear of change? I genuinely seem to fear that change may make me become a person I and others around me will, rightfully, dislike.", "social_network": "reddit", "user": "tinytiger4321", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1445200856, "permalink": "/r/DecidingToBeBetter/comments/3p9p0u/fear_of_change_i_genuinely_seem_to_fear_that/", "nsfw": false, "first_save": 1635435845.8137422, "replies_charged": false}