{"id": "t5_2tand_t3_mylvz1", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I don’t really know where to begin, and don’t have a lot of time to post rn. But I feel that this is too good to keep to myself, and maybe hopefully it can help others the way it’s helped me. \n\nI’ve always struggled with bizarre jealousy issues in my romantic relationships. People always have given me advice like “don’t worry”, “try not to think about it” etc and obviously this is not very helpful. \n\nI’ve had this issue in every romantic relationship I’ve ever been in. The innate craving to look through my partners phone, social media accounts, etc completely takes me over. The thoughts are intrusive, and even though I never find anything, I feel like I have to keep going to get the “right feeling”. Like an itch that’s never scratched. \n\nI’ve tried all kinds of therapy and they always say it’s attachment issues, inner child trauma, etc. I’m not saying it isn’t those things per say, but they always explained it as this lofty deep seeded issue. \n\nBut - I knew for me it much more resembled an addiction than some deep emotional wound, I know that doesn’t make sense, but that’s really how it felt. Like it was bigger than me. I couldn’t control it. It was compulsive; IT chose me, not the other way around. I know it doesn’t make sense but hear me out - I physically could not stop doing it no matter how hard I wanted to. It was a ritual of sorts, and the thought, or rather the URGE to do it is what told me it was time to do it, *not* my environment or things that happened. \n\nI read the book “Brain Lock” by Jeffrey Schwartz - and it’s a book about OCD. For the first time in my life, I felt heard. For the first time in my life, o had actual tangible advice. \n\nAnd guess what - I’m overcoming my intrusive OCD like thoughts using the four steps, and I’ve broken the cycle of shame surrounding the behavior. \n\nI finally feel validated and heard, and it’s been an unbelievable gift. I’m asking my doctor for a referral to a psychiatrist- and for the first time ever, I don’t feel crazy anymore.\n\nPs: there are free versions of the audiobook on YouTube!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mylvz1/i_finally_found_a_book_about_cognitive_behavioral/", "title": "I finally found a book about cognitive behavioral therapy that has given me a new lease on life", "social_network": "reddit", "user": "Gorl08", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1537, "down_vote": 0, "creation": 1619398197, "permalink": "/r/DecidingToBeBetter/comments/mylvz1/i_finally_found_a_book_about_cognitive_behavioral/", "nsfw": false, "first_save": 1635436829.1759925, "replies_charged": false}