{"id": "t5_2tand_t3_jenmct", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I have ADHD, which means that maintaining a task beyond the \"interesting stage\" is very difficult. It means I've struggled with binge eating, an alcohol habit (not addiction, but a bottle of wine every night), and generally flaking and failing at any goal I ever set for myself.\n\nSince May 2020, I utilized being jobless during lockdown to do better. No more \"I am gonna do THE THING and never, ever slip up again!\", because I would always slip up, and hate myself so, so much. Here's what I did.\n\n**No more beat-ups: If I messed up, I learned. It wasn't a failure, it was a hiccup.** This attitude helped me to realise that it's not the apocalypse if I miss a day, or don't do enough of something on one day. It helped me start again tomorrow where I left off.\n\n**Literal baby steps. No more big changes.**\n\n* I've gradually cut my 7 bottles of wine per week down to a successful 3-4 bottles a week - over 6 months. This - as the start of my diet - has seen me lose 3lbs in two weeks \"without trying\". Gradually, I'll cut it down to 0. But right now, it's working.\n* I read exactly 5 pages of a novel each day, and that way I don't burn out. I used to try and \"read more\" by reading 100 pages in a day, but by day four, I'd quit. I'm about 160 pages into this book, and still going.\n* I'm learning piano. Original goal? 2 hours a day. I didn't play for three months. Now? I play daily, but only learning 1 bar of a piece every few days, and then just playing what I know through. Yes, I could learn quicker, but at least I am learning and sticking.\n* Early starts. I wanted to treat my day like a work day despite being out of work, so I set alarms. First 9am. Then 8am. Then 7:30am. Then 7:00am. Then 6:30am, and finally 6:00am. I wake without issue now and only lie-in occasionally.\n\n**I make lists, and I stick to them religiously**\n\nI put *everything* on that list, from \"brush teeth\" (ADHD makes it easy to forget), to \"do dishes\", to \"read 5 pages of book\", to \"learn 1 bar of piano piece\". I get immense joy out of crossing everything off that list, and then being able to just sit and vegetate, or let my ADHD run wild with agitated boredom.\n\n**I got a sort of \"sponsor\"**\n\nYou know how AA people have a sponsor they can call when they want a drink? Well I have a fellow ADHD friend who, when I want to quit a project for the 100th time, I call them and they tell me why quitting is a horrible idea, and it helps me to realise the scope of quitting and starting over, compared to just taking a day off and going back to it tomorrow.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jenmct/heres_what_helped_me_when_i_kept_failingnot/", "title": "Here's what helped me when I kept failing/not following through", "social_network": "reddit", "user": "Ratio_Administrative", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 44, "down_vote": 0, "creation": 1603193307, "permalink": "/r/DecidingToBeBetter/comments/jenmct/heres_what_helped_me_when_i_kept_failingnot/", "nsfw": false, "first_save": 1635437557.365824, "replies_charged": false}