{"id": "t5_2tand_t3_ii4bmx", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Hi my name is C_______.\n\nI’m addicted to sex, I am a habitual/pathological liar, & I’m trying to come back from being a piece of shit person. I lie in relationships when things get tough & I get so scared I’m like a frazzled chihuahua who can’t even speak. \nToday at 7PM I am going to tell my bf that I have cheated, I’m addicted to sex, & going to tell him the whole truth & nothing but the truth. \n\nI don’t know how I got here. I know I was raised that little white lies are okay & as I’ve gotten older, I would speak w/ my parents & my mom would encourage the lies b/c they had reasoning behind it. “Don’t hurt their feelings”, “just say youre busy, they don’t need to know everything”.\n\nI started a really hard vigorous program this year in January. I’ve been nothing but stressed & I use sex as an outlet. My last affair was a couple weeks ago drunk & I made decisions I shouldn’t have. \n\nI use sex as a way to de stress but I cannot always get it from the man I love. I know ppl will say that if you love someone you wouldn’t be doing the things you did. It’s an addiction. There’s no excuse for me. But I would reason b/c I never had feelings for the others, it was fine. Just a hit it & quit it. \n\nThe first step I did yesterday was admit to him that I have a problem & im a pathological/habitual liar. \n\nI can’t expect him to stay, I can’t expect to understand. He says he does. Realizing how i can easily lose him is frightening. I haven’t loved someone this intensely & passionately & have true love since I was married. But I made grave mistakes. I understand if he leaves. To whatever power out there, please don’t let him leave but I get it if he has to. \n\nI need to shut my emotions off to tell him the truth. I don’t want to. But I need to. I owe him the truth & nothing but the truth. \n\nStep one: I admit i have a problem. \nStep two: This morning, I cut off contact w/ all ppl (which is 3).\nStep three: tell the bf the truth. \nStep four: face the consequences, cry it out, & focus on what needs to be done. \n\nI have never been so terrified in my entire life. I have never been so terrified that I am nauseous & got nervous bowel movements. I’m so sure I’m going to lose the man of my dreams, someone who I thought could never exist. I take it all back. I wish I never did anything. I was weak minded. Scared to lose the financial security I was getting since I was giving sexual favors. \n\nBut I need to get better. I need to schedule an appointment w/ a sex therapist & a regular therapist & become better. I have to do for myself. \n\nI’m taking the first step you guys. I know a shitty person. But for the first time in my life, I’m accepting responsibility for my disgusting actions in a relationship. I’m trying really hard. Just wanted to tell someone. \n\nI’m trying. \n\n\nAlways be truthful! No matter how hard it is. It will save you more in the end. \n\n(If this doesn’t follow the rules please let me know & I’ll remove. Also typed this on my phone if that changes anything.)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ii4bmx/being_truthful_is_hard/", "title": "Being Truthful is Hard", "social_network": "reddit", "user": "shewlf31", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1598608867, "permalink": "/r/DecidingToBeBetter/comments/ii4bmx/being_truthful_is_hard/", "nsfw": false, "first_save": 1635436516.854027, "replies_charged": false}