{"id": "t5_2tand_t3_nscrup", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I tried to keep this as short as possible but it's still a pretty long post. Sorry for that.\n\nJust a quick background on my relationship with her: we first started dating around 3 or 4 years ago, I broke up with her twice and she got back with me twice. The third time we dated is the period to which I will be referring to in this post.\n\nThe third time we started dating, it went well for the first 5 months or so. I was putting in effort to show her that I had changed from the last time I broke up with her, we were going on dates, hanging out, etc. After those 5 months, my destructive qualities took the forefront once again. I gradually stopped giving her attention, acted like I was tired on days that I actually wasn't so I wouldn't have to talk to her, kept forgetting important things she would tell me, and stopped making attempts to hang out with her. These are not excuses for my shitty behavior, but I also had other external issues that were affecting our relationship, such as my addiction to pron and severe anxiety.\n\nI was always aware of the asshole I was being to her, especially after I tested positive for HSV-1, which I had most likely gotten from my time sleeping around in college during our breakup periods. I never knew I had it until I first developed cold sores about 2 months after we started dating for the third time. I knew it was morally wrong to withhold that information from her, but I was scared of how she would perceive me and the actions she would take. I always tried to avoid her whenever I did have cold sores to prevent her getting it from me, but I knew even without cold sores, I was putting her at risk anytime I kissed her. I think at the time I found out about the herpes, I also felt it was unfair to me that I got it and never knew who it was from, so I tried using that to justify my silence to her. On a movie date we went on, I ordered one drink for the both of us and subconsciously was thinking about the herpes, so I asked if she was okay with sharing one drink, and she jokingly asked if I had herpes. I panicked and lied to her.\n\nI knew that eventually I was going to have to come clean about everything going on with me if I wanted to stay with her, but I never did until she finally got fed up with my complacency and decided to end things; when she did call for the conversation to break up with me, that's when I unloaded everything onto her at once. We went on a walk and she seemed alright when telling me that she wanted to end things, and perhaps she wanted to see if I still cared about the relationship. I told her I knew what a selfish asshole I was being to her, about my pron addiction/anxiety, and she didn't seem too affected by this information, but once I told her about the herpes, the whole tone changed. She asked me to shut up and for the rest of the walk back to her place we didn't talk. When we got back she told me to delete her number and never contact her again before entering her home, leaving me with the most sickening feeling in my stomach that I can still feel while I write this post. Obviously, she blocked me on everything. This all happened just a few days ago.\n\nIt wasn't until after that I truly understood the gravity of the type of person I've been. I realize now more than ever that I have been narcissistic and selfish, not even just to her, but to my family and friends. I only ever cared about what people thought of me, so much so that almost everything I've done in my life has been to please people and receive their attention/validation. While I was dating her, I actually had the mindset of, \"Her, leave me? Yeah right. If anyone would ever leave in this relationship, it would be me.\" I did, twice, and she took me back after breaking her heart twice, yet I still had that mindset even during our third time together.\n\nShe was the most loving, caring and incredible person I ever had the opportunity to get to know and I have cried both days since she ended things because of how I completely trashed our relationship. Do not get me wrong, I am not trying to draw pity from you guys or shift the blame to anyone or anything else; I know that as much pain as I am feeling, she must be feeling 10000 times worse, and all of this pain was brought about my my selfish desires and actions. I know I need to respect her wish for me to never contact her again, but I still have so much to say to her and I'm so regretful on the way I left things. Its not even like I want to beg for her forgiveness or ask for another chance, I just want to be able to try to clean up a little of the enormous mess I made, but maybe even that is my selfish nature coming through.\n\nHow can I ever live with myself knowing the terrible things I did to her? How can I be less selfish and stop ruining the lives of the people closest to me?\n\nI am willing to listen to any advice you guys may have for me, no matter how scathing or raw it may be. I am tired of my destructive personality and never wish to hurt someone the way I did her ever again.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nscrup/i_21_m_was_selfish_and_destroyed_my_relationship/", "title": "I [21 M] was selfish and destroyed my relationship with my girlfriend [19 F]", "social_network": "reddit", "user": "pleasehelpme12358", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1622833558, "permalink": "/r/DecidingToBeBetter/comments/nscrup/i_21_m_was_selfish_and_destroyed_my_relationship/", "nsfw": false, "first_save": 1635436024.4036016, "replies_charged": false}