{"id": "t5_2tand_t3_eb0h10", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I've been lurking around this sub for a while and decided that I wanted to share something that might be helpful to some. I've never been a great writer, but it's something I've been trying to improve on. I felt that sharing is the next step in my progress.\n\nThis is an personal piece of my struggles and what I have been doing to try and conquer what was a big fear of mine. \n\n\nI always thought of myself as a complete failure in life. I wasn’t great in school and I barely graduated. I dropped out of college twice and changed my career path several times. I constantly doubted myself in all types of situations. I tanked my credit from careless spending. I drank, smoked, ate like a 5 year old with no supervision. I was a mess and scared everyday. \n\nI was scared… of meeting new people, voicing my opinion, checking my credit, calling someone back I should have called a week ago, everything. It was endless. The common denominator behind it all was that I was afraid of failure. I failed so many times in my life that I didn’t know anything else. It was like the boogieman to me. I would avoid things just so there was no opportunity for me to fail. It was toxic to everything in my life.  But then something changed.  I decided to take inventory of my life and look at what I needed to do so that I didn’t see myself as a waste of life.  \n\nI had to fix my credit, pay off debt, hit the gym, quit drinking and smoking, eat real food. It was a lot and I had to find a way to conquer each one.  In the end I chose to step outside my comfort zone and say, screw it.  \n\nI learned to fail without feeling so self-conscious about it. I chose not to care what other people thought. To me, failure is the best teacher I have. It doesn’t matter what I read, watch, or listen too. Nothing gives me a better lesson than when failure.  I never really conquered my fear though. I learned how to handle it. Without fear I probably wouldn’t have learned as much from my mistakes and  wouldn’t have taken the proper steps to correct them. I learned to be better prepared and build good daily habits. I learned to set goals in a way that failure isn’t a possibility. I focus on what’s important and if I fail, I’ll pick myself up and try again. \n\nI decided to do better and It has been working in my favor ever since.  I’m still far from where I want to be, but everyday I’m grateful that I decided to try.  And now that I started to frequent this subreddit, I’ve begun to notice familiar stories.  It’s just my opinion that the fear of failure and lack of successes kill motivation, the drive we need to move forward.  But if I can help one person in this sub commit to taking it one day at a time and see failure in a positive way then I will be happy.\n\nI’ll end this with tips that can make moving forward a little easier.  Some of these I’ve taken from others and changed some to fit my lifestyle and mindset.\n\n1. Keep a calendar -- I use google calendar for my work schedule, client meetings, personal and family events, and birthdays. For a more detailed daily schedule I’ll use a bullet journal. I keep it super simple and don’t dress it up at all, but you can check out r/bulletjournal to see how others use it. I’ll include specific times for where I have to be, to do lists, brain dumps, and other things I may need to remember.\n\n2. Create a solid nightly habit -- Everyday I do the same things before I go to bed. I prepare the coffee machine, and I create my detailed schedule for the next day, that's it. Even on my days off I’ll do this. I wanted to keep it simple but effective. The more I included in my nightly routine, the less often I felt like doing it.   It makes me feel more productive and motivated to conquer the day ahead.  \n\n3. Get more sleep -- I struggle with this the most. Some days my work schedule has me up by 4am and in bed at 11pm.  Some days I’ll be able to get a nap at some point, but most of the time I’m getting very little sleep.  Sleep is vital to all of our lives and the less you get increases the stress hormone, cortisol.\n\n4. Be consistent --  If can make your schedule as consistent as possible, do it.  People are naturally consistent, both in a positive and negative way. We become consistent in our good and bad habits.  Now it’s time to stay focused on the positives and build on those consistent habits. Gym, work, studying, chores. Set a specific time to do them and get it done.\n\n5. No more negative mindset -- Have you ever heard that saying, “if you tell a lie long enough, you’ll begin to believe it”?  It’s the same when we tell ourselves that we suck. Morning affirmations can help create a positive mindset.\n\n6. Take it one day at a time -- Sometimes the thought of what we have to do is enough to raise your anxiety levels, but you need to take it one day at a time. Break your goals up into weekly or daily tasks that work towards your big goal.  Check out [SMART goals](https://en.wikipedia.org/wiki/SMART_criteria)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/eb0h10/my_fear_of_failure_and_rejection_would_normally/", "title": "My fear of failure and rejection would normally keep me from posting any of my writing, but I'm trying to improve my writing and think this will help. I'd like to share something that helped me deal with failure and how it may help others.", "social_network": "reddit", "user": "double_chicken", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 36, "down_vote": 0, "creation": 1576425183, "permalink": "/r/DecidingToBeBetter/comments/eb0h10/my_fear_of_failure_and_rejection_would_normally/", "nsfw": false, "first_save": 1635436528.5624108, "replies_charged": false}