{"id": "t5_2tand_t3_kjia1g", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "24.12.2019 (A year ago) I came back to India from England with a massively torn heart and a what felt like a failure. \n\nTo say, I was at my worst would only be an understatement. \n\nI was broken, shattered and ashamed. \n\nI carried very heavy emotions in my heart of pain and regret. \nso 2019 was a traumatizing and soul wrecking year for me, a year I'll never forget. \n\nI was fortunate to have few friends who were literally my back \n\nIn 2020, I told myself ' I'm going to use this pain.. each day.. \n\nIt was hard to get up in the mornings and face the same reality every day and every moment, but. somewhere in my heart, I knew I didn't want to ruin myself or my life. I couldn't do that. \n\nI still face the flashbacks from the day... but I always chose to find meaning behind this pain. I become very very depressed thinking about it , but, I always reminded myself 'no Pranati,.. zindagi theek karni padegi '\n\nSo each day I had to make a choice, to use this pain for my greatest fulfilment. Well, I didn't only have pain..I also had immense anger within me. \n\nOn top of that, I had gained good 5-6kgs of weight in 2019. \n\n I hated myself even more now.\n\nEverything seemed against me. \n\nBut I always kept reminding myself of the choice that I still have. \nI didn't want to be a weak poor woman.  \n\nI had enough of dealing with life this way. \n\nOf being small, scared and weak.\n\nI started taking small steps like..\n\nI started running :) and so far since June-July, I have covered 255kms of running. \n\nI started cycling and since July, I have covered 920 kms of cycling.\n\nalong with daily 1 -2hr  tennis since September, 2020.\n\nI lost 6.6 kgs of weight :) :D the body is a lot more muscular now :)\n\nI eat healthily and have given up eggs and chicken for the love of animals. I plan to embrace full veganism from Jan 2021.\n\nIn the month of November, \nI participated in 2 cycling events of 20 and 25kms each.\nand 1 running event called as Streak Week in which you maintain consistency with running each day for 3kms. (16-22nd nov) which I completed today.\nI continue to participate in more such events ( upcoming 5kms running Nov 26th, Dec 18th Run-5kms, Dec 25th-27th- Run 5kms).\n\nThereafter, I also started working on my own research papers. \n\nToday, i.e 24th Dec, 2020\nI have 2 research manuscripts as a first author that will soon be submitted for publication. \n1 publication as a second author with Cureus Journal of Medicine. \n1 manuscript submitted to the British Journal of General practice, in which I'm the 4th author amongst 15 researchers as a part of research assistance in the University of Southampton, UK project.\n\nI hope to see 4 min publications next year, 2021.\n\nWorked as a voluntary research assistant on University of Goethe, University of Cape Town and BITS-Pilani for the Indian chapter.   \n\nMost importantly, I hold a PhD offer letter from a University in the U.K. \n\nWe also have a new addition to our family, Helga :) the golden retriever pup :) Chiku, the rabbit came to our lives in the month of July.\n\nIt is my dream now to run the London Half Marathon and then London Marathon before I turn 30. \nI hope to be a financially independent, strong woman, a woman who is extremely physically healthy and someone who has a very strong mind and most importantly, as someone who loves and respects herself a lot.\n\nI want to live life on my own terms.  Not get married soon or have children  :p (traditional life).  I also want to travel the world and do a lot of public speaking :) \n\nBesides these things, I want to have lots of animals esp bunnies to take care of and dogs and cows. I want to live in the mountains or somewhere very peaceful and serene. I want to eat healthily and have only good thoughts in my mind. I want a beautiful mind and a healthy body.\n\nIn the end, I want to say that this post is not a success story and I still have a long way to go. \n\nThis post if at all, means anything \nThen I want to use it as a reminder to anyone who is in pain. \nI still haven't recovered fully, maybe it will take years but I want use this post to remind you \nthat please please please love yourself. work hard on your goals,. focus on yourself and be there for yourself\nhave dreams. work hard on them\n\nYOU ARE THE MOST IMPORTANT PERSON !!!!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kjia1g/to_a_life_of_self_regard/", "title": "To a life of self regard", "social_network": "reddit", "user": "willtomeaning", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1608827691, "permalink": "/r/DecidingToBeBetter/comments/kjia1g/to_a_life_of_self_regard/", "nsfw": false, "first_save": 1635436628.4701042, "replies_charged": false}