{"id": "t5_2tand_t3_fylj26", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "Hi everyone!\n\nI've been lifehacking my life over the last 20 years to improve my life and myself. In many ways I think I've done quite well in terms of career, personal development, relationships and so forth. I dedicate the success to hard work, discipline, curiosity, growth mindset and all the other things you would expect from a high performing individual. However, I find it really hard to find the balance of acting with high potential and resting.\n\nI am probably the worst person in the world at doing nothing, resting and taking it easy. Sometimes when Ive pushed myself too hard my body forces me to rest (becoming sick), but it's usually at a point that is past of what is sustainable and healthy in the long run. It is as if something inside of my is constantly in need of doing things, and when I stop - I feel uncomfortable.\n\nI've done a lot of thinking, meditating and reasoning with my therapist around it and my current understanding is that is has to do with me equating results in the other world with self value. But even with that knowledge I find it almost impossible to relax and let myself rest. \n\nAnd at times when I do actually rest, it usually goes to the extent that I feel fear over going back to high performance since it might lead to a burnout or similar. So then it becomes unbalanced in the other direction.\n\nSo... How do you find the balance between performing at your highest potential and taking time to rest?.\n\nAll advice would be highly appreciated!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fylj26/how_do_you_find_the_balance_between_performing_at/", "title": "How do you find the balance between performing at your highest potential and taking time to rest?", "social_network": "reddit", "user": "grollens", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1586543278, "permalink": "/r/DecidingToBeBetter/comments/fylj26/how_do_you_find_the_balance_between_performing_at/", "nsfw": false, "first_save": 1635435250.0342705, "replies_charged": false}