{"id": "t5_2tand_t3_oowqwk", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "*POTENTIAL TRIGGER WARNING: TALKING ABOUT WEIGHT, CALORIES, POTENTIAL ED TRIGGER*\n\n\nHi everyone, I'm Cherry (17F).\nI have crohn's disease and am currently being treated with long term with steroids, of which the side effects include swelling of the face, weight gain, mood swings, etc.\n\nI didn't think I would have this issue, and continued to eat healthy (in fact, maybe not enough since I am eating around 1400 calories per day), and exercising for at least an hour each day, if not two hours such as yoga, volleyball, cardio, weights, etc.\n\nWhile I worked on improving myself, my weight kept climbing. My face is completely round and swollen, my thighs are covered in big purple stretch marks, my belly is soft, my chin got way fatter, no matter how I look at it, none of my work is paying off because of this damn medicine.\n\nIt's not even helping to control my Crohn's symtpoms, and I'm waiting on new medication, but I have to finish the steroids.\n\nI'm just so incredibly frustrated and upset, especially because the people around me keep pointing out how I look.\n\n\"Oh, your face is so round!\"\n\n\"Oh, you have stretch marks.\"\n\n\"You look like you gained weight. How much do you weigh?\"\n\n\"You were so skinny before!\"\n\n\"Maybe you shouldn't eat that *insert dessert* if you're so upset about it.\"\n\n\nWhat am I supposed to do? I feel so alone in this and I'm struggling.\n\nDo you have any advice for me?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oowqwk/no_matter_what_i_do_im_not_making_progress/", "title": "No matter what I do, I'm not making progress", "social_network": "reddit", "user": "-INKGHOST-", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1626894639, "permalink": "/r/DecidingToBeBetter/comments/oowqwk/no_matter_what_i_do_im_not_making_progress/", "nsfw": false, "first_save": 1635438244.5038996, "replies_charged": false}