{"id": "t5_2tand_t3_mbwca5", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "[Day 37] - I had an interview the next day and i was not able to sit and study. I started watching YouTube since morning and couldn't stop. It was like I was trapped and i was crying out of helplessness. I struggled whole day to began studying but i found myself wasting time on my phone. It was around 9 PM that i finally sat down to study and studied till 11PM.  Put an alarm for 2AM and slept. \n\n[Day 38]- I woke up at 2AM but kept on lying and slept again. Did the same at 3AM too. Finally I forced myself to study at 4AM. Studied till 5:30AM  and then slept again. It was like I was fighting myself. I was thinking of not giving the interview ( last week I missed one interview like this) the stress of interview and pressure of not preparing for it was nudging me not give it. I woke up at 7AM again and felt this intense stress. I broke down and thought of not giving it and watching YouTube whole day and eating junk. In that moment I was kind of convinced that I was doomed and I can never get out of this shit. \nBut then there was this other voice that was telling me to not destroy myself like this. That voice was showing me  all the past instances  where I had excelled under pressure and not given up. I literally fought myself and started to study at 8AM and studied till 9AM. Then I was getting stressed again and wasted time till 10AM. But then again I was like  I am not going to die  by giving this interview and all this pain and stress will end after I gave the interview  but if I didn't give the interview then I have to carry this pain for God knows how long and it will be a sign of my weakness. It Will remind me how weak I was and  that I gave up. I started to study again and studied from 10-11AM.\n\nAfter all this I was feeling relaxed, I don't know how that happened but suddenly I was very peaceful and calm. Interview started at 11:30AM and I was able to answer most of the questions. It was my luck that they didn't ask me questions from areas I hadn't prepared well. It went very well and soon after the interview got over i felt this intense wave of happiness and respect that i couldn't express here. I was smiling like I had won a war or something. I was feeling so good that I can never forgot that feeling. \n\nAfter that I made a to-do list for myself with 7-8 task from studying to filling form to making strategy for upcoming exam to book Mock interview for tomorrow. \nI was so engrossed in working that I didn't care about phone or whatever. I completed 95% of my to-do list for the first time in my life and slept at 1:30AM with a satisfaction that I can't describe. I am not going to lose control over myself now. I will hold onto this person that I am now. \n\nI hope you guys are taking care of yourself and remember don't give up. It's a fight and just because you are punched down doesn't mean you should stay there and accept your defeat. Get up and punch back 👊👊👊👊👊.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mbwca5/day_37_and_38_of_167_days_of_changing_my_bad/", "title": "Day 37 and 38 of 167 days of changing my bad habits. [ Milestone⚡⚡]]", "social_network": "reddit", "user": "learner_55", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1616556186, "permalink": "/r/DecidingToBeBetter/comments/mbwca5/day_37_and_38_of_167_days_of_changing_my_bad/", "nsfw": false, "first_save": 1635438112.5924056, "replies_charged": false}