{"id": "t5_2tand_t3_lvwhza", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I sometimes have an issue with how we view emotions.\n\nIt's true, we have \"negative\" and \"positive\" emotions, and for obvious reasons, we like the positive ones more.\n\nBut negative emotions get a bad rap. Yes, they feel bad (by definition), but I wonder how many of us stop and think about why we have them.\n\nOur bodies and minds are amazing. They have developed over countless years to help us function, even thrive, and this includes those so-called negative emotions. Physical pain is not a pleasant experience, but we don't doubt it's utility. Instead, we listen to it and respond: we rest or we heal or do whatever our body needs to recover. And yet when it comes to feelings, we do almost the exact opposite: We ignore them, pretend they're not there, distract ourselves, even lie to ourselves and deny them outright.\n\nBut what if we looked at our negative emotions in the same way we look at physical pain? What if we recognized that they are part of a warning system, a system our minds and hearts use to communicate with us, hinting or even screaming at us \"something is not right here\"?\n\nIn essence, just because something feels bad doesn't necessarily mean it is bad for us. I'd like to ask that we all be a little more curious and even more self-compassionate, and maybe say to ourselves \"I'm angry/sad/anxious/worried/bored now (or even just \"I feel bad\"). I wonder why?\"\n\nPlease feel free to share your thoughts, questions, even disagreements or critiques. I'm here to learn. :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lvwhza/bad_feelings_get_a_bad_rap/", "title": "Bad Feelings get a Bad Rap", "social_network": "reddit", "user": "LCBrianC", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1614670100, "permalink": "/r/DecidingToBeBetter/comments/lvwhza/bad_feelings_get_a_bad_rap/", "nsfw": false, "first_save": 1635437669.9553092, "replies_charged": false}