{"id": "t5_2tand_t3_8qurb1", "request": ["9ad14901-6d2f-44f9-8b16-48a4f40b66ab"], "text": "Like most, I cared a little too much about what people thought and feared rejection. It’s something I always wanted to change about myself but never really committed to fixing. I discovered something called the Rejection Challenge which was designed to eliminate this fear. What you do is go out every day for 100 days and ask strangers silly questions until you’re turned down. Once you get a rejection you’ve won for the day and can chill till tomorrow. Apparently after 100 days you’ll be so numb to the idea of being rejected (asking a girl out, asking for a raise, speaking up to the idiot who just cut in front of you in the queue) that you’ll be brazen, raggo and assertive for evermore.\nThe second I heard about this felt the pit of my stomach turn to frozen ice with a sharp fear that let me know I had to give it a try no matter how uncomfortable it might be. For 3 solid months I faced a different type of rejection every day every day to completely eliminate my fear and trust me, it was as nerve wracking and harrowing a journey as you might imagine. Also; this challenge was originally posted on an internet forum so if you see me making references to the people who were a part of said forum then realise that you’re not losing your mind. I’ve just reposted it to keep all my content in one place. \n\n**I KNOW I’VE THROWN AWAY THE CIGARETTE YOU GAVE ME BUT I WANT ANOTHER ONE**\n\n**[challenge selfie](https://s33.postimg.cc/48cq9mrwf/6_C31870_F-_D8_C6-495_D-927_C-81_D0_EC11_D0_C9.jpg)**\n\nSet to purpose by the ever friendly yet morally bankrupt Alastair Patterson, I found myself trawling the streets of London on my lunch break in search of someone with a cigarette. 2 minutes into my quest, I spied a young guy in his late 20s minding his own business while puffing on death sticks and asked him if I too could have a fag to slash 5 minutes off my own lifespan. He proceeded to roll me one and while doing so, engaged me in friendly conversation before proudly presenting my rollie and flashing me a beaming smile. I took his rollie, smiled, thanked him and casually flicked it away all while looking him dead in the eye before saying ‘Cheers, can I have another one?’ He got visibly nervous at this point and asked me to repeat what I’d said so I told him in no uncertain terms that I wanted him to roll me another death stick, post haste.\n\nHe got genuinely uncomfortable when I said that so I chose to break character, tell him about the rejection game and give him a brand spanking 10 pack of B&H Silver for being a good sport. He burst out laughing, smiled, took a selfie with me then went on his way.\n\n**EPIC SUCCESS**\n \n**CAN I HAVE SOME OF YOUR CHICKEN?**\n\nI wasn’t too sure how successful my first approach was in terms of my being actually rejected so I decided to dive back in right away. This time I saw a smartly dressed gentleman snacking away on some tasty smelling chicken while sat on a park bench. I approached said gent and asked if he would be kind enough as to let me take a bite of that sweet smelling poultry only to have him laugh right in my face and say ‘Yeah mate, you’d be lucky!’ I pressed the situation further, informing him that people like me go gaga for that delicious bird and that it was his duty as a good human being to let me at least try a bite. Sadly, this dude wasn’t buying what I was selling and simply told me to ‘jog on’, which is exactly what I did. I thanked him, shook his hand, turned around and skipped away down the road.\n\n**EPIC SUCCESS**\n \n**THOUGHTS**\n\nI know I’ve gone a bit back and forth with this but I think this is definitely getting easier. These two approaches would have been difficult for me to do at the beginning but I hardly felt anything today. I did feel a slight twinge of anxiety but it was really mild and barely anything worth noting. I was also much more comfortable with hanging around and talking to both guys even though I knew they probably thought I had a screw loose. \n\n\n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8qurb1/can_i_have_another_cigarette_100_days_of/", "title": "Can I have Another Cigarette? - 100 Days of Rejection - Day 11", "social_network": "reddit", "user": "Ciaran_Callam", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1528914387, "permalink": "/r/DecidingToBeBetter/comments/8qurb1/can_i_have_another_cigarette_100_days_of/", "nsfw": false, "first_save": 1635435312.701662, "replies_charged": false}