{"id": "t5_2tand_t3_4zncdj", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "I don’t know why I’ve always liked the service industry. It’s not like I enjoy the work or the customers.\n\nI don’t really enjoy the people I work with either, don’t get me wrong, I think they are fine enough as humans but when it boils down to overall appreciation that isn’t much to go on.\n\nThey’re the greedy type. It’s not that they really mean to be but fate forces a hand. Bartenders and servers do nothing at all really, a crime I’m often guilty of but I shrug it off. I wish I could explain why there is that sense of superiority that we all hold over support staff but it really is just how it is.\n\nMy job is this weird nebulous cousin that I hate but at the same time can’t help but love. It’s’ annoying as all get out but there is a certain charm in the personalities it brings. I guess as is true with everything else, people are retardedly unaware of the good in their life.\n\nI wonder why that is. Not just in the precarious situation I currently find myself in, being broke, homeless, etc. Maybe it’s these changes that make me really admire the people who don’t take everything for granted. People that know they have it good even when they don’t. \n\nI’ve never had less and for some intangible reason never had more. I think I’ve changed. That was never really my plan to begin with, but I didn’t really have a plan at all. I just sort of winged it and hoped for the best.  And I think I got it.\n\nThere have only ever been a few times in my life that my constant habit of lying for no reason and only telling half truths have benefited me. I think this might be the best one though. I took something away from my stupidity this time, I actually learned something. \n\nI know now that no matter what happens I’m going to be okay. It’s bearing a lot on my friends and their help but that’s something I did too, without knowing it. I can do this. I can be happy. \n\nI don’t have any money, no bed, no sense of direction. But I do have one thing.\n\nI have hope.\n\nAnd for a long time that has been elusive. \n\nMaybe I’m looking at this wrong and I’m actually in trouble but I don’t think that’s the case.\n\nI think for the first time maybe ever I feel free.\n\nI feel like I can do anything.\n\nI feel happy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/4zncdj/the_little_things/", "title": "The little things.", "social_network": "reddit", "user": "Alfidtot", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1472195089, "permalink": "/r/DecidingToBeBetter/comments/4zncdj/the_little_things/", "nsfw": false, "first_save": 1635435844.375433, "replies_charged": false}