{"id": "t5_2tand_t3_o2a16q", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "For years, I have been struggling with seasonal depression and anxiety (usually triggered by the presence or anticipation of weapons). I kept putting off looking for a therapist because I’d hit rock bottom, then find my way out and convince myself it wouldn’t happen again. I did attempt to seek a counselor in undergrad, but by the time they got me on the schedule, I was feeling better. I also did one consultation a couple of years ago at a local behavioral health center, but I found the therapist challenging to relate and disclose personal feelings and thoughts to, so I left feeling hopeless.\n\nThis year, my best friend of 20 years moved from across the street to Florida, my boyfriend was sent on his first deployment overseas, and my other best friend will be moving to Europe in a few months. Needless to say, my mental health plummeted and I slipped into a very steep depressive state. I knew I needed help and took the steps to apply for counseling through my EAP. Once I got the acceptance, I found it really difficult to make the effort to research different counseling styles and submit multiple intake forms and emails. I wasn’t receiving any responses from the counselors I was interested in for weeks and I felt discouraged.\n\nToday, one of the original therapists I emailed responded back to me and after chatting back and forth a little about insurance and availability, I made my first appointment. Just sharing because I’m proud of myself for finally committing to improving my mental health.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o2a16q/i_scheduled_my_first_therapy_session/", "title": "I scheduled my first therapy session.", "social_network": "reddit", "user": "Chic_Nugget", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 90, "down_vote": 0, "creation": 1623969838, "permalink": "/r/DecidingToBeBetter/comments/o2a16q/i_scheduled_my_first_therapy_session/", "nsfw": false, "first_save": 1635437505.6774387, "replies_charged": false}