{"id": "t5_2tand_t3_crdk93", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Before we took a break from our relationship I was always afraid that I would be miserable without him after being inseperable for 4 years and 10 months. Fortunately I was wrong.\n\nI decided first I was gonna go for a stroll around at that books sale near where I work and maybe get some books for myself. If I were with him that time I would’ve worried about taking too long choosing which to buy. But I was alone so I was able to take my time and drown myself in all the sypnosis and page skimming of all I was able to get my hands on.\n\nAfter I got some books and did some damage on my wallet, I went to a poetry night at a coffeeshop which I always wanted to do. If I were with him, I would’ve worried if he were going to enjoy it, would he have found it too corny? Was it too late at night already? I didn’t need to think of those things last night. \n\nAs I listened to the performers in that poetry night, I was in awe of how they turned their pain into something beautiful. Of how, if taken cared right, that poem they made could outlive them. \n\nI came home feeling inspired. I couldn’t stop smiling. I remembered how I used to write poetry and all the other hobbies I had forgotten and how I’m able to have time to do them again now.\n\nThis is what I learned. Other people are not responsible for my happiness. I am responsible for it. Any other relationship I have or will have, boyfriends, friends, even family, can be taken away from me. \n\nThe only relationship that no one can take away from me, the only one I have full control with, is the relationship I have with myself. \n\nAs I get ready for bed, I think about all the dates I’ve yet to take myself to, I couldn’t help but get excited. There’s so much more to life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/crdk93/i_took_myself_on_a_date_last_night/", "title": "I took myself on a date last night", "social_network": "reddit", "user": "mikeemouse03", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 878, "down_vote": 0, "creation": 1565994544, "permalink": "/r/DecidingToBeBetter/comments/crdk93/i_took_myself_on_a_date_last_night/", "nsfw": false, "first_save": 1635436633.6949403, "replies_charged": false}