{"id": "t5_2tand_t3_pmviy2", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Some background first. While I don't suffer from any major anxiety or depression, covid did have an effect on me where I felt hopeless about everything. As a result I abused weed and porn a lot. Granted, I was still working, exercising and doing school while being high out of my mind (I don't mean to come off as bragging with this), I just became antisocial and reverted back to how I was in high school (quite kid, did his work, but didn't talk much). Also, weed reinforced a pattern of believing that my life was good enough and I didn't have to work harder than I currently was. This combined with porn just lead me to having no motivation to go out of my way to improve myself, especially in improving my social skills. \n\nI have since moved out of my parents place back to my university town as I felt the change of environment will force me to be more social and put more effort into my non-family relationships. \n\nI had a big realization yesterday, I was out with friends and we were just gonna party and mess around, but I had smoked weed prior to meeting up with them (just out of habit, usually I would smoke every Friday during peak-covid). Like I said earlier, weed makes me anti-social, I do not want to converse with new people and would much rather just be with friends and chill out. What was supposed to be a fun night out to meet new people turned into me just following my friends around acting like a bum. I then left my friend group and went to  park alone to smoke some more, and it really hit me. \n\nWeed did me get through some tough times, and I will not deny that it is a very fun drug, I had a blast just being with myself during quarantine. It also helped me pursue my passion for music more seriously, but my abuse of it has lead to my overall detriment. I couldn't deal with negative emotions on my own,  as I would turn to weed to just pass the time until I forgot about them. I relied on it to calm me down, only for my thoughts to start racing again when I wasn't high, thus leading me to smoking more and more. Even though I only smoke 1-2 times a week, those 2 days would start off great, but end off with me in a downwards spiral. So... I tossed all the weed I had along with the fancy lighters I bought into the garbage bin at the park. \n\nWith regards to porn, while I did abuse it during quarantine, it is just one of those things where after the deed is done, I feel like shit. While I don't abuse it now, I think it would be better off that I quit it altogether. It destroys my drive to pursue romantic relationships.\n\nFrom today, I will deal with my negative emotions on my own and break out of this cycle of reliance on weed and porn.\n\nTLDR; I abused weed, now I need to stop", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pmviy2/going_to_stop_using_weed_and_porn_as_a_crutch_for/", "title": "Going to stop using weed and porn as a crutch for even minor sadness", "social_network": "reddit", "user": "Sukhi099", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 67, "down_vote": 0, "creation": 1631462943, "permalink": "/r/DecidingToBeBetter/comments/pmviy2/going_to_stop_using_weed_and_porn_as_a_crutch_for/", "nsfw": false, "first_save": 1635435775.081965, "replies_charged": false}