{"id": "t5_2tand_t3_fxqmmy", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290"], "text": "Some people start establishing their life strategies (or, rather, things they call “a life strategy”) with goals setting. And this is a big mistake. First of all, we have to learn who we are, that is what our life destination is about.\n\nWhat are “goals”? These are our wishes, our dreams. Do all of them have to do with our genuine desires? Not always.\n\nA lot of us would like to be rich. And this is quite reasonable. We all tired of thinking of money – because there always not enough of it. It would be a miracle to wake up someday and to realize that we have more money we could spend. So, some want to be rich (or, maybe, everybody?).\n\nA lot of us want to be famous. It is certainly nice to see our faces on the covers of the magazines. Or, maybe, among the Top-10 stars of Instagram. It is nice when people adore you.\n\nSo, we are in a hurry to set a goal – to become rich and successful in, say, ten years. Of course, such a goal looks quite primitive, so we can set a goal like “to have MORE money than we do now, and be MORE famous and well-liked then we are.” Sounds reasonable? No way.\n\nWhile establishing our life strategy, we have to forget about the goals completely, at least for some time. We have to think of our destiny, and isolation is the best pretext or reason to do so.\n\nWho are you? What do you like to do most of all? What kinds of activities bring you more pleasure than anything else?\n\nFor instance, my list is: \n\n1. To write books (and I have written several of them)\n\n2. To write blogs (and at the moment you are reading one of them)\n\n3. To teach people – so before coronavirus, I used to be a lecturer and a business trainer, and I hope to become one again soon. \n\n4. To help people and businesses to find and establish new strategies.\n\nSo, who am I? I am a writer, a blogger, a lecturer, and a consultant. This is my destiny. Now I can set my long-term life goals. Such as: to be a successful (and rich – at least I hope so) writer, blogger, lecturer and a consultant.\n\nNow my goalsetting makes sense because I set my goals based on my destiny. Because the main life goal is not to be rich or famous. The main goal is to be happy. I doubt that my books or my lectures will bring me a fortune. But my goal is not a fortune. I am happy to be able to travel around the world and to live in my house in Ljubljana. I don’t particularly want to see my face on the cover of Forbes. All I want is to do things I love doing. If they bring me some money – it will be a good supplement.\n\nWhat is your destiny? What do you love to do most of all?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fxqmmy/life_strategy_is_not_about_goals_it_is_about/", "title": "Life Strategy is not about goals. It is about destiny.", "social_network": "reddit", "user": "sbiryulin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1586430908, "permalink": "/r/DecidingToBeBetter/comments/fxqmmy/life_strategy_is_not_about_goals_it_is_about/", "nsfw": false, "first_save": 1635436641.6123712, "replies_charged": false}