{"id": "t5_2tand_t3_pxub03", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "My boyfriend and I broke up after a year of considerations, pain, back and forth, and discussions. \n\nThe reason is that we are compatible in nearly everything, but not in the way we express love. He hardly touches me unless I go look for it, almost never initiate intimacy, never expresses his love vocally (e.g. no compliments because those would just fuel my insecurities and make me \"superficial\"). he says he can't do it, that's it's not his style. He's a loyal, kind man. I know deeps down he loves me, provides safety for me, and he's an intelligent, ambitious and responsible man. But i also know that for me touch and expressing love are crucial to be lovers and not just friends or roommates.\n\nWe have been together for 6yrs and i stayed even if i was missing those things because he's sincerely a good guy, didn't meet many before him, and everything else was there. \n\nit feels like a divorce. I'm an expat in his country and due to this my life is falling apart. Because he earns more he can now buy from me my half of the apartment we own and for me it will be tough (where we live is really hard to find rentals or buy when alone). \n\nMoreover, I'm 32 yrs old woman, which now lacks the hope that I can find someone else in time to truly get to know him and trust that i could have a family with him - which i really desire. \n\nIs it really true that people cannot learn to express love differently? He says he can't but i can't accept it..\n\nMy life is falling in pieces", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pxub03/starting_life_over_at_32/", "title": "Starting life over at 32", "social_network": "reddit", "user": "rapashrapash", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 616, "down_vote": 0, "creation": 1632918410, "permalink": "/r/DecidingToBeBetter/comments/pxub03/starting_life_over_at_32/", "nsfw": false, "first_save": 1635436944.0637867, "replies_charged": false}