{"id": "t5_2tand_t3_p7x2bl", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "5'9\", I used to be 170, got back down to 140-130ish and stopped counting calories. First time around I did it in a pretty unhealthy way, I just lost two pounds a week going down to 1200 calories whereas my minimum should have been around 1500 for a guy.\n\nPandemic hits, I balloon up to 174. I don't do anything but stress about it for two weeks. I try to start counting calories, it won't stick. I've done this before, what's wrong this time? I feel depressed, swim around in my failure for a while, and hate the shit out of my body. I weigh myself. Nothing's changed.\n\nI start looking at other people in the same process and it helps me get a grip. I start logging things in myfitnesspal before I'm allowed to eat them. I buy a craigslist treadmill for cheap and start couchto5k program, zombies run, listening to audiobooks while I'm on it. I don't eat back the exercise calories. Sometimes I screw up but that's what the treadmill deficit is for. If I eat out and can't log something I get as close as I can. I've definitely had two days where I just said \"screw it\" and ate what I wanted. And then I was back on it the next day.\n\nIt turned around for me. I'm down to 161 and it's easier than ever to hit my calorie goals, and I'm setting a new personal best every time I'm running. I put my runs in Smashrun and it feels really nice to see all of it there. \n\nMotivation did not come to me. I think that's maybe a myth, every time I waited for motivation I just had to do it even though I was completely miserable, and my motivation came from doing these things properly and not wanting to undo all the progress and work I put into it. I started weighing my food on a scale, which takes an extra 5 minutes per meal if I'm not eating something packaged, but it went a long way towards helping me not want to binge eat later because I already put in all the time and effort planning carefully.\n\nI think the thing that helped me the most was making these rituals pleasant. I didn't enjoy indoor running, so I gameified it, put on an audiobook, started logging miles and started a program. I did not enjoy logging food so I started playing music while I was doing it to make it less dull. I bought a box of cheez-its and said I'd only eat them if I was under at the end of the day to fill calories and I ATE THE ENTIRE BOX IN ONE SITTING so maybe that one was a mistake but the rest of it helped a bunch.\n\nI've got lots of other stuff to work on, my body's just one aspect. But it's helped me have the motivation and energy to clean up my surroundings, take care of my relationships, and has eased my anxiety a ton. I wish all of you the best of luck wherever you are in your journey and I'm cheering for you!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p7x2bl/running_and_counting_calories_to_lose_weight_and/", "title": "Running and counting calories to lose weight and what I've learned", "social_network": "reddit", "user": "HungryMoblin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1629443158, "permalink": "/r/DecidingToBeBetter/comments/p7x2bl/running_and_counting_calories_to_lose_weight_and/", "nsfw": false, "first_save": 1635435860.1495705, "replies_charged": false}