{"id": "t5_2tand_t3_nog25o", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Hello everyone,\n\nI am in a strange situation where I would like to ask for your opinion, I am afraid that I am an abuser. I am really confused.\n\nI met a girl last year, it all started as a nice friendship, we have several passions in common including Cinema, she is engaged and that was fine with me because I wasn't looking for anything more than a friendship, however we soon started watching movies together, after a while she started telling me how much she liked me, how perfect I was and that I was a really good person, she told me that she wished she had known me much sooner and that I would be her ideal boyfriend, I fell in love with her, I warned her right away as soon as I started to feel feelings for her, I was afraid she would pull away but I felt the need to do the right thing by warning her, she told me that it wasn't a problem but that she is in a serious relationship.\n\nFrom then on things went downhill, there were days when she would tell me how perfect I was and days when I felt she was more distant, this made me go completely crazy, the more she moved away the more I started looking for her and the more I looked for her the more she moved away, I started looking for her constantly, checking when she was online on whatsapp, checking Facebook, in March or so I was feeling really shitty and she was also always anxious I think because of me (she never said it explicitly), she told me to take a break and not to hear from her for a while, I violated the break several times by writing to her and telling her how much I missed her and at that point she told me that it was time not to hear from her anymore.\n\nI waited about a month without writing to her, then I asked her if she wanted to hear from me again, I told her that my crush had gone away and I believed that it had gone away, she said no and that she didn't want to pretend if she didn't even feel like trying.\n\nIn May it was her birthday and I wrote to her again, she replied that she thought about me and that maybe she just needed time, in all this I was trying to move on and stop feeling something for her, but writing to her was like starting all over again, I started checking her facebook again, now I have deactivated my facebook account because I find it really unfair that I am stalking her, This whole situation has made me have huge doubts about who I really am, one thing that sticks in my mind is when she told me that with me she felt like with her previous boyfriend who was an abusive person, I really can't understand why I'm so obsessed, it never happened to me to be so fixated on a person, I wonder if I'm exaggerating or if I have some problem, I should probably go to a psychologist. I feel very sad because really the last thing I want is to make her feel bad\n\nI really want to understand how to stop to be so obsessed\n\nExcuse my bad English, I need to improve it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nog25o/how_to_improve_and_not_being_an_obsessed_person/", "title": "How to improve and not being an obsessed person?", "social_network": "reddit", "user": "theMorfe", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1622395938, "permalink": "/r/DecidingToBeBetter/comments/nog25o/how_to_improve_and_not_being_an_obsessed_person/", "nsfw": false, "first_save": 1635437239.3345783, "replies_charged": false}