{"id": "t5_2tand_t3_7p74z9", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hi, I'm not exactly sure how to make this comprehensible but I'm gonna give it a go.\n\nLately I have been trying to expand my horizons in the spiritual and emotional sense. I've been making a conscious effort to become more compassionate and empathetic with others. I've been praying, establishing a connection with the  Universe (my higher power) and overall trying to transcend my lower version of self.\n\nI've hit a pretty rough patch over the past two years. I've been engaging in a very self destructive lifestyle and I decided to turn my life around a few months ago. In those (almost) 4 months, I felt I made immense progress and improved in my many aspects of my life. Changing my behaviors and thought patterns, connecting with a universal source and others, reading a lot on philosophy, psychology, and spiritual books (The Celestine Prophecy was by far the best one). \n\nI've had somewhat of a spiritual epiphany around a month ago where I realized that a lot of the shit I had to endure throughout my life that caused me to engage in those old behaviors ultimately had a huge positive impact on my life. I'm still nowhere as close to being some sort of guru but I do believe I've gotten quite far with it (at least compared to where I was a year ago with such matters). I had so many insights and engaged in a lot of introspective thought and self reflection. I concluded that the traumatic upbringing that I had and the way I chose to cope with it was all meant to happen. \n\nI felt like I was destined to live such a life because it fueled my drive to seek something different, a way of life that not many people choose to embark on. I knew that I'd never be happy living the same autonomous, mundane lifestyle that majority of this world embraces. I felt like I was destined to go through these difficult times because it gave me a deeper understanding of life. I don't value materialistic success as much as I did in the past. In fact, I even harbor a slight resentment towards wealth because it brought so much misery into my life and destroyed my family. \n\nWhat I'm trying to say is that I believe all those events had been leading me up to something special. I believe that if I continue on this path, I can become a life changing presence in people's lives and do something great for this world/humanity altogether. I was lucky to have discovered it at this age (I'm 17) and feel privileged in that manner. I may be self aggrandizing but it's what I envision/want for my future. The dilemma that I'm currently writing about is the fact that I may be doing it for the wrong reasons. \n\nThis realization unveiled today as I was reading The Subtle Art of Not Giving a Fuck. I began contemplating on something that Manson wrote and as I was taking a walk, I engaged in more introspective thinking. I've had a realization that my motives for becoming this highly spiritual and enlightened figure aren't what I think they are. I'm beginning to think that I want that for myself not for the sole reason of making a valuable contribution to other people but to gain their approval of me. I still feel an inherent need to be liked and respected by others and it seems like my self-esteem still hasn't improved very much. I don't loathe myself as much anymore but I still don't seem to love myself either. I'm still dependent on others and can't seem to just be happy for being myself and what I'm doing, always seeking other people's confirmation.\n\nThis whole ordeal just made me somewhat depressed. Could I have been manipulating all these situations and beliefs, all these \"synchronicities\" to reinforce my reasons for doing it? I guess it's just an old pattern of self-criticism and judgement resurfacing (or its probably just been masked well for a while). It feels like the further I dig into into myself, the more shit I realize I have to somehow change. Shit that'll take a long time to alter and I guess I just want it all now. Each time I uncover a layer of myself, I realize there's 5 more underneath it all. I'm only now beginning to comprehend how complex it all is, the human psyche, and I have a tendency to give up for when things get too hard or complicated (a serious lack of perseverance/tenacity). I know I have loads of time to get it figured out and move past it but now I feel like I'm a fraud and I've been lying to myself this whole time. It's just something that's been eating me up and I had to seek some insight into this dilemma from other like-minded people. \n\nThanks for reading this long ass rant, hopefully I can find some answers to my issue. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/7p74z9/it_seems_like_i_chose_to_become_a_better_person/", "title": "It seems like I chose to become a better person for the wrong motives and it's eating me up.", "social_network": "reddit", "user": "ldamien65", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1515505184, "permalink": "/r/DecidingToBeBetter/comments/7p74z9/it_seems_like_i_chose_to_become_a_better_person/", "nsfw": false, "first_save": 1635437868.705921, "replies_charged": false}