{"id": "t5_2tand_t3_g60gtb", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "DISCLAIMER: To get to this point and out of the deep end, I've been on meds for the past year. This is the journey that worked for me personally so it might be completely different for you and you might be at a completely different stage.\n\n\\---\n\nI've been researching a lot of stuff about reparenting, healing your inner child, etc etc stuff to finally deal with my childhood trauma and I recently came to a huge breakthrough by doing so. I realised almost EVERYTHING I do has an official psychological definition. I don't know why, but it's really helping me ground myself when I'm spiraling.\n\nLike for example, I'll keep on replaying certain events in my head (sometimes on purpose to trigger a panic attack) and come up with different ways of how I'd \"fix\" them - turns out, that's called rumination & emotional addiction. Most of the time I'm now able to stop myself in the middle of it and be like \"hold up, you're ruminating.\" And then ask myself why I'm doing that, what does that mean my mind needs at the moment, how could I turn it into a non-self-harm thing etc.\n\nTherapy's too expensive for me to commit to full time, so I've downloaded a bunch of psychotherapy & CBT (cognitive behavioral therapy) worksheets & books therapists use on their clients and basically became my own therapist. Been using visualisation techniques to talk to my abusers etc etc\n\nIt's tough work and it doesn't always work, but I can definitely see progress in myself :) Just thought I'd share in case it's useful for anyone.\n\nEDIT:\n\nBasic books I've been using that tackle the 'why' rather than immediately go into unhelpful & overwhelming solutions - you can find these for free in slightly \\*cough\\* unethical \\*cough\\* digital libraries that I don't think I can link here:\n\n* Depression for Dummies\n* Anxiety and Depression Workbook for Dummies\n* The CBT Handbook\n* Understand Psychology: How Your Mind Works and Why You Do the Things You Do\n* Any Intro to Psychology book\n\nStart there and see what works :) The goal, at least for me, was to develop compassion for my brain so we could together cope with mental illness.\n\nEDIT2: **Thank you for the awards and Reddit gold but please consider donating to food banks instead :)**\n\n#", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g60gtb/i_started_studying_psychology_in_my_free_time_to/", "title": "I started studying psychology in my free time to better understand my depression & came to a huge breakthrough", "social_network": "reddit", "user": "HappyHippyToo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3318, "down_vote": 0, "creation": 1587559559, "permalink": "/r/DecidingToBeBetter/comments/g60gtb/i_started_studying_psychology_in_my_free_time_to/", "nsfw": false, "first_save": 1635435793.7884862, "replies_charged": false}