{"id": "t5_2tand_t3_owfi9v", "request": ["eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": " \n\nHello ,\n\nI’ll start by saying I'm from another country so my English wont be grammatically correct\n\nand thank you for reading.\n\nI'm very confused professionally speaking since I was 20 / since I was discharged from the army.\n\nAnd was pushed by my parents to start college when I knew I wasn't ready or knew who I was .\n\nSo because I wanted to choose something I thought I would enjoy, I thought about high school and how I really enjoyed art history classes and creativity/ history .\n\nSo I applied to the archeology program and art history programs at a university.\n\n(got accepted but went to a different collage instead)\n\nOn top of that I thought maybe majoring in visual communication(was a big passion of mine at the time) at another college.\n\nBut because I didn't had the right portfolio to show at that collage (for visual communication) and missed the deadline to enter that major ( was at the army and the next deadline was only next year )\n\nI decided to enter a different program at the same school for art a B.F.A in the hopes to change programs as the year progressed.\n\nIn the end, because I really enjoyed my first year at that program I decided to stay and thought I could be an independent painter/illustrator and sell my works to the public.\n\nAnd also went to illustration studies on top of the art studies .\n\nBut when I graduated and started working as a freelance artist/illustrator/designer\n\nI felt like I wasn't talented enough and wasn't fast enough for the clients .\n\nIn short, after graduating I felt very unfulfilled and from a motivated person who loved art and life and was very optimistic I became a very scared person without self esteem and lost in life.\n\nAt the moment I work as a digital marketer for the family's business and have been trying to figure myself out ….. for the past 3 years.\n\nI’m very ashamed of myself and don't know what to do.\n\nFrom what I know about myself so far I love being outside, I love solving technical problems involving computers or phones , I love being in an aesthetically pleasing environment, I love learning and reading , earning money by myself with my skills , and love being active physically.\n\nI will greatly appreciate any advice and thank you for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/owfi9v/what_profession_should_i_choose_career_advice_27f/", "title": "What profession should I choose ? Career advice 27(f)", "social_network": "reddit", "user": "aliceetsuk", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1627914054, "permalink": "/r/DecidingToBeBetter/comments/owfi9v/what_profession_should_i_choose_career_advice_27f/", "nsfw": false, "first_save": 1635437494.8516943, "replies_charged": false}