{"id": "t5_2tand_t3_q05wo1", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Hey! 👋 It hit me recently: I don't have any friends who care as much about self-improvement as I do, so I decided to reach out to see if anyone would like to connect, share in our growth journeys, push each other to become better people, and share in this glorious experience that is life!\n\nAbout me: I'm Jon and concepts like self-growth, mental health, fitness, goals, life purpose, and self-love are so important to my core 💯 and, for the last few years, I've been on an amazing growth journey. Here are just a few highlights: I've worked on overcoming my codependency in therapy, I've attended a bunch Tony Robbins virtual events, I'm pushing myself at the gym more than ever (5x/week + cardio), I quit my job as a corporate lawyer because it didn't align with my life purpose, and I started a YouTube channel focused on mindset, mental health, relationships, and productivity. I believe every person has a gift to share, that we are each capable of truly incredible things when we have the right mindset, and that life is meant to be enjoyed and explored. My current life focus is on understanding myself more and improving my content so that I can help empower millions of people to live their best lives. \n\nI'm a big believer in knowing what you want, so I would love to attract people who are optimistic, ambitious, kind, self-empowered, passionate, empathetic, friendly, and humble. Bonus points if you're into any of the following: 📷 content creation, 🏋️ fitness, ✨ spirituality, 🎮 gaming/nerdy stuff, and 🥳 EDM/raves.\n\nI'm going to move to LA soon, so it would be amazing to make friends who live there, but I'm also open to making online friends or even creating a mastermind group! Comment below, DM me, or add me on IG (link in bio) if interested. Btw no pressure at all, we can chat and see if we vibe, and I've already learned that I'm not meant to be friends with everyone ❤️ Let's make our dreams come true together!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q05wo1/hello_im_looking_to_make_some_new_extraordinary/", "title": "Hello! I'm looking to make some new extraordinary friendships focused on self-improvement!", "social_network": "reddit", "user": "itsjonwhite", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1633217264, "permalink": "/r/DecidingToBeBetter/comments/q05wo1/hello_im_looking_to_make_some_new_extraordinary/", "nsfw": false, "first_save": 1635436828.257769, "replies_charged": false}