{"id": "t5_2tand_t3_ofjtzo", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "I have been smoking weed for the past 10 years.  I started smoking weed when I dated this girl at 19 who had ovarian cancer. She would smoke weed to help her nausea and appetite while taking chemo. I never grew up thinking weed was bad, and this made me think that weed is actually helpful to folks in need. But I started doing it because I loved the action, feeling, and the atmosphere that smoking weed gave me. Fast forward 10 years, and I can say that weed has changed me in certain aspects of life. But the negative effects have been taking a toll on me since I even started smoking weed. Financially, Im not the best at it and this became a cause of why im always living pay check to pay check for the past 10 years. \n\nI finally came to the realization that I spend over $4-5K per YEAR on WEED! Mostly just on myself. My wife smokes but only on weekends when I do have some on hand, which is like 24/7 anyway. I've known how much i've spent on weed for that past couple years now and I never really looked at it as a bad expense. Now that im almost 30, I find my 20's were wasted money on smoking weed all the fucking time. Spending my last few dollars of my paycheck just to get high. SO FUCKING DUMB OF ME. Looking back at the past 10 years if I hadn't smoked any weed, this money would have probably gone somewhere else instead of weed (obviously). Either in a saving account, or somewhere in need, like new hobbies or existing ones that I dont do anymore because I smoked so much weed (like mountain biking). Thinking about it now, I was getting paid okay to live a good life without spending any on weed. But I kept saying to myself, I need to get a raise, or get another job to get more money. And the only reason why I was thinking like that, was to cover the expenses of my weed habits.\n\nSo now that im slowly creeping into my 30's, I feel I need to take on self responsibility that should have been in action since I was out of high school. This past month I just paid off my car. This was a big milestone for me. I've paid off a couple of cars in the past, but this one, was a big one for me. It was my first car that I purchased on my own with no co-signer. Now, every month, I have an extra $225 in my bank account. Nice little raise right?! True! BUT, I can give myself an even bigger raise by stopping smoking weed. Per month I spend over $300 on weed. That would be a $500+ raise I can be giving myself. 1) Because I paid off my car saving me $225 per month, and 2) I can quit smoking weed a give myself another $300+ raise every month! WOO THE FUCKING HOO! (WOOHOO!). THIS IS MY MOTIVATION TO QUIT! $500 raise per month, tax free (in a way)!\n\nSo for me to get to the realization of this, it took me awhile to finally hit me in the face. Im struggling over here paying my monthly mortgage because I want to buy weed instead. Fuck that. The past years, almost every time I smoke I get this feeling of \"you're better than this\", \"i dont need this right now\", \"you could be enjoying your hobbies instead of spending money on weed\". Thoughts like this kept crawling up my sleeve every time i would purchase another 8th or two just to smoke it in a weeks time. (To me, thats a lot of weed for one person). I would smoke ALL the FUCKING TIME. No matter the action I would do. I recently got into Rock Climbing this past year during Covid, and I LOVE IT! BUT, I smoke weed every time before I go. It gives me concentration and focus. So I zone out when i climb solo, and its an awesome feeling. I would smoke weed before and during work hours. Im the kind of smoker that can do ANYTHING while high. Like literally anything. I would want to smoke while driving, ALL THE TIME. This is a stupid action, because I've been driving my car with out it being registered since 2018. I could have gotten arrested on JUST the registration itself. On top of that, if I got pulled over With weed in the car at the same time. Fuck, my wife would have left me. And I dont want to go to jail again. I went to jail a few months after i started smoking weed at 19. For less than a gram of weed. I still think its dumb how that happened. I also believe weed should be legal in the whole world. But I was just being plain stupid.\n\nSo, Im deciding to do better! I have currently started reading, which I never enjoyed. I'm currently reading two books at the same time. About to choose another book genre, so i wont get bored while reading the other books. Im sticking with Fiction, Mental Well-Being, and Graphic Novel books. Im about half way through each. One is fiction book (Never Let Me Go) and the other book is a mental well being book (Atomic Habits). And I'm also going to pick up the third book, which will be a graphic novel (starting with reading the Sandman series again). I can't stop thinking about getting to a point in my day now where i have free time to read for an hour or more. THIS is exciting to me now. Never was. And its an awesome feeling.\n\nI have also started with a daily task/journal. I write in it everyday. Tasks that I want to get done, tasks that need to get done, and then I have a spot for Notes and Thoughts that I can write down so I dont lose any ideas i come up with through out the day. The night before I write in what needs to get done the next day. This gives me motivation and a purpose. I write these things down because they are important. A persons brain isn't capable of holding all this info, especially a high tolerant weed smoker. So actually writing things down has been helping so much this past week with getting things done in a timely manner. This is now becoming a positive habit that benefits me. I feel a level of accomplishment doing this and its great. Almost like a weed high. You get that feeling of relief when you finish a task. just like taking that first hit of weed in a way. Its really motivating.\n\nI could probably write more, but im not a good writer, so this whole post is probably a boring read with a lot of grammar errors. I just needed to get this out and say it to someone. And this seems like a great place to do so.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ofjtzo/i_will_not_be_buying_weed_any_longer_im_giving/", "title": "I will not be buying weed any longer. I'm giving myself a pay raise. (long post)", "social_network": "reddit", "user": "zxvegasxz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1625667601, "permalink": "/r/DecidingToBeBetter/comments/ofjtzo/i_will_not_be_buying_weed_any_longer_im_giving/", "nsfw": false, "first_save": 1635438435.2243855, "replies_charged": false}