{"id": "t5_2tand_t3_jeoy67", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "In some people's lives it always comes to a point where you feel like a lost cause, or like life lost its taste, you feel sad, feel constant pain, and you can't just take it anymore - you want to end it. I say, you better not. \n\nBeen depressed for 9 years, with no useful therapy, pills just won't help, and as a result I can't have normal relationships with people at all. Music lost its sense, art lost its sense, I just don't see any difference anymore. It all went to the point when I decided that at 27 I should end it, if nothing that I can't change happens. And you know, covid happened, right when I wanted to end my life. So I told myself, okay, shit's happened, I can't change it, what am I gonna do about it? I got myself fired from a company I'd given 3 years of my life to, not that big of an amount, but not that small. In Russia it's shit and a road to nowhere when you have no job at all. \n\nIt all came to a point yesterday when I felt like I needed to end my life anyways. But, Ricky Gervais popped up in my youtube recommendations, I started watching, laughing, watching again, laughing again, and I saw an interview where he was talking about his \"Afterlife\" series. He described the idea of wanting to kill oneself as an ability to do everything you want, because now you really know you can end it anytime anywhere, so why not just have some fun pissing around everything till it gets too much? And I realized, yeah, exactly, you can do whatever the fuck you want if it's the right thing to do, who cares? No one. Lost a job? Who cares? You better go check any other. Got dumped? Who cares? You better go check what you've got on your mind. Lost business? Sucks. But who cares? You got it one time, you'll get it twice. No shit is worth ending your life for. But every shit is worth giving it a try.\n\n So I got my first interview now, doesn't matter if it goes bad. I'll check another one. Earn some money, find some course to learn something in order to earn extra, stop masturbating my little prick, start music again, maybe a band. If it doesn't work, I don't care, I'll go check some other things. Who's gonna stop us? No one. Cause who cares? \n\nIf you're still reading, keep on, dude. You're doing great, you're doing your best and I am proud of you. No one is gonna stop you now. You are fucking invincible.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jeoy67/if_you_feel_suicidal/", "title": "If you feel suicidal", "social_network": "reddit", "user": "MethocaineX", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 95, "down_vote": 0, "creation": 1603198681, "permalink": "/r/DecidingToBeBetter/comments/jeoy67/if_you_feel_suicidal/", "nsfw": false, "first_save": 1635435868.3686724, "replies_charged": false}