{"id": "t5_2tand_t3_m5mlqg", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "**TLDR: My view of my achievements is just pure luck to the point of desire to pursue my dream and today I decided to change and acknowledge that I won't be in this current situation if it wasn't for my small efforts. and its returns to me because of Haikyuu and Aleczandxr's Video** \n\nLast Year, I did lose the desire of wanting to pursue my dream university. Slowly I manage to drift away from the meaning of my own efforts, being stagnant and waiting at something that makes things more interesting. \n\nBefore I enrolled at my current university I was putting effort into everything like my morning routines, my habits before, during, and after school, and also my nighttime routine just to achieve the best option to transfer to my dream university in the best condition I can attain. \n\nThank goodness that I enrolled at my current university because it was the best and maybe the only option to create the best chance to transfer to my dream university but somehow I didn't notice that I'm slowly losing the meaning of my efforts because of being stagnant and just thinking that I was just \"lucky\" to make it this far. (let's just say that my Dream University is at the Top University in my country while my current university is at Top 8).\n\nFor Months after at my current university, I was lazying around just to kill time but deep down, I know the fact I'm just slowly killing my own chances to pursue what is meaningful to me and just accepting the fact that I'm just lucky to be here.\n\nToday, I realize that everything that I did is the byproduct of my small actions, my pursuit of the things that I dreamed of, and doing everything I can because I accepted that I'm not the brightest, the smartest, and the most-gifted person I can be. But I know that my small efforts and growth mindset and perspective can get me anywhere.\n\nI just want to share this thought of mine and wanted to get back at the things that I needed to do. and this post will be a reminder for me to pursue.\n\nP.S \\[ This post was made because of Aleczandxr's Video About Haikyuu [https://youtu.be/Cft1WkFCMrM](https://youtu.be/Cft1WkFCMrM) and Kita Shinzuke's Philosophy of Talent and Hardwork (One of the characters in Haikyuu S4)\\]", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m5mlqg/i_decided_to_acknowledge_that_im_here_because_of/", "title": "I Decided To Acknowledge That I'm Here Because Of The Small Actions That I Made", "social_network": "reddit", "user": "TheDraggy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1615820555, "permalink": "/r/DecidingToBeBetter/comments/m5mlqg/i_decided_to_acknowledge_that_im_here_because_of/", "nsfw": false, "first_save": 1635436849.7651136, "replies_charged": false}