{"id": "t5_2tand_t3_o6eloe", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "In this post I will talk about 6 concepts that have helped me in my self-improvement journey. \n\n**1) Measurable goals are the best goals.**\n\nGoals like “lifting weights 5 days per week” and “fixing my sleep  schedule by waking up at 7 am every day” are good goals because they can  be tracked and worked on in an incremental and measurable way. There is  a concept known as SMART goals. The acronym stands for Specific,  Measurable, Achievable, Realistic, and Timely. Make sure that your goals  follow this acronym. \n\nGoals like “not procrastinating” and “delaying gratification” are not as helpful because they are too vague and lack context.\n\n**2) “Black-and-white thinking” is not helpful.**\n\nLet’s imagine that you are trying to discipline yourself to go to the  gym. You create a goal to go 5 times per week. Unfortunately, you only  manage to go 3 times during the first week.\n\nFor someone who thinks in a “black-and-white” or “all-or-nothing”  way, the week is considered a failure. The effect of this negative  thinking might result in the person quitting the gym and later feeling  depressed. This is a scenario I used to often find myself in. I used to  think “either I do everything perfectly or I don’t do anything at all”.\n\nHowever, I have learned that ups and downs are a normal part of the  process. Perfectionism is dangerous because it can cause you to avoid  doing the work that is needed for you to improve. My thoughts would now  be, “Oh well \\*shrugs\\*. That’s okay. This is a process. The week was  still a success. However, I can do better next week.”\n\n**3) Progress should be enjoyable and come from a state of flow.**\n\nA lot of people think that, in order to be happy, healthy, and  successful, you need to constantly punish yourself and suffer. I have  found that I am most productive when I am enjoying myself and going with  the flow of things, kind of like when I was a little kid and I suddenly  got interested and passionate about something. \n\nSure, there will be some discomfort whenever you are trying to  achieve something great. Discipline is important. However, suffering  should never be at the foundation of your purpose.\n\n**4) Escapism should be paid attention to.** \n\nPay attention to how and why you are escaping “reality”. For example,  let’s imagine a guy is constantly watching romantic movies and porn.  The reason behind this is that he probably lacks that connection in real  life. He probably has little to no experience with girls. \n\nInstead of indulging in escapism, he should go out, make friends, and  go on dates. The reason he escapes is that he probably feels that this  reality is too far away from being possible.\n\nThis is when he should go back to **1), 2),** and **3)**.  He should create small and measurable goals, understand that his  process might take time, and try to make these small goals as fun and  enjoyable as possible.\n\n**5) Schrödinger**‘s **cat is all around us.**\n\nThe reason getting disciplined and improving ourselves is so  difficult is because there is so much contradicting information out  there. Schrödinger’s Cat is a thought experiment that shows that two  contradictory things can be true at the same time. The same can be said  about a lot of information out there. For example, I believe that both  of the following statements are true:\n\n– In order to become truly “successful”, mere desire is not enough.  You need “compulsion”. You need the drive and the will that are  necessary to become great. Felix Dennis talked about this in one of his  books.\n\n– “Compulsion” can be dangerous because if you fail, it can lead to  depression. It can also take away from the joy of the present moment and  create a condition of worth.\n\nThe reason both of these statements can be true while still seeming  contradictory is because everyone is at a different point in their  process and because both statements lack context. The advice that is  good for one person may not be good for another. Everyone is in their  own unique situation, and oftentimes simple and short sentences like the  ones above don’t give the full story.  \n\nAnother example is of Schrödinger’s cat is the debate surrounding  patience versus speed. Is it better to take things slow and to make a  little bit of progress every day, or is it better to act quickly and  with as much speed as you can? Gary Vaynerchuk hits the nail on the head  with the following quote. He says, “macro patience, micro speed”.  Meaning, have patience in your long-term vision but try to get a lot of  things done in the short term. \n\nTwo contradicting ways of thinking can both be correct. It all comes  down to perspective. You need to allow your mind to be flexible.  Everything is based on context, and only you have the full context of  yourself and your situation.\n\n**6) Balance is the greatest virtue.**\n\nThis is my most important rule of thumb, and is a continuation of **5)**. When I’m having trouble with a dilemma, I simply go back to this.\n\nFor example, the popular “selfishness versus selflessness” debate, or  even, politically, the “right-wing versus left-wing” debate. I find  that I’m happiest and in agreement with myself most when I’m somewhere  in the center of things, objectively balancing two contradicting ideas,  and understanding that the scale can tip in either direction depending  on the situation.\n\nAnother example is the “free will” debate. I balance the  philosophical “truth” that free will doesn’t exist, with the  psychological “truth” that a belief in free will is important in our  lives.\n\nHave balance with everything, including with balance itself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o6eloe/6_concepts_that_may_help_you/", "title": "6 Concepts That May Help You", "social_network": "reddit", "user": "RossWriter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1624460559, "permalink": "/r/DecidingToBeBetter/comments/o6eloe/6_concepts_that_may_help_you/", "nsfw": false, "first_save": 1635435286.4923909, "replies_charged": false}