{"id": "t5_2tand_t3_5e6u58", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "Hey everyone.\n\n Just going to unload my mental anguish into words and hopefully inspire at least one of you reading. Last week I had the most unproductive week ever. You are not alone. Yesterday I stepped outside ONCE….to take the trash out. My day was filled with food (at least I didn’t eat junk), Netflix, and lots of lots of games. (Mostly Rocket League). You ever just play games for so long and you’re just like god damn I really need to do something, and still don’t? YEA, that was me. I think I took like 3 naps. Now lazy days are OKAY. I actually think they are needed. But I had almost done the same thing the same 3 days before. I had been chilling for like 5 hours and even after that, all I wanted to do, was nothing. I just didn’t want to do anything, yet felt like shit for not doing anything. It was a vicious cycle.\n\n\nI had done almost nothing productive for 5 days, and my main catalyst was gaming. I’m a gamer. And I have LOTS of fun gaming. Sometimes I will play for hours at a time because I simply won’t get bored. Then some days I’ll be out all day following my dreams and genuinely impressing myself with my work ethic. My hot and cold are so drastic it is crazy to think about But I will tell you something, you can choose to change your state of happiness or sadness at any given moment. You could do it right after this paragraph ends.\n\n\nYou HAVE TO STOP FEELING BAD FOR YOURSELF. That’s really it. You will never be able to change if you cannot man up and stop playing the victim. You will never change if you allow yourself to make excuses to justify why you haven’t changed. Ex: I have chronic back pain, it drains me. OKAY. I can’t help it, I simply can’t. I can seek TEMPORARY justification by being okay with sleeping all day because I am in pain OR I can seek PERMANENT happiness by accepting it and putting forth the effort into creating a lifestyle I am happy to live. That lifestyle for me in being disciplined enough to progress myself in my business and personal/mental health, daily. You can’t change your situation by wallowing in it.\n\n\nThis mindset helped me. You have to realize that the simplest advice is sometimes the most important. JUST DO IT. You have to realize that not all people deserve to be blessed with a life full of mental bliss. If you don’t put any work into creating that, why would you deserve it? It’s not given out. Yes, some people can achieve it more easily. BUT THAT’S THAT. Just because it’s “harder”, does that mean you don’t want it anymore? Think about that. I woke up from maybe one of my worst days and made today one of my best. I made a to do list and am already halfway through it (20 items) by 5pm. It all started by LITERALLY forcing myself to go outside and experience the sunlight. I drove to a freaking library and just brought my laptop. Well shit, now I’m at a library. I might as well get some work done. That one act of forcing myself led to such a great day. On my to do list was to make this post and here I am a page in. This brings me no monetary value, it’s not a grade in school. I spent my time doing this so I can check it off my list and give myself what I deserve, happiness. Tomorrow is a new day! In 60 seconds is the next minute. When will you change for the better?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5e6u58/the_mindset_that_will_help_you_break_free_of_your/", "title": "The mindset that will help you break free of your mental slump. From me to you", "social_network": "reddit", "user": "Choosehappinessguy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1479765413, "permalink": "/r/DecidingToBeBetter/comments/5e6u58/the_mindset_that_will_help_you_break_free_of_your/", "nsfw": false, "first_save": 1635435661.1031172, "replies_charged": false}