{"id": "t5_2tand_t3_o23wl8", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "802203c7-ca80-4c23-ad08-f571694cfc55", "e234981c-b061-4d83-8134-70d441847f74"], "text": "I (26M) feel like I see many posts about forgiving yourself for the things you've done, but I don't think I've seen many posts pertaining to the things you *haven't* done. I have pretty severe ADD, with a solid sprinkle of depression. This has caused me to more or less flounder for past 8 years. I've failed many classes and wasted time working in restaurants with nothing to show for it. Since I've met my girlfriend (20F), I've noticed that I've been having a huge quarter life crisis due to the fact that I really haven't done anything that I've really wanted to do in life so far. She is amazing and supportive, and I really think this could go somewhere, and I've instantly felt comfortable around her since the first time I met her. She is also very out going, a real go-getter, takes advantage of and creates many opportunities for her future, and just generally has her shit together. I really admire this about her, but it could be stirring something in me. I'd like to think that I'm not comparing myself to others, but it's definitely something I struggle with. To be clear, this post is only about things I can do to stop beating myself up and practice a little self love, not about her. That was only for some background.\n\nSo, about the things I want to forgive myself for:\n\nSchool - I want to go to medical school, but I have poor grades from the past, and will have to take 100 credits worth of straight A's just to get my cumulative GPA back up to a 3.0. It'll take a while, and it makes me so worried about my prospects and sometimes I question if it's even worth it. I also have no idea how I would go about finding an internship or research gig I would probably need to get into med school.\n\nFinances - I have saved absolutely no money whatsoever, and every time I want to do something or go somewhere, it's a big financial issue. I would ideally like to have 5 figures in my bank account at all times, plus some money saved. I just don't even know if it's realistic at this point. I'm taking a full course load in the fall semester, and would probably only be able to work at my serving job Friday night to Sunday night. I live at home currently so rent isn't an issue, but I still do have some bills to pay. It feels like it'll take forever for me to be financially stable enough so that I don't have to worry so much about money. I really don't wanna continue being in the trenches all this time.\n\nLife experience and relationships - Although I love my girlfriend and want a future with her, hearing about her having a great time in university makes me feel quite envious and insecure. This is both from the standpoint of her having had lots of interesting and varied relationships, and me not putting myself out there and taking full advantage of my original higher education institution. It feels so counterintuitive and I really want to get over this.\n\nI also haven't really traveled the way I would've wanted when I was younger. I've always wanted to go backpacking, and simply never did. Now, I have so much work cut out for me to achieve my dream career, that I don't even know how this is logistically possible.\n\nThanks for reading if you've gotten this far. I'm sure there's more than this, but these are the big ones. I want to allow myself to be more content with where I'm at so that I'm not miserable, and so that I can move on and actually start doing the things I wanna do. I'm willing to put in the work to achieve these things, but am just feeling so down on myself. Any advice you have would be so helpful and appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o23wl8/how_to_forgive_myself_for_inaction/", "title": "How to forgive myself for inaction", "social_network": "reddit", "user": "mason1111", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1623954022, "permalink": "/r/DecidingToBeBetter/comments/o23wl8/how_to_forgive_myself_for_inaction/", "nsfw": false, "first_save": 1635435158.4019303, "replies_charged": false}