{"id": "t5_2tand_t3_f98442", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "All my life I've been overweight. But it's come to a head for the second time now. Last year I lost a bunch of weight kind of unhealthily and then gained it all back when I got complacent in my current relationship. And so I'm back to my starting weight and after months of struggling to not relapse into those equally unhealthy habits, I'm finally working on having a healthy relationship with food.\n\n\nBecause see I've never had a healthy relationship with food/eating. I've always over or under eaten and tie a lot of my worth into my appearance. Now though, I really want to make a lasting change. For the last week or so I've been working on healthy portions and learning when I'm full. Today is the first day my boyfriend and I have had a full day of healthy portion sizes. What made me realize that was the box of veggie pasta we were using up. The serving size is about 5 servings and before when I'd make us lunch we'd finish the whole box and STILL be starving.\n\n\nWe used up half yesterday, on quarter for me and him and the other half today. We made a healthy lunch and were gonna have a healthy breakfast. And it's nice. I enjoy food. I love making it and experimenting with flavor and it's nice to eat it and not feel so painfully bloated at the end of it all. I'm kind of eyeballing calories but I'm not starting CICO until I can trust that I won't go off the deep end and start undereating on purpose again.\n\n\nI'm already seeing differences. I've been sleeping better, and I can tell the difference between hungry and thirsty. I have hope. Hope that this time it's different.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/f98442/baby_steps_to_being_healthy/", "title": "Baby steps to being healthy", "social_network": "reddit", "user": "spicychicknnugget", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1582625203, "permalink": "/r/DecidingToBeBetter/comments/f98442/baby_steps_to_being_healthy/", "nsfw": false, "first_save": 1635436069.2508068, "replies_charged": false}