{"id": "t5_2tand_t3_hsmv4y", "request": ["cbd1933a-caaa-464d-8e4c-373318982c62"], "text": "My mom and I had a huge fight a month ago that left me feeling really hurt and distancing myself. Afterwards I left and stayed with friends and family in New Jersey for three weeks. I came back last week and she said she was sorry for what she said and that she talked to her therapist and was trying to understand me better, but it wasn't happening. Nothing had changed.\n\nI tried bringing up the fight several times to talk to her about how her behavior was unacceptable to me. She has a habit where once a year or so, after holding in emotions or getting frustrated or whatever, she blows up and screams and says some of the cruelest things I've ever heard a mother say to their child. She does it to everyone in the family and has for years. \n\nShe knows she does it and shes talked about it with therapists but she doesnt know how to fix it. So when I finally talked to her today about what happened and how I felt, she got upset and asked why I kept bringing it up, why I cant just forget about it and focus on the good times, and why I cant accept those parts of her. \n\nThis time, though, instead of caving in and giving up, I stood up for myself and told her that what she does is unhealthy and wrong and I wouldn't subject myself to it any longer. I went on to say that I have people who love me and are able to communicate in healthy ways, that I was agender and pansexual, that I was a sugar baby for awhile because of my anxieties towards money, that I loved my body and that I am happy with how I look for the first time ever in my life, that I cut sometiems, that I dislike family vacations because they cause me anxiety, that I was just diagnosed with diabetes, and a whole slew of other things. I told her all this without screaming or raising my voice. I told her who I was, and that i wouldn't put up with being hurt or put down. Most importantly I told her that I still loved her very very much, but that i wouldn't wet myself up to be hurt again by her lack of control over her feelings or communication skills. She was quiet the whole time and seemed like she was listening. \n\nI dont know what will happen next and I'm euphoric and scared and anxious about the whole thing. I'm hoping she will be more accepting of me and my choices and not put me down if she disagrees. I'm hoping we can grow a stronger, healthier relationship because of this. I'm hoping a lot of things. But I finally opened up, and I'm going to keep trying to be more open about who I am.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hsmv4y/came_out_to_my_momabout_everything/", "title": "Came out to my mom...about everything", "social_network": "reddit", "user": "SquidLegsMcGee", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 39, "down_vote": 0, "creation": 1594949951, "permalink": "/r/DecidingToBeBetter/comments/hsmv4y/came_out_to_my_momabout_everything/", "nsfw": false, "first_save": 1635436407.1813052, "replies_charged": false}