{"id": "t5_2tand_t3_9313vl", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "Be a dreamer because no one else will. Be a dreamer because you are unique. Be a dreamer because this life that humanity has provided us is abhorrent. They tell us we can accomplish anything but why are so many people living miserable? And why is evil in charge of us? Dream for the people that cannot. Dream for the people that are stuck in this hallucination where others control your life instead of yourself. Dream for yourself. Because if you do it will set you free. Don’t be restricted to the shackles that society restrain and hold you down with. Free yourself to a new world, a world where you seek to make better for not only you but for your kids and your kids kids. For everyone around you. For the love we don’t share. For the selflessness we lack. And for the poverty we induce. Dream big and don’t let anyone tell you less. Dreaming is a breathe of fresh air because we’re all drowning in this thing called social media, this thing called money. This thing called narcism. We’re drowning in how others see us, how the world sees us. And what for? Why are hundreds of likes on your post going to give you true and abundant joy? Why do we base our self esteem on what others think of us? Why do we let others determine how we feel about ourselves?  Dream to love yourself. Dream to be whatever you want. Dream of love. Love that not only shelters your mom or dad, wife, husband, etc. but exceeds to everyone around you. Dream because that’s where the fun is at. Dream so that people will follow your lead and dream with you. I remember someone else having a dream and he was shot and killed before he could see it flourish. Dream to be kind. Dream to be whatever you want. And then grind until you see that dream at the end of the tunnel. Until it’s tangible in your hands. Until you’re living it and sleeping in it. Don’t ever give up. Don’t ever. Because once you do it dies, YOU die. It may not be physically, but spiritually. Be who you are meant to be. Don’t worry about what the person next to you thinks or says because it’s your dream. Your life. It’s who YOU are not who they are. Grow past this life we are living right now and work on creating a world where being who you want to be isn’t a rare story. Where it isn’t based on what you look like but based on your true talent based on who you are. Leave your phone, your tv, your Xbox and go out into this beautiful world and strive to be something more than this. More than what this society is now. We are so corrupt. So exploited. Know your value and dream big.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9313vl/be_a_dreamer/", "title": "Be a dreamer", "social_network": "reddit", "user": "CarinoReyes", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1532925570, "permalink": "/r/DecidingToBeBetter/comments/9313vl/be_a_dreamer/", "nsfw": false, "first_save": 1635436561.2963293, "replies_charged": false}