{"id": "t5_2tand_t3_q9lpm3", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "Hello, first time using this platform so I hope I'm doing it right. \n\nI've had this issue for the past few years and I was hoping someone could give me some guidance. I have trouble expressing and understanding emotions; I really don't know how to react or what to say to other people. \n\nA few months ago I started college in another country, when my parents were dropping me off at the airport they said things like \"we will miss you\", \"come back soon\" and things like that, but I couldn't reciprocate the same, I just said something like \"I'll be fine\" and so. While entering the gate I saw them crying but I didn't feel sad or anything similar, I really felt nothing. Everytime I make a video call with them they say how they can't wait to be vacation so I can return, but I can't but just smile and agree, even though I don't feel the need to return. \n\nSame thing happened when my grandpa died, I really didn't feel the need to cry, even though I had a good relationship with him.\n\nToday is my sister's birthday so I wrote her a Happy Birthday message and sent her some flowers but just because is the right thing to do. I didn't feel something like \"Hey, it's my sister's birthday and I love her so much that I will send her a gift\".\n\nIt's been quite a problem, It's really difficult to understand people emotions, understand when to react and say something. It's the main reason it's always been difficult for me to make friends. I went to the psychologist while in highschool, but nothing happened, maybe because I didn't put much attention. Should I try going again? \n\nHope anyone can help. \n\nSorry if my grammar is bad, english is not my first language.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9lpm3/how_to_become_more_emotional/", "title": "How to become more emotional", "social_network": "reddit", "user": "MysteriousSubject824", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1634422051, "permalink": "/r/DecidingToBeBetter/comments/q9lpm3/how_to_become_more_emotional/", "nsfw": false, "first_save": 1635436828.5649486, "replies_charged": false}