{"id": "t5_2tand_t3_8zwwky", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "(warning: Long Post *thx in advnace for letting me vent*) Im not religious or anything, but God hears and answers your prayers. He truly does.\n\nIm going to sum this up best I can. I was stuck, or what felt like being stuck truly seemed like, in a relationship (if i can even call it that) with someone that used me and took as much as they possibly could from me physically and emotionally. I was in an exclusive 'friends with benefits' situation with my best guy friend at the time. We met in college and at the time he was really struggling. I ended up getting him a job, letting him stay at my place for months, and supporting him emotionally like a mother AND a girlfriend. He was the arrogant type, oh god was it bad.. very immature but one of those people that only has their own way of thinking and truly believed their opinion was fact, and had no shame in emphasizing that. He chose to live out of his car, even after I got him a job to help him get on his feet, he would spend his paychecks on weed and eating out.. I felt bad for him truly at one time but it came to a point where he would tell me things like 'oh im saving so much money not having to pay rent like you, im richer than you' yea.. just stupid stuff like that. Keep ni mind hes 21 years old so hes not a kid, but he definitely acted like it. We would have very petty fights, someone would say the wrong thing and then have to drop each other off cuz we wouldnt want to talk, the last times we hung out ended in a mean , and i mean MEAN, arguments where alot of the time i would just walk away and we wouldnt talk, we would see each other again like nothing happened and not address it, but thats why things were quick to deteriorate. Thing were bad, and he would tell me how Im not good enough and hint that guys wouldnt date me for how needy and complex i was, it was the worst feeling because i actually wanted to be with him, there was just something about him but i know now that life lessons happen in different ways. Its werid how he would call me the needy one when he had no one else in the area to hit up and hang out with, i was with him all day every day. He would treat me like a girlfriend, told me how muich his family really likes me more than his ex and all this other stuff.. but when i would want a real solid relationship, he wouldnt act on it. Yet everytime I walked way threatening to leave because i deserve more, he would go crazy. I did try ignoring him, hed text me nonstop i mean nonstop until i replied kept calling and there were two times in particular where i didnt answer and he came to my house in the middle of the night to put notes all over my car. Like post it notes, nothing threatening like cute notes and doodles saying i love you i miss you why arent you answering , just ugh it was so so frustrating and I didnt understand I would cry every night wondering if things would get better and that he would show me he loved me by more than being attached to me, but that was something i was waitingfor that would never come. We were together for too long, and Im still trying to balance things out with him, although we wernt 'together' we were basically in this relationship shit show for 2 years. He recently came back in my life (what timing huh) to tell me he misses me and wants to take me on a vacation over the weekend.. distance is the best thing from him that has happened to me and I plan to keep it that way. But Right now, Im the happiest Ive been in months. I started seeing someone that is very compatible with me, much more classy of course , handsome <3 and he seriously gives several shits about me, and is up front in telling me he wants me and Hes been there more than i could ever ask , and hes truly an amazing soul , the nicest kindest guy ive ever met, and extremely intelligent. I know his friends and their my good buddies from the past He knew the same people in high school but we all recently reconnected , almost by fate. He inspires me to build an honest foundation with him, I told him about my ex , or idk if i can even say that, but about my past and hes very understanding. It was kind of like God was truly winding my path towards someone on the peripheral, and he has told me he felt the same way about us entering each others lives.\n\nWe made it official last night, we make each other so happy and I havn't been this giddy and loved in I don't know how long.Im so so blessed I realized and decided to pour some of it out on reddit (as cheesy as this post is) because Im overflowing with love. If you truly radiate love and only love it has to come back to ya eventually! proven theory :p I am so happy I am so grateful to have him in my life to love and respect, I truly couldn't have wished for anyone or anything better, i am still in shock that I got so lucky and how things just fall in place. For a long time I was told I didnt deserve love, and I heard it so much I started to believe it. I kept my prayers high and hoped just to be happy, and truly I was heard.\n\nThanks for reading this, and know that things do get better.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8zwwky/from_an_abusive_to_a_loving_relationship/", "title": "From an abusive to a loving relationship", "social_network": "reddit", "user": "whunderlusty", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1531930710, "permalink": "/r/DecidingToBeBetter/comments/8zwwky/from_an_abusive_to_a_loving_relationship/", "nsfw": false, "first_save": 1635437637.1381843, "replies_charged": false}