{"id": "t5_2tand_t3_q8lxtz", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "TW: Sexual Assault, Sexual Coercion.\n\nI started writing a stupid long post about my entire situation, but it’s so specific I know my ex would recognize it. Very long story short, I got with a guy my freshman year. He left his old school because he got accused of sexual assault, said he didn’t do it, I believed him. A few months after, the situation came back up and more girls came forward. He told me he didn’t do it, and again, I believed him. I ended up breaking up with him right at the beginning of quarantine for unrelated reasons.\nI spoke with a friend about some stuff that went down during the relationship. I spent 90% of our time together high as hell, he was the cool upperclassman who gave me free weed and I was the lovestruck freshman with my very first boyfriend, so I wasn’t able to recognize it at the time, but she said a lot of what happened between us was coercion. (For example, we’d be making out and he’d guide my hand towards his dick, and I’d kinda skip my hand away before he would just take my hand anyway and put it on his dick) but I don’t remember most of my freshman year due to memory issues. I used to get anxiety attacks when we’d go any further than what I was comfortable with (which 9/10 were just handies or the occasional shitty head on my part) and he’d back off.\nI went to a party last night hosted by one of the frats in his major, and while talking to someone about him being my ex, she told me that he had forced her best friend to give him head. Complete stranger mind you, she just knew he was my ex and I egged her on to tell me the tea. I was horrified, and my roommate walked me home. I couldn’t sleep all night and I’m writing this the next day. People at this school had no idea what happened at the last school, so why would they separately accuse him? I feel sick and I knew some of the stuff we did wasn’t great, but I chocked it up to my own sexual inexperience. I asked a friend and she said I should report him. I gave my number to the girl who told me and told her that her friend can have it, and she can text me if she wants, but no pressure. My head is swimming and I was doing so mentally well, but this shit is coming back to drag me back down. I don’t know what to do. I could really use some advice.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q8lxtz/my_exboyfriend_has_been_accused_of_assaulting/", "title": "My Ex-Boyfriend has been accused of assaulting multiple women", "social_network": "reddit", "user": "Memory-Muted", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1634295216, "permalink": "/r/DecidingToBeBetter/comments/q8lxtz/my_exboyfriend_has_been_accused_of_assaulting/", "nsfw": true, "first_save": 1635436001.2564213, "replies_charged": false}