{"id": "t5_2tand_t3_mrodpl", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Once upon a time, I started working for a company I believed to be great. I was fresh out of university and found the job that would support my dreams and encourage me to thrive. \n\nThis bubble was burst on day one. \n\nI found myself in a position where I was surrounded with negativity, toxic people and zero staff morale. The work itself was hard and challenging and very misconceiving to the unknown victim with very little job satisfaction and a lot of bullying. \n\nI used to be the most fresh, sparky and light kind of person. I had no anxiety, no depression, no self hatred, no lack of confidence and most importantly, no judgement. I soon realised that I couldn’t leave the company as I would never be able to find a job that paid what it paid and get my ‘higher tier’ title. Even though I was ‘the fun, friendly one’ I was also ‘the pushover’ and the ‘ask Kayla, she’ll say yes’ and therefore, I started saying no; started to grip conversations by the throat and argue about unnecessary things. \n\nMy work life completely changed my personality and the woman I am today. \n\nI would go to work, cry in the car home and go to bed. My relationships with every single person has changed. My partner started to notice this angry, argumentative, manipulative person who completely lacked any sort of care unless it was about myself. I started buying clothes I wouldn’t normally wear, got my hair done every few weeks and would never leave the house without make up. My confidence and self esteem hit an all time low.\n\nMy company is moving locations so we all have to pack up our stuff, label our desks and archive 93.1 million boxes. I was rummaging through some drawers today when I came across my file from when I first started and you could have knocked me over with a feather.\n\nThere was a Polaroid of me on my first day with the biggest smile, little make up and big soft glowy eyes. My uni qualifications were in there along with other bits and bobs I’ve picked up on the way and I felt the biggest ache in my heart. \n\nWho am I anymore? Why did I let myself get so influenced? What happened to the girl who was so excited and wanting to change the world and make a difference to someone’s life? I stood there with the most immense urge to be her instead of this anxiety riddled and careless person I am today. This person who wears a helmet everyday in case I fall off my high horse. \n\nI sat at my desk and started reminiscing about all the good times and reflected on myself over the past few years. I am a completely different person and yknow what, I’m not going to continue to be that person anymore. I wrote up that notice, signed it and handed it in. \n \nI left the room feeling a million dollars. \n\nI have an interview next week with my local care home and I am so excited. I’m done with being posh and I’m ready for the care and compassion I once had as a teen. I am going to regain my control and be better. If you’ve made it this far, thank you. Here’s to a new me. I’m proud of myself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mrodpl/i_handed_in_my_notice/", "title": "I handed in my notice.", "social_network": "reddit", "user": "kookykayla", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 42, "down_vote": 0, "creation": 1618521486, "permalink": "/r/DecidingToBeBetter/comments/mrodpl/i_handed_in_my_notice/", "nsfw": false, "first_save": 1635438108.471897, "replies_charged": false}