{"id": "t5_2tand_t3_oph2rf", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "So I've been watching porn regularly since I was 14 (around 10 years) during these 10 years, i used to realize every now and then some harmful effects of the porn I'm watching on my life, but I used to justify porn as being my only outlet. I'm a secular who's living in a Muslim country and in a very conservative city in that country so real sex and intimate relationships are not an option in here and in the same time, up until the moment, I can't afford to allocate to a western country, so I had to deal with it.\n\nEverytime I googled how to quit porn I find the answers to be something around the fact that I should get in a real relationship and I should stop lying to myself and that sex is the real and only deal but non of those smartasses say a thing about what to do if that's not an option, I figured, or I tricked me into figuring, that yeah since I have no other choice because of the environment, then I'm not lying to myself, it's okay to rely on porn temporarily until this situation changes.\n\nBut how long is temporarily going to be? Recently I started to realize that porn might be affecting my life in a negative way way more than how I imagined (especially social life), I used to blame the negative energy in my life on my poor routine, well, now I'm eating healthier, sleeping better, going to the gym, and as much as these activities were positive and fixed a lot of details in my life, now i can see more clear than ever the remaining negativities in my life that are not small and purely because of porn and it hit me that maybe I've tricked myself into allowing porn to be part of my life because I liked it deep inside, but now, after my recent realization, i guess if it's gonna give me a few minutes of pleasure and then hours of social and mental pain, then no thanks, I'd rather git rid of it no matter what.\n\nNow the problem is, I'm completely clueless, I mean with no sex on the table how long can fapping carry my? Some of you might even argue that porn-free fapping is still a bad habit that needs to be broken but then what am I supposed to do? How other people with similar situations went through this? I'll start with stopping porn anyway but I really hope if someone can give me any advice on how I can keep avoiding it in my situation without burning out or stressing myself with a burden more than I can bear. Thank you in advance!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oph2rf/i_will_try_to_quit_porn_for_good_for_the_first/", "title": "I will try to quit porn for good for the first time", "social_network": "reddit", "user": "Capital_Income1372", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1626970403, "permalink": "/r/DecidingToBeBetter/comments/oph2rf/i_will_try_to_quit_porn_for_good_for_the_first/", "nsfw": false, "first_save": 1635435088.9494643, "replies_charged": false}