{"id": "t5_2tand_t3_qaeces", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "e234981c-b061-4d83-8134-70d441847f74"], "text": "# Differentiation is Survival and the Universe Wants You to be Typical\n\nThis is my last annual shareholder letter as the CEO of Amazon, and I have one last thing of utmost importance I feel compelled to teach. I hope all Amazonians take it to heart.\n\nHere is a passage from Richard Dawkins’ (extraordinary) book The Blind Watchmaker. It’s about a basic fact of biology.\n\n*“Staving off death is a thing that you have to work at. Left to itself – and that is what it is when it dies – the body tends to revert to a state of equilibrium with its environment. If you measure some quantity such as the temperature, the acidity, the water content or the electrical potential in a living body, you will typically find that it is markedly different from the corresponding measure in the surroundings. Our bodies, for instance, are usually hotter than our surroundings, and in cold climates they have to work hard to maintain the differential. When we die the work stops, the temperature differential starts to disappear, and we end up the same temperature as our surroundings. Not all animals work so hard to avoid coming into equilibrium with their surrounding temperature, but all animals do some comparable work. For instance, in a dry country, animals and plants work to maintain the fluid content of their cells, work against a natural tendency for water to flow from them into the dry outside world. If they fail they die. More generally, if living things didn’t work actively to prevent it, they would eventually merge into their surroundings, and cease to exist as autonomous beings. That is what happens when they die.”*\n\nWhile the passage is not intended as a metaphor, it’s nevertheless a fantastic one, and very relevant to Amazon. I would argue that it’s relevant to all companies and all institutions and to each of our individual lives too. In what ways does the world pull at you in an attempt to make you normal? How much work does it take to maintain your distinctiveness? To keep alive the thing or things that make you special?\n\nI know a happily married couple who have a running joke in their relationship. Not infrequently, the husband looks at the wife with faux distress and says to her, “Can’t you just be normal?” They both smile and laugh, and of course the deep truth is that her distinctiveness is something he loves about her. But, at the same time, it’s also true that things would often be easier – take less energy – if we were a little more normal.\n\nThis phenomenon happens at all scale levels. Democracies are not normal. Tyranny is the historical norm. If we stopped doing all of the continuous hard work that is needed to maintain our distinctiveness in that regard, we would quickly come into equilibrium with tyranny.\n\nWe all know that distinctiveness – originality – is valuable. We are all taught to “be yourself.” What I’m really asking you to do is to embrace and be realistic about how much energy it takes to maintain that distinctiveness. The world wants you to be typical – in a thousand ways, it pulls at you. Don’t let it happen.\n\nYou have to pay a price for your distinctiveness, and it’s worth it. The fairy tale version of “be yourself” is that all the pain stops as soon as you allow your distinctiveness to shine. That version is misleading. Being yourself is worth it, but don’t expect it to be easy or free. You’ll have to put energy into it continuously.\n\nThe world will always try to make Amazon more typical – to bring us into equilibrium with our environment. It will take continuous effort, but we can and must be better than that.\n\n\\* \\* \\*\n\nAs always, I attach our 1997 shareholder letter. It concluded with this: “We at Amazon.com are grateful to our customers for their business and trust, to each other for our hard work, and to our shareholders for their support and encouragement.” That hasn’t changed a bit. I want to especially thank Andy Jassy for agreeing to take on the CEO role. It’s a hard job with a lot of responsibility. Andy is brilliant and has the highest of high standards. I guarantee you that Andy won’t let the universe make us typical. He will muster the energy needed to keep alive in us what makes us special. That won’t be easy, but it is critical. I also predict it will be satisfying and oftentimes fun. Thank you, Andy.\n\nTo all of you: be kind, be original, create more than you consume, and never, never, never let the universe smooth you into your surroundings. It remains Day 1.\n\nSincerely,\n\nJeffrey P. Bezos\n\nFounder and Chief Executive Officer\n\nAmazon.com, Inc.\n\nsource: Amazon 2020 shareholder letter", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qaeces/an_excerpt_from_jeff_bezos_final_shareholder/", "title": "An excerpt from Jeff Bezos' final shareholder letter", "social_network": "reddit", "user": "Okmanl", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1634527569, "permalink": "/r/DecidingToBeBetter/comments/qaeces/an_excerpt_from_jeff_bezos_final_shareholder/", "nsfw": false, "first_save": 1635436295.5643013, "replies_charged": false}