{"id": "t5_2tand_t3_kddmdv", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": " I would like to start off by saying I am in no way trying to bash marijuana or those who enjoy it. I think it can be beneficial to a lot of people for multiple reasons, but for me what was just harmless smoking before bed, turned into smoking multiple times a day. It really wasn’t healthy. Weed had made my depression and anxiety worse without me even realizing it. Anytime I got high I just wanted to lay in bed and waste away, stuff myself with bad food, and just sit on my phone. It eventually took ahold of my diet, and I developed eating disorders. I felt like I had become a lifeless zombie.\n\n It wasn’t until my second trip to the hospital a week ago when the doctors told me that I have CHS. (Cannabinoid Hyperemesis Syndrome) I had already been doing my own research and figured I was suffering from it, due to months of vomiting. While I was hooked up to the IV and my dad was sitting in the chair staring at me, I had made the decision to be better. No more wasting my life away. No more hospital visits. No more brain fog, and questioning why I feel the way I do. No more weed. \n\n It’s been a week without it, and I feel amazing. Today was the best day I have had in months. My relationships with others are already starting to improve as I’ve become more extroverted again. And since I haven’t been getting high and distracting myself, I’ve been able to properly manage taking care of myself and being able to eat more than just a few bites of food. My nausea, headaches, and body aches went away. I truly haven’t felt this good in my body for so long, it feels like seeing an old friend again. I even got a job interview this Saturday for my dream job! I’m more creative, I got back into drawing and playing music. I’m more content with life. I know it’s only been a week, but this just makes me so hopeful for the future and only how much better it will get. I just wanted to share this here in case anyone needs a sign to get sober or to change your life for the better. Here is to a new chapter of my life!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kddmdv/one_week_sober_from_weed_after_2_12_years/", "title": "One week sober from weed after 2 1/2 years.", "social_network": "reddit", "user": "mossymushr00m", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 36, "down_vote": 0, "creation": 1608002432, "permalink": "/r/DecidingToBeBetter/comments/kddmdv/one_week_sober_from_weed_after_2_12_years/", "nsfw": false, "first_save": 1635435463.1349235, "replies_charged": false}