{"id": "t5_2tand_t3_iklwzl", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I (22m) went to school with this girl since 4th grade. As we grew up and moved onto highschool we became closer. Our sisters were good friends, and we considered each other friends as well, and we continued to become closer throughout highschool.\n\nI always knew she was a bit different. She was somewhat closed off, but fairly popular in highschool. She was pretty promiscuous with guys throughout school, which made me uninterested until about grade 10 when we kissed at a party. I already had a crush on her but it became much more serious after that point. She ignored me for a while after that, but every once in a while she would try to come back into my life.\n\nIn grade 11 we had a class together and we talked a lot, and became close again. We went on a date, but I - not being great with girls at the time - was too nervous to   make a move which she later told a mutual friend she was disappointed about.\n\nIn grade 12 we were going out for coffee together a lot. It seemed like we both really liked hanging out together but nothing serious ever came of it then, we just studied together and talked. When prom rolled around, I \"promposed\" to her at this coffee place and she agreed to go with me. On prom night she seemed very uninterested in hanging out with me, and didn't come to the after-party with me. I was later told that she made out with another guy (friend of mine) at the party. That was sad.\n\nIn first year of University we went to different schools and she started dating a guy. I was trying to enjoy myself and not think about her, but she continued to ask if we could hang out, and was very flirtatious every time we did.\n\nAfter she broke up with him we were hanging out, watching movies and drinking together a lot. One night I told her that I've had these feelings for years and she didn't say much, but seemed glad that I said it. She later told me she also liked me, but said she wasn't looking for a relationship, which I was okay with but I still hoped it would eventually become that. We started a freinds-with-benefits thing which was great at first, but the longer it went on the more I wondered why she didn't want to be with me and it started to tear me apart. It became worse when she started talking about the other guys she was talking to, and even texting the while we were hanging out together. All we ever seemed to talk about was her sex life, and everything was about her. This went on for about 5 months.\n\nFinally one night I asked her to come to a party with me, but I was already drunk and started texting her a lot when she stopped responding. The next day she said she didn't want to hook up anymore because I was going to get hurt. I was super upset and resisted, which made it worse.\n\nThe problem after that is she still really wanted to be friends, and would continue trying to contact me often. This kept hurting me over and over. I was too afraid to kick her out of my life because i still wanted to be with her so badly, and honestly still kinda do now.\n\nA few days ago I told her I can't keep doing this. I noticed that I only ever posted on social media to get a reaction from her, and I thought about her constantly, and so much of what I did was aimed toward making her like me. I said that I hope I can be her friend eventually but can't do it right now. She understood but seemed sad, told me to block her on social media, and we haven't talked since.\n\nThe next few days were rough, but for the first time in years I feel like I'm doing things for me instead of for attention from someone else. I'm slowly feeling better and starting to truly work on myself and enjoy the things in my life that I previously took for granted.\n\n\nTLDR: I was pulled back and forth by a girl I was completely obsessed with for years. We eventually started hooking up, but she didn't want a relationship with me and continued talking to other guys. I finally cut her from my life and realized that she has had an overall negative impact on me. I'm now living for me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iklwzl/after_years_of_trying_to_be_the_person_she_wanted/", "title": "After years of trying to be the person she wanted, I finally let go of someone who has made me miserable for years", "social_network": "reddit", "user": "SpaceDogTodd", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1598972690, "permalink": "/r/DecidingToBeBetter/comments/iklwzl/after_years_of_trying_to_be_the_person_she_wanted/", "nsfw": false, "first_save": 1635437024.2546592, "replies_charged": false}