{"id": "t5_2tand_t3_nvikua", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Every fucking day is the same shit [24M] for me... especially living alone during quarantine. I wake up late, mindlessly browse Reddit for hours to numb myself (I don't even like it anymore tbh), and then I on really bad days I browse porn for HOURS [and don't \"finish\"] because I need the dopamine fix or whatever.\n\nI feel like I know my mind well now. I have anxiety & ADHD - I overthink about EVERYTHING, I worry what people think of me and my ethnic background (I'm Chinese-American), and my low self-esteem makes me unsure of myself. But one thing I DO know, is that - it's all I've ever wanted to be since forever. I even moved to a bigger city for it (I have a day job of course) and I've been to open mics as well... but I'm just... so fucking lazy. I think it's laziness?\n\nI waste my entire days and weeks just doing the same stupid routine, and I don't know how to snap out of it. I have a decent week or two where I run, meditate daily, and even journal but then I'll end it by watching porn for hours the next day or something -- I'm hopelessly addicted to this and it quite literally makes me cry thinking about all the time I have and am currently wasting.\n\nI feel so lost - I know I'm not \"old\" by any metric, but it just feels like time is passing me by and I'm pissing away my active 20s doing nothing and taking super tiny, ridiculously small baby-steps to becoming a comedian; when I know people int he scene who are my age or younger that are grinding daily and are getting places...\n\nIf any of y'all have read this far, god bless you. I really love this subreddit and appreciate all of you guys - and if you leave a comment or have anything to say at all, I love you even more. Thanks yall *sigh*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nvikua/i_know_what_want_to_do_in_life_i_have_the/", "title": "I know what want to do in life, I have the motivation, but I just have never been able to act upon it - what do I do? (ADHD, Laziness, Internet Addict)", "social_network": "reddit", "user": "explicado", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1623197527, "permalink": "/r/DecidingToBeBetter/comments/nvikua/i_know_what_want_to_do_in_life_i_have_the/", "nsfw": false, "first_save": 1635435562.4615312, "replies_charged": false}