{"id": "t5_2tand_t3_qby7hq", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "c6df14ee-195b-4e9d-8032-7cca73d46fe8"], "text": "Info about exam: it's in one month from now, end of November, it will basically to get a post graduate degree in business major. In my country a bunch of unis take that score however many unis have their own exam and judgement criteria, most of the time the syllabus is 80% same. \n\nThe exams mainly has Mathematics, English and logical reasoning in layman terms. The selection process comes after you have cleared this exam.\n\nInfo about me: first I started to study for this a year back, but then due to various different reasons i was not able to (read: covid infected parents, major surgery of a family member, my mental state at an all time low and depression) \n\nHowever, when compared to others in general, I have a better understanding of English and mathematics. Because I consume books like how we consume food, and I like mathematics as a subject and got above average marks in the subject. \n\n\nI just feel like I don't have any time now. I feel like other candidates have worked on themselves for far more time than me. Like they have an obvious advantage over me.\n\nThis resulted in my motivation being lost and I just can't find myself to study. How can I ever beat them with just my one month preparation when they were preparing for it months and months? \n\nAt times I feel like I should just drop it and go find a job, but I do want to get my post graduation degree though. One option is to just drop it for now but I am not prepared for the rejection I will feel and the disappointment and hundred other things my parents will throw at me. (they are funding my uni fees so I feel like I owe them my best, and right now I'm nowhere near my best) \n\nAny advice, words, help, motivation will be appreciated!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qby7hq/i_have_a_competitive_exam_coming_up_which_i_have/", "title": "I have a competitive exam coming up which I have not studied. I feel like now it's beyond me to score good in that. Idk what to do anymore, help me please", "social_network": "reddit", "user": "Welcometohell98", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634727601, "permalink": "/r/DecidingToBeBetter/comments/qby7hq/i_have_a_competitive_exam_coming_up_which_i_have/", "nsfw": false, "first_save": 1635435127.526216, "replies_charged": false}