{"id": "t5_2tand_t3_n6y6r2", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "TITLE: should be \\*now realizing\n\nIt was truly an odd circumstance.  I recall being in my first grade classroom at the end of the school day and a girl in my class had a new Ariel mermaid watch.  She told me that the watch tells you when you're going to die, so she showed it to me and it was flashing 9:00.  That was interpreted by her or by me to mean that I was going to die on my 9th birthday (2-3 years away).  Needless to say, I was very much not thrilled with that.  I went home panicked a bit (though I only remember the watch situation, not the going home or falling asleep on the couch in my pajamas).  When I woke up from my nap on the couch, I couldn't breathe - I was terrified.  \\[I remember the phrase my mom used to describe the color of my chest was \"fire engine red.\"  Those words to me feel like a powerful, blistering anthem.  When I hear her say \"fire engine\" in my head I can hear alarms and sirens accompany the word as it rolls forward off the tongue.\\]  I can just remember struggling to breathe at different locations - first the doctor's office, then the hospital, and I remember being upset that I wasn't a) already at the hospital, and b) that I still couldn't breathe.  It was one of those things where I tried to breathe in slowly to \"trick\" my lungs into taking in more air, but that was futile.  The panic and fear and lack of oxygen was really terrible - a truly harrowing experience.  In the end the first said it was pneumonia, but then they said it wasn't so I don't fully know what it actually was - part of me now thinks it might've been a kind of panic attack?  I guess we'll never know...  Adding to all of this is that on 9/11 I was 7 and living in NJ and my dad worked in NYC.  I knew that he'd sometimes worked at the WTC, but I didn't know if he did that day.  Nobody told me he was fine because other kids' parents weren't fine - for example my best friend's dad died.  But I spent the whole day obsessing wondering if he was okay or not - I basically had a visual representation in my head of all of my family members and I kept removing my dad and putting him back in to see what it would feel like in x, y, or z situation.  That messed me up too.\n\nI remember being so nervous leading up to my 9th birthday because the \"prophecy\" said I'd die on my 9th birthday.  I went to sleep the night before worried that I wasn't going to wake up.  Then I did wake up, which was a pleasant surprise.  But I still was afraid to do things throughout the day for fear that something was going to happen to me.  But I was very much relieved once the day turned after that - I felt like I was finally in the clear after 2+ years of having this on my mind pretty often.\n\nSo now, here I am.  I have a heart arrhythmia (WPW for those who know what that is) that I mostly took care of with an ablation but it still bothers me from time to time.  Last night I rolled on my side and tucked my chest in, felt my heart palpitate ONCE, and then couldn't sleep for hours checking how my body felt worrying and thinking that I felt like I was going to pass out.  Today my left shoulder and upper left chest have been bothering me, as has my left hip.  I still can't stop checking in to feel if I'm going to die.  As the title says - I do the same thing with sneezes, worrying that I might've ruptured some blood vessel or artery or something.  I can't live like this anymore.  I don't want to.  I'm seeing a therapist and am working on mindfulness periodically, but I can't shake this.  Thanks for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n6y6r2/i_had_a_medical_issue_when_i_was_6_currently_26m/", "title": "I had a medical issue when I was 6 (currently 26m) and I'm not realizing how damaging that was to my psyche - every time I sneeze I can't stop thinking about that sneeze for hours and hours and constantly checking to see if it feel like I'm gonna die.", "social_network": "reddit", "user": "tombstonekid8394", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1620393169, "permalink": "/r/DecidingToBeBetter/comments/n6y6r2/i_had_a_medical_issue_when_i_was_6_currently_26m/", "nsfw": false, "first_save": 1635437669.0996366, "replies_charged": false}