{"id": "t5_2tand_t3_jqxuvp", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I have a lot of things i want to get better at, but i never seem to start practicing/ practicing consistently because im afraid of practicing wrong/ spending a long time going about it the wrong way.\n\nIts happened alot, where i start trying to do something one way and it turns out to be stupid/ not being very beneficial. The thing is it can take me weeks or even months to figure that out.\n\nAs a result I've basically started doing several things:\n1) Reading articles upon articles of how to do something which all usually parrot the same couple of points that don't seem to work well for me, but i continue looking hoping i find the one thing i haven't tried/ might work.\n\n2) \"Speedrunning\" methods. Basically if i don't see potential in the method in the first few days im going to ditch it. Which may have helped me sometimes but may have resulted in me stopping doing things that may have been beneficial in the long term, too bad I'll never know which is which.\n\n3) Once i find a method that *might* work, i procrastinate doing it. Im not sure why i do this, but im guessing it might be because part of me thinks it will end up being a dud and ill be back to square one (again, this has happened before)\n\nThis fear also comes coupled with the fact that im just bad/slow at doing things, and when i do try out common methods they pretty much never end up working out. So i scramble around trying to find some \"secret\" method that will work well, or whatever. Even the methods that do work for me at the moment, part of me thinks that they're inefficient anf i should be doing something else, but i have no idea what.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jqxuvp/how_do_i_overcome_a_fear_of_practicing_making/", "title": "How do i overcome a fear of practicing/ making long-term wrong decisions?", "social_network": "reddit", "user": "Daisukideku", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1604929559, "permalink": "/r/DecidingToBeBetter/comments/jqxuvp/how_do_i_overcome_a_fear_of_practicing_making/", "nsfw": false, "first_save": 1635435480.2325377, "replies_charged": false}