{"id": "t5_2tand_t3_jf5o6j", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I’ve had some serious struggles with addiction in the past and it has been an absolute torpedo to my life. I’ve had cripplingly poor self image. I’ve spent more time wallowing in self hatred and self pity than ever doing the things necessary to get better. \n\nI’m deciding to be better. \n\nMy wife and me are currently separated and it’s been a very very difficult time. Albeit I’m doing well in terms of sobriety from my primary addiction and getting to at least 2 meetings a week, I’ve put little to none dedication into repairing my marriage. I mean like- *really* repairing it. Not ‘getting along’ and avoiding doing things to rock the boat. Inevitably an argument broke out a couple of weeks ago between me and my wife and it just escalated out of no where. Next thing I know my wife has taken our 2 year old son and gone to stay with her mum, and I’m on my own. Left with so much misery and self pity - ‘I’ve been getting better’ blah blah blah. \n\nNo, fuck you self pity. You are no longer keeping me prisoner. \n\nI’m going to make a video for my wife, not simply pleading for her to come back to me, but rather to initiate the love I have for her truly deep within me. In essence I’m going to make the case that our marriage can be like Kintsugi- the art of repairing broken objects with gold and ultimately creating a much more beautiful and valuable item. \n\nI need to fight for this marriage with everything, because that’s exactly what marriage ought to be. It’s not simply a ride where I’m taken somewhere and happiness is immediately granted. Nope. It needs to be worked with. It needs to be fought for. \n\nI don’t think my wife is stupid. I don’t think she chose to marry me 3 years ago out of a whim. She truly believed we would be happy together. I have not held up my end of the deal and my addictions have truly broken us. But I know I can fix this, and I’m hopeful we can be much much happier for it. \n\nI truly love my wife. I adore our son. I want nothing more than for us to be a family.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jf5o6j/you_know_what_im_gonna_get_my_marriage_back_im/", "title": "You know what? I’m gonna get my marriage back. I’m gonna fight tooth and nail to fix this. Not just so that things can go back to the way they were, but so that we can truly, deeply be happy.", "social_network": "reddit", "user": "iamgettingbetter_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 31, "down_vote": 0, "creation": 1603252418, "permalink": "/r/DecidingToBeBetter/comments/jf5o6j/you_know_what_im_gonna_get_my_marriage_back_im/", "nsfw": false, "first_save": 1635437012.482662, "replies_charged": false}