{"id": "t5_2tand_t3_qbsdvo", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "My partner (22F) drinks quite a bit of alcohol on a daily basis, she consumes about 750ml is hard liquor (40%> ABV) and usually dilutes it with coke, she usually consumes it throughout the day or in 2 days. \n\nContext, she was previously clinically depressed and lost the meaning of living.  It has gotten better, but she tells me that she would prefer to stay in bed all day and do nothing it weren't for the alcohol.\n\nAlcohol helps her get out of bed, gain confidence, and gives her reason to do daily things that people do (work, eat, run errands).\n\nAs her long term partner, I fear that the long term effects of alcohol consumption might have a damaging impact on her overall physiology and mental health.  Her dependence and seeing how much she drinks scares me.  \n\nI've explained to her the effects it can have on the body and in the long term, but she does not seem to be able to take it as seriously as I would like.\n\nCan you please give me some tips, and advice on how I can speak to her about this issue and how we can \\[hopefully\\] reduce her consumption and find happiness/meaning/life satisfaction in other things? For example, I've tried to say that life experiences are much more fulfilling, doesn't seem to have worked yet.\n\nI would also appreciate if you could advice where else I could post this (ie. other subreddits) where people can offer some help.\n\n&#x200B;\n\nThank you in advance kind redditors", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qbsdvo/how_to_help_my_partner_reduce_alcohol_consumption/", "title": "How to help my partner reduce alcohol consumption?", "social_network": "reddit", "user": "cronoss40", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1634702220, "permalink": "/r/DecidingToBeBetter/comments/qbsdvo/how_to_help_my_partner_reduce_alcohol_consumption/", "nsfw": false, "first_save": 1635435073.2080247, "replies_charged": false}