{"id": "t5_2tand_t3_nbts4l", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "I'm a 22 year old uni biotech student, currently third year, with many exams to face going forward. I've dealt with diagnosed depression before, related to a difficult family situation and a toxic relationship with a girl, some remnants of those situations are still here and both left me quite hopeless and scarred... it's a very long story.\n\nI would love to leave my family but i don't think i have the financial help nor the mental strenght at this point. I don't even think i can afford to see a psychologist, my parents hated paying for that.\n\nI am tired of being this way but know no way to change this. I can't begin studying. The mere thought of it is so very uncomfortable... it's been like this for a year at least, i fear it could be depression again mmaybe in a new form, i really don't know.\n\nLockdowns and covid has not helped of course (at least before i had the gym and saw someone), i  also compare myself a lot and seeing people having fun, a social life and success \\*even\\* in a pandemic makes me really hate myself.\n\nIt is not even that the subjects are too hard or it is something I can't like. I just can not get myself to study until a few hours before an exam, whose results never fail to disappoint.\n\nInstead I do very specific and monotonous things on my computer. I would open a news site , a ebook, youtube and go through them one by one, watching, commenting... and this takes the hours away from my day! \\*Or I either watch movies/tv shows or play a video game, sometimes i'm too tired even for that.\n\nI am very uncomfortable with this life. I derive no real pleasure from these activities. They just give me a temporary release. But the very thought of studying makes me feel so very uncomfortable that I subconsciously revert to the mind-numbing time wasters.\n\nThere are 2 ways I see I can help myself:\n\n1. I can force my way through and push myself . This hasnt worked in the past as I end up feeling helpless and tired.\n2. Meditate to find out what is the source of this and how can I deal with it . But this again has not been very efficient and takes me nowhere.\n\nThis discomfort seems so natural to me that I can't even dissociate it from myself. I would never be that person who gets good grades and has a good social life (I went to the gym regularly  before lockdowns and am attractive enough to not be a completely social outcast, yet i \\*almost\\* am).\n\nIt is all apathy. I dont feel like I can do anything. I feel like I'd fail at everything or would simply be not good enough for the task, yet i yearn for independance. I know all this and I still feel helpless.\n\nDo you have any suggestions to tackle this? Any form of advice or point of view? Thanks.\n\n*I think I wrote too much . Sorry about that . I have a fever of 102.6o* *F and I dont have much control of my mind.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nbts4l/i_cant_force_myself_to_study_even_if_i_want_to_a/", "title": "I can't force myself to study even if i want to, a general apathy", "social_network": "reddit", "user": "MegaThrower", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1620946379, "permalink": "/r/DecidingToBeBetter/comments/nbts4l/i_cant_force_myself_to_study_even_if_i_want_to_a/", "nsfw": false, "first_save": 1635437760.9627614, "replies_charged": false}