{"id": "t5_2tand_t3_kujxlc", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Hello lovies of the internet,\n\n(Don't thrash me if this is a wrong sub to post this, what I am going to say means a lot to me...)\n\nMy boyfriend is a wonderful story writer, but he get's very little appreciation because among people  we know, they hardly read stories. And also, his stories are full of insight and really exceptional. He puts in a lot of work and each word has something hidden in it, so much so that you will need to put your whole brain to it to understand it. But when you do, you won't regret it.\n\nDue to lack of critic on his writings he has taken the decision to quit writing and that's killing him and me from inside. He wants to have an honest critic for his writings, he wants to grow as a writer, but there is no circle who would help him do that. There isn't any circle where there would be a healthy criticism on writings. And that's highly disappointing for any growing artist.\n\n**I want to form a group of all such people who would like to be part of such a circle and give healthy critics on each others' work and help each other improve. You don't necessarily have to be a writer, you can serve as a reader and give your honest critic on the writings.**\n\nGuys, I am breaking down because of his decision and so is he. I know he is a wonderful writer, and I can't let him quit this way. I can't let such a wonderful writer die before the world gets to know him.\n\nThis is my only hope. Please help.\n\n(Also, I am aware of the r/stories and r/story and all other subreddits of this kind, he has tried there but it doesn't help much. So, this time I want to form a specific group for him. That would help not only him but also such blooming writers who are serious and dedicated enough to their writing)\n\nLooking forward to positive replies from your end. DM me if you want to know more...", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kujxlc/help_and_feedback_need_to_for_improving_writing/", "title": "HELP and FEEDBACK need to for improving WRITING SKILLS.", "social_network": "reddit", "user": "Drowning-moon", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1610303927, "permalink": "/r/DecidingToBeBetter/comments/kujxlc/help_and_feedback_need_to_for_improving_writing/", "nsfw": false, "first_save": 1635438213.49095, "replies_charged": false}