{"id": "t5_2tand_t3_3h6mbe", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "from my [blog](http://selfimprovementguy.com/ebook):\n\n**Habits: we all have them, good and bad. And from time to time, breaking the bad habits and sticking to the good ones can seem like an uphill struggle...**\n\nSelf-Improvement involves intentionally and consistently engaging in the right activities. Habits are not always intentional, but they are all about consistency, so they're a key piece in the Self-Improvement puzzle.\n\n=======================================\n\n**\"HABIT: a settled or regular tendency\nor practice, especially one that \nis hard to give up\". (Google)**\n\n=======================================\n\n**How are your habits?**\n\nWhat habits do you have? Even if you're not particularly organised and don't have a consistent schedule, you will still have some habits. What routines do you tend to follow? What tasks do you do every day without thinking about them? Do you eat certain foods at certain times of the day or listen to music during a particular activity? Habits can be conscious actions (taking your dog for a walk every morning) or unconscious responses (biting your nails under stress).\n\nA good foundation for Self-Improvement is knowing yourself: analysing and evaluating what you currently do and identifying areas for change (I emphasis this in [my book](http://selfimprovementguy.com/ebook)). You will have some better habits and some poorer ones. But how can you reinforce those that serve you and eliminate the ones that don't? It's not always easy!\n\n**Habit formation**\n\nJust like habits themselves, habit formation can be either conscious or unconscious. There have been various suggestions about how long it takes to create a habit: the original myth of 21 days has been widely debunked and research at University College London now suggests it can take anywhere between 18 and 254 days!\n\nI imagine the time it takes to form a habit depends partly on the type of habit and the amount of resistance you have to forming it. For example, during my morning dog-walk, I am in the habit of visiting my local branch of Booths every day for a takeaway coffee. When I first received my Booths loyalty card, a delicious free cup of fresh coffee was not difficult to integrate into my routine! Is this a habit? Yes, according to the dictionary definition above. And it took nowhere near 18 days to form. On the other hand, I tried repeatedly to form the habit of drinking plenty of water each day, only to find that after a few days I was back to not drinking enough and consuming diet Coke instead.\n\n**Habit replacement**\n\nOne way to eliminate less helpful habits is to directly replace them with more helpful ones. Rather than eliminate that unhealthy snack between meals, you might replace it with a healthy one.  Or you could try reading a book instead of watching too much TV (see my post about watching less TV). Getting rid of a habit, even when it is not serving us, can feel like 'losing' something. Reconfiguring this as a replacement or \"swap\" can help.\n\n**Habit chaining**\n\nHere's a method of habit formation that works well for me: connecting a new habit to an existing one. This was how I eventually increased my water intake. I started filling my water filter jug each day when I went downstairs to let the dog out. The jug filled while he \"went about his business\" and then I collected it on my way back upstairs where I work. Once the jug-filling had been added to the habit chain, it was an easy matter to add the next link: drinking the first glass of water. I then chained on one more link - refilling the empty glass - which sat next to me on my standing desk to remind me to drink more. Habit-chaining these tasks has been 100% successful: I now drink plenty of water every day without fail.\n\n**So What About The Teeth?**\n\nOne habit I had a lot of trouble with was inter-dental brushing. My dentist advised me a few years ago that in order to keep my gums healthy, I should use an inter-dental brush daily. I tried habit-chaining but the resistance was too great: I just couldn't be bothered fiddling around in my mouth to try to get the brush in the right place. It's a bit of a skill and I found it too difficult to attempt every day. I would do it every so often but I would get frustrated with the amount of time it took and give up again. I still didn't have it figured until about 9 months ago...\n\n=======================================\n\n**A CHILDHOOD MEMORY: I didn't like tinned sweetcorn. If it was served on my plate, I would refuse to eat it. I can remember my mum used to encourage me to try it, and when I refused, she would say, \"Just try one little piece. It won't hurt you to try!\" I would tentatively put a single piece of corn in my mouth, pull a face, swallow it and make horrid noises. I was not persuaded.**\n\n=======================================\n\nRemembering my mum's words got me thinking: it wouldn't hurt to clean between just two of my teeth, would it..?\n\nAnd that's what I did. On the first day, before brushing my teeth, I cleaned between just two of them with an inter-dental brush. It took a second or two. Job done. On the second day, I cleaned the same gap, plus another one.  Again, this was over in seconds.\n\nI'm sure you can guess what happened next. I have had a few extractions, so the teeth I am left with have exactly 24 gaps between them (I guess the maximum for a full head of teeth would be 30 gaps.) Each day I started with the gaps I had cleaned previously and cleaned just one extra gap. As I progressed, my skills developed, I got to know all the best angles to use and the job got quicker. It was almost fun! And in 24 days, I got to cleaning between all my teeth quickly and easily.\n\nMost importantly, I have continued to clean between my teeth immediately before brushing them every day, without fail, for the last 9 months. I reach for the inter-dental brush automatically now, no thought required. My gum health has improved dramatically and my dentist is delighted!\n\n**The Elephant Revisited**\n\nYou've probably heard of the \"Eating an Elephant\" Self-Improvement technique. You break down large, seemingly impossible tasks (like eating a whole elephant) into smaller, manageable chunks. Eat small pieces for long enough and you'll eat the whole elephant. (Why an elephant?  Who on earth wants to eat an elephant? Feel free to let me know in the comments.)  My inter-dental brushing technique is similar: except you start with tiny pieces and increase the size each day.\n\nIt might be a 'man thing'; but the process of cleaning one extra gap each day became a game I was playing. Having to remember how many I had cleaned the day before helped me focus on the task. Daily success was only one extra gap away: I could congratulate myself on \"levelling up\" every day. And \"Game Over\" was exactly 24 days away if I got it right every time.\n\n**Crazy?**\n\nOf course, cleaning between  just two of your teeth seems crazy: it's not enough to make a difference. But the same could be said for replacing one of your fifteen cookies with a grape, or one of your thirty cigarettes with some gum.  Parking one space further away from the door at work so that you walk an extra two yards seems pointless.  But progressed daily, when your grapes have completely replaced your cookies, your gum has eliminated your cigarettes and you are walking from a parking space half a mile from your office, the benefits start to show.\n\n**Take Action**\n\nWhat habits do you find difficult to develop or maintain? Could you apply this method? Even if the first few days look pointless or crazy? How about:\n\n* Walking up 1 step and then coming back down to take the elevator?\n* Running for 10 seconds?\n* Doing 1 press-up?\n* Watering 1 house-plant?\n* Writing 1 sentence?\n* Meditating for 5 seconds?\n* Eating 1 raisin before your chocolate bar?\n* Taking 1 sip of water before your coffee?\n* Reading 1 paragraph? \n* Getting out of bed 1 minute earlier? \n\nLet me know what you try and whether it works.\n\nOriginal post at [selfimprovementguy.com](http://selfimprovementguy.com/what-i-learnt-about-habits-by-cleaning-between-two-of-my-teeth/)\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3h6mbe/what_i_learned_about_habits_by_cleaning_between/", "title": "What I Learned About Habits By Cleaning Between Two Of My Teeth...", "social_network": "reddit", "user": "djhendra", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1439713952, "permalink": "/r/DecidingToBeBetter/comments/3h6mbe/what_i_learned_about_habits_by_cleaning_between/", "nsfw": false, "first_save": 1635436219.0752194, "replies_charged": false}