{"id": "t5_2tand_t3_jpbrjm", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hello! This may not be the path for everyone, but journaling as changed my life for the better! I don’t even do it every day!!\n\nI kept a sporadic kinda silly teenage girl journal in high school, and in college I started a more “serious” one in 2014 and filled all the pages by spring of this year. Getting to read back through 6 years of development, love, pain, friendships, joy, phases of interests, personal losses and wins, blossoming career goals and revelations is a gift I worked hard for over half a decade to give myself! Extremely cathartic. \n\nI started rereading my journal a few months ago a bit after I finished it. Some of what I had written was shocking and made me very very grateful and proud to be where I am today. I wanted to give that 21, 22, 23 year old girl a hug. I’m so glad I stuck around to see the present moment and didn’t give in to the darkness, even when I felt like I had very few other options. \n\nI got to relive a nasty cocaine addiction, weed dependency, and a few really sad and hurtful relationship experiences that felt so deeply awful at the time but are now a distant memory. I’ve found that it’s so easy to forget what got you to where you are, even if it seemed like hell. \n\nThe bad stuff helped me develop boundaries and having the privilege to remember it from a distance gives me the chance to understand myself deeply. And it’s always nice to read and remember your good times, too! Little victories are sometimes all we’ve got! \n\nI hope everyone is having as good of a day as possible. Either way, write it down ;)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jpbrjm/journal_journal_journal/", "title": "Journal, journal, journal!", "social_network": "reddit", "user": "mortalmeatball", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 86, "down_vote": 0, "creation": 1604691347, "permalink": "/r/DecidingToBeBetter/comments/jpbrjm/journal_journal_journal/", "nsfw": false, "first_save": 1635436872.2976363, "replies_charged": false}