{"id": "t5_2tand_t3_q8egfz", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Today I had a shit day and needed to vent somewhere other than my journal.\n\nIn the last couple years I’ve struggled a lot with toxic relationships, bad anxiety, lack of direction and feeling very lonely. \n\nSince then, I worked very hard on myself, got fit, am working on completing my degree, got a part time job and started therapy.\n\nSometimes I feel lonely. I have few friends and my close family has their own load of problems to deal with, so I end up keeping things for myself. \n\nThing is, some days I’m very proud of myself, some other days, I fail to complete the tasks I set out to do, which is fine, but sometimes I just feel down and wanted to be listened to. It’s not that I feel bad about it, I accept things as they are, but I just wanted a bit of attention from someone and a word of encouragment, something.\n\nI’m just posting this to vent a little, overall I feel good about myself and I know that I’m headed in the right direction. I’m optimist in general, but bad days are rough, it’s like all my efforts aren’t noticible. It’s hard to see light at the end of the tunnel, but I keep on moving.\n\nFinally I’d like to share that I deleted all social media (apart from instagram that I had already deleted before) and will try hard to no fill my mind with garbage.\n\nI would also like to wish the best of luck to anyone on a similar position, stay strong my friends!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q8egfz/staying_motivated_after_bad_days_feeling_lonely/", "title": "Staying motivated after bad days & feeling lonely", "social_network": "reddit", "user": "Lonesav", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1634264361, "permalink": "/r/DecidingToBeBetter/comments/q8egfz/staying_motivated_after_bad_days_feeling_lonely/", "nsfw": false, "first_save": 1635437447.3892589, "replies_charged": false}