{"id": "t5_2tand_t3_fik2q4", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": " \n\nDear  people, in all the Corona-commotion, good things still  happen. I've completed my third round around the sun sober. What a great  year it was. I'm very grateful for all the gifts sobriety has given me.  It's nice to see how these gifts have evolved during the years. Maybe my story could inspire someone who's struggling with alcohol, like I was in the past.\n\nThe first year:\n\nI  chose for sobriety in a very turbulent time in my life. Existential  problems due to finishing my higher education and not knowing what the  hell I was supposed to do next. There's the classic quarter-life crisis.  I loved going to university and a lot of my identity was built upon my  academic pursuits. Suddenly that all fell away and left a big void. I  used to drink to not interact with those strong and complex emotions. I  had difficulties in the relationship I was in then. My underdeveloped  emotional side couldn't handle talking about feelings and getting into  conflicts.\n\nIf I look back even  further, I could say I abused alcohol to supress emotions for the first  time when I was still at the young age of 15. This was three weeks after  I had my first beer. So it actually all went downhill quickly. Most of  my peers and the adults around me didn't think this was bad, just a part  of being a developing teenager in Low Countries.\n\nI've  been using this strategy to avoid complex and difficult emotions, to  avoid facing my (social) fears, to avoid being vulnerable, to avoid  conflict until I chose sobriety at 24. A switch turned in my mind after  my best friend had to put me into my bed, because I was to drunk to get  there safely. Somehow this time sobriety sticked. Before this time I had  periods of sobriety of weeks or months after a harsh hangover or  relationship fallout from drinking. Losing friends, losing memory,  losing health.\n\nDuring the first   year I was mostly clearing debris from the past in therapy, changing  social circles,  finding my first job as a consultant. There were  difficult conversations with my parents about deep feelings that I was  never able to express. There was a lot of internal growth in this  period. Just learning how to talk about emotions, and learning that  emotions are an important part of life. I was a 'stoic' person in the  past, who thought expressing emotions was weak. That's some bad  masculinity right there.\n\nIn the  end of the first year, I wasn't great yet, but it was getting better.  Around this time I started taking SSRI's. These made me feel grey all  the time and killed my sexdrive while I was taking them.\n\nThe second  year:\n\nDuring  the second year, eventually my relationship with my ex ended. It didn't  end on good terms at the time. Now, we can be active friends. I feel  this is a more natural way of interacting for us.\n\nI  got fired from my first job, as it was a bad fit. This was a good  thing, as I was looking for another thing myself already. I've found a  new career path in education during this time. This felt so much better  than my job as a consultant. I was even eager to go to work most of the  time, getting fulfillement from seing my students progress through  mathematics. I've found a new house, which I corented with a friend. All  was going better this second year. During this year I also stopped  taking SSRI-medication, as I was tired of feeling nothing all the time.  After slowly reducing the dose, I was able to continue without the  medication.\n\nIf the first year was  clearing debris, this second year was mostly building a stable base for  future life and consolidating the lessons from the first year. I've  found new friends that support me in sobriety if I tell them about it.  I've lost a lot of drinking-buddies, which was inevitable after chosing  the sober path. I've even reconnected with a friend from the past who  chose sobriety after heavy drinking and drug abuse. Now we support  eachother to stay on the right path. During the year I felt that my  social network got stronger and that my self-esteem got better.\n\nThe third year:\n\nIf  the second year was building a secure base, then the third year was  expanding my life and my comfort zone. As I kept at therapy during all  this time, I've found my personality was changing for the better. I  became more empathetic, suportive, was a better listener for my friends  when they needed me. My social skills had already improved. I've found  my inner beliefs were improving.\n\nI  became more humble, less governed by a fragile ego. What a freeing  experience this is. I've returned to improv theate, which I was doing in  the past. I started dancing oldschool jazz solo. After three failed  auditions for the final level of lindy hop dancing, I followed the  advice of the jury instead of being to prideful to do this. I allow  myself to be bad at something more easily now, which allows faster  growth. This still doesn't come easy, but it gets easier.\n\nLast  week, I stepped outside my comfort zone by DJ'ing at a party. \"DJ'ing?  That's exposing your personal music taste to so many people. That's  showing your vulnerable side to 50+ people\" my anxious side was telling  me. In the end people were dancing on my music. It gets even better,  when one of the dancers asked me to put on a funk song to do a 'soul  train' to, I was suddenly so happy. I love 'soul train', and they want  to do it to my music? A dream that I didn't even knew I had came true  then and there.\n\nIn this year I  probably had the most entertaining summer in the last decade. 30 days  spent at festivals of the 60 days vacation, wow! As a sober person on  Youtube once said: \"life is not over when you're sober, life is just  beginning and it's a beautiful life.\"\n\nFuture plans:\n\n\\- I want to keep expanding the comfort zone, by trying new, scary things. When expanding the comfort zone, I feel very alive.\n\n\\- I want to be more active in my dancing communities by volunteering at the bar or DJ'ing.\n\n\\-  I want to be vulnerable in front of an audience more often, to show my  inner self that it's ok to be vulnerable, that people won't leave you  suddenly. I'll join an improv jam in some weeks.\n\n\\-  Keep going to therapy to improve my emotional side. I'm already so much  better than before, but there's still room for improvement. Usually,  when I share my deep wants and needs, some good plans come up: like the  solo dancing, going back to improv.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fik2q4/three_sober_years_sober_life_is_sublime/", "title": "Three sober years, sober life is sublime.", "social_network": "reddit", "user": "engineer_whizz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 835, "down_vote": 0, "creation": 1584199750, "permalink": "/r/DecidingToBeBetter/comments/fik2q4/three_sober_years_sober_life_is_sublime/", "nsfw": false, "first_save": 1635436889.287084, "replies_charged": false}