{"id": "t5_2tand_t3_j0j72l", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "To be honest, I am struggling. I have completely socially isolated myself from those who were closest to me, and my depression/anxiety has severely worsened.  I have pushed away some people from my life that I truly care about, and now I am facing the consequences. I have taken these relationships for granted, and I will try to learn from my mistakes.\n\nI have come to terms that there is a lot I need to change about myself and the way I think.\n\nI have put others's needs before myself for so long to the point where it has been very detrimental to my own mental health. While I still will do everything in my power to care for others, I am going to stop ignoring my own issues.  It's okay to ask for help sometimes.  It's okay to not be okay.\n\nMost importantly, I have come to the realization that most of the reason why I feel \"misunderstood\" is my own fault.  It's not because society is \"out to get me\".  I need to let people in and stop letting my fear of being taken advantage of take over.\n\nI realized that for me personally, loving myself is a lot harder than loving others. I realized that if I am unhappy with who I am then I will not be able to fully give my all to others and in my relationships.\n\nEveryday is a struggle, but I realized that the only way I will have a chance of achieving real change will be through improving my mindset and not being afraid to ask for help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j0j72l/after_neglecting_my_mental_wellbeing_for_nearly_4/", "title": "After neglecting my mental wellbeing for nearly 4 years, I finally started going to therapy and will try to stop blaming the outside word for the way I feel.", "social_network": "reddit", "user": "spacehiphopnerd", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 72, "down_vote": 0, "creation": 1601174223, "permalink": "/r/DecidingToBeBetter/comments/j0j72l/after_neglecting_my_mental_wellbeing_for_nearly_4/", "nsfw": false, "first_save": 1635435194.43636, "replies_charged": false}