{"id": "t5_2tand_t3_o0mkgv", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I don't really know how to say this other than I'm really, really dumb. I make dumb assumptions and absent-minded mistakes all the time that leave me out money or time or generally at an inconvenience. I don't know how it always happens, but it does, and I don't know what to do. Here's a recent example:\n\nI (30m) broke it off with my partner (32m) of two years and decided to move out and buy a car. I budgeted at length, agonized over what I could afford, and hesitated to make a decision specifically because I knew there must be something I was forgetting or otherwise overlooking. I asked him if it seemed reasonable and accurate and if I was doing the right thing, to which he replied that even budgeting was more than he'd done and it looked totally reasonable and he couldn't think of anything I didn't already consider. That made me feel great because I could move forward with the apartment and car I wanted and not have to feel like I was waiting for the other shoe to drop. I had to borrow a little money from my parents (which I've never done prior) to put a big chunk down on the car I wanted so that I'd have a small loan and monthly payment. It was most of my savings but felt like a good investment. I've spent most of my adult life with barely any money and for the last 6 months I've been in a job making more than twice as much as my previous job. I say that to say that I'm no stranger to being frugal, but found myself in a situation where I needed to make some big purchases and wanted to make sure I was happy with them without being too crazy with spending. Again, I got it confirmed that I'd been very smart about the way I approached my purchases and was not out of line.\n\nMeanwhile, I'd just enrolled in my workplace's 401k plan and bought a couple of pieces of furniture for my new place (I don't have much after moving out of my partner's place that he'd already furnished prior), but I made sure to leave myself enough to get through the next few days, knowing I'd be getting paid by Thursday. I woke up today to a notification that a credit card payment I'd scheduled had posted and when I looked, realized I'd overdrawn my account by mistake, forgetting that I'd scheduled that payment. Oh well, still know I'm getting paid in a couple of days so no big deal.\n\nBut, on top of that, I got my pay stub today and saw it was much lower than I expected (I'm talking 25% of my normal pay). Of course I freaked out and asked our business operations person what was up, then looked over the paperwork I'd submitted recently for my 401k. I had opted for 50% of my *compensation* to go to pre-tax 401k contributions and 50% to post-tax. When I spoke with our partner, he suggested that I split my contribution 50/50, but he was talking about splitting a 10% contribution, not my *compensation*, so when I filled out the form, I had 50% in mind rather than 5% like it should've been. Granted, our business operations person did say that she asked our HR manager if my forms looked odd, *but never asked me,* which is its own version of what-the-hell.\n\nSo I spent hours and hours and hours agonizing over a budget for moving and buying a car to get out of my ex's place ASAP and double-checked to make sure it wasn't totally reckless and stupid, got it confirmed that no, I was being thorough and smart, only for it to not even matter because I so royally effed up planning around a credit card payment and a completely bonkers mistake on a work form leaving me almost completely broke for the next two weeks. Meanwhile, he told me he hasn't put anything into savings in months, makes way more than me, and hasn't had any issues.\n\nI do things like this *all the time*. Plan, agonize, wait, think, hesitate, double- and triple-check *knowing* that I will have overlooked or forgotten *something* critical, only to be completely blindsided by something that I otherwise had no reason to suspect I completely botched or some insane alignment of the stars of bad luck or both. Why am I like this? How do I stop making these ridiculously stupid mistakes and shooting myself in the foot? I'm 30, I have a Bachelor's degree and a Master's degree, and I still feel like I need a friggin babysitter half the time. I just don't understand how I can be so hopelessly absent-minded and dumb.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o0mkgv/being_less_dumb/", "title": "Being Less Dumb", "social_network": "reddit", "user": "synchrxny", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1623785570, "permalink": "/r/DecidingToBeBetter/comments/o0mkgv/being_less_dumb/", "nsfw": false, "first_save": 1635436980.6531205, "replies_charged": false}