{"id": "t5_2tand_t3_q33xb4", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "This is a problem that I've been having since I was a child I'm 23 by the way. All of my life I just couldn't create a very close relationship with anyone I meet like I had friends during elementary school highschool kinda, but nothing too meaningful it seems to me that most people have that one friend every since childhood or latest high school, and they considered each other equals and 'can't do it without em' no matter where I go I see this in real life, social media, movies,  western TV, video games, and anime. Where people just have a close friend to depend on.\n\nI don't feel anger or resentment from it I just feel subpur and miserable like there's is something wrong with me. After I've interacted or see people like that I feel empty, but when I'm alone I'm fine I even talk to myself aloud most of the time I able to to find ways to entertain myself and have fun by myself. Like right now I'm learning how to play the acoustic guitar by myself, and I feel fulfillment doing it, but once I get in an environment with other people, and see how they interact with each other like they're close friends and stuff I feel empty, miserable, and lonely, and this is an insecurity that other people can spot as well. I remember back in highschool that still creeps back up, and fucks with me that a girl once told me that \"she has lots of friends but can we say the same about you\" now I won't say that the comment wasn't unwarranted, because I was being an asshole towards her, because back in highschool I was that one guy who thinks he's funny and cool, but actually he's not. I played that role to the core, and I realize back than I really wanted people to like me, so I could have that deep connection with someone.\n\nI hate to sound like a black pilled incel doomer, but at times it feels like I will never know what it feels like to have a deep and meaningful friendship with someone, and I will be stuck feeling like this it's like all the friendships I see are all set in stone, and they don't need anyone else. Right now I have a Xbox friend group, and there is two guys in the group they were best friends since childhood, and they do everything basically together I can see that they vibe with each well better than anyone else I meet in my life. I'll have to admit they both are dicks, but I do enjoy playing games with them, but ultimately I know that I don't matter to neither of them  I got into a argument with both of them for different things, and they both said that they don't care if I leave or not. I've never once said or indicated that I would leave, and they said it because apparently they've a few people leave them because one of them would say or do something that would cause that to happen. That just fucks with me, because it embodies everything that I've been struggling with that no matter what I do I just don't ultimately matter to anyone, and that no one cares about me in a deep connective way. That I'm no one's top person.\n\nI just want to know how can I cope with this feeling or just find a way to move on with life not having any close friends, and I do apologize for sounding very clingy this has something that was a problem for me every since I was a kid, and I want to find a way to solve it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q33xb4/how_to_copedeal_with_not_having_any_close_friends/", "title": "How to cope/deal with not having any close friends?", "social_network": "reddit", "user": "throwback115", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1633592116, "permalink": "/r/DecidingToBeBetter/comments/q33xb4/how_to_copedeal_with_not_having_any_close_friends/", "nsfw": false, "first_save": 1635436705.3265977, "replies_charged": false}