{"id": "t5_2tand_t3_4pg6qe", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Hi guys.\n\nLong story short: my friends are dragging me down. There's a saying that you're the average of five people you spend the most time with. Luckily for me I spend most of my time on self dev subreddits (slow time at work), so keep my head high and somehow still believe in myself (thanks guys, by the way).\n\nThe thing is I want to change. I want to stop drinking, start eating and sleeping better, and keep going to the gym. My friends, well, there are the definition of complacency. I love them, but I can't count on them too much when it comes to self improvement. You know: \"you won't last a month\", \"oh come on it's just one beer\" and the usual \"don't try to be better than us\". \n\nI don't want to be better than them. I want to better *for* them and myself. I want to be able to help them when they'll need this and be a \"solid\" guy. \n\nBut, as many of you probably know, it's hard. It's hard to know you'll no longer be invited to the all-night drinking binges, even though I can have fun without alcohol. It's hard to constantly fight with yourself when you hear \"oh, come on, one bag of chips won't kill you\". I meet new people from time to time (usually at the gym), but it's hard to call them \"friends\" (yet). I try to stay positive and improve despite those *first world problems* and it helps me to keep going.\n\nSorry for this pretty lame rant, but I have basically no support, except for my family which I don't see all the time. I'm looking for advice on how can I deal with this. Cutting my friends off is unfortunately pretty impossible: the \"core\" of my group is my flatmate and I can't afford moving out.\n\nI would greatly appreciate any advice. You can also call me names, I find it motivating sometimes.\n\nCheers.\n\nEDIT: Thank you guys for all the advice. I appreciate your support, it's good to hear that there are more people like me who managed to better themselves despite some obstacles. Thank you and keep up the good work everyone!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/4pg6qe/how_to_deal_with_complacent_friends/", "title": "How to deal with complacent friends?", "social_network": "reddit", "user": "mental_diarrhea", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 20, "down_vote": 0, "creation": 1466680076, "permalink": "/r/DecidingToBeBetter/comments/4pg6qe/how_to_deal_with_complacent_friends/", "nsfw": false, "first_save": 1635436019.98703, "replies_charged": false}