{"id": "t5_2tand_t3_jvka4s", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "if I was half the person my peers seem to believe I’m capable of being, I’d probably be way farther than I am today. \n\nI have a lot of privilege on my side - was homeschooled in the suburbs for a good portion of my life, got a solid hs education, okay undergrad experience, and am now in my second year of grad school, which I was awarded a full ride to. Since day I I’ve been struggling to be motivated in school bc I don’t really think I knew what I was getting into, but I just couldn’t pass up a free Masters (public policy) in good conscience. \n\nBut I’m failing on pretty much all cylinders. Despite unfortunate combo of imposter syndrome, burnout (I went full time, straight from undergrad), undiagnosed adhd and some other mild-to-moderate issues, I’ve been able to get by with mostly B’s and B+’s (one A) thus far. but there’s this *one freaking required class* that always starts off well n then I fuck up majorly mid semester n end up being about to bomb it, so I withdraw. This is my *third straight semester* of being in the same class, same position and I am humiliated. It’s just endless frustration here. I don’t want to be here. the ppl I’ve met and the situations I’ve been in as a result of moving for grad school have been great but I really resent the academic experience itself, especially since going remote. \n\nAnd my personal life seems impossible to manage. Everything is either inconsistent, shit, or consistently shit - the state of my room, my hygiene, my exercising, my ability to explore creative interests, my diet. I have nothing to be proud of besides staying alive and even that seems like a waste when I just let life pass me by. \n\nI feel like I’m wasting my time in school and I’m so ashamed of how little I’m taking from an experience that was literally dropped in my lap. I’m terrified of having to job hunt after this, especially because I KNOW I cannot do remote work indefinitely (n that’s what it’s looking like in the US). I’m honestly lucky if I can compete for jobs, given my lack of experience and expertise. Im good at writing n working w/kids, & I’m curious about a lot of fields that allow me to work w/my hands or explore diff modes of self help n self knowledge/expression. But everything requires more school and I’m so burnt out from school. Plus it just makes me feel guilty from having done *so much school* and still having studied nothing that I actually love. \n\nI just don’t know what to do. Even though the ppl in my corner say they’re proud of me or try to keep me encouraged I’m sure they’re really judging me and wondering why I make my life so hard. Idek myself. I want to be happy and just have the freedom to do things that make me happy - learn to skate, learn instruments, read more, write more. I honestly don’t care what kind of job I have to work through if I can at least hang my hat at the end of the day and not have deadlines and essays weighing on my psyche every waking moment. I just feel so trapped. I want to learn how to lock into a future focus that at least makes it seem worth it & keeps me motivated to try despite the fatigue.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jvka4s/a_21_yo_ball_of_shame_and_wasted_opportunity/", "title": "a 21 y/o ball of shame and wasted opportunity", "social_network": "reddit", "user": "StaleBlueBread", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1605578339, "permalink": "/r/DecidingToBeBetter/comments/jvka4s/a_21_yo_ball_of_shame_and_wasted_opportunity/", "nsfw": false, "first_save": 1635437851.0604517, "replies_charged": false}