{"id": "t5_2tand_t3_p7ugdb", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "e234981c-b061-4d83-8134-70d441847f74"], "text": "I also posted this to offmychest\n\nI should have seen it coming, like how  a mirror says \"objects are closer than they appear\" I saw something, but I just didn't realize how close it was.\n\nI've had a long distance friendship with this girl for almost two years now. We've been pretty flirty the whole time, but we never really progressed things. She's been through a lot of trauma and I'm inexperienced when it comes to relationships so we were both scared to some extent about progressing things. We discussed meeting up last year, but covid happened and that put plans on hold.\n\nShe ended up ghosting me basically last summer because she was going through a lot of internal struggles. Questioning her identity, her sexuality. (She came out to be as bi and chopped her hair off) I should point out I stuck around for one reason or another despite everything because I cared about her.  She resurfaced around this time last year and told me she got into a long distance relationship with another girl. That ended up being on again off again till around February of this year. Her partner was emotionally abusive to her and would tell her things like \"you don't care about me\" and the day my friend's dog died her partner told her to get over it and deal with it. They were planning on moving in together, but things fell apart a week before it was going to happen. Her partner was visiting the week before the planned move, but one day things completely fell. I ended up calling my friend like two hours after her partner left and their relationship ended (none the wiser)\n\nDuring the call my friend told me the break up was going to be really difficult for her despite everything that happened. She gave her partner a lot of her heart. Her partner was her first same sex relationship. Also during the call, she told me losing her partner was going to hurt and she'd be able to move on eventually, but if she lost me she wouldn't know how to function anymore.\n\nWe ended up talking a lot more to the point that we were heads over heels for each other in March and April. I was making plans to visit her in August. Then something happened in May, we started drifting. I got jealous because it seemed like she was avoiding me and hanging out with other friends. There was one particular friend that I asked about because it seemed like they hung out a lot. She told me \"he's just a friend don't worry I flirt with a lot of people it means nothing.\" I believed her, but something seemed off so I just filed it away.\n\nOne day I found out at random she planned a trip to Seattle around the same time I was going to visit. So I asked her if  I should extend my vacation and tag along with her, she seemed cool with it then. This was June. From June on I kept trying to finalize plans to visit her and it seemed like she kept avoiding the topic, things seemed to keep coming up (she needed to move places around the same timeframe) She also seemed to be getting closer to the other guy.\n\nJumping ahead to the beginning of this month I asked her if I should just cancel my plans to visit and she said \"idk, im struggling with stuff\" she also told me she had to cancel her Seattle trip and that she hadn't found a place yet. I'd like to think I gave her an out when I asked her that, but she didn't directly say no and it almost seemed like she was avoiding the topic again. I pointed out a few days later that it seemed like she was avoiding the topic of visiting and she told me it was just a bad time to visit, so I kinda just left it at that.\n\nWell a few days later she posted about moving the next day. Then the day after moving she posted about heading off to Seattle. I thought wtf a week or two ago you were telling me you didn't find a place and that you were cancelling your Seattle trip. When I asked about the Seattle trip she told me she was going by herself and not with her friends like originally planned.\n\nEarlier this week while she was there I found out through social media that she didn't go by herself and that she went with the guy I was jealous of (she doesn't know I know she went with him).  Earlier today I asked her about trip because I was hurt that it seemed she lied to me about cancelling the trip, I was willing to make last minute plans to tag along. She told me the trip was last minute and she emphasized how she went alone and that having time to herself was nice.\n\nI know she's lying to me when she says to went alone. I didn't confront her about lying about going alone because I knew it wouldn't end well.\n\nI'm just not sure how to think anymore. Where did I go wrong? It feels like she's been gaslighting me. It's sad to basically see my friendship fall apart like this.\n\nTl;dr: My friend has been lying to me and maybe even gaslighting me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p7ugdb/i_think_i_just_saw_my_friendship_fall_apart/", "title": "I think I just saw my friendship fall apart", "social_network": "reddit", "user": "PM_ME_UR_BOOBS_PWEAS", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1629431316, "permalink": "/r/DecidingToBeBetter/comments/p7ugdb/i_think_i_just_saw_my_friendship_fall_apart/", "nsfw": false, "first_save": 1635437385.345797, "replies_charged": false}