{"id": "t5_2tand_t3_np76v8", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "*edit: I finally decided to launch a YouTube Channel talking about ideas like this, which i've been wanting to start for a long time. I uploaded a video of this whole post in video form. I'm kinda proud of myself for taking this step. If anyone wants to watch it instead of reading, dm me and ill send you the link :) anyways, on to the post.*\n\n**The Secret To Becoming The Person You Want To Be.**\n\n We all have parts of ourselves that we aren't so proud of. bad habits, weak points, un ideal living situations. we also all have an idea of what we want our life to look like. greater visions or ourselves. dreams, aspirations. \n\nthe problem is for a lot of us, there's a gap between our current reality and that vision. often times, it's seems so big, it almost feels unrealistic to close it. that's why it's called a dream. because people don't think its real. people don't think the possibility to change is real. to become the person we wish we saw in the mirror, to live the life we truly wish to live. \n\nif we're fat, we look at skinny people and think how do they manage that, how are they living that reality? or to rich people and think how is it that these people are currently making millions per year while I'm struggling just to pay rent? or to people who are sober and think to ourselves how are these people productive, functioning people without the pain of addiction? we all want to change in some way or another. we all want to be better. whether it's in 1 area that I just mentioned, or all of them; we all have a vision for ourselves. the question is, how do we get there?\n\nthe truth is, that gap is an illusion. it's a wall that we subconsciously build up in our head over time that's completely false. whether that's to protect us from the unknown, or simply our accumulation of fear, our minds build up this wall that separates us from our dreams. the truth is, if you try and walk through that wall, you'll realize there's nothing really there. there's no barrier. it's all in your head.\n\nwe look at people who are successful and think they were just chosen or born into a position to have that life. we look at people who have what we want and feel so disconnected, like they are living on the other side of the glass somehow. really, those people are not unlike you, or I. we're all just people. some people, just didn't let that barrier stop them. they just walked through it, and it worked.\n\nthey think making a million dollars, or getting into the best shape of their life is so farfetched and unrealistic, but really, they never even gave it a fair shot; hell, they never even entertained the idea that it was possible. \n\nand that's where it all begins. \n\nthat belief.\n\nthe first step in the door is believing it's possible, or at the very least not letting that barrier stop you from starting. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/np76v8/the_secret_to_becoming_the_person_you_want_to_be/", "title": "The Secret To Becoming The Person You Want To Be.", "social_network": "reddit", "user": "tilthagrave", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1622478077, "permalink": "/r/DecidingToBeBetter/comments/np76v8/the_secret_to_becoming_the_person_you_want_to_be/", "nsfw": false, "first_save": 1635437253.334851, "replies_charged": false}