{"id": "t5_2tand_t3_hqdy1u", "request": ["1a213df6-3f71-466c-9762-ace119e0102e"], "text": "This seems like a pretty specific situation, but I want some perspective here. Redditors on this sub are really intelligent and observant, so please let me know what you think of this.\n\nThe situation is this. I was with my bf (broken up now) for about 2 years. A lot of stuff happened in these two years. He was trying to come off of his player lifestyle to be committed to me, but struggled. I admit I took the moral highground, as I have always been a very devoted and loyal partner, so I would tell him when he was acting shady. I am also pretty straight to the point.\n\nI am all for sitting down and discussing how I feel without pointing fingers. But often, his behaviour with other women just felt so blatantly disrespectful to me, that I would tell him straight up that what he is doing is wrong (rather than “When you do X, I feel Y” statements).\n\nHe ended up cheating. I broke it off. He then vowed to be better, and actually turned his life around, so i agreed to try again. He was doing everything in his power to make the relationship stronger and to build trust. I appreciated the effort. But I guess I was still doubtful of his fidelity, so I said things like “this is how you should be” or “this is the correct way to be in a monogamous relationship” and “you clearly don’t love me if you still do X”.\n\nAt first he appreciated the honesty and bluntness, and agreed completely that my points were right, as he wanted to change. So this is how I communicated.\n\nOne day, he felt overwhelmed with my demands, and said I became toxic for getting upset so much and for pointing out so much. So he broke it off.\n\nWe kept talking, hoping to patch things up. I reflected on myself. I want to be better. So I was apologising for my own selfish behaviour. But I wanted to let him know some of his behaviour upsets me too.\n\nThis is the problem now: he does not respond well to anything he perceives as criticism from me at all. If I express any dissatisfaction or upset from the relationship (cos after all, it’s a two-way street), he lashes out and calls me manipulative and toxic.\n\nIf we set a time to talk in the day, for example, he might be late or fall asleep because he’s busy and overworked. I don’t mind if he tells me in advance, as I of course don’t know his plans. But he doesn’t. So I end up waiting, and am left hanging. I feel it’s a disrespect of my time, but when I let him know I’m upset, he lashes out that I again criticise him and am manipulating him into saying sorry, just like I always did in the relationship. \n\nThis makes me feel: a) gaslighted and my feelings—invalidated; and b) like I’m no longer allowed to express my unhappiness at all, so I have to walk on eggshells.\n\nI understand that he probably feels he can’t take anymore, and has become hypersensitive to anything I say as a result. Maybe it affects him very strongly and hurts him, where he doesn’t logically see that his reaction is not proportionate to what I’m saying. I get that can be the case too.\n\nI just really need some perspective here. Is he right? Am I too manipulative and critical and toxic? Am I no longer allowed to show my feelings because I’ve been negative towards him in our relationship so much? Or am I being gaslighted into believing I’m not allowed to do these things, but my feelings are actually legit?\n\nI’m just so confused at this point. I feel none of my feelings are considered at all. What do you guys think? Any input will be super helpful, as my mind is spinning. Thank you!\n\nEdit: Wow! I didn’t expect this post to get much more than 1-2 comments, so this is great. Thank you so much. I honestly didn’t write as many details as I wanted as I thought no one would be interested to read, but as more are reading it, I felt it would be great to clarify and add onto some things!\n\n1: I genuinely don’t believe he has NPD, but thank you for your concerns about my wellbeing. You’re all lovely. I have been in an emotionally abusive relationship and this is nothing like it. \n\nHe doesn’t get mad, he never raises his voice, and he had a tendency, if anything, to feel he was in the wrong. He was a bit self-aggrandising and self-absorbed pre-cheating, but has changed significantly and became quite mellow. In fact, I’d say the reason the power dynamic shifted post-cheating is that he wanted to take on the weight of all the problems in our relationship, and wouldn’t tell me anything he found wrong with me. Hence I started to believe I was in the right, because he was convincing me that with any problem or whenever I was upset, he had to be the one to fix it as he was the one that messed up. This meant I got zero feedback for my behaviour until after the breakup.\n\n2: I’m not concerned about getting him back. I’m working on moving on. But I am an extremely analytical person who needs to dissect every thing in order to get on with my day, so getting as much analysis on this issue as possible is very helpful in me being able to see clearly. My head is full of fog, and I genuinely can’t tell if I was solely responsible for the relationship’s demise, or if he is refusing to see his side because he was so hurt by all of my negativity and criticism.\n\n3: I also did show appreciation. I always thanked him for every little thing (like every time he held the door open, I would smother him with kisses and rub his arm, because I knew his love language was touch). I also told him in words very often. But I felt that even though he would get flustered and really happy in the moment, he didn’t register those things—he kept bringing up how he just wants to be appreciated and “seen” by me. It was like he forcibly put us in this impossible dynamic where he was forever clambering for my validation, and though I can see how he would feel that way given all the criticism I pelted him with too, I also feel to say I didn’t appreciate him was unfair and even scary that he couldn’t see it at all. Like staying in this role of “fighting for my love” was more important than accepting reality. \n\nI’m sorry if it doesn’t make any sense. I am still in a fog. Thanks again for reading!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hqdy1u/some_insight_please_i_used_to_be_critical_in/", "title": "Some insight please! I used to be critical in relationship with an immature/non-loyal bf. He changed a lot, but my resentment sometimes still consumed me and I nagged. He now says my feelings are manipulative and I am not seeking my own happiness. Is he right? Or am I justified?", "social_network": "reddit", "user": "theoreoestofpandas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 152, "down_vote": 0, "creation": 1594641406, "permalink": "/r/DecidingToBeBetter/comments/hqdy1u/some_insight_please_i_used_to_be_critical_in/", "nsfw": false, "first_save": 1635437068.8050082, "replies_charged": false}