{"id": "t5_2tand_t3_9165qe", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "As you might have guessed, I do procrastinate quite often, but the thing is that it is not a usual \"one more video before homework\". If we talk about gym, then instead of just following the routine, eating and sleeping well, I make it all complicated with studying different  programs, diets and so on. That does not sound as a bad thing, but it haunts me everywhere: I am a junior at uni right now, and the freshman year was a struggle thanks to this. For example, instead of simply working in the library for few hours everyday and going to classes, I am constantly looking for ways to study \"smarter\", watching CollegeInfoGeek (no offense, great content), shopping for all these 5 star notebooks on Amazon and so on, thinking that these actions will put me forward. Well, I finished the second semester with GPA of 2.6 (failing one of my core classes) Is there a way to persuade myself to just sit down and study? Because while it works with going to gym, I fail at something which involves more mental willpower \n\nP.S As many people here (if not the majority) I always want to improve myself in any possible way: mind, body, looks, and I understand that I don't need too many things to accomplish my goals, however, unconsciously I am always looking for something better: better clothes, phone (while current is absolutely fine) and so on. How do you deal with this problem? Thanks.\n\nTL;DR My mind doesn't want to just work through things and rushes for alternative \"solutions\" that eat my time and willpower", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9165qe/i_reached_the_advanced_level_of_procrastination/", "title": "I reached the advanced level of procrastination", "social_network": "reddit", "user": "justanotherzhan", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 139, "down_vote": 0, "creation": 1532344407, "permalink": "/r/DecidingToBeBetter/comments/9165qe/i_reached_the_advanced_level_of_procrastination/", "nsfw": false, "first_save": 1635435086.7061996, "replies_charged": false}