{"id": "t5_2tand_t3_pki33v", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "I always got teased for being the \"old man\" of the group because I used to be very committed to my success and talking about \"weird\" philosophical ideas. I'm starting to realize that I stopped my pursuit of greatness out of fear of growing up, because I'd been mocked for it so long that I didn't want to alienate immature friends.\n\nI don't know why I made myself the jokester. I mean, I've never had trouble getting a laugh out of people and I know people speak more openly and honestly with people they believe are on the same level as them. I guess I want people to feel no shame around me, so I belittle myself for them.\n\nHanging out with an old friend I had lost touch with that is now a successful lawyer, I realized that my own success is nothing to be ashamed of. I've simply been comparing myself to the wrong people and associating with the wrong crowd. I was finally able to talk honestly about finances, investments, side hustles and a promising future with a peer I could to relate to. I was able to drop the lifelong facade of \"comedic relief\" and it felt awesome to be encouraged and supported, rather than being told I \"sold my soul to fit into society's expectations\"\n\nI don't need to downplay my ambitions and fit in with a crowd that doesn't share my values. I'm doing well in the game of life. It's time I allow my spirit to reflect that.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pki33v/im_giving_up_making_myself_mediocre_to_make/", "title": "I'm giving up making myself mediocre to make people comfortable", "social_network": "reddit", "user": "WeirdAnswerAccount", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 76, "down_vote": 0, "creation": 1631131314, "permalink": "/r/DecidingToBeBetter/comments/pki33v/im_giving_up_making_myself_mediocre_to_make/", "nsfw": false, "first_save": 1635435931.4347548, "replies_charged": false}