{"id": "t5_2tand_t3_lfnzt3", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "I've been making beats since 2016-2017... every year more and more and it gets better and better.\n\nMy parents both insulted my music and sometimes even insulted me for mixing and repeating parts for sometimes hours. I kept making my stuff, it got better and better and even got complimented. \n\nI just sold my first beat, in 2019 when I had some money and worked I asked my father should I buy studio monitors and he told me ''what do you need that for, time will come, you will work other jobs, have fun etc''  I'm not mad at him though. I'm a bit sad I didn't invest this money because I can make good stuff and sell it half the price because I can't mix it properly.  He even laughed and told me that no one either believed in him and told me the amount of money was amazing for the first beat. \n\nIt's hard because even people in my family looked at me like I was some idiot that understands nothing because I don't have a job atm and don't drive a car, but when they spend some time with me they kind of underestimate that I can understand stuff pretty well.   \n\nI just have to get a job now, we had bunch of earthquakes happening so there will be lots of jobs.\n\nWith the job I will afford better pc, studio monitors and all other things that will help me produce music.  \n\nI still smoke cigarettes and weed when I can. I would rather have money and smoke weed though than binge on cigarettes lately because my body finds them harder.  I still have a friend who don't even wanna get a proper job, never or barely give cash for weed.. But to be honest I'm pretty lonely. \n\nIt's a blessing and a curse. Like people in my city I go to hang out with them and they accept me but they never really call me on FB. It happens but rarely.  I also exchanged gaming for producing in 2020 because I didn't want to get a job that year and that made my production skills skyrocket but I'm still in the beginnings.\n\n&#x200B;\n\nI just sometimes question myself if I succeed financially will I finally find a girl even with my wacky character.  That would really be weird. Because I'm 23 and never had a longer relationship. I still don't measure my happiness by this relationship thing. Some people place all their bets on marriage n stuff and when shit happens they do bad stuff to themselves or others.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lfnzt3/keep_doing_what_you_love_regardless_what_they_say/", "title": "Keep doing what you love regardless what they say", "social_network": "reddit", "user": "thedawnofthepinksun", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1612824193, "permalink": "/r/DecidingToBeBetter/comments/lfnzt3/keep_doing_what_you_love_regardless_what_they_say/", "nsfw": false, "first_save": 1635435594.208328, "replies_charged": false}