{"id": "t5_2tand_t3_lsbm3a", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "Just a back-story. \nI’m 20 years old and since 16 I stopped going to school. Since I was bullied a lot because of my skinny body. Living with a single, absolute narcissist dad and ever since I dropped out of high school, I’ve become addicted to weed, porn, and cigarettes. I only go out for buying cigarettes to a tiny market 2 minutes away from our home. I’m suffering from ADHD and social anxiety. Sounds terrible, doesn’t it? lol \nSo today was raining cats and dogs and I told myself I either stay home as always and feed the monsters in my head, and constantly scroll down Instagram seeing how others live or I’ll find the guts to go out and learn to live like a normal human being. I decided to ride my bicycle and hit the street. Initially, it was frightening a bit. Before I open the door and go out I started to panic and bad thoughts were bombarding me in seconds, but I said “screw it, I’ve got nothing to lose” and I DID IT. I put on the headphones and went around my neighbourhood and rode for almost 20 minutes and it was awesome!!! I didn’t give a single flying F about what the people would think of me, my body, my bicycle, my peddling, or anything else, I just enjoyed myself doing something appropriate and beneficial in order to get out of the pathetic situation I’ve gotten myself into. It’s not much but I haven’t done something like this in years and I’m really proud of myself for what I did. I decided to do this everyday.\nI desperately want to go out, find a girlfriend, study languages, do crazy things, find friends, bring home the bacon and etc. \nWishing the bests for everyone here❤️", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lsbm3a/went_out_of_home_after_4_years/", "title": "Went out of home after 4 years", "social_network": "reddit", "user": "LittleLegion", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1750, "down_vote": 0, "creation": 1614273449, "permalink": "/r/DecidingToBeBetter/comments/lsbm3a/went_out_of_home_after_4_years/", "nsfw": false, "first_save": 1635435437.2416725, "replies_charged": false}