{"id": "t5_2tand_t3_hoakjo", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "So this all started in March, when my school was forcing people to go home bc covid was starting. I (18F if it really matters), 15% enjoying my freedom and 85% DESPERATELY wanting to avoid my father (he isn't physically abusive but he's REALLY emotionally abusive. the difference is that my mom swears that if he lays a hand on us things will change but he can SCREAM all day and say horrible violent things and she just rationalizes it away) and sister (also really emotionally abusive but not nearly as bad). So, panicking, I reach out to my aunt. She offers me a bed at her house and asks that I watch her son. I agree and for a few days things are good. Then my parents demand that I come home and tell me they will personally pick me up. I realize that I can't pull off a smooth transition to home so I break down and tell them I did this to avoid my dad. (They kept PRESSING and PRESSING why did you do this) And then my dad made it about him. About his hurt feelings. Anyway this started a flame war of sorts between my mom and my aunt (they're sisters) and my mom \"disowned\" her and then a month later forgave her. But since then my aunt has had my mom blocked and has been ranting to their dad about how terrible my mom is. Everyone in my nuclear family strongly believes I made a terrible mistake and comforts my mom and shits on my aunt whenever they can. Only my other sister can even see things from my side, because of how my dad specifically treats me worse than the other kids. (He already has a bias for my brother, the only boy, and he's hella authoritarian and cracks down HARD on my \"evil sister\" and I because we don't take well to \"because I said so\" and authority in general) ANYWAYS one more thing is that twice now my dad has made me listen to him tell me I should be \"helping to make inroads\" and shit because \"[my aunt] really believes she was doing you a favor and that you painted the image in her head that I was abusing you.... IM NOT ABUSING YOU (in a loud voice)\" and like \"do you understand?\" and then I have to say I understand HHHHHHH anyway thank you for reading all this I just really want someone to say I'm not a terrible person bc I have no friends that I can just dump this on and I can p much only talk to my family and you already know how they feel", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hoakjo/family_stuff/", "title": "......Family stuff?", "social_network": "reddit", "user": "8i33jfl1q", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1594326216, "permalink": "/r/DecidingToBeBetter/comments/hoakjo/family_stuff/", "nsfw": false, "first_save": 1635436524.634142, "replies_charged": false}