{"id": "t5_2tand_t3_fmr7eu", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Yesterday I was thinking about the common notion that “you can’t help a person who doesn’t want to help themselves” and considered that maybe the primary problem is that people can’t even recognize what help looks like. This quote stirred up similar thoughts in me, as it refers to the challenge experienced in a relationship when one person focuses on their self-growth but the other isn’t “ready”, and so the couple tends to split. \n\nI think for those of us of working on our self-growth, it can make us more keenly attuned to where those we care about are still “stuck” and in pain, yet we are unable to help them. It’s been tough learning to emotionally accept that I can’t influence someone’s path even though I know it would help them and that they’ve got to go through their own journey. It requires another layer of self-growth on my part because there’s a level of trust and release that is required of me for this to not be a source of anxiety and sadness for me. Maybe others can relate \n\nI think for those of us who deal with this, one of the most powerful things we can do is continue to renew our dedication to our self-development: improvement of our character, practice of mindfulness and self-awareness, and allow our growth to inspire others to also come out of their darkness and hope the unique tools they need will show themselves to them in time", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fmr7eu/the_light_is_too_painful_for_someone_who_wants_to/", "title": "“The light is too painful for someone who wants to remain in darkness.” — Eckhart Tolle, from “The Power of Now”", "social_network": "reddit", "user": "jtflcntmltstlbms-", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1584839998, "permalink": "/r/DecidingToBeBetter/comments/fmr7eu/the_light_is_too_painful_for_someone_who_wants_to/", "nsfw": false, "first_save": 1635435916.380907, "replies_charged": false}