{"id": "t5_2tand_t3_pkrmp8", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I had a fight with my so called best friend over nothing, now she says she wants to take a break from the friendship, now she's acting like nothing even happened, I'm upset at the fact that she wants to be happy but not even say sorry for what she's done. I'm upset at the fact that she wants to take a break from the friendship that she's been putting a strain on not ever saying atleast a sorry to me for everything she's done, she doesn't get to be happy I should be happy, I should be the one to say I don't want to be friends anymore, she doesn't get the right to say that WHEN SHES THE REASON WE ARENT HAPPY! Not even a sorry not even anything. Ugh I can't believe I wasted my four years of this I can't believe this. \n\nHow can I move on from this what can I do?, all my friends are linked together if I drop her I drop EVERYONE, I'll be alone. I can't, I don't want to do this anymore she doesn't get to say that when she's the cause. I'm so upset, I don't know what I need to do to move on from this. I feel so childish because she's just ugh\n\nEdit:\nWe aren’t friends anymore, she said she couldn’t wait to take a break but I said that she could but I’m not participating because I wasn’t planning on going back to her. I left yesterday or maybe the day before that but I still left. There is no “we” just “you” \n\nThe audacity is uncanny.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pkrmp8/how_can_i_be_better_how_can_i_just_act_like/", "title": "How can I be better, how can I just act like nothing happened?", "social_network": "reddit", "user": "Remarkable_Lynx_9601", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1631165819, "permalink": "/r/DecidingToBeBetter/comments/pkrmp8/how_can_i_be_better_how_can_i_just_act_like/", "nsfw": false, "first_save": 1635437384.903695, "replies_charged": false}