{"id": "t5_2tand_t3_iz2i71", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Distractions are nothing new. They have been standing in the way of success and progress for millennia. Ancient philosophers in the West (i.e. Markus Aurelius, Seneca) and in the East (i.e. Laozi, D.T. Suziki) have fought distraction as fervently as the New Age *philosophers* (i.e. Ryan Holiday, Tim Ferris, Charles Duhigg). The difference between now and then is the sheer amount of available distractions. You can always reach out to your phone and review the social media updates instead of doing deliberate work. You can always turn on the TV instead of staying connected with yourself *in silence*. And, of course, you can always call a meeting to discuss a topic at work instead of thinking about it.\n\nI recently read a book called \"*Indistractable*\" by Nir Eyal. And I decided to post my thoughts on the topic, influenced by this book, but also by a few others - Good to Great, Grit, The Power of Habit, Flow, as well as my own experience over the years. In this article I will share my tools for  avoiding distractions so that you can put deliberate practice to work for you and for your success (or what Nir Eyal calls *traction*).\n\n## Time to read\n\nTime to read: **14 minutes** (based on 150 works per minute).\n\n## Introduction\n\nI get a lot of letters from readers of my blog  or personal friends saying, \"I wish I had more time\", \"I need to get more organized\",  \"I need to conquer my calendar\", and \"I need to catch up on my email\". I find myself giving similar advice, but there is really no *universal* solution for all the problems. The main challenge, in my opinion, is that our minds always seek distraction from the boredom of the *normal* life. You could argue that the current COVID-19 times are not *normal*, but you would be surprised how fast your minds and bodies adapt to changing conditions. If you are struggling to find time (which usually means just to *make time*) for the most important things in your life - this article is for you.\n\nIf you have been following my articles, you know that I am an advocate of habit. Habits are the single most powerful force in your life. And just like a superhero, you can either use it to destroy (usually yourself and your own success) or to propel toward success (usually your own, but also you can *contaminate* the people around you to be more successful). In this article, I share the habits that I have created around avoiding distractions.\n\n## What is the problem with distraction?\n\nLet us examine habits a bit. A habit has a cue (i.e. something that triggers it), an action, and a reward (i.e. something that you are craving). There is also this handy thing called *willpower* that helps you stay focused. It is a resource, which means you can deplete it. But it is also a muscle, which means that you can train it.\n\nNow picture the following situation: You are on a diet and you want to lose wait. You are working on your computer and you are doing something important. And there is a soft, fresh, and delicious chocolate cookie on your desk, just below the monitor. It is still early in the morning and your *willpower bar* is full. You keep working and you keep telling yourself, \"Do not think about the cookie!\" Be honest with  yourself - how long do you think you can last? Now look around your room, desk, workplace. How many *cookies* do you see around you? Your phone, your social media tab in the browser, your email client with the annoying little bubble with a number on it?\n\nThe benefit of this article is less about training your willpower (which is a legitimate way of avoiding distractions) and more about the simplest solution to your distraction problem - removing the cues. What if your phone is out of reach? How can you look at it? What if your email client does not display the number of unread messages? How can you keep that nagging feeling that *this* email that just came is *super important*?\n\n## Personal story\n\nOnce upon a time, I was the king of the procrastinators. This was before the smart phone times, but well into the video game times. I would waste hours and hours in playing. I calculated that over a period of several years, I had spent 20% of my waking hours playing. Imagine how much that is! I was blessed with an amazing memory and surprisingly strong will power, so I made it through university and found a job. But then I lost my job, because of not paying enough attention. I would sit at my desk and meticulously plan my gaming night, researching what artifacts I needed and what quests I wanted to do that day. And everything started with a simple distraction - an email, a social media post, a message.\n\nAs we learn in the Power of Habit, you can never get rid of your habits. You can only learn to manage the cues and to redirect your energy to a more beneficial action, still getting the same reward.\n\n## But why are we like this?\n\nRemember that our minds have been evolving for millions of years to keep us safe and to survive.\n\n### Look for the pain\n\nMost of what you do is driven by pain. Nature has taught us that being bored is painful (you might be gathering food or gossiping), thinking is painful (your mind usually uses the time to scan the surroundings for danger), work is painful (you might be seeking pleasure instead). You cannot blame technology, a device, or a tool. It is you who chooses to pick them up. Only by understanding your pain you can conquer distraction.\n\n### Satisfaction is temporary\n\nHow long does it usually take until you are bored of a device, a thing, a toy that you dreamed about for months and months? A day? A week? Your mind is hardwired to quickly return to a neutral level of satisfaction, unless exposed to other sources of pleasure (i.e. distraction). You also experience negative events in a more powerful way than positive events - Nir Eyal calls that *negativity bias*. We keep thinking about bad experiences in order to learn to avoid them.\n\n### Identify the habit\n\nAs we learn in the Power of Habit, a habit is always fueled by a craving, triggered by a cue, and rewarded at the end. Look at the distractions in your life as habits. Try to find the craving (i.e. attention, hunger, boredom), the cue, and the reward. Write both down. Define a new behavior with the same cue and the same reward, but without the distraction.\n\n## What can you do to avoid distraction?\n\nBelow, I have shared several tips for keeping your time distraction-free.\n\n### 01. Study and practice mindfulness\n\nMost of the distractions happen when we are not present in the moment, when we day dream. If you learn to be more mindfulness and focus on the task at hand, you will end up reducing your distraction time drastically. One of the best tools to practice mindfulness is to learn meditation.\n\n### 02. Start with yourself\n\nIf you do not put yourself on the calendar, nobody else will put you there. If you do not *make time* for yourself, nobody will make time for you. You are the center of your world and you need to dedicate appropriate time to yourself. It is so much easier to spend time on something which is important to you, than on something which is not important to you. It is also one of the keys to avoiding distraction.\n\n### 03. Consider the important relationships\n\nRelationships take time. If you are anything like me, you probably consider the time you spend with other people as part of the same cost/benefit analysis. But human relationships are not like this. Be deliberate in your relationship, don't just be friends with everybody. But once you've decided to keep a relationship, invest in it. Go back to step 1 and *schedule distraction time* for relationship. This can be a 1:1 meeting with a colleague, a lunch with your spouse, an email-free night for your kids.\n\n### 04. Schedule time for distractions\n\nI believe in making time over finding time. My personal process for calendar management starts with spending 30 minutes in the morning, before everything else, in planning my day. I usually start with the *interruptions* \\- meetings, lunch, commuting, and personal time. Then I put the most important tasks for the day. And finally, I put everything else. And then I schedule my activities for 25 or 50 or 80 minutes. Thus, I leave about 5 to 10 minutes every hour or *free*. I can open my email, or open my phone, or just chat with a colleague. Usually, I just walk around to pour myself some water. If I get a distracting thought during my *work time*, I just delay *it* to later. I reassure my mind that there is time for distraction later.\n\n### 05. Remove the triggers\n\nAnd when I am doing something that requires concentration, I put all potential triggers away. My phone is on DND mode and silenced. Only calls from my spouse are forwarded to my watch (there is *productivity* and there is *common sense* \\- you cannot afford ignoring your spouse). All on-screen notifications are disabled. All notification bubbles are disabled. Over the years I have found that in 50 distraction-free minutes, I can do so much productive work, which is worth a few hours of *normal time*.\n\n### 06. Always have a goal\n\nRegardless of what you are currently doing, have a goal and a clear understand of when you will be *done*. For example, if I sit to write an article, I start with the skeleton of the article and I write until I am done or until the time allocated for it passes. If I enter a *Flow* state, then I could run over the allocated time, which is fine as long as I do not have an *interruption* after that (e.g. a meeting). Always try to visualize what you do with a plan, with fun. Have a goal to strive for and compare the result against others.\n\n### 07. Focus on the effort\n\nYou cannot guarantee that by spending time on something you will actually get it done. The only thing that you control is the input - the time you dedicate to it. You decided what your life roles will look like and you decide how much time you spend on them. The more time you dedicate to important things, the less you will have to deal with distractions.\n\n### 08. Define pacts\n\nNir Eyal calls an \"effort pact\" a promise that you make to yourself and a set of barriers that you put for yourself in order to prevent distracting yourself. For example, turning the *Screen time* feature on your phone after 7:00 PM. It takes two clicks to enable an app after that, but it makes sure that you really need to do what you intend to do and you are not just *clicking*. Or, you can make a pact to wait for 10 minutes before giving yourself to a temptation. Most often, you will see yourself forgetting about the distraction. There is also a \"price pact\" - a price that you need to pay to do something. And an \"identity pact\" - a deliberate image of yourself as being a person who does not do XYX.\n\n### 09. Organize your desktop and home screen\n\nIn order to reduce the external cues to a minimum, redesign your desktop and the home screen of your phone. Remove all the notification bubbles (they are only created to distract you), remove all the clutter (e.g. funny pictures, or documents that you do not currently work on). For the home screen on your phone, monitor the applications that you usually open and think about putting them on the second screen. Scrolling one screen to the right might seem like a fairly easy exercise, but at least it is an additional friction for you.\n\n### 10. Advocate within your organization\n\nLet your colleagues know about your pacts and your commitment to fight distraction. Print and put a DND sign on your desk. Use the DND status of your phone and the group chat apps. Help your colleague adopt a more distraction-free mindset.\n\n## Summary\n\nFighting distraction is hard. Especially after you realize that our minds have been evolving to keep us distracted and to seek satisfaction. But one of the keys to success and being productive is in harnessing the power of focus. And focus means distraction-free time. You cannot avoid distraction unless you understand the process and the need for it.\n\nTin Mayer\n\nAuthor", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iz2i71/deliberate_thought_against_distraction/", "title": "Deliberate Thought Against Distraction", "social_network": "reddit", "user": "tinmmayer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1600971173, "permalink": "/r/DecidingToBeBetter/comments/iz2i71/deliberate_thought_against_distraction/", "nsfw": false, "first_save": 1635438153.4710712, "replies_charged": false}