{"id": "t5_2tand_t3_nciw65", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "So about a month ago I posted about how I wasn't willing to give into depression and that I would do everything I could in order to get better.\n\nI'm not as bold a to say that I don't have depression anymore but I can notice some improvement and that's what I want to tell you about. \n\nI started taking meds and I've been really consistent at taking them. Of this I'm proud since I find it really hard to stick to whatever I have to do for long periods of time, but I decided that if my doctor had prescribed me this meds so they could help my brain to produce some serotonine then I should do it. \n\nI applied to a job and... I got it! I started just this Monday and I'm so happy about it. I write now for a magazine and although it's not my ideal job nor the themes I write about are specially of my interest, I love learning all these new things and finally getting some experience so my CV won't be that empty. \n\nNow there's just one month left until I finish college and I'm starting to feel hopeful once again. I don't know what's ahead of me, I don't know what the future is going to be but I'm excited to find out. Also I'm starting to dream again about the things I want to do or be. \n\nI'm trying not to be over excited about this, I still have some bad days. But man, it's only been a month and I'm starting to feel so much better. Just a few months ago I was feeling so incredible sad, so anxious, nothing seemed to matter and I thought I was a complete failure. I had been feeling like that for so many years that I think I just kinda get used to it.\n\nSo, anyway, sorry for the long rant. I'll stick to my meds, I'll still go to therapy and I'll do whatever there's in my power to keep on getting better. \n\nThanks to whomever might have taken their time to read. It feels good to share a little of my progress.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nciw65/life_starts_to_seem_easier_and_happier/", "title": "Life starts to seem easier and happier", "social_network": "reddit", "user": "Reckonerspeckle", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 33, "down_vote": 0, "creation": 1621026045, "permalink": "/r/DecidingToBeBetter/comments/nciw65/life_starts_to_seem_easier_and_happier/", "nsfw": false, "first_save": 1635437227.3377452, "replies_charged": false}