{"id": "t5_2tand_t3_q9zwiz", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Hi, I'm 24F from India, got unemployed in August and living with my parents currently. I suffer from anxiety, low self esteem, and have not been doing well profesionally which has taken a toll on me, my self image and my hopes for the future. Although it is a safety net to live at my parents, it is affecting me a lot mentally. They fight a lot, there's a lot of aggression at home and a lack of warmth and peace in general. The thing is familial fights are common in India but it is affecting me a lot. Sometimes its because of the environment at home and sometimes it's because of my own mental issues. Today morning I woke up to the cries of my mother and since then, I've been feeling horrible. It's so difficult to hunt for jobs and stay positive with all this happening around. My LDR boyfriend wants me to move out, preferably to his city which is across the country since the living expenses there are far less than my city. Should I move across the country to be near him and away from my home? It _might_ be good for my mental health and I might be in a better position to get a job but it would mean losing all my savings (my savings can cover me for just 3-4 months) . Or should I stay at my parents, not deplete my savings and push through? I really need help and suggestions. Thanks in advance.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9zwiz/should_i_24f_leave_my_parents_home_and_move/", "title": "Should I (24F) leave my parent's home and move across the country using my emergency savings since the toxic environment at my parent's is making it difficult for me to find a job and be productive.", "social_network": "reddit", "user": "someonedude84", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 604, "down_vote": 0, "creation": 1634481295, "permalink": "/r/DecidingToBeBetter/comments/q9zwiz/should_i_24f_leave_my_parents_home_and_move/", "nsfw": false, "first_save": 1635435066.0115132, "replies_charged": false}