{"id": "t5_2tand_t3_pjn5xs", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Hope this is ok. I'm in the UK, I work for a small independent company that hasn't made any money for 4 years - coupled with the lockdowns (I worked through the winter one) I've just been grinding away for over a year now without direction. \n\nMy job does have benefits, flexible working day and the owners are frankly absent so as long as I'm producing the product I'm supposed to, it's fine, and it means I get to see my family more. Salary is enough to support my family and not too much is expected of me - It's more of a kind of dull inertia that's getting me down here. I used to have friends in the company, it's now staffed almost entirely by women and although I get on with them I'm sort of the outcast. \n\nThis was once my dream job, but I've been languishing hard for about a year now - I took two week long holidays over summer and got a message or call every day despite telling everybody to only contact me if something was on fire or somebody had died. I've tried to reignite my love for it by doing new things and learning new things related to the job but it's only vaguely there - I've fallen into management too with an assistant, and I'm not totally cut out for it - I just sort of mull about and get on with it.\n\nI do want to love this place again, but I've no idea how to get there basically. Any advice is welcome, before I retrain and go into a new industry!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pjn5xs/what_to_do_when_work_motivation_falls_flat/", "title": "What to do when work motivation falls flat?", "social_network": "reddit", "user": "SlowConsideration7", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1631021661, "permalink": "/r/DecidingToBeBetter/comments/pjn5xs/what_to_do_when_work_motivation_falls_flat/", "nsfw": false, "first_save": 1635438313.6406176, "replies_charged": false}