{"id": "t5_2tand_t3_q6ppf5", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "This might sound stupid to some but I've decided that I'm at a point in my life where video games are hindering my progress.\n\nI use to truly have a good balance with video games, I would play for a couple hours a week. When the pandemic happened, I had way more time on my hands and I began playing a couple hours a day... everyday. Sometimes more, sometimes I would play for 12 hours a day. This seemed fine because I was furloughed and the pandemic was full force so I was basically getting paid to sit at home and play video games. Well life has gone on, I go to work everyday now and I get home and \"reward\" myself with play video games all afternoon. It is no longer a healthy balance like it was pre pandemic for me, its toxic and its setting my goals and health back.\n\nI also realize that there is nothing wrong with playing video games, its a great and fun hobby. But I simply have an unhealthy relationship with it right now. So I plan on going cold turkey for a while. I need to rebalance my life and then come back to that hobby when I'm ready to have healthy boundaries from it. I moved all of my games to a seperate hard drive, gave it to my GF and told her to hide and it and not give it to me. This is perfect because I have painfully slow internet so I cannot just redownload the games if I get the impulse to play, as it would take hours.\n\n&#x200B;\n\nWish me luck! I truly hope this makes a differnce in my life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q6ppf5/giving_up_video_games/", "title": "Giving up Video Games", "social_network": "reddit", "user": "yushi97", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1634055276, "permalink": "/r/DecidingToBeBetter/comments/q6ppf5/giving_up_video_games/", "nsfw": false, "first_save": 1635435224.3383605, "replies_charged": false}