{"id": "t5_2tand_t3_ko2el4", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Hi all! Happy New Year's! Fair warning long post ahead lol.\n\nLike most people, 2020 has been a rough one for me. However it only started rough because of my own dumb mistakes. I got fired from my job on January 29th because of a series of idiotic decisions I made. I immediately began sending out my resume to every single business I could think of in my field only to hear \"we'll keep your resume on file\". Then the pandemic happened. My husband lost his job and our kids havent been back at school in person since March 13th. Fortunately my husband was able to collect unemployment and that extra $600/month plus the first stimulus check as well as me closing out my 401k from my old job kept us afloat until roughly August.\n\nMy husband went back to work in August and I had multiple interviews for per diem work in my field but with nothing coming to fruition. My lack of working really took a huge toll on not only our marriage, but both of our mental health statuses (depression, anxiety, etc.) as well. So finally after my husband basically giving me a much needed, harshly worded but spoken with good intentions, kick in the ass I began applying for any and all jobs throughout October and November. With my kids being homeschooled indefinitely now and my husband working 3rd shift I applied for a lot of work from home jobs but most of them I was underqualified for. I got hired at Starbucks almost immediately and I actually love my job there, but I still need something more concrete and secure in terms of benefits and set schedule and whatnots.\n\nFast forward to last week. I received a call from a recruiter for a local hospital system in my area to schedule an interview for a work from home position essentially assisting patients in scheduling all their appointments. I had my interview exactly 11 months to the day of getting fired, and received a phonecall with the job offer today!!\n\nThis has been a crazy year. However, I am happy to say from starting it with feeling like I was the biggest fuckup and spending most of it feeling completely useless and worthless I get to end it feeling accomplished, proud, and confident again.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ko2el4/i_am_ending_2020_with_an_awesome_job_offer/", "title": "I am ending 2020 with an awesome job offer!", "social_network": "reddit", "user": "julesthegules", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1609464370, "permalink": "/r/DecidingToBeBetter/comments/ko2el4/i_am_ending_2020_with_an_awesome_job_offer/", "nsfw": false, "first_save": 1635436636.2576902, "replies_charged": false}