{"id": "t5_2tand_t3_mqlpmd", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "This is amazing. Let me give a crude story here. My life was in ruins. It still is, but I am choosing to feel better now. The only moment that ever lives and happens is \"right now\". If I can't learn to be fulfilled right now, then I will never be fulfilled. Even so, fulfillment isn't a goal, it is a situation. Never will I be fulfilled 100% of the time. And that's beautiful, isn't it?\n\nI don't really know what's happening. Basically I just started doing the things that I always knew I had to. I set aside time to read a book every day now, I jog every day(sometimes I skip), I put aside time to listen to music that I love with headphones in the dark and think. I write. I became a waiter specifically to exercise my sociality.\n\nMy life was fucking ruined, it was a joke. I was a massive drug addict. I have had 12 grand mal seizures from WD from benzodiazapines. I was a vendor and a dealer for most things throughout my life. My teenage years were awesome, using LSD and other psychedelics constantly. They were what taught me that I actually loved myself in the first place. Truly a valuable experience. Maybe not for everyone, but for me and the people around me it was about 100% effective at forcing you to reconcile with being slowly eroded by time in a mundane world.\n\nI haven't been using psychedelics, but I'd be lying if I said they weren't a huge part of my life. Without them, I truly do not believe that I'd be where I am now or have as much of an existential imagination(I guess I would have, I've always been obsessed with it since I learned to read)\n\nBut eventually I turned miserable. I told myself I had anxiety, I definitely did and I definitely do. And it has controlled my life since I can remember as well. I was using benzos constantly among other \"bad\" drugs and started dating a shit person. She cheated on me constantly, isolated me from my friends and family, and then she got pregnant. Now she is out of the picture and I am the one with our daughter, with my families help, bless their hearts because I was an impossible person to deal with around my teens and early 20's. I'm 26 now.\n\nThe first step was leaving her. The second part took about 3 years up until now as it keeps getting better. It took about a year and a half to where the trauma from her subsided and I could think about her without grinding my teeth in anger. I chose to not think about her, but I always would eventually.. Grinding my teeth, literally, every single time as I was so upset for so long.\n\nA year and a half ago I got a DWI on top of plenty of other legal trouble and felonies. I have done jail time, I owe my lawyer $16k as we speak. I got in a car accident once where I am in constant pain. 75mph, fell asleep at the wheel, flipped the car 5 times without wearing a seat belt. Bounced around the inside of the car until unconscious, ejected through the glass of the driver's side window cutting myself up and getting road rash, landing on the service road. Broke my pelvis in two places, 4 ribs, my nose and was unable to walk for 8 months. This was in the beginning of my ex and I's relationship though, way before having our daughter.\n\nI hope this crude version of my life story helps show you the point that my life is entirely ruined. It goes without saying. The thing is, it isn't. I have suffered so much pain and trauma, to a degree that I wouldn't even wish on her. In fact, I wish her the best. But I will likely never speak to her again.\n\nThe thing is, some people have it even worse than I do. I used to scoff at people saying they had depression and stuff thinking, \"you don't even know what trauma is.\". But none of that even matters. Life is not a contest of who has more trauma or who is more \"deserving\" of it. I think many people think this way, and it is not the way to be. Any unhealthy judgmental thought that sneaks its way into my head, is cast out with a quick \"fuck you\", calmly.\n\nI cherish this life. I understand, have always understood but am recently coming around to living inside of again, that my life is  valuable. That nothing can stop me from loving myself and the Universe around me. It may seem even delusional. But what else am I to do? What really is the point in life when it comes down to it. Even with our mammalian needs? The point is to love. I do not care how hippie-dippie that sounds. It is extremely true, at an extraordinary level.\n\nAll it took was trying. And this is coming from someone who has spent many, many years of his life fantasizing about suicide, being very close a few times. Someone who has spent years of his life as the most miserable piece of shit that you could possibly imagine. Being \"literally incapable\" of trying due to the paralysis of being miserable. But just as much as I have a right from the sum total of my life circumstances to hate myself and others who helped me get there, it is so much more interesting and useful to say that these are the exact reasons why I have compassion for myself. There is the 10 year old me inside of myself, he has always been there. I am practicing showing him the love that he should have gotten, the love that is his God given right.\n\nI couldn't possibly explain my entire life, or the entire process of what got me here. But I think it is over. I really do. I will get depressed sometimes, I will get massive anxiety sometimes. I will lay in my bed in a pool of seething regret, unable to sleep. I will even cringe at this Reddit post in the future probably. But you know what? All that matters is that I have compassion for myself, and that I keep making an effort in deciding to be better. Because it was a decision. I have so much love for everyone here, you can make it. But you get out the work that you put in. I tried every shortcut to that imaginable. Every which way around it trying to cheat the system, but that is the truth. And the more you practice, the more you get there. But don't expect \"getting there\" to be the end. It never ends. Just love it instead.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mqlpmd/things_started_getting_better_and_now_they_are/", "title": "Things started getting better. And now they are getting way, way better. Way, way faster.", "social_network": "reddit", "user": "HomiesTrismegistus", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1618386040, "permalink": "/r/DecidingToBeBetter/comments/mqlpmd/things_started_getting_better_and_now_they_are/", "nsfw": false, "first_save": 1635435571.8584828, "replies_charged": false}