{"id": "t5_2tand_t3_kcn9fl", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "1. If anything, it shows that you either shouldn't allow other people's opinions about your abilities to even be relevant to what you are pursuing :)- **Do not confuse correlation with causation, so do not attribute people's opinions about you as the CAUSE for what happened**\n2. They may have their own \\*opinions\\* about you (because ***facts*** *are* things that have not only be **widely accepted, but also proven**) , but do not let outside people **INTERFERE** with you and your goals\n3. ..........do not \\*let other people \\* come in between what is the intimiate relationship between **you and your goals, because your goals are based on an entirely individual sense of choice/passion/purpose/survival to earn a living, etc whatever.**\n4. and if you do feel like you failed so bad b/c you aren't smart/strong enough etc, then if you get so caught up in the moment that you feel that way for a bit, then alright. But if that's how you feel, do not feel that way because of \\*outsiders\\* who had nothing to do with the goal that made you feel like shit to begin with. IF you feel like that, only allow what you are pursuing to make you feel like that(your goals). if you feel dumb because of a test for example, keep that relationship between you and your test. do not attribute how you may feel to outside opinions which are not causal regarding who you are or your situation\n5. .........**.Because we don't confuse causation with correlation around here.**\n6. **Just because other people made a statement about you, doesn't mean that is the ACTUAL CAUSE of the misery, and that you have to \"blame yourself\" in anway because of it. blame the idiots who can't understand this instead , aka the very outsiders who attempt to come in between you and your goals, the latter of which is not their business to even begin with**\n\n**-------------> and by the way, i am not encouraging people feel bad about themselves. I am saying that correlation is not causation,** so you failing at something does not cause the other person's opinion about you to be true. So I say this to help people feel a lot ***less*** **bad. At the same time, definitely do not feel that way for more than a few days or to the brink of self destruction. the failure is only a lesson of what didnt' work,** so keep chugging along to find out what does work. if that still doesn't work, many of the most succcessful people became successful s**imply because they tried something that didn't work out only to realize another path was more suitable for them.---**\n\n**-----> Thanks to those who took the time to read this very lengthy post if anyone did! Dealing with certain people inspired me to write the advice I gave to myself to help me get over certain things I was told \\*but failed at actually belieivng\\*, because I've realized we are not the voices that come come across inside our heads or that which penetrates our ears, but we are instead WHAT WE CHOOSE TO BELIEVE.  I will literally have to die before anyone makes me believe that I am Anything less than amazing, smart, and capable because throughout my childhood and current adulthood, I've never been the type to allow others to make me actually believe anything different. And you shouldn't either  (;**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kcn9fl/if_you_didnt_attain_the_goals_you_initially_set/", "title": "If you didn't attain the goals you initially set to achieve, this in NO WAY gives validation to others saying that you aren't worthy, capable, smart enough, strong enough, disciplined enough, committed enough, independent enough, beautiful enough, etc.", "social_network": "reddit", "user": "Cat_Eyed_Goddess94", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 132, "down_vote": 0, "creation": 1607908216, "permalink": "/r/DecidingToBeBetter/comments/kcn9fl/if_you_didnt_attain_the_goals_you_initially_set/", "nsfw": false, "first_save": 1635435362.5218046, "replies_charged": false}