{"id": "t5_2tand_t3_pxj5gw", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I went through about a year and a half of getting stoned to the gils every night smoking pot, and I'd often drink beer or wine on top of that. I loved smoking up, then drinking, as the effects were compounded significantly. That year and a half was kinda a brief hiatus from university, where I basically just took time off to do whatever I wanted and get experience in the world.. find myself etc..\n\nNow I'm back to business and I quit pot and alcohol a few days before returning to university. Its been about a month, and I'm tired as hell! I used to be able to work labor 10 hours a day come home get stoned drink and sleep around 11 or 12 wake up at 5/6 and do it all over again. Now I wake up around 7 and struggle to stay awake past 8pm! \n\nFor background I'm a 20 year old guy, active as hell, pretty good physical shape, eat really damn clean, and overall pretty health conscious. \n\n&#x200B;\n\nIs this normal? I didn't drink everyday (I smoked pot everyday) but I went through cycles and more importantly, right before I got sober I went through a 2 month period where I pretty much drank like a fish every night, but it was all under the presumption that it was temporary fun. I didn't expect this much of a backlash. Jesus Christ I feel like an old fuckin man?! I feel like the juice got zapped outta me. I've also got this looming depression where its a battle just getting out of bed and everything that was once miniscule feels extremely difficult. I struggle to be optimistic of the future and just wanna lay in bed and exist alone in isolation. I'm conscious of this depression and realize my brain needs to adjust but I figured one month of sobriety would do it? I've been feeling literally like shit for a month straight. Just been powering through it but I'm wondering when the hell I'm gonna feel like myself again? \n\nAny thoughts or advice from people who have gone through some similar experience is much appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pxj5gw/quit_weed_and_alcohol_and_have_huge_fatigue_and/", "title": "quit weed and alcohol and have huge fatigue and depression", "social_network": "reddit", "user": "EsjaCapital", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1632873231, "permalink": "/r/DecidingToBeBetter/comments/pxj5gw/quit_weed_and_alcohol_and_have_huge_fatigue_and/", "nsfw": false, "first_save": 1635436796.0077577, "replies_charged": false}