{"id": "t5_2tand_t3_fqe6n6", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "You might be the worst social offender, you might have broken laws, you might not have kept your vows, you might have not completed your degrees, you might be economically unproductive, you might not be knowledgeable, and you might not be an expert in any field — that does not matter.\n\nExistence has no care for your achievements.\n\nThe sun would still shine upon you. The rose would not turn its face away from you. The moon would still be available to you. Existence is not anthropomorphic. It does not believe in man-made ways. The society may say that you do not look pretty, but if you go and look at your face in a pond, in a pool, in a lake, the lake would not despise you. The lake would welcome you just as it welcomes the beautiful moon. So, it does not matter where you stand, what people think of you, and what is your social standard. It does not matter even what you think of yourself. You are an accepted child of the universe.\n\nThe universe accepts you just as much as it accepts a Buddha. It gives them no special favors. And it does not discriminate against you. Even in your worst hour, you may find that a butterfly comes, and quietly sits upon your shoulder. The judge there is pronouncing you guilty of the most heinous offenses and the butterfly is quietly sitting upon your shoulder, not at all bothered by what man-made laws are proclaiming you to be.\n\nEqually, they might be crowning you the most beautiful woman in the universe, but that does not deter the crow from dropping a little-bit of blessings on your forehead! Maybe that is his way of accepting that you are so beautiful.\n\nIt’s a very simple thing. Nothing complicated about it. There is nothing at all wrong about being whatever you are — tall, short, good, bad, man, woman, qualified, unqualified, read, unread, achiever, non-achiever.\n\nEverything is just okay. It is not even okay, it is irrelevant. The universe is indifferent to your qualifications. \n\nWhat is not okay is hiding, pretending, rejecting, suppressing. Loneliness is alright. Pretending that you are not lonely is not alright. Trying cheap substitutes for the real one is not alright. Living in self-deception is not alright.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fqe6n6/you_are_an_accepted_child_of_the_universe/", "title": "You are an accepted child of the universe", "social_network": "reddit", "user": "AcharyaPrashant_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 36, "down_vote": 0, "creation": 1585373618, "permalink": "/r/DecidingToBeBetter/comments/fqe6n6/you_are_an_accepted_child_of_the_universe/", "nsfw": false, "first_save": 1635436525.053755, "replies_charged": false}