{"id": "t5_2tand_t3_o4jk3h", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "badbd7e1-4692-457a-97bc-7317bdf8e5c1", "f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "It has been a month since I had a mental and emotional breakdown. I finally pushed through with getting an appointment with a therapist, and it feels a little nice to have a name for that vague emotion, loneliness, and hopelessness I feel most of the time (in my journals, I refer to it as a dark place). \n\nIt seemed that I have trauma (from work), which caused me to have anxiety--and both of these leaked through the other aspects of my life. I finally learned that I cut people off my life because of the toxic attachment I have to my work and the imbalanced approach I have to my life (I neglected my social life, intellectual life, recreational, etc. in favor of my work, which led to extreme burnout and anxiety).\n\nSo two weeks ago, I resigned from my work and searched for other jobs that would give way to a more balanced life. By next week, I would begin my new work and it really feels liberating. But I do acknowledge that I still have a long way to go.\n\nI have to relearn that progress is slow, and that it would entail patience and time. And of course, I have to make tiny steps everyday by making conscious decisions to be better even in the small details of my daily life. \n\nI have to face that mending relationships hurt, but it certainly is worth it. It feels great to reconnect with friends, it feels humbling to set my pride aside and apologize for drifting away. \n\nStill a long way to go, but I make it a point to try being better everyday.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o4jk3h/deciding_to_be_better_is_an_everyday_choice/", "title": "Deciding to be better is an everyday choice", "social_network": "reddit", "user": "raracee", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1624237576, "permalink": "/r/DecidingToBeBetter/comments/o4jk3h/deciding_to_be_better_is_an_everyday_choice/", "nsfw": false, "first_save": 1635435287.308697, "replies_charged": false}