{"id": "t5_2tand_t3_3d7uf0", "request": ["cbd1933a-caaa-464d-8e4c-373318982c62"], "text": "So, I've been meditating for nearly two months now. I changed my diet a little bit, cut out some bad foods/sugars/lessened caffeine. And have been exercising daily for a week now (though yoga's been for nearly two months as well). My life has changed dramatically. The way I talk to myself in my head is much lighter and more open to negotiation rather than immediate hate. I stop and think a bit more before I say something and question \"now, why am I saying this? Does this **really** need to be said?\" and that has changed things dramatically in my head and action-wise. So, things feel good and promising. \n\nBut here and there moments of sadness and distress have popped up.\n\nWhen something bothersome has hit me, I immediately just meditate on it so I can converse with myself in an open, calm space without criticism which offers a really awesome perspective on things. But there have been slip ups where I've reverted (only slightly though) to that mindset of negativity and self-hate/self-criticism and started feeling really down. Fortunately, I'm at the point now where I am still in the sadness/anxiety but almost on the outside looking in of it, trying to have control of it and observe it. But feeling that way, the hate and anger, the more I gain perspective of it the more I relate it to being hooked on a drug. It feels fucking amazing to hate myself and make myself feel like dirt. It's normalcy. It hurts so good, y'know? That sort of thing. I detest it.\n\nSo, being depressed or angry with myself is like being hooked on a drug that I'm getting myself away from. Does anyone else struggle with it this way or have any perspective on this concept? I feel really weird about it and like something's not quite right with me because of it. For clarification, I don't **want** to feel sadness and engage in self destructive behavior but the manipulation and negative emotions feel, well, internally euphoric sometimes. Kind of like scratching an itch in a way. \n\nThank you for your read and help! This thread has been tremendously helpful in my couple of months of self-healing. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3d7uf0/depression_feels_like_an_addiction_im_running/", "title": "Depression feels like an addiction I'm running away from?", "social_network": "reddit", "user": "boopbeepbooboo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1436849418, "permalink": "/r/DecidingToBeBetter/comments/3d7uf0/depression_feels_like_an_addiction_im_running/", "nsfw": false, "first_save": 1635436408.42037, "replies_charged": false}