{"id": "t5_2tand_t3_on2kjw", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "Since my last relationship ended (was very toxic), I have been an unsufferable obsessive over sex and relationships. My life is pretty good all in all, but I've been so disappointed that I have hit a dry spell that it sucks all of my energy right out of me. It genuinely makes me depressed.\n\nThat's not good for anyone. Not for me. Not for anybody I might date. This obsession means that I am more likely to make myself vulnerable with the wrong person, and therefore I am at greater risk of entering a toxic relationship and being taken advantage of.\n\nSo I'm deciding to be better. To let go of this compulsion, to recognise it is okay to focus on other things. That the right one will come along in time, and I have little control over when that is. After posting this I'm gonna:\n\n* Calm down with the dating apps. Stop checking them so much, and if a date doesn't happen: that's okay.\n* Speak my mind. If there is someone I like, I need to stop dreaming about them and actually talk to them about it so that if they reject me we can both move on in our lives. No big drama necessary.\n* Limit social media. Dude, social media causes so much damage - seeing others also complain and obsess about not being in a relationship, legitimises my self-destructive habits.\n* If I do feel down, pick myself up with something fun, like painting or playing a game. Do not hangout with a close friend, as that can generate all the wrong feelings.\n\nAny others I am missing?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/on2kjw/deciding_to_cancel_my_toxic_obsession_over/", "title": "Deciding to cancel my toxic obsession over relationships & sex", "social_network": "reddit", "user": "nuclEarsnak3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1626652860, "permalink": "/r/DecidingToBeBetter/comments/on2kjw/deciding_to_cancel_my_toxic_obsession_over/", "nsfw": false, "first_save": 1635435137.3866067, "replies_charged": false}