{"id": "t5_2tand_t3_kx7xq4", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Throughout my childhood I often gave up on things that got hard. Things like math for example. I fell behind in middle school and never really got it back. I also had a very traumatic childhood I was sexually abused the entire time. Which caused me to fall into a deep depression. I tried in school but not my best because my mind would often tell me I couldn't do better. \n\nI graduated high school and forced me into college when I didn't believe I was ready. I was forced to choose a major I didn't favor. It was a drag. I didn't show up to school because I didn't feel smart. My lack of confidence made it difficult to complete courses. I also had opened up about my sexual abuse and my life was spiraling downward. I decided to stop going to school and just work. So I did that. I was embarrassed that I failed school. I started telling myself that I couldn't do it so everytime I tried I failed. \n\nWhen I was pregnant I decided to enroll because I never to do better for myself and my daughter. I began getting great grades. It didn't last long though.  The next semester I fell into a deep depression. I was constantly being told I wasn't enough and that hurt. So I failed again. I took a semester off this fall. This spring I'm at a new school. I'm taking things slow because that's what works best for me. I'm telling myself that I can learn instead of I can't. I'm allowing myself to be and do better. Unlike before. I'm only 22 and I felt like a failure but the truth is its just the beginning.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kx7xq4/years_of_failing_and_finally_allowing_myself_to/", "title": "Years of failing and finally allowing myself to do this for real.", "social_network": "reddit", "user": "Forsaken_Earth_2835", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1610638555, "permalink": "/r/DecidingToBeBetter/comments/kx7xq4/years_of_failing_and_finally_allowing_myself_to/", "nsfw": false, "first_save": 1635436516.1380749, "replies_charged": false}