{"id": "t5_2tand_t3_oczq1s", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I'm 26 but at the core wounds I'm about 4-11... I'm wondering is it okay to bawl if an adult calls me, say, something I totally didn't expect- if they*were* being mean to me? I stay in my room all day, I live with my parents. It's normally my parents who push/shove-hit & kick me verbally, abusively. Psychologically berate me, etc. My very presence is enough to irritate. \n\n\nI'm not able to throw and break things anymore, I'm not a kid with a temper tantrum. I'm an adult in regards to how violence is scary when you are strong like an adult, so cops have been involved. At the end of the day I just want a hug and to be told, okay, you made a mistake it's no big deal. Then to get a hug. But I isolate. In fact I'm isolating in bed rn! It's about 11 pm. I don't listen to a radio, watch movies or read things. I don't listen to music either unless my parents blast theirs, it really traumatizes me so I blast music on the only thing I have in my room, which is my tiny phone speaker 😥 I just want to be able to cry if I'm hurt. Because the things my mom says hurts me, but I disguise it in anger. Always... I'm ready to kind of show pain though; I'm ready to express sadness. Despite crying like a child as an adult. Is that healthy?\n\nEdit: Thank you for the rewards! 🙂", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oczq1s/as_an_adult_with_problems_im_just_wondering_if/", "title": "As an adult with problems, I'm just wondering if it's okay to cry like I'm a kid when an adult or situation crumbles me like I'm a pile of rubble?", "social_network": "reddit", "user": "No_End_7227", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1148, "down_vote": 0, "creation": 1625324610, "permalink": "/r/DecidingToBeBetter/comments/oczq1s/as_an_adult_with_problems_im_just_wondering_if/", "nsfw": false, "first_save": 1635437375.301058, "replies_charged": false}