{"id": "t5_2tand_t3_q943bm", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "Im currently in the process of overcoming some old triggers so I thought that I'd share my perspective on what's happening in my life right now. If you're struggling with coping with triggering situations or not understanding why you're being triggered this may be useful for you...\n\nI've noticed that I've been getting super triggered by multiple situations in my life right now that are very similar to traumatic situations I've experienced in the past. They are literally **highlighting** my deepest fears & worries.  The only difference now is that I cant give into my old patterns/defense mechanisms because of the higher awareness I hold now. Apart of me wants to shut down, freak out and run away but another part of me is like, what if I don't do that this time?, how different will the outcome be if I chose to respond to what's happening from a objective/rational place instead of reacting & taking action from an emotionally wounded place?\n\nDon't get me wrong, Im still in a constant emotional & mental battle with myself but I think I'm doing a pretty good job at weathering the storm. I have to consistently remind myself that my triggers are only showing up to help me avoid experiencing painful situations again but they are no longer relevant because they're based on outdated fears **(aka** ***F*****alse** ***E*****vidence** ***A*****ppearing** ***R*****eal)**. Ever since I started to perceive my triggers simply as pop up notifications, Its a lot easier for me to acknowledge & resolve them because I know that their only purpose is to notify/inform me of something that MAY occur.\n\nWe all are well aware of the fact that triggers aren't fun to feel but when you change the way you look at them, they're a lot less scary to deal with. Be curious about what's causing them, write them down, acknowledge what its trying to tell you, be thankful for it showing up but don't give into it.\n\nIm not here to sugar coat anything but I promise this will help but It definitely won't get rid of that icky uncomfortable feeling right away. It takes time for our subconscious mind to catch up with our conscious mind so as long as you keep resisting the urge to play into your old patterns, eventually the neural pathways in your brain that maintain those triggers will begin to weaken so you'll no longer be impacted by the same type of stimuli again.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q943bm/on_overcoming_fears_triggers_the_only_way_out_is/", "title": "On overcoming fears & triggers (The only way OUT is THROUGH!)", "social_network": "reddit", "user": "Evolved_hippie", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 16, "down_vote": 0, "creation": 1634355455, "permalink": "/r/DecidingToBeBetter/comments/q943bm/on_overcoming_fears_triggers_the_only_way_out_is/", "nsfw": false, "first_save": 1635436779.6312833, "replies_charged": false}