{"id": "t5_2tand_t3_hipt2n", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hi everyone. I hope all who read this are safe and well during this pandemic. Due to the circumstances we are in, **I am offering free facilitation of 'The Work of Byron Katie' worksheets or free informal psychological support**. Those familiar with 'The Work' and are interested in guided facilitation can freely message me personally, and in return we can relate over Skype (or a similar platform as suitable).\n\nSuch correspondence can of course be completely anonymous, and privacy and wellness of being is paramount to me.\n\n**About me:**\n\nFor around 5 years now I have been relentlessly dedicated to The Work. I own all of Byron Katie's audio that is available to purchase (obsessive, I know!) and listen to at least an hour of content per day - and far more now during lockdown! I have listened to (collectively) thousands of hours of The Work being facilitated by Katie, and it is a never-ending path towards greater fulfilment for myself. I would sincerely love to pass this experience on for others, please feel free to message if you would be interested at all - it would truly be my privilege.\n\nAlternatively, I greatly recommend exploring The Work of Byron Katie for free on YouTube, her podcasts online or with her copyright audio free to download: [http://web.archive.org/web/20160318085027/http://www.everypathis.org/](http://web.archive.org/web/20160318085027/http://www.everypathis.org/) . I cannot describe in words how profound an effect this material and 'The Work' has had on me.\n\nI look forward greatly to your messages, be safe, look after family and friends - and know that there is always someone willing to listen to your situation.\n\nAll the best, and much love. ❤️\n\n(I stress that I am not associated with Byron Katie, BKI - nor am I a certifed facilitator of 'The Work'. Instead I am volunteering my services for free due to the situation we are in, and my experience of 'The Work' being the most profound method of relieving stress, negativity, axiety, pain that I have ever experienced. I direct anyone with more urgent and serious issues to contact help lines local to your area, and thework.org has a free helpline to call, as well as certified facilitators to guide you through a worksheet.)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hipt2n/offering_free_facilitation_of_the_work_of_byron/", "title": "Offering free facilitation of The Work of Byron Katie", "social_network": "reddit", "user": "Do-The-Work", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1593531874, "permalink": "/r/DecidingToBeBetter/comments/hipt2n/offering_free_facilitation_of_the_work_of_byron/", "nsfw": false, "first_save": 1635437858.7575097, "replies_charged": false}