{"id": "t5_2tand_t3_au8gn8", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "I've never been the type that feels happiness in the way you're supposed to. Of course, I've felt it but it's always been accompanied by either manic happiness or some sort of heaviness in the background. Anxiety ridden plague spreading through my body or the feeling that inevitably, it was about to get taken away. That isn't an over exaggeration. I can't remember a time, even during my childhood, where happiness was carefree and not saturated by thousands of thoughts and emotions that combated it. I've never been a settled person. Even when I went through my six years of stability, happiness was there but I felt like I was sitting in the middle of the ocean during a storm, happiness just a momentary pause in the chaos.\n\nLately though, I've been working really, really hard on myself. When I realized I had hit rock bottom in November, I quickly found my way back to therapy, knowing damn well that the last thing I was going to was give up because no one deserved to feel the way I felt on any given day.\n\nI found this therapist and let me tell you, she has been a miracle in my life. I'm not a religious woman, I don't believe in divine intervention from the heavens above, but I do believe in fate. People being connected in various ways for specific reasons. And to me, finding my therapist was fate. Therapy has always been hit or miss, more often than not, therapy being a huge miss. \n\n\nBut this time was different. I knew it from the moment I stepped out of my first session. There was a shift in me and I could breathe easy, for just a second. Each session has provided me with more clarity, more easy breathing, more days spent with hope. \n\nThe sessions aren't easy. Diving head first into who I am, what makes me who I am, what I feel on a real and honest level, and what I can do to fix it, is probably the hardest thing I've ever done. But it has also been the absolute best.I've spent my entire life, and I mean that in every sense of the term, being hard on myself. It got worse the older I got. \n\nAnd I'll be the first to admit that I am, and always have been, a perfectionist who believes love is conditional which further perpetuates the problem of perfectionism. I've always believed that if I don't adhere to the standards I believe someone or something has placed on me, I self destruct in preparation for the inevitability that someone will leave. \n\nI have always been the type who is filed with guilt, as if my actions and my existence is the reason anything goes wrong. For any given situation, I could give you a few reasons at least, as to why I could be at fault.I have always been the person who feels she did not deserve anything, while everyone else deserved the world. I'd tell my friends they deserved a break and to, you know, treat yo self, while on the same side, I'd guilt trip myself if I tried the same.\n\nI have always believed that what I see in the mirror is a direct and accurate reflection of what the world sees in me. Every flaw I had, every comparison I made, it had to be written along my skin like a tattoo. Not the right size. Too many flaws. My mom stomach being the only thing anyone could look at. My hair imperfect and wild. My skin riddled with imperfections. If i saw it, then the world probably saw it ten fold.\n\nAnd I have never believed that I had self worth, my worth in fact, only being tied into what I can can provide as service to others. And among other things I have believed about myself, these things have molded how I interacted with the world and with myself internally.As you can imagine, it's hard to feel happiness when this is how your brain has been speaking to you. Whispering the negative words to you as you try to fight for some sense of, well, anything good. So any happiness I've had throughout my life has always been coupled with mania, anxiety, sadness, or the feeling of impending doom. As if happiness was a precursor to something bad around the corner.\n\nBut lately? I've felt...happy. True, honest, raw happiness. A sense of calmness. Content. As if I'm sitting in still waters for the first time in my life. And every time I think about it, I pause, sometimes for a few fleeting seconds, sometimes for longer, and really feel it. Because it has taken me 29 long years to get here. I'm working hard every day to improve. To understand. To move forward. To find my worth because I believe it, because I've discovered it, not because someone has told me what I am worth. To find that sense of content with not being perfect. To discover that love is not conditional. That the love I have in my life will always be unconditional. That I am worth unconditional love. To really believe I deserve everything I have. To really be okay with deserving things like having a break for myself or relaxing, because up until now, any break I took, any moment I had for myself, had me feeling more anxious than relaxed. \n\nThe mindset that I should be doing something for someone else, that I don't deserve to just be. I'm learning how to relax, and I mean actually relax. Chill out, just be me, without feeling guilty. Treat yo self being something I can apply to myself.And I can't even begin to describe how incredible this has all felt. It's truly indescribable. \n\nThis is what I've been searching for my entire life. The type of happiness that I'm supposed to feel. And the biggest thing that I've found to be the most incredible feeling is that happiness hasn't just been coming when something good comes about, it happens just randomly. My baseline is happy. My confidence is real and not based on the confirmation of others. I'm finding myself discovering things I like about me because I found it. I did that. I accomplished that. And I'm just...happy.\n\nI stumbled upon a photo of me from November. It's a picture of me smiling, or mustering as much of a smile as I could handle on my end. And I compared that to a picture that was recently taken of me by my best friend. The difference is uncanny. You can see the weight of hitting rock bottom in my face versus the light of finding myself. It was the confirmation that happiness isn't just internal, it impacts everything that you reflect on the outside.\n\nThis journey isn't over. I don't think I'll ever stop finding ways to improve, finding ways to maintain this. But I'm excited to discover who I am in a way that I've never done before. I'm excited to love me, the real me. I'm excited for what's to come because while most people go through a midlife crisis at this age, I feel like I've spent my whole life in some sort of crisis. And now it's my turn to just enjoy life. To just be happy. \n\nI guess the biggest piece of advice I could possibly give is to never stop learning, whether it’s about yourself or psychology or treatments. Never stop trying to look at yourself, really look, even when it’s hard. Never stop being open to your flaws and seeing them as ways to improve and not just problems. Never be afraid to seek help because there really is no shame in trying to better yourself. \nETA: sorry for the format. I did it on mobile. From my view, I see paragraphs. 🤦🏼‍♀️", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/au8gn8/after_29_years_im_finally_genuinely_happy_and/", "title": "After 29 years I’m finally genuinely happy and doing better.", "social_network": "reddit", "user": "mamaandthelittless", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 463, "down_vote": 0, "creation": 1551018777, "permalink": "/r/DecidingToBeBetter/comments/au8gn8/after_29_years_im_finally_genuinely_happy_and/", "nsfw": false, "first_save": 1635437171.3211145, "replies_charged": false}