{"id": "t5_2tand_t3_mk1mzb", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "First time poster, so thanks for having me!\n\nI’m 37, M, Scotland and I’ve had a pretty happy life thus far. I do a job I enjoy and I’ve got good family and friends but I’ve always been fat. There’s only been one time in my adult life (during 2006 when I decided to run the New York marathon and slimmed down from 273 to 231 lbs) tbag I’ve not been well overweight. It’s never really bothered me; I had moments during my life where I’d see a photo or catch my reflection and just be like ‘what are you doing?! You look terrible!’ But on the whole I’m just the fat jolly guy and don’t let it get to me. But something changed at the end of last year. I aw some pics and decided that for the sake of me and especially my 5 yo daughter that enough was enough. \n\nI chatted to a group of friends all over the UK who all had similar challenges of their own, set up a whatsapp and started out on 1/1. I weighed in at my heaviest ever, 300 lbs and set myself targets and a plan. Walk 10k steps a day, minimum, manage calories through my fitness pal and maintain a sizeable deficit (typically ~1000 a day) and off I went. Well the weight has fallen off (in 13 weeks to Friday, I’ve lost 66 lbs) and I’m now 234lbs. 3lbs off the lowest I’ve ever been as an adult and I’m planning on going well below even that. I’ve lost 8” off my jeans size and have had to sell basically my entire wardrobe! \n\nBut the thing that’s been REALLY amazing is how this has impacted other areas of my life. My little side hustle of a business which I’d spoken about but done nothing with is now up and running. I’m totally on top of things at work and full of motivation. I now get up at 0545 and walk for a couple of hours minimum, listening to audio books, podcasts and music and I’m more creative and thoughtful than I’ve ever been!\n\nI also realise how much I’d lied to myself. I’m still fat at 234 lbs - but I’d long told myself that if I got to about 252 then I’d no longer be overweight! I’m gonna get myself to a place where I’m genuinely not fat any more and be able to look back and see what’s possible when I apply myself.\n\nStill lots to do both physically (another 24+ lbs to go I’d say) and mentally (keep pushing myself to drive my side hustle forward and challenge myself to push on at work too) but the difference I’ve felt this year has been huge and I’m delighted with the way I’m looking and feeling! Hopefully some things there that inspire others to try something they’ve put off and get stuck in to their journey!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mk1mzb/my_growth_in_2021/", "title": "My growth in 2021", "social_network": "reddit", "user": "SpoonieAB3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1617560286, "permalink": "/r/DecidingToBeBetter/comments/mk1mzb/my_growth_in_2021/", "nsfw": false, "first_save": 1635436201.368189, "replies_charged": false}