{"id": "t5_2tand_t3_ggebo8", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I'm so sorry for bringing a negative into this sub, but I really don't know where else to go. I'm a 17 year old Singaporean student and I'm a jack of all trades, master of none. It pains me because everything I've once loved just dies down and I always need to find something new to replace it. \n\nI've done woodworking, calligraphy, singing and music (which are the only consistent things but they don't satisfy me), musical writing and book writing, played over 100 different video games but found it hard to stick to one and complete it, Krav Maga, 3D modelling, game creation, and probably a crap ton of other things that I just can't recall now. It just seems like I get half decent at something, get bored, and lose interest. \n\nMy current \"hobby\" right now is a game called Cook, Serve, Delicious 3. Once something becomes a hobby of mine, it'll quickly escalate into an addiction for a week, at most, before dying down.\n\nI don't know what I want to find. Maybe it's a passion that I can stick to for a lifetime. Maybe the validation that it's okay to be bored. I don't know, really. It seems like everyone around me has a set passion and is really good at it, and while I do excel at some of my hobbies and fail miserably at others (looking at you, Krav. Punched someone in the face softly during sparring and apologised for 5 minutes), I just can't seem to stay with one for long. \n\nAny advice on what to do? =(", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ggebo8/i_cant_find_my_passion_and_im_stuck/", "title": "I can't find my passion and I'm stuck.", "social_network": "reddit", "user": "ibrokebatterypacksb4", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1589025911, "permalink": "/r/DecidingToBeBetter/comments/ggebo8/i_cant_find_my_passion_and_im_stuck/", "nsfw": false, "first_save": 1635438261.4960158, "replies_charged": false}