{"id": "t5_2tand_t3_87ooih", "request": ["5f5800f0-4f93-434b-b4ea-20780c889498", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "For a while now, I've had this desire to head back to my old high school (grades 9-12) and share some knowledge I've been fortunate enough to come across since I graduated almost ten years ago. More recently, a former teacher of mine at this school convinced me to write something up, and while I've been going through iterations I noticed how I am constantly reminding myself of these lessons I was taught. I figured since I've been far more productive and I feel like a better version of myself recently that some users on this sub might also like to give this a look. Obviously, any insight/opinions would be great to hear as I need to share this with around 450 students in a couple of weeks.\n\nSo without further ado, here is the \"Blackjack of Life\", a collection of the 21 best pieces of advice I've received from 21 different people:\n\n\n**1. There is no rush**\nEspecially so with regards to the current generation, where we often look to rush things to completion as quickly as possible. Life is long, and although it feels as though time passes so quickly, it is important to remember the long road ahead. Do not waste the precious time you have worrying about how to get somewhere within a specified amount of time. Slowly but surely, you will get there. If all you have to look back on is a blur, it wasn't a life well-lived.\n\n\n**2. Write it all down**\nThe biggest lie people tell themselves is that they will remember it. It shouldn’t matter if it is a ridiculous thought, an idea that’s already been invented or what you are feeling that day. When you have a strong feeling about something, write it down. The ability to revisit thoughts can often help in productivity.\n\n\n**3. Keep yourself healthy**\nJust as your body responds well to a healthy lifestyle, so too does your mind. In order to reach the top performance of mind and body, it is important to maintain a healthy lifestyle. The better condition you are in, the more you can accomplish. Not just physically, but mentally. If you need that day off, take it. What many people fail to realize is that any kind of pain or suffering you are going through is just as harmful to your being mentally as it is physically.\n\n\n**4. Draw your targets**\nOn a journey, the best way to figure out your direction is to establish your goal, not the means. Just like traveling, it is far easier to pick a destination and then decide between traveling by bus, plane or car than if you had just wanted to go on vacation with no set destination. \n\n\n**5. Be a little childish**\nThere is something about being childish that gives  the purest feeling of freedom. Your upbringing has taught you to dress, behave, and live in a particular way. Sometimes this can be a limited way of thinking that hinders your mind; you do not think as openly and freely as you used to. Allow yourself to be childish occasionally. Because as a child, the entire world was so new to you. Your rewards and consequences, your excitement on learning and trying new things. The limitations of this world weren’t holding you back, you were free to grow however you chose to. \n\n\n**6. If you're unsure, just flip a coin**\nWhen faced with the dilemma of a split decision, just flip a coin. If you are hoping for it to land on a side while its in the air, you've already found the decision you want to make.\n\n\n**7. Teach yourself useful skills**\nIt is an excellent way to increase productivity and benefit you without feeling like a waste of time. If there is something you always considered useful, try learning it. If you set a time for yourself every day to learn something new, you will go to bed with the affirmative feeling of accomplishment and that you are positively sticking to a routine that will only better yourself. \n\n\n**8. Pique your interests**\nMany people go through life having interests, and do nothing with it. A real shame, since many eminent individuals throughout history accomplished great things by diving into their interests. If nothing else, learning about what interests you can make you that much more of a knowledgeable person.\n\n\n**9. Create something**\nIn the process of self-betterment, there will be times where you stumble across something that you wonder why it isn’t around. Not for others, but for yourself. In those instances, you should take it upon yourself to invest some time in a personal project for something you think should exist to help you out. Not only will you create something more useful for yourself, but the additional understanding of hard work for creators and the humility of getting your hands dirty will make you a more appreciative person. Maybe it’s a morning routine, a computer program or a display case for all your treasured memorabilia. In any case, it’s investing your own time to create something for yourself.\n\n\n**10. Be the early bird**\nAs a child, I could never imagine why someone would willingly leave their bed early when there was no work to be done. Yet every morning, my father would get up in the hour of sunrise and leave the house. After my teenage years, it dawned on me that my father had simply loved having more time in his day to do things that is now shared with me. More time in your day gives you more time to get something done!\n\n\n**11. Leave your comfort zone**\nAn extremely common piece of advice notorious for its vagueness. The focus of this is to encourage the sheltered to break free and see what they are capable of. It is quite the shock to see how miserably hopeless or pleasantly capable people can be. By pushing yourself out of your natural element, you can discover just how well-equipped you are to take on the unfamiliar monsters of the world.\n\n\n**12. Think abstractly**\nAdvice on creative thinking is commonly affiliated to boxes and thinking outside them. Instead, remove the requirement of sense to your solutions. Problem-solving today has become somewhat linear in the sense that many flock to a single method of thinking. Imagination is the key element missing from the equation, where methods of thinking such as reverse engineering can end up yielding far better results to problems. \n\n\n**13. Everyone is worth knowing**\nAs fleeting as it may seem, life is the longest thing one can ever experience. Throughout this lifetime, you will (statistically) encounter upwards of ten thousand people – and each and every one of them is worth knowing. The stories of a chance encounter leading someone to success is a dime a dozen, especially in the ever-evolving growth of media platforms that allow individuals to connect with others all over the world instantly. Just as everyone else progresses with their lives, they may also turn into someone who becomes a great contact. To someone you've met, you could someday be the next story they tell.\n\n\n**14. Look down on no one**\nGrowing up and the culture around you both in and outside your home will always have a lasting impression of your behavior. The world is filled both with people who think they are better and people who think they are worse than others. Never become one of those that look down on others. A problem with life is that we live it thinking we are the main character of the story - and we are, to an extent. We are the main character of our story; the problem is that there are seven billion others writing a similar story called life. Never forget that every single person has a life and have made decisions that ultimately put them where they are today. They are not just support characters to your main story, they are their own protagonists and don’t deserve being looked down on by anyone.\n\n\n**15. Don't take your pride everywhere**\nMany people walk around with this sense of pride, which is fine… If it needs to be there. For millennials who have a strong sense of entitlement, what makes you so entitled to receive what you want? Do you have pride in yourselves because you know how to use modern technology better than your parents? Because you are growing up in a more tolerable world to different lifestyles? Or for the baby boomers, do you think because you paid your dues working and raising kids who moved out that your job at being a decent human being is over? That you can retire from work and that includes leaving things like tact and respect at the door? This is a false sense of pride, hindering you from many things like being open minded and accepting when you are wrong or that there may be someone better than you at something out there. Leave this kind of pride at the door, it doesn’t help anyone when you act like you deserve the world when you haven’t earned it or when you cast your back on newer generations because they differ from your own.\n\n\n**16. Keep your fears**\nEvery decision you make will affect the countless others that follow it. Though it seems unorthodox, it is the very fear of doing something that can be used as the greatest impetus. By depriving yourself of certain things, you are closing the doors to many opportunities and chances that only could’ve happened by going out and experiencing. Save for danger, having the “fear of missing out” can be used in positive ways.\n\n\n**17. Become an expert in what you love**\nAiming for the title of “best” in what you love doing is as admirable as it is vague. To truly become the best, one should strive to be acknowledged as an expert in what they love doing. Consolidating your interests into a set topic to excel in is a step forward in the path of success. Just as Olympic athletes compete to win the gold and nothing else, so too should you compete in order to be an expert in what you enjoy. You’ll only ever be as good as the effort you put in.\n\n\n**18. Find the silver linings**\nThe picture of life is painted as the greatest experience one could have, along with the most difficult. It is strange to think that something so enjoyable could ever be difficult, much less the most difficult. Rather than that, I believe it is the difficulty of life that gives us appreciation for what comes after we climb up the hill. When faced with the trials and tribulations that will inevitably come, it is important to keep your thoughts on the silver lining; the light in the darkness. One cannot exist without the other, just as shadows cannot exist without light. There are always two sides to the coin, and you should always obligate yourself to find the better part of something horrible; true silver linings.\n\n\n**19. Find the best partner**\nFinding the one person to share your world with and to be shared their world is a beautiful thing. The idea of marriage should be having the ultimate partner to tackle the business known as life. It’s this ultimate partner that you can be completely yourself around and have no fear of being too open with. Someone that can know you so well and help you reach greater heights, just as you help them reach greater heights as well. One person against the world may not achieve much, but two people against the world doubles your odds.\n\n\n**20. Define your success**\nEveryone wants success. The concern is when many people are running for the end zone for success without knowing which side of the field they should be running. “Success” is not something so easily defined by many people, because people have different views of what success is. Because success isn’t measured simply by wealth, or love, or your kindness to others. Success is actually an accumulation of everything you believe in, everything you want and everything you dream of. Success is how well you excel at meeting your needs, your family’s needs and your professional needs. Success isn’t linked to just one aspect of life; it’s linked to all of it. \n\n\n**21. Always believe in something**\nI found this to be the most important advice I have ever received - believe in something. Doesn’t matter what it is, doesn’t matter what anyone else thinks, doesn’t matter how strange it sounds - believe in it. Every single human being subconsciously clings to something their entire lives and only realize it when it happens - the arrival of hope. No other emotion can turn people more than hope. Hope for love, hope for vengeance, hope for something good to happen - it’s all hope. And people will change completely to get the result they are hoping for. In that sense it is the most powerful and most destructive tool we have in our arsenal as a human being. To know how to harness this is as simple as believing in something good, and using it to push you to receive that outcome you are hoping for. But you need to be in it to win it - in order to get the hope, you so desperately want, you need to take the first step forward and have faith. Focus on a hope, let it drive you and fuel you to push you past your limits and achieve something great.\n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/87ooih/top_21_life_lessons_collected_by_me/", "title": "Top 21 Life Lessons (collected by me)", "social_network": "reddit", "user": "Jahlei", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 402, "down_vote": 0, "creation": 1522206720, "permalink": "/r/DecidingToBeBetter/comments/87ooih/top_21_life_lessons_collected_by_me/", "nsfw": false, "first_save": 1635436738.249384, "replies_charged": false}