{"id": "t5_2tand_t3_6csg71", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "TL;DR To complete the transition from boyhood to adulthood at 25, I must overcome my addiction to videogames and shift my focus to producing art. \n-\n\nThe thought that inspired this whole post:\n\nThe thing that makes a man good is that he fulfilled his potential. Sustained effort dedicated to some higher purpose or some greater goal is integral to the human soul. Without sustained effort, a man can fall victim to his own base desires to seek pleasure and become addicted. When addicted, he is just a lab rat pressing a lever, stuck in a cycle of narrowly chasing what feels good. That isn't human, that's too basic, too primitive of a behavior to fit an apex predator.\n\n___\n\nUp until now, my behaviors have been to maximize the amount of pleasure per effort. Ever since I picked Squirtle in Pokemon Blue at age 6, I've used videogames to give me a source of entertainment and achievement. I was often bored as an only child and video games were probably the single most fun thing I could have done with my time. Now, more than ever, video games provide an incredible amount of dopamine. I've created an amazing battlestation to maximize the amount of fun I can have using my gaming PC. I've done all the setup, so the pleasure per effort of using my computer is at its all time high. My dopamine economy is booming more than it ever has. But because I'm expending such little effort, I've wasted an enormous amount of potential. That effort decays and turns into laziness. Laziness is the price I pay for my lifelong task of optimizing the amount of fun I can have when I have alone time. That's what I chose to do instead of skill-building; this is due in part because I didn't grow up with a father to set a strong example and influence me with the societal expectation that I had to be strong and do hard work to be taken seriously as a man. However much contempt I hold toward societal expectations, I do acknowledge that my new strategy needs to be one that takes that wasted effort and produces something with it.\n \nWhat's my old strategy? Well, I've been spending my free time playing Rocket League. Anyone who's played this game and gotten better at it knows what it feels like to finally score an aerial goal or perform an epic save. It's the most addictive videogame I've ever played, and sustains my dopamine at high levels for hours at a time. I've played for 1069 hours, which, to be fair, does include all the time it's been open on my computer while I'm away from the game. And anyway, who's counting? That's just **8%** of the 13,632 hours since I started playing in November 2015... Holy shit, that's not even accounting for waking hours! If you change the days to 16-hour waking days, that becomes **12%** of the 9,088 waking hours since the day I played this game for the first time. It is tragic that this extra potential is being squandered in my addiction to video games. Though it's culturally acceptable for me to dedicate the bulk of my leisurely efforts to playing my days away, I can be more than just a good Rocket League player. Reaching Grand Champ is not the potential I want to strive for. Competitive video games are a good way to outlet the desire to compete and dominate others that so many men have. They're great because at the end of the day, if you lose a Rocket League game in overtime, it's not the end of the world. When alone, I engage in lazy, unproductive dopamine harvesting as my primary recreational activity. Don't get me wrong, it feels very good and enjoyable and fulfilling (when I get a new item or when I win / rank up) to play video games. But when I focus on Rocket League as a goal to which I dedicate a lot of my time, then both my victories and my losses are trivialized. I'm shielding myself from serious failure but blocking myself from serious fulfillment.\n\nI am not as proud of my Rocket League achievements as when I produce an arrangement, an essay, a comment (like this one!), or a song.\nWhen I make one of those, I share it and excitedly but neurotically--I'm extremely concerned about how it's going to be received. I think I see it as some sort of competition, just like I always have with videogames and sports. When I'm going to put one of my productions out there in the world, I have much higher standards for it. I will settle for nothing less than a sustained effort because the #1 priority is for me to be proud of it, for it to eloquently communicate *exactly* the message or feeling I wanted to communicate. But I'm so nervous to publish these works because I'm afraid to start competing with others. The only way I'll publish something is if I've perfected it (which is the only reason why this diary-entry-turned-Reddit-self-post got to be so long).\n\nI'm a musician, and one of my life goals is to get better at making music and to share it with the world. I wrote some cool a cappella arrangements in college and I want to keep making music, otherwise it feels like something is missing. Nothing makes me more fulfilled than if my art is well-received and people make me feel proud of myself. There's an incredible reward, but the consequences are also dire. I don't want my productions to be any less than the best, because I'm an obsessively meticulous perfectionist about these things. When it comes to my music, I want to be the very best, like no one ever was. Producing electronic music in Ableton has been my goal for almost a year now, and I have nothing to show for it. I bought an expensive keyboard, studio monitors, and audio interface but haven't been taking advantage of them for months. I'm paralyzed with procrastination because I'm too afraid to fail.\n\nVideogames are an excellent coping mechanism that I've developed over time to counteract my obsessive tendencies, but I know that I could be achieving more, if only I could put forth that sustained effort. The most ironic part is this: upon sending the intro/hook I made in my first sustained effort making beats in Ableton yesterday to my friends for feedback (after months of having the equipment but no motivation to produce), I was met with overwhelming positivity and encouragement. I seem to have taken that encouragement as an excuse to do a tiny bit of production, then slack off until turning in a revision by Sunday. Procrastination with videogames and smoking weed is what I chose.\n\nUltimately, I think that this is the primary conflict that will signify my full transformation from a boy into a man. I have a long-term problem with the patterns of my behavior. Recognizing them is the first step to correcting them, and that's why I've written this self-reflection. I've obsessively revised it and communicated *exactly* the lesson I've learned for myself, just as I knew I would if I actually intended on submitting this as a self-post instead of just keeping it in my diary. Hopefully you can identify and rectify some of your own dysfunctional behavioral patterns from my revelation. I need to rearrange my priorities into something I can really be proud of. For me, being proud of my accomplishments is the only way to be fulfilled. I need to trade in my Rocket League highlights for my electronic music masterpieces. I'm going to get back on the wagon of mindfulness meditiation, too. Being in this state of mind will keep me on the right track. \n\nP.S. Thanks, Mary Jane. I couldn't have written this without you. You're a huge part of the problem, but I'll let it slide this time. One battle at a time.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/6csg71/ive_just_admitted_to_myself_what_the_central/", "title": "I've just admitted to myself what the central problem is in my life and figured out why I don't feel fulfilled. Here's my self-reflection.", "social_network": "reddit", "user": "thesilverbandit", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1495513282, "permalink": "/r/DecidingToBeBetter/comments/6csg71/ive_just_admitted_to_myself_what_the_central/", "nsfw": false, "first_save": 1635436717.4764605, "replies_charged": false}