{"id": "t5_2tand_t3_equz2p", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "On some days I think I should just resign to doing an ordinary job, get a wife and kids, smoke my joint in the evenings and be happy with that.\n\nBut then I know I would feel regret on my dying bed. This post may feel very pretentious and I am sorry for that. So please just act like it's an anonymous post, because I don't know what place to go with these thoughts.\n\nLife has given me many signals that I should create something of greatness to humanity. I am in so many ways privileged I kind of feel ashamed of wasting these gifts on a daily basis. Ive lived in Europe, the Philippines, India and now Thailand by the age of 23. Ive worked as bartender, social worker and ghostwriter, but primarily I am a student.\n\nThere is too many things that I would like to do and too many that I have to do. Im doing my masters because I didnt wanted to risk the relationship to my parents over not doing it. Often I feel like I should pick one thing and focus the shit out of it, over a decade maybe to eventually become professional in that area and then use the influence Ive gained to make a positive impact.\n\nBut I dont know if Im being pretentious to myself, because most of these activities would serve myself in the first place. That makes me sick. I have a addictive personality in a way, that whenever I pick up something or someone new thats fun, I overly put time and effort into it and then I just drop it a few days later because I lost interest.\n\nThere's only two things for which it has been different: My best friends & drugs. \"Luckily\" the drug Im addicted to is only cigarettes and weed, still I feel like the later steals all my willpower to create something.\n\nI smoke till late in the morning and wake up when the sun allmost goes down. I have no schedule to keep to, because Im studying and working online, anytime I want. And I am smoking because it makes me forgot about the obligations that I feel towards humanity and myself.\n\nI have no drive to get out of bed in the morning, no reason to live and wake up if you want to say so. Even if I would decide to take up something that is a potential catalyst for my talents I'd probably lose my drive somewhere again, because Ive never learned to work 10 or 12 hours a day.\n\nEven though I want to get there. Possibly social work is the one thing that Ive always felt a lot of passion for, but it appears like this is a job were you can ressourcefully but easily spent a lifetime on without creating something of true value for humanity.\n\nMaybe thats fine and I am just supposed to help a few people. I hope that would let go of this nudging sensation inside of me. Possibly I need to think less and just keep doing small steps.\n\nI have decided to make this year the year of getting ripped. I am hoping that if I achieve a 10/10 physique then possibly the new found confidence and discipline will transfer to other areas of my life. And I am working out almost every day, it does feel great but once the workout \"high\" wears off, I am back to wondering what the fuck I live for.\n\nEdit// Concerning the topic of death: I feel like I have already seen and done so much, Id die now as a happy man. Sometimes I really feel tired when thinking of the life ahead, the burden that's to be carried or even the chance of reincarnation, life after death etc.\n\nBut I cannot die, because I'd hurt my parents too much. So even though itd be an easy exit, the only option is going forwards. Also I cannot simply take my own life and therefore throw away the many gifts of it, thatd be disrespectful towards all people struggling and fighting so hard on a daily basis. Life in its simplicity and calm, pure existence is just too beautiful to not respect and cherish the gift of it. Even though I know this, I am lacking the daily profound experience of it.\n\nAnyone been there or experienced something familiar? How did you overcome this challenge? Thanks for your time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/equz2p/i_feel_like_i_was_born_for_greatness_but_dont/", "title": "I feel like I was born for Greatness... but don't know in which form or where to draw my energy from.", "social_network": "reddit", "user": "jolimark", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1579431531, "permalink": "/r/DecidingToBeBetter/comments/equz2p/i_feel_like_i_was_born_for_greatness_but_dont/", "nsfw": false, "first_save": 1635437856.3852866, "replies_charged": false}