{"id": "t5_2tand_t3_kwgf27", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "My whole life I’ve been concerned about how people  perceive me. I want to be liked, loved, and accepted. This is a human need since we are social creatures. Having experienced my fair share of abandonment, loss, and grief in my life at an early age, I developed some thought patterns that thought these needs weren’t being met so I clung to the need even more and molded myself into taking action that I thought everyone wanted me to take instead of what I actually wanted. \n\nI constantly agreed to things that I didn’t want to do out of fear that I would be abandoned once again, if even only in the thoughts of other people thinking that I wasn’t lovable or likable because I wasn’t doing what they wanted of me. \n\nThis trend continued in my life in so many ways, I’d mold my personality, appearance, desires, paths, all in the name of being acceptable in someone else’s opinion. \n\nOne day, I finally cracked. Beaten down by an adderall addiction, voluntary starvation, at a job I hated, a college major I despised, in a fake relationship I thought was the best thing I had going for me, I existed as a hollow shell who didn’t know who she was. \n\nThere had to be another way. \nSo I had to flip my life as I knew it upside and do everything I thought I shouldn’t do so I could finally find myself once again. \n\nOne of the common habits I’ve always had is saying yes to what I don’t want to do because it’s what someone else wants from me. I didn’t realize, though, that every-time I did that, I was actually saying no to something for me. If I spend my time doing something I don’t want to do with resentfulness, I say no to the time I could be spending doing something for myself and my own inner peace. This also applies to things that have absolutely nothing to do with others such as my own thoughts or actions.\n\nThis morning I set my silent alarm for 5:55 and an actual sound one for 6:30 because I wanted to go running before work. I went running on Monday too, and that was the first time I did so in months. I woke up the earliest I have in so long on Monday and the whole day I was grounded and confident and felt good. Since I had been dealing with a lot of anxious thoughts the last few months, I knew something had to change so I took control of what I could. \n\nWhen the 5:55 alarm went off I debated getting up at the moment but didn’t. Then the sound alarm rang and I immediately had the thought, “if I say yes to staying in bed, what am I saying no to?” This was a surprising thought because it’s not one that every really came up before immediately at 6:30AM but I also feel it’s just proof of the inner shift through thought work and self-improvement that are sticking. I was saying no to doing something good for my body (yoga and running), I was saying no to feeling accomplished, I was saying no to alone time which is rare since my boyfriend and I both work at home and we don’t do anything because of covid so time by myself is harder to come by these days. I was saying no to all of these wonderful things compared to saying yes to staying in bed which is what I did for the past few months and it didn’t make me feel good when I just ignored my alarm or internal clock that woke me up but I decided to sleep and ended up more groggy and just rolling out of bed right before I had to sign on for work. \n\nSo saying yes to something you don’t want to do becomes more of an obvious issue when you think of what you’re giving up. Opportunity costs I guess for my business people. They’re real and they impact our lives in many ways. I thought I was doing good deeds when I said yes to something I didn’t want to do but truthfully I was also saying yes to resentment and saying no to so many other things that would be better use of my time & energy which are our most important resources. \n\nI invite you to ask yourself next time you feel an “obligation” to say yes in order to please someone else, what’s the cost? What are you saying no to? Making informed decisions instead of ones out of fear of rejection or abandonment has been such an important tool for me on this journey. I’m not perfect at it, but I know every time I evaluate this, I feel a million times better because I usually end up choosing the one that is best for me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kwgf27/whenever_you_say_yes_to_something_you_dont_want/", "title": "Whenever you say yes to something you don’t want, you’re saying no to something you want.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 88, "down_vote": 0, "creation": 1610544515, "permalink": "/r/DecidingToBeBetter/comments/kwgf27/whenever_you_say_yes_to_something_you_dont_want/", "nsfw": false, "first_save": 1635437998.5217853, "replies_charged": false}