{"id": "t5_2tand_t3_jj9mq8", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "Hey everyone!\n\nThis is a copy and paste from another subreddit I posted on, but it entirely applies to this one as well.\n\nBefore I move on, I would like to acknowledge the impact this subreddit has had on me. I don't want to overstate it, because it has only been about a week and a half, but since I stumbled upon this beautiful community I have been on something of a rampage in ridding myself of distractions. I got rid of the internet browsers on my phone, and I primarily use my computer for research, school, and other essentials. (Reddit is one of a couple of my indulgences.) I'm unsure if I have had what would be called an addiction to the internet/social media, but it has negatively impacted my life in so many ways. I was a bad student in high school and junior high because I decided that watching porn and going on Myspace and Facebook were far more important; I had little interest in my studies, and I really think that it stunted by emotional and relational growth. When I joined the Navy, I spent far more time on the internet and social media than I should have, and my career suffered for it. Now that I am out and in college, I find myself in a familiar place. The only time in my life that I had chosen to disconnect from the Matrix for an extended period of time was about two years ago, when I enrolled in online school while I was working full time.\n\nI have never had a GPA so high.\n\nI ended up with a 3.7 GPA, which allowed me to transfer to a good, small private university in Southern California, as well as gain admission into their honors college. Since I believed that I had my impulsive streak under control, I thought that it wouldn't hurt to go back on social media. I couldn't have been more wrong.\n\nI arrived at my new school that fall, full of hope and excitement for this new chapter in my life. I ended up having a massive panic attack due to unresolved social anxiety issues that were only exacerbated (and in some ways caused) by the years that I had spent engulfed in social media and the internet. I also started a new, ill-fated relationship with someone who lived 15 hours away from me, and our primary mode of communication was (you guessed it!) social media. My grades suffered as a result, but I wasn't in the hole yet. Just before winter break, I thought of a plan to completely change myself, to rewire my brain. I bought a paper dictionary so I wouldn't have to unnecessarily use the internet. I resolved to spend more time in the library and to make use of the hundreds of thousands of books that I had (and that we all have!) at my disposal. And finally, I disappeared from social media.\n\nThis lasted two weeks.\n\nI couldn't take the loneliness I felt, and I knew I was spiraling out of control. Still reeling from the effects of my panic attack and subsequent anxiety, I was already in a delicate state, and felt that I had nothing to turn to. I was ill-prepared for my courses in calculus and physics (during the six-month period in which I wasn't on social media, I had also taught myself algebra 1 and 2. I had to go back to 7th grade math on Khan Academy because I hardly understood how fractions worked. If I had stayed off of social media, I would have been able to move on to trigonometry, which is absolutely essential if one wants to succeed in calculus and physics.) Then, because when it rains it pours, the pandemic hit. I lost all motivation to succeed in school, and spent an average of 8-10 hours a day on the internet and social media. I failed calculus 2 and was forced to withdraw from my other science classes, since I was going to fail them as well. The only classes that I did well in were my honors classes, both of which I received an A with distinction. Not that this made a difference. I have never been so depressed in my life.\n\nI spent my summer in this weird state of suspension. I have felt rudderless before, but never without a sail. I was just... existing. No feeling of deep desire for the present or future. For the first time in my life I felt as if I had no direction, since external things (military, high school, parents) had always provided that for me, and the one time I tried my hand at the helm, I utterly failed. I had changed majors to business, and I failed those classes as well. I simply did not care an ounce.\n\nThings started to look up once I changed majors again. What had drawn me to this school was their renown for teaching philosophy and theology, but I had chosen to study engineering instead, out of mindfulness for future job prospects. After all, they say that the difference between a pizza and a theologian is that a pizza can feed a family of four. At this point, I didn't care. I'm not sure how many of you are spiritual or religious, but I felt led to make this decision. Every time I had made a decision by this leading it ended up serving me well, so I chose not to question it. I love what I am studying now; it fills me with so much joy. And for the first time I am able to move forward without feeling like I have to know where I am going. To say that this is blissful is an understatement.\n\nYet, the problem of the internet and social media persists. Well, until a week and a half ago.\n\nJust in the last ten days, my attention span has increased considerably, and I am noticing things around me that would otherwise have gone unnoticed. I quantified this by doing the pomodoro technique. If you are unfamiliar with this, it goes as follows: set a timer for 25 minutes. During this time you will focus on whatever you need to, and once the timer goes off, take a 5 minute break. Repeat this three more times. At the end of this interval, take a 30 minute break. Work to increase your focus intervals. When I first started, I could hardly focus for 20 minutes at a time. Now I can focus for 35 minute intervals, and this week I am set to increase to 40 minutes.\n\nThis was a long way to set the stage for what I came here to ask, but it was helpful for me to recount the past couple of years in this frame. So if you made it this far, thank you.\n\nHere are my questions: How do I discover what I am good at? How do I figure out what my aptitudes are? Before, I never engaged with anything for any meaningful length of time, so I'm still unsure of where my strengths lie. I have faint ideas of what I desire and what I can possibly excel at, but nothing is concrete.\n\nAnd how do I learn to talk to girls? I'm 25 years old and I still struggle to form relationships with women, even platonic ones. I have had a couple of girlfriends, but I met them through dating apps, and one through a mutual friend, but she already knew who I was so I didn't really have to do any groundwork there. I suspect that not watching porn will help me out with this, but that will take a while, and it won't give me a sense of confidence that is necessary in forming romantic relationships.\n\nThank you to those who have read this whole story, and thank you in advance for your replies! I am fairly busy so it will take me some time to get you you guys, but I promise to get to you nonetheless.\n\nEdit: grammar.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jj9mq8/aptitude/", "title": "Aptitude", "social_network": "reddit", "user": "sailrjerry", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1603831859, "permalink": "/r/DecidingToBeBetter/comments/jj9mq8/aptitude/", "nsfw": false, "first_save": 1635435634.413135, "replies_charged": false}