{"id": "t5_2tand_t3_bfiw0p", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924", "b1a66ef4-3e71-4d03-875c-961dbcef2285"], "text": "I have been working the last year, to save. For what? I'm not sure. I do not make much money... I only make $15-20 dollars an hour depending on whether or not I hit overtime. I'm an addict in recovery. A heroin addict. My life has been full of trouble, and pain, and of course euphoria and blissfulness, but also ignorance and regret and loss & emptiness, and hiding from my worst fears. I've flailed around aimlessly for so many years, worshipping good times & laughs... highs and, believe it or not, I've even worshipped the lows... \n\n&#x200B;\n\nI want to get as far away from these city centers of poverty and predation as I possibly can. I want a home in a suburb. I want to never have to pass a package store on my way to work. I want green grass and white sidewalks without cracks. I want to relax by the TV or a fire in the fireplace, in a home I spent years fighting to afford. I want a car that excites me when I hit the gas, and reminds me that hard work and holding out pays off... Even if I have to drive that car into the dirt... I want to forever remember that it took countless months upon months to buy it. I want to look around my livingroom and see furniture that took me months to save for... YEARS all together... i want to run around switching on light fixtures that I paid for, so that the light will shoot me out of dimly lit cathartic depressions. I'm not talking about the most expensive furniture cash can buy... I'd settle for a cot in the bedroom, plastic chests, a comfy couch pointed at a TV on a particle board entertainment stand. Just give me someone the share it all with...\n\n&#x200B;\n\nand I want love. I want love. Friendship.. want someone just as dependent on me as I am of them. i'm so afraid of this loneliness. I'm so afraid of falling asleep without someone that cares about me, to call or reach out & touch... I'm so sick of feeling like i'm freefalling, unable to grab on to anything or anyone... with no one at the edge of the cliff to look up at.\n\n&#x200B;\n\nI just want order. I want out of this rockslide.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bfiw0p/i_want_to_get_as_far_away_from_evil_without/", "title": "I Want To Get As Far Away From Evil (without becoming my own slave-driver) As Is Humanly Possible", "social_network": "reddit", "user": "formerlydeaddd", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1555805365, "permalink": "/r/DecidingToBeBetter/comments/bfiw0p/i_want_to_get_as_far_away_from_evil_without/", "nsfw": false, "first_save": 1635435647.408466, "replies_charged": false}