{"id": "t5_2tand_t3_k3m2jm", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "A long read but it’s worth it I think . Skip to the bottom if you want the TDLR. Thanks for those that read it. Just had to put my story out to the Universe. Take care.\n\nWow this whole year has been quite a roller coaster. So much has happened around the world and within myself and all of you out there. The first half of this year was painful and I numbed myself from feeling life and the pain that needs to be felt to grow stronger.\n\nI had a completely different life growing up than most people I know. Both my parents are meth addicts and I was born in the midst of all that. I had a lot of traumatic events happen growing up and witnessed a lot of drug/inappropriate stuff a kid shouldn’t see. Both my parents taking me to get meth then leaving me in the car for a couple hours. Stuff like that.\n\nGrowing up I was mainly raised by my grandparents who I love so much. Both of my parents were using on and off my whole life. My dad went to prison for 5 years for a few burglary’s when I was around 8-9 and it really hurt not having a father figure around all the time. I did live with my mom mainly but she was married to a very abusive alcoholic who abused her and me. My stepdad back then was very abusive and he really hurt me physically a few times.\n\nMy main refuge during that time was going to my grandparents. I was dropped all the school bus there then mom would pick me up after work. My grandfather was truly my dad and he helped me so much during those times. I love him so much. Next month will be 9 years since he passed away and the pain never truly goes away but it goes get easier.\n\nAt 14 my grandfather passed away from cancer in December. It hurt so bad to slowly watch a person you love so deeply wither away in pain and slowly become a shell of who they once were. I miss him dearly still. He was my favorite person. My role model. \n\nSo at 14 I really started to get deep into the drug scene and selling/using drugs heavily. I first used drugs at 13 when my mom was passed out I got curious about the pills I always saw her take. I took my first Xanax and all of the bad feelings went away. I felt normal. It worked temporarily. After that it was a steep decent into hard drugs mainly opiates and benzos. I’ve done every drug you can name. I don’t recommend doing that. I’ll only advocate the use of psychedelics for personal growth.\n\nPsychedelics saved my life and showed me a new way of living and a whole new perspective on life. Many life changing moments that I am eternally grateful for. After one of those experiences around 18 I overdosed a month later on opiates/benzos and passed out on the floor with my left arm pinned under me. Was lying there for a long time.Thankfully my uncle found me in time. \n\nWhen I awoke my whole left arm was completely numb and I could not move it at all. At first I thought it would come back soon but days/weeks went by and I was really terrified of losing my arm. After that experience I quit everything cold turkey and dryed out for a few weeks. Still unable to move my arm.\n\nAfter a few weeks of that I decided to go help take care of my great grandfather who had a stroke and could not move well or take care of himself. And his wife, my sweet great grandmother passed away that same year in 2016. So I went down to his home in the country and was his caretaker for 3 months. Woke up every morning at 4:30 to make him coffee and get his medicine. He always ate 2 creams pies for breakfast. I was there taking care of him while learning to live without hard drugs while at the same time I only had one damn working arm.\n\nThat time was challenging as I was learning to live for the first time and I was helping my great grandfather transition to dying. Quite a paradox. Life’s funny like that. Often I would wake up to him crying out for his mother or wife in the middle of the night. I would have to go sit with him but it was like he was in some sort of purgatory state between life and death and I wasn’t even there. I hope no one has to hear a loved one slowly withering away and calling for their mother. It is so painful as there’s nothing you can really do or say.\n\nWas there for 3 months taking care of him and the house while staying sober for the most part. The responsibility of taking care of another living being really changes your priorities. I slowly regained feeling in my left arm and eventually it returned to normal before I left there. It is kind of symbolic I suppose. I went there with a physical impairment. Had a perfectly good arm right there but had no control over it. The same thing could be said for my life and way of living during that time. I had a perfectly good body and mind right there but I had absolutely *no* control over it. Gaining discipline through regular life duties and taking on the responsibility for my great grandfather and MYSELF allowed me to grow up.\n\nAfter my stay there and helping I went back home. I messed around occasionally  for a couple years but didn’t touch the hard stuff. Mainly psychedelics and stuff like that. Went to a couple music festivals from 2017-2018 and enjoyed them. In 2018 I went to my first Bonnaroo. That experience completely changed my life and set me on a new path. I met so many wonderful creative people and everyone was just so friendly and happy to be there.\n\nAt Bonnaroo in 2018 I met a wonderful girl that completely turned my life upside down. By “coincidence” she and her friends were camped right next to us.\nThat weekend opened my eyes in so many beautiful ways. The girls name was Rachael and she was a true artist. A painter. We had a incredible time together at Bonnaroo just talking about life and everything. Had the most magical intimate moments that I will never forget. \n\nAfter Bonnaroo ended she drove down from Ohio to Alabama to see me. I was just a 21 year old kid washing dishes at the local Chinese restaurant with no real goals or anything going for me. Here comes this wonderful woman who saw something in me. She said she saw something in me that I couldn’t see yet and helped me realize my potential to do great things for myself and the world.\n\nOur time together was beautiful and life changing. We burned bright then that magic went away soon after. Distance played a role but it was my fault that I didn’t try hard enough to change into who I am now. She tried to help me help myself with creating art and applying for college and all the things that would better my life. I took things for granted and then one day she just cut contact completely out of nowhere. I don’t blame her. I probably would have done the same but would at least give closure. Haven’t heard from her since. I wish her well.\n\nIronically it wasn’t until after she was gone from my life that I actually started doing the things she hoped for me. I picked up the electric guitar, went to college for a bit , got more into photography and video editing. She always said you can heal through your art so I just keep pushing and pushing. Another thing she said was it’s ok to let other people down just as long as you don’t let yourself down.\nI always remember that and her eyes. We spent a lot of time just laying down talking looking deep into each other’s soul. Laying down in my bed she told me she didn’t want me to get stuck here in this backwoods small town. Promised her I won’t. \n\nFast forward to 2020 and I have a real job with benefits and health insurance for the first time! Getting paid more than ever before! In January my mom relapsed on meth off and on for about 2 months. It was so heartbreaking to witness that. It reminded me of being a child and witnessing my parents and their friends doing hard drugs. She would stay up for days and start getting paranoid about someone hacking into her phone and saying a lot of nonsensical things. She lost a lot of weight and did not look good at all. I wake up at 4 to go to work and there she was wide awake most days. \n\nWatching a loved one relapse is incredibly painful. Especially if you you’re an addict yourself. And especially if you used to use drugs together it’s really hard not relapse yourself. I stayed strong externally during that time but was dying inside. Just a feeling of impending doom and having panic attacks at work and going to the bathroom to break down and cry for 5 minutes then “man up” and get back to work. I eventually started taking my prescription klonopin for the anxiety attacks and completely closed off emotionally. Just a feeling of metallic numbness. Nothing but a shell.\n\nWhen you grow up with these issues it can be so easy to fall in your parents footsteps. I did, for a while at least. You have to break the chain. I am breaking the chain right now. I am focusing on myself first and getting my life back. Dealing with the pain of my past hurts so deeply but it is required to grow. To heal. To be made whole again. I am facing it head on instead of running away or distracting myself with mind numbing bullshit. \n\nI met a very special women a few months ago that turned my life upside down once again. She changed my life completely forever. She relit that fire inside of me that was merely smoldering. She allowed me to feel again, to live and to love again. To love not just her but myself as well. She helped me remember that everything you need is truly within you at all times. All the love and external things you think you need are already within you. This is a beautiful story I recently came across. \n\n“A beggar had been sitting by the side of a road for over thirty years. One day a stranger walked by. “Spare some change?” mumbled the beggar, mechanically holding out his old baseball cap. “I have nothing to give you,” said the stranger. Then he asked: “What’s that you are sitting on?” “Nothing,” replied the beggar. “Just an old box. I have been sitting on it for as long as I can remember.” “Ever looked inside?” asked the stranger. “No,” said the beggar. “What’s the point? There’s nothing in there.” “Have a look inside,” insisted the stranger. The beggar managed to pry open the lid. With astonishment, disbelief, and elation, he saw that the box was filled with gold. I am that stranger who has nothing to give you and who is telling you to look inside. Not inside any box, as in the parable, but somewhere even closer: inside yourself.”\n\nI am so grateful for meeting this very special woman and grateful for our time together. Our time together burned bright as the sun and fast as a wave breaking on the shore. We both have inspired and helped each other in the most loving and healthy ways. We had some of the most beautiful experiences of our life together. I will never forget the way we looked at each other so gently and compassionately. I will never forget watching the sunset on the beach while just enjoying life in the present moment. The sound of her beautiful voice singing from her soul is one of my favorite memories. Expressing our gratitude for one another. Her taking me by the hand and jumping into the water and being so cold. Just holding each other, laughing and smiling. Both of us radiating so much love for one another. Simply living in the present moment.\n\nNow we are just friends and I’m incredibly thankful for that. I’ve never felt such a close connection to someone like this. I just want to truly cherish our connection in the right way. Neither of us are really ready for a serious relationship at this time. We both have a lot of inner work left to do. It’s incredibly harmful to jump from person to person instead of dealing with your issues and loving yourself first.\n\nWe are not spending as much time together now but that is ok. Gives both of us time to work on ourselves and grow.\nWe both are just going through growing pains. The whole world is. I have learned so much recently from Ram Dass especially. About letting go of all attachments to people or any external thing. Letting go of all expectations and desires. Just living in the present moment. As that’s all there ever is or will be.\n\nExtremely grateful to have met this wonderful being. She reawakened the ancient fire inside of me that is burning bright as the sun. I believe that I did the same for her.  She is going to do so many great things I can feel it. She has so much potential and it’s so beautiful to witness a being slowly realizing the potential they have to do anything they want. After some soul searching I have released all my attachments to her or the desire to be connected to the divine mother as Ram Dass says. Released all expectations of us being together in the future or even being in each other’s lives as friends. I’m grateful for any outcome. I’m so grateful for this lesson and experience the universe blessed us with. She helped me realize I already have everything I need within. Anything additional is just a wonderful blessing. Focusing on myself and creating music and art is where I’m at. Missing my grandfather so much. The whole Universe will feel me through these 6 strings.\n\nI’m getting serious another making music now more than ever. Making great progress with my guitar playing. So proud of myself.\nWatching great artists live inspired me but since meeting my wonderful friend I feel so compelled to tell my story through music. All of my pain and suffering. All of my love and joy.\nAll of me. Every ounce of my being.\nYou will hear exactly how I feel.\n\n\nEmbracing my pain.\nEmbracing my past.\nEmbracing my fears. \nEmbracing my grief.\nEmbracing life. \nEmbracing the world\nEmbracing myself.\nAll with unconditional love.\n\nEmbracing the whole universe with the deepest love and compassion for I am it.\nIt is me and you. We are just attached to the illusion that we are all separate. \nI am you and you are me.\nI am always with you.\nI am you. \nI AM.\n\n\n\nWhatever you seek is seeking you too ;)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k3m2jm/letting_go_of_it_all_starting_over_again_new/", "title": "Letting go of it all. Starting over again. New chapter called Growing Pains", "social_network": "reddit", "user": "Selectbk", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1606700164, "permalink": "/r/DecidingToBeBetter/comments/k3m2jm/letting_go_of_it_all_starting_over_again_new/", "nsfw": false, "first_save": 1635437020.2611532, "replies_charged": false}