{"id": "t5_2tand_t3_enur0a", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "She's been telling me for a while that I've changed, and recently that she doesnt love me the way she used to. She says she still cares deeply about me, but I'm not the man she fell in love with. We've even talked about divorce. \n\n\nToday, an hour ago, I finally shut the hell up and listened. Even more importantly, I stopped filtering her words before they got to my brain. No more, \"Stop attacking me!\" filter. No more, \"Nag, nag, nag\" filter. No more, \"You're right, I'm awful\" filter. Just listened to her words exact as she said them. \n\n\nEver since my dad died, I've completely lost control of myself. Before he died I was funny, confident, calm, in college, and losing weight. After he died, I was insecure, scared, lashing out, binging on junk food, isolating myself, and dropped out of college. She has tried to be with me and be there for me, but I've made no progress. I've not bettered myself, only gotten worse. Its to the point she's talking about divorce; She just can't take my self pity and unpredictability anymore.\n\n\nBut she's right. I've changed. But if I've changed once, I can change again; This time for the better. I'm at the laundromat right now, watching our clothes wash. And whether we stay together or separate, I will be better. I will be better for me, for her, for our daughter, and for my late father. \n\n\nI've unsubscribed to a lot of the self-deprecating subreddits, and subbed to some healthy eating, self care, grooming, and mental health subreddits. I'm going to buy some healthy things to have around the house to eat, and I'm going to be going to the gym (My goal right now is just to go the gym once a week and do at least one exercise. Starting small, and progressing week by week. My work has an on-site gym, so it's high time I take advantage of that.)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/enur0a/i_finally_actually_listened_to_my_wife/", "title": "I finally actually listened to my wife.", "social_network": "reddit", "user": "ceetsie", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3281, "down_vote": 0, "creation": 1578868563, "permalink": "/r/DecidingToBeBetter/comments/enur0a/i_finally_actually_listened_to_my_wife/", "nsfw": false, "first_save": 1635435184.5082586, "replies_charged": false}