{"id": "t5_2tand_t3_kewiem", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "I'm at this terrifying yet exciting point in my life where, after 31 years on this planet, I'm finally trying to put myself first.\n\nLong story short, my journey of recovery and self discovery has mostly spanned the past six or so years, after I hit my rock bottom with my mental health (stemming from an emotionally abusive childhood, with unhealthy thought patterns, low self worth, etc. that spilled into all other aspects of my life). I'm been making good progress ever since, but I think the shitshow that has been 2020 has given me the shake up that I've needed to take that next big step for myself - finally realising that I deserve better, and that I should prioritise my needs over others.\n\nThis means, in the past month:\n\n- Ending a relationship of 12 years that wasn't all that terrible and where there was still a lot of love, but where I found I was comprising way too much and not able to be truly happy or satisfied.\n\n- Realising that I need to leave my job of seven years, to find somewhere that actually values my work and allows me to grow.\n\n- Being even more strict with the boundaries I'm setting with my family, who I have minimal contact with by choice, but are still demanding things of me.\n\n- Shedding friendships where I feel my efforts aren't reciprocated.\n\nWhile I know it's ultimately a positive thing that I'm able to now come to these realisations and make these decisions for myself, it's hella unsettling to flip the table on so many aspects of my life, all at once. I'm someone who likes stability, and this feels so far from stable. But once a flick switched in my brain and I realised what I needed to do, it felt silly to continue settling on any of these things.\n\nHas anyone else been through something similar? Any tips of how to get comfortable with a this change? Any recommendations for little things that I can start doing for myself, to get more comfortable with being healthily selfish?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kewiem/how_do_i_get_comfortable_with_putting_myself_first/", "title": "How do I get comfortable with putting myself first?", "social_network": "reddit", "user": "okaaay_so_now_what", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1608207896, "permalink": "/r/DecidingToBeBetter/comments/kewiem/how_do_i_get_comfortable_with_putting_myself_first/", "nsfw": false, "first_save": 1635435961.739928, "replies_charged": false}