{"id": "t5_2tand_t3_phpmx3", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Hi! I’m a college student who, to be fair, doesn’t have much free time. I have full-time school, a part-time job (which at some parts of the year turns into full-time hours), I’m in a long-term relationship, and have other commitments to my family and friends and my own well being.\n\nAnother important fact is that I move at turtle speed: not literally, but everyone just does things way faster than I do. I’m not making it up, yesterday I had my entire family helping me move into my apartment and they were all carrying boxes left and right. Meanwhile, I couldn’t go at the same speed as any of them without going crazy. I also can’t talk and do other things at the same time, that’s how dumb my brain is, I’m just not able to multitask at all.\n\nI’m really tired of the way my brain works because it’s holding me back in life. Every day, I’m telling people that I’ll do a task, and saying yea when someone asks me to do something, only to either do it too late, or forget to do it at all. I kid you not, this happens every single day. I try writing things down but I can never seem to remember to write down everything, like what if I don’t have something to write with in my hand? Let’s say I write it on a sticky note, how will I remember to write it on my master list? I also agree to plans that I totally think are doable, but then the time comes and I’m running out of time! Hence I’m late to do anything. I tried that trick where you give yourself ample amount of time to get things done, but that’s not feasible with a pretty heavy school and work schedule.\n\nDoes anyone have any better advice for someone who’s very forgetful and slow like me to make sure I’m not letting others in my life down?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/phpmx3/i_dont_do_what_i_say_i_was_gonna_do_help/", "title": "I don’t do what I say I was gonna do. Help?", "social_network": "reddit", "user": "testingpage2025", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1630753937, "permalink": "/r/DecidingToBeBetter/comments/phpmx3/i_dont_do_what_i_say_i_was_gonna_do_help/", "nsfw": false, "first_save": 1635438430.9215224, "replies_charged": false}