{"id": "t5_2tand_t3_oacwir", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "I'm re-reading Cal Newport's book Digital Minimalism at the moment. I didn't love it the first time through about a year or so ago as I just wasn't in the right headspace for it. I thought it was too extreme, too limiting, and I didn't buy into it enough to stick to a 30 day detox. \n\nBut as I re-read it now, some new thoughts have come to light and I was wondering what the Reddit folks thought about all of this. Just so happens r/DecidingToBeBetter is the place I thought that fit the best. \n\nI'm in my early 40's. Most of my friends (with the exception of one or two) spend a lot of time on their phones. They often share Reddit posts with group chats and in our friend group, but not useful posts containing news articles or cool photos. It's just the mundane drivel of day to day Reddit. These guys seem to thrive on it and spend a lot of time there. To each their own, but I wonder why they don't ever \"look up\" and decide to make changes? They often complain they need to lose weight or \"make changes\", but if I tell them I'm trying to go minimal on my phone usage or try some new things in my life, they laugh at me like \"oh, yeah, you'll be back in a week\" and they blow it off.\n\nEven taking a week off all social media earlier in the month, it makes me realize not only how much time I waste online, but how much time my friends waste too. Not that I concern myself with their business, but when they share a bunch of this stuff with me constantly it becomes my issue. \n\nI also host a business account on Instagram where I post maybe once a month. Instagram isn't normally on my phone but occasionally I'll install it when I want to post something or see what a friend has been up to. \n\nWhat's with all the mom's and girls constantly seeking attention now? \"Reels\" I believe they're called. It's a constant stream of people dancing or doing little skits for the camera -- are we all so attention deprived? \n\nI'm struggling to find a balance between 2 apps on my phone and being able to keep in touch and up to date with what's online. The more I wade through things though, the more it becomes apparent that Cal Newport was and is onto something with his book. \n\nFor the past week or so I've tried to be mindful of my phone use and it's helped immensely. Why am I clicking on this? Why am I reading this? What's the point? What's in it for me? What's in it for the author?\n\nLately when I sign on to the web, it feels like there are millions of people yelling and waving their arms at me, begging for attention and someone to notice them. It's become a real issue I think, and it's too bad more people aren't cognizant of it. And hey - I'm no exception. But I feel like being aware of all this is the first step.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oacwir/limiting_social_media_my_observations/", "title": "Limiting Social Media -- My Observations", "social_network": "reddit", "user": "Altrosmo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1624987423, "permalink": "/r/DecidingToBeBetter/comments/oacwir/limiting_social_media_my_observations/", "nsfw": false, "first_save": 1635435293.45999, "replies_charged": false}