{"id": "t5_2tand_t3_cbc0kd", "request": ["b1a66ef4-3e71-4d03-875c-961dbcef2285"], "text": "Rant ahead with different issues that might have the same root. Throwaway for obvious reasons. \n\n• I'm an asshole, and pretty aware of it. Not long ago, I would wear that as a badge of honor, I thought (and sometimes still do) it's cool, look down on more sensitive/emotional people, etc. The whole pack.\n• I'm outwardly really cold and inexpressive, this has caused a lot of trouble. \n• I try to make nice things, but I just don't feel it. I'll go to this place to help poor kids, and all the time think about why tf did I wake up early on a Saturday. I don't feel satisfaction doing the right thing. I'll try to write about how grateful I am for having nice things, but I'm not, even though I know I should be. \n• One of the main reasons I try to be nicer is to clear my image, tbh. I think that if I were part of a TV show I'd be that one pathetic and despicable side character that everyone would love to punch in the face. \n• I'm arrogant as hell, thinking I'm above the rules is another source of conflicts. Sometimes I say something and realize how condescending it is when I hear my own words. \n• I tend to manipulate the narrative in my mind so I don't feel bad about the shit I do. As I'm writing this a side of me is telling me that I'm actually a pretty good person and secretly hoping the comment section validates me.  I have to constantly remind myself that if I were I wouldn't have such shitty interpersonal relationships. \n• I feel like a victim, but at the same time proud because I don't externalize my pain. Like \"that time my mom wss mean to me 5 years ago truly traumatized me\" but at the same time \"lmao look at them crying for stupid things not like me, with my real problems and real suffering which I fight like a champ (I don't)\"\n• I looove talking about myself, and rarely care about what others have to say or straight don't know how to not talk about me. I don't just say \"i did nothing last weekend lol wbu\" but \"it was the most unproductive weekend of my life (bc I am such a productive and hardworking person yknow?) I only walked my dog and went to the gym once blahblahblah\" \n• I can't really be hard on myself, I just feel entitled to nice things constantly even if I do nothing to earn them. \n• I have this random outbursts of total euphoria and sucking my own dick and then be completely depressed the next days for some dumb trigger or nothing at all. Like \"holy shit I'm Jesus Christ\" to \"I should seriously kill myself\" in less than 12 hours. \n• I have no patience, there's this girl who's really dumb and socially retarded, but also incredibly nice. She doesn't do much harm besided being clueless about unwritten social rules but the mere fact she's weird (Not like me, I'm not a weirdo, I'm a troubled misfit) makes me deeply hate her. \n\n\nSo, I'd love if you could give me some insight and advice on how to fix myself. Thanks for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cbc0kd/how_do_i_become_a_decent_human_being/", "title": "How do I become a decent human being?", "social_network": "reddit", "user": "outtahereassap", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1562733081, "permalink": "/r/DecidingToBeBetter/comments/cbc0kd/how_do_i_become_a_decent_human_being/", "nsfw": false, "first_save": 1635436383.9661918, "replies_charged": false}