{"id": "t5_2tand_t3_k2maep", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I grew up in a big family, so I always had people around me. When I moved out, I insisted on having my own apartment, because I wanted to be independent and I wanted to have my own bathroom for once. \n\nI live in the same apartment for four years, I realized like a year ago that I would feel lonely often, often even purposefully isolating myself during depressive episodes and slowly becoming a little bit awkward. I‘ve made a few soft attempts to move last year, like asking friends if they want to become roommates, but no one was seeking a new apartment/ roommate. \n\nNow recently my boyfriend broke up with me, and I couldn’t work for weeks because I hurt myself at work. Also my work requires me to go to another city 10 weeks spread over a year and while being there I have to stay in a catholic boarding school (which is apparently also some kind of hostel) for hard to educate young women. My room there looks like a prison cell (I’m not exaggerating), the windows are barred and I have to be in bed by 10 pm. Obviously the isolating is way worse there, and I always come home depressed (usually needing 4-5 weeks to recover). During the last seven weeks I had 4 weeks in this hostel and three weeks not working staying alone at home, so the depression is kinda bad this time. \n\nBUT somehow finally something in me had enough and I stopped waiting for my friends to be ready and started looking for roommates. I visited two apartments yesterday and although I know it’s not going to be easy to live with 4 other persons in an apartment after 4 years of living alone I know this is the right thing to do", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k2maep/im_finally_moving/", "title": "I‘m finally moving", "social_network": "reddit", "user": "LinaJG", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1606563612, "permalink": "/r/DecidingToBeBetter/comments/k2maep/im_finally_moving/", "nsfw": false, "first_save": 1635438262.6103117, "replies_charged": false}