{"id": "t5_2tand_t3_ow41nr", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "Important bit is at the last paragraph. \n\nShort background of my life: I'm currently a college student in pre-medicine. It's the typical story of parent forcing child to become a doctor, I guess. I gave up on all my aspirations as a child because my parents said they were unrealistic and wasn't for me. So by the time I had to apply for college, I had 0 motivation whatsoever and I just chose a pre-med course like my parents wanted. \n\nFast-forward to the present, I'm about to enter 2nd year. I want to drop out. It's very stressful, I don't know why I'm here, I can't bear to face what the future has in mind for me. How am I supposed to go through med school and pass the licensure exams and all that jazz?\n\nExcept there's a *HUGE* penalty if I would drop out of the course. Of course, my hands signed the contract so I have no way out.\n\nSo I need to finish what I've started, becauss even if my parents may have \"nudged\" me, I'm still the one who made the choice in the end, right? Fake it 'til I make it. Else I don't know how to cope with the responsibility of making the wrongest choice of my life, since I can't take any of it back. \n\nI would really like to be more open-minded about my course. I want to genuinely try to be happy with what I have instead of grumbling and complaining about how 'I didn't choose this' or 'this isn't for me'. How can I motivate myself that this is the right path for me? \nAny advice or life story is appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ow41nr/how_can_i_be_openminded_about_premed/", "title": "How can I be open-minded about pre-med?", "social_network": "reddit", "user": "i_made_through_today", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1627864918, "permalink": "/r/DecidingToBeBetter/comments/ow41nr/how_can_i_be_openminded_about_premed/", "nsfw": false, "first_save": 1635436454.744254, "replies_charged": false}