{"id": "t5_2tand_t3_nmw335", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Ironically, my whole life has been one of wanting to be better, but I feel I've only figured it out in the past few months. When I was a kid I modelled myself on the heroes in the books I read and the movies I saw, because that was what I thought it meant to be \"good\". I wanted to be Harry Potter, or Aragorn, or Luke Skywalker. I desperately searched for characters I could model myself on. That's how you become good, right? That's what those stories are supposed to do. Teach what it means to be good.\n\nBut there's a problem. Heroism in our society is sometimes presented as a kind of ruthless self-sacrifice. A willingness to abandon the self for the other. And that's not necessarily bad in and of itself, but the truth is you have to choose that freely. I felt like I was conditioned into it - I hated who I was, and so determined that I had to purge myself of anything \"wrong\" with me. But of course, I was a kid, so \"wrong\" became \"abnormal,\" and I felt that the only way to be good was to fit in.\n\nThere's a lot of trauma I'm unpacking now - trauma from my childhood, being the golden child, starting to realize what I wanted from life, and then being ignored when I failed to live up to my parents' standards, the standards of the society around me. Becoming hopeless when I realized that being perfect, being good, being a saint was impossible.\n\nBut the key is that you don't have to be a saint to be good. A coworker recently told me that \"Individual heroism can't fix systemic issues.\" Sure, if everyone banded together to save the day, it could happen, but on an individual level, we aren't responsible for fixing the whole world.\n\nAs long as you attempt to empathize with others, you have goodness. But the attempt must be genuine, and if others don't reciprocate, or if their views are inherently unempathetic then you are not obligated to make or maintain a connection. Doing good, for the time being, can mean making small personal choices, or making human connections wherever possible.\n\nI'm an optimist, but I'm also a realist. The big problems matter. They matter a lot. But I no longer believe they are any one person's responsibility. We can only tend our little gardens, help a few others do the same with theirs, and if we can convince enough people to try to do the same, then maybe the forest will bloom again more vibrantly than before.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nmw335/ive_spent_my_life_living_in_should_when_my_truth/", "title": "I've spent my life living in \"should\" when my truth was inside me the whole time", "social_network": "reddit", "user": "DisquietRaven", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1622202466, "permalink": "/r/DecidingToBeBetter/comments/nmw335/ive_spent_my_life_living_in_should_when_my_truth/", "nsfw": false, "first_save": 1635437591.684786, "replies_charged": false}