{"id": "t5_2tand_t3_oqwcnw", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Hope this is the correct place to post stuff like this and that the format is suitable. To get right to the point, I have been struggling with heavy feelings of simply being inadequate and not intelligent enough. I have been journalling my thoughts, but I also wanted to vent about it here and get some different perspectives from other humans if I am lucky enough to get replies.   \n\n\nI am a male, I am 22 years old, and I go to university in Denmark, and I study english. (Both english and danish are my mother tongue due to parents). For all of my life I have struggled with math, science and other logical and technical subjects. I have always taken a longer time learning information in these subjects than my peers, and now that I go to university I struggle with topics such as english syntax. Syntax focuses on different intricate ways of analysing sentences, and even though I passed my last syntax exam, I still feel inadequate and ashamed that I didn't have the mental capacity to embrace the topic as well as my peers could. I know it sounds silly to worry about a subject that I was able to pass, but what actually triggers my anxious feelings is the idea that I am 'not normal' or less intelligent than other people around me. \n\nIt took me lots of work to barely master the basics of the logical topics at uni, and sometimes the feelings of being worthless and unintelligent just hit me like a freight train, and it leaves me feeling like I want to disappear. Not that I don't want to live, it's more about the anxious feelings leaving me incapable of enjoying life and relaxing. \n\nThe shitty feelings of inadequacy have been over me like a horrible cloud for the past two weeks. I often get these negative thought-spirals of sorts where my mind brings up difficult past experiences from school or other random situations where I have felt worthless, slow, dumb or like a failure. Sometimes the anxious thoughts turn into physical symptoms and I completely lose my appetite for a day, and have a hard time keeping food down. \n\nI am hoping to start feeling better, and stopping with feeling ashamed of being behind other people in some topics. I want to dare to live life and to get rid of this sickening feeling of being slow, bad, dumb or otherwise inadequate. I'm a well functioning person and I'm priviledged and lucky to have the life I have, but I just wanted to get this off my heart, so thank you whoever has read this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oqwcnw/fear_of_being_inadequate_and_worthless/", "title": "Fear of being inadequate and worthless", "social_network": "reddit", "user": "Buddhistbassist1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1627154337, "permalink": "/r/DecidingToBeBetter/comments/oqwcnw/fear_of_being_inadequate_and_worthless/", "nsfw": false, "first_save": 1635438050.145906, "replies_charged": false}