{"id": "t5_2tand_t3_q8fyxx", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "c67213dc-0eed-4cac-a781-9bc082742908", "883794f3-030f-4844-8950-6e28281dfa3f", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I'm a 48f with two beautiful teenage girls, ages 13 and 16. I love them more than anything in the world, but I unknowingly have been a terrible role model to them. Ever since I was in high school and was in an abusive relationship, I've suffered from very low self esteem. I'm always critical of myself... I'm unorganized, I'm overweight, my hair is grey, and the worst are my teeth. A few years ago I began losing them from a combination of a disease I suffer from and the meds used to help mitigate the symptoms of the disease. I feel ugly and worthless. I'm embarrassed, always putting my hand over my mouth if I'm in public (which is rare). I NEVER let anyone photograph me. \n\nYesterday we were getting ready to go to the grocery store when my 16 year old said that she wasn't going. She said she is ugly, nothing looks good on her, she doesn't know how to put on makeup well, and she went on and on. I was stunned. She is beautiful, creative, talented, smart, and has the kindest heart of anyone I've ever met! I told her how amazing she is and asked her why she would say anything like that about herself. Her response was a gut punch. She said, \"Mama, you always talk bad about yourself!\" I've taught my kids to think the worst of themselves, and I'm gutted.\n\nI sat both of them down and had a heart to heart about self love. However, I know that I need to lead by example and love myself. It's not going to be easy, but I have the strongest motivation...my two girls❤❤", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q8fyxx/starting_today_im_going_to_love_myself/", "title": "Starting today, I'm going to love myself.", "social_network": "reddit", "user": "gramgram73", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 135, "down_vote": 0, "creation": 1634269661, "permalink": "/r/DecidingToBeBetter/comments/q8fyxx/starting_today_im_going_to_love_myself/", "nsfw": false, "first_save": 1635435340.110741, "replies_charged": false}