{"id": "t5_2tand_t3_i9ooz7", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I am a year and a half sober now. I'll start by saying, that despite any other hiccups in my life, things are INFINITELY better than they were 2 years ago when I was totally alone, strung out on dope & crack for days on end. I must make sure I am always grateful for that.\n\n&#x200B;\n\nThat being said, when I was first getting sober, which I did through a 12-step program coupled with a Buddhist meditation practice, I was much more gung-ho about the changes I was making. I was going to 1-2 meetings a day, going to the gym every day, working two jobs, working with a couple sponsees myself, doing lots of reading and journaling, etc.\n\nNow in recent months, a lot of that has slowly fallen by the wayside. Of course, I recognize that COVID-19 played some part in this. It has affected all of our lives. But I also can see my part in this, and my using it as an excuse. I don't go to the gym because I don't feel safe there. However, I have started riding my bike every day. I'm currently furloughed from my place of work and for a while, all I did was play video games, play guitar, and ride my bike. It was awesome for a while but it suddenly hit me last week that I have become complacent and not making quite the forward progress that I want to be making.\n\nI guess I just want to share with some strangers about where I am at and also open myself up to some advice as well. I'm trying to implement some more structure and routine into my life again.  That's probably the biggest struggle for me, holding myself accountable and setting daily goals.\n\nToday, I woke up early like I used to. I made coffee, I watered my plants, I meditated, I reached out to some friends, I called my sponsor, I went for a bike ride and picked a couple things up, I did some research on starting a small business (because I make my own hot sauce and want to try and sell it). All of these things were things I had been dragging my feet about. I had fooled myself into thinking I was happy and content with where I am, which I am, but the reality was I had also become stagnant and let my inner addict behaviors take over. I was becoming anxious and insecure and resentful again.\n\nAlan Watts said to stop measuring days by degree of productivity and start experiencing them by degree of presence. That's one of my favorite personal mantras as the present moment is all we ever have, and it does no good to beat ourselves up for not being productive ALL the time. I would rather be totally present and mindful in my non-doing than to be elsewhere mentally while checking things off a list that are supposed to make me better. It is about balance for me. Mindfulness and meditation is not a supplement for other paths to self-improvement. It is merely another tool in the toolbox and I was using it as a guise for what had really become depression for me. I started talking to a girl recently and she is amazing, the first girl I have considering dating since I got sober. And I want to be the best version of myself for her as well as for me.\n\nSo I ask any of you who are in a similar boat to please forgive yourself and take a moment right now to feel your breath and make small steps to doing what you want to do. Love yourself. And I, like anyone else, always want to be open to new ways to be better. I want to find some ways to help others and be of service, even if it is as simple as lending an ear to another addict/alcoholic. I want to write the best music I can and keep working on my creative craft. I want be kind to everyone I meet, starting with myself.\n\n&#x200B;\n\nI guess I'll stop rambling. I just needed to get some of this out there. I wish all of you to live your best life.\n\n&#x200B;\n\nEDIT: I just wanna give a collective thank you to everyone who has wished me well in this thread. I am always available to talk for anyone struggling with something similar, or not! Just anyone who needs an ear to bend.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i9ooz7/i_am_a_recovering_heroin_addict_and_i_have/", "title": "I am a recovering heroin addict and I have recently become complacent in way of life.", "social_network": "reddit", "user": "DopeyDeathMetal", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 156, "down_vote": 0, "creation": 1597421079, "permalink": "/r/DecidingToBeBetter/comments/i9ooz7/i_am_a_recovering_heroin_addict_and_i_have/", "nsfw": false, "first_save": 1635436014.409042, "replies_charged": false}