{"id": "t5_2tand_t3_qgl2gc", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "c67213dc-0eed-4cac-a781-9bc082742908", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Early in the pandemic, about two weeks into the first shut-down, i was loading a bowl to smoke to wind down from the day.  I’d also poured a whiskey, cracked open a beer, unwrapped a new pack of cigarettes.  It occurred to me then, after two weeks of being temporarily unemployed:   what was there to really wind down from?  \n\nI was ingesting all this garbage out of habit in a conditioned effort to “relax”.  I’ve been a bartender for the past 8 years.  Before the pandemic, i worked a pretty erratic schedule- some nights up until 6am to close the bar, others up at 10am to open it.  A couple shots of whiskey helped me fall asleep.  A couple bowls helped me to not drink too much whiskey.   The beer helped me chase the whiskey down.  The cigarettes, well, I’d just been addicted to the cigarettes since i was 16.  \n\nThe next day, i was brewing my third cup of coffee for the day, and again, something occurred to me:   what is there to be alert to?  \n\nThat night i decided to forgo the weed. Haven’t smoked weed since. The next day i stuck to just the single morning cup of coffee.  \n\nBy late April, bars were open again, for “to-go” drinks only.  Work was scarce, tips were almost nonexistent.  We were shut down again in early July.  When we opened again in September, part of my job had then included enforcing masks on inebriated customers, requiring 6-feet of distance between tables and bar seats.  Any “fun” or enjoyment I’d experienced at work had entirely disappeared, and before October, i began having panic attacks in the keg room at work.  At first, to combat the anxiety, i chose to not have my pre-work coffee.  It worked, and so i decided to try giving up coffee altogether, which wasn’t easy.  I started drinking coffee when i was 15, and when i was younger I’d regularly have a half a pot of coffee at work. A full pot on doubles. \n\nI was still having issues at work, so i asked my manager not to schedule me on nights anymore.  The money wasn’t nearly as good, but it was enough to survive until this whole pandemic thing ended.  \n\nLast New Year’s Eve I made a resolution to quit smoking.  I switched to a vape but continued having a single cigarette at night with my whiskey.  In early February i was playing a video game and it was a very cold night.  So cold i decided it wasn’t worth the cigarette, so i skipped it. And i haven’t had a cigarette since. \n\nLast month, on September 25th, I made my biggest effort yet to be better.  I decided to quit drinking.  \n\nDrinking has admittedly been my biggest problem for the last 12 years.  It’s a problem I allowed to drive me down on a nightly basis. \n \n\nI refrained from caffeine for 3 full months. I greatly enjoyed its absence, though now that I’ve gained control of it, I now have just one cup of green tea in the mornings on days off and one cup of half-caff coffee on work days.  I’m not proud that I still use a vape, but despite what the anti-vape community says, my breathing and energy have improved immensely.  Yesterday marked my first 30 days sober, and i haven’t felt this good, mentally and physically, in my entire adult life.  In the weeks of initial sobriety, it’s often been depressing, annoying and exhausting continuing to bartend for a living.  I see in every customer the troubles i once lived.  And so I’m making efforts to make yet another decision to be better:   I’m beginning to search for employment outside of the bar industry.  This will strangely be the hardest change I’ve made, as it’s the only job I’ve ever known.  But i really look forward to a calmer, more balanced life to settle into.  \n\nAs rough an experience as the pandemic has been, I’m finding myself coming out of it a better, stronger, healthier and more responsible person.\n\nThanks for reading. I hope the best for all of you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgl2gc/currently_working_on_my_final_goal_toward_getting/", "title": "Currently working on my final goal toward getting better.", "social_network": "reddit", "user": "likeguitarsolo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 56, "down_vote": 0, "creation": 1635297139, "permalink": "/r/DecidingToBeBetter/comments/qgl2gc/currently_working_on_my_final_goal_toward_getting/", "nsfw": false, "first_save": 1635435218.7439644, "replies_charged": false}