{"id": "t5_2tand_t3_izkq9g", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "This is going to be a long one. I'm formatting this on mobile, so please excuse any weird formatting things. \n\nUp until recently, my mental health has always taken a back seat. \"Depression isn't real.\" \"You don't have anxiety, you just worry a lot.\" \"Things will get better once ___ happens.\" \"You don't need friends. People are disposable.\" Those we're all things I would tell myself. For, from what I can tell, nearly eight years, I've struggled with depression and anxiety. I've been able to mask it or bury it behind other stuff. Some good, some not so good. \n\nRecently (thanks Covid), everything came crashing down. I went through a breakup and finally opened my eyes. \"You are depressed. You do have anxiety. You need help.\" That was a terrifying moment. I found myself, door closed, crying in my office. I realized that the relationship was only a happy little distraction from the deep-rooted mental issues that had plagued me.\n\nSo, I begun the process of getting better. I started calling therapists. I called at least half a dozen before I finally found one who both returned my call and had availability. \n\nSide note - I am appalled by the hoops one has to jump through just to reach a therapist. I am extremely fortunate that I was still thinking rationally and was able to go through the motions. For someone in more of a crisis situation, I cannot imagine the difficulties that would cause. \n\nAnyways, I found a therapist and began the therapy process. My therapist has been excellent thus far. He is very good at going just a layer or two deeper than what I say and getting to the root of things and is able to put words to a lot of the things I cannot. It is helping. I recommend anyone who is struggling with any kind of mental struggles to please, please find a therapist or psychologist. Don't keep it bottled up inside. \n\nSince then, I have found myself able to be more open with myself about the things that are affecting me. As my therapist described it, the depression and anxiety are like little monsters that sit on our knees. They start small but we start feeding them. The more we feed them, the bigger they get until we're carrying them on our back. Well, I've been feeding my monsters for a very, very long time. \n\nHowever, even with the therapy, I find myself struggling. I find myself with intrusive thoughts that pull me down. My therapist says that it's good that I'm still able to function (and it is), but I want to be able to function at a level of true happiness. I want to find internal happiness. I want everything external to be an addition to that internal happiness. I want to be able to lose everything and still be happy. That's a scary thought. \n\nFor years, I have struggled with derealization. I feel as though every moment of every day is not real. As though I'm watching myself go through the motions. It's a very difficult thing to describe and even more difficult to fix. It's awful. \n\nBut, through all this, I've begun to exercise. I've tried yoga. I'm trying. I'm trying my best to keep pushing through and past everything. \n\nI guess I'm writing this because I'm struggling. And I'm just looking for advice, experiences, or just to talk about some of this stuff. It's very difficult. Sometimes I feel like I don't understand any of it. \n\nMoreover, if I can be of any assistance to anyone, I'm happy to try to help as well.\n\nThanks so much for taking the time to read this. Feel free to respond to this post or send me a message. I'll respond to either.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/izkq9g/finally_working_on_myself_struggling_with_what_i/", "title": "Finally working on myself, struggling with what I know is right and what I feel.", "social_network": "reddit", "user": "OnlyAThrowaway_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1601045130, "permalink": "/r/DecidingToBeBetter/comments/izkq9g/finally_working_on_myself_struggling_with_what_i/", "nsfw": false, "first_save": 1635436634.3856869, "replies_charged": false}