{"id": "t5_2tand_t3_o6rlmm", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Hi all. This post is to share the three-step process to stop overusing social media. I’m using social media as the example here, since it’s what I myself applied these steps to, but whichever excessive/over-ing activity you do (whether that’s watching porn, eating, drinking, etc.), these steps can be applied to that as well.\n\n1) Plan at least 24 hours in advance:\n\nThis is really important as we want to make sure we’re using our prefrontal cortex, our higher brain, to decide our social media use in advance. Our primal brain is wired to seek pleasure and avoid pain in the moment — it doesn’t see the long-term, net negative effects of the over-ing activity we’re engaging in. So, we want to make sure our prefrontal cortex is the one in control.\n\nI personally like to take 5-10mins every Sunday to plan for the upcoming week. Write your plan down, and be as detailed as possible. For example: “On Monday, I will spend 20mins on Instagram from 5:00-5:20pm, and 20mins on Youtube from 5:20-5:40pm.” Place it somewhere you’ll see it as you’re going about your day (your bedroom wall, for example). I’d suggest starting off with a plan that is realistic and achievable for you.\n\nTip: I prefer having most of my social media notifications muted, so I only see them at the time I’ve planned in advance to check that app.\n\n2) Follow the plan & Allow urges:\n\nYou’ll have the urge/desire to use social media outside of the times you’ve laid out in your plan. This is not a problem — it’s totally okay. Our urge to check social media may seem so intense and like it’s something that’s happening TO us, but it’s actually just something we programmed our brain with. Whenever we feel an urge to check social media and give in to what the urge wants us to do, our brain is rewarded with an intense dopamine hit, which only trains our brain to want it more.\n\nAllow yourself to fully feel these urges, without acting on them. Don’t try to resist them, or willpower your way through them. Ask yourself these questions in the moment to help yourself truly allow feeling an urge: Where in my body am I feeling this? Is it heavy/light? Is it moving — fast/slow? Does it have a color to it? Pretend there’s an alien next to you who has no idea what it means to feel an urge to check social media — How would you describe it to them? I personally describe it as a pull I feel in my chest towards my phone.\n\nWill it be uncomfortable to allow feeling an urge without reacting to it? Yes. Is it the worst thing in the world? Definitely not. The more you allow yourself to feel an urge without reacting to it, the faster you retrain your brain. The more you practice this skill, the less intense the urges will become. No website/social media app blocker (trust me, I tried those) will help long-term, if you don’t practice feeling urges without reacting to them. And when you learn this skill, you’ll actually have no need for those.\n\n3) Interpret mistakes from your future-self: \n\nAs you’re implementing and practicing this process, there’ll be times when you don’t follow the plan, by giving in and reacting to urges. You may have thoughts after, like: “I can’t do this”, “I’m never going to figure this out”, “I’ll always be stuck spending too much time on this”, etc. Instead of interpreting the situation from your present-self, ask yourself what your future-self, who’s already where you want to be, thinks about this moment. Do they even really care about your first failed plan? They’re probably thinking: “Me making that mistake was just part of my process to getting here”. Now that I’m actually where I envisioned my future-self to be when I was struggling with overusing social media, that’s 100% my thought about the mistakes I made along the way.\n\nThere you have it — there’s more that can be said about each step, but I tried to put it as concisely as possible. This process is truly THE solution from my experience. If you have any questions, feel free to comment and ask. :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o6rlmm/how_to_finally_stop_overusing_social_media/", "title": "How to (Finally!) Stop Overusing Social Media", "social_network": "reddit", "user": "kirticoaching", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1624501468, "permalink": "/r/DecidingToBeBetter/comments/o6rlmm/how_to_finally_stop_overusing_social_media/", "nsfw": false, "first_save": 1635437748.4576519, "replies_charged": false}