{"id": "t5_2tand_t3_jy3ids", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "when I get nervous my mind starts racing, and fuck am I nervous. \n\nQuestion: how do you say I'm sorry to the person who ruined your well-being for two years and get them to take you back because you're scared and alone?\n\nAnswer: you fucking don't .\n\n&#x200B;\n\nThe story is becoming too long to retell simply, but my life is a random disaster. I wish I had anyone to love me but I don't even love myself . I've been trying to sail my little boat out of unfriendly waters alone for so long that I've kind of missed enjoying life. and all I've found out is that no matter where I sail this boat, the storm will follow. \n\nthe older I get the bigger the world gets and the more I'm supposed to have figured out. I have no compass I am so lost. I would feel better if I could rely on my own intuition and not have to be so trapped day after day for a degree that I don't feel qualified for in a field I feel I may or may not be accepted in. This is not me.\n\nAll I want is the security blanket of escapism, because I'm so desperately unhappy and alone. \n\nI had more figured out before, but I lost it. I have bad luck with letting in people who hurt me and now I'm broken and that person is long gone. And i'm trapped like a chump while they go off and have a fuckfest ....\n\ni have no friends, i have no family except for my mentally unstable mother. \n\nGetting with my ex was the single biggest mistake i've made in my life because it fucked up my sanity and it ruined my independence. I thought we would help each other . I was a better person with better intentions and motives going into it. That sick fuck to this day I have no idea what he was thinking when he decided to ruin his own life to pursue me. In retrospect my own sanity worked against me, thinking this person really loved me because they were willing to sacrifice so much.\n\nTurns out all he sacrificed was shit and what he brought into my life was chaos and more shit. and lies and hurtful behavior. Drug usage and setbacks. Destruction of friendships, mine and his, emotional damage out the fuckin yin yang.....so much wasted time. All to just lie to me and cheat on me.\n\nIt really opened up a can of worms in my subconscious and stirred up all of my issues that I'd worked so diligently to overcome in my early adulthood with my father leaving me as a small child and my neglectful mother. Psychological damage can never be undone but it can be removed from your life and coped with, which is what I'd done. \n\nHe did his best to completely drive me insane. It started with him not respecting me and that getting under my skin. Turns out I should have just let it go because I paid for being so annoyed by that. I was so lonely and insecure even then, that I easily allowed myself to be manipulated . This guy would cry with me late at night and act like a friend. He never was. He saw what I lacked and tried to give it to me short term so that he could get what he wanted. \n\nand I fell for it like a naive stupid pathetic fuck and i still can't move the fuck past it because all I have is fucking NOTHING in my own life and he lied to me so badly that he had my back and cared about me that I ignored the signs. He always knew what to say to get me to ignore the signs. First of all I never thought someone would care enough about me to do anything like that and second of all he went to extremes of messing up his own life to do it. it made no sense, \n\n&#x200B;\n\nmy friends thought he was a clown but I took him seriously. what does that say about me... pathetic, naive... stupid... abuse lover .... creep... \n\n&#x200B;\n\nI thought that I found someone who would stay and that really just fucked with my head in the end because some part of me deep inside holds onto people I allow in really tightly. He manipulated my fears. How much will I have to lose to men and \"adjust\" about myself to avoid being exploited? I feel as if I adjust any more that there will be nothing left... I just wanted things to be ok and for it to work out. Like the stupidest naive idiot that ever lived. \n\nNothing will work out for me \n\nI'm convinced I will end up on the street, alone, hated, dismissed.\n\nNo one in my life loves me anymore, they're all dead and gone or toxic and I'm out of love to give after getting hurt so badly. I find myself unsure of what exactly there is to live for anymore since my natural predilection towards loving the opposite sex and enjoying the chase has been traumatized. I'm a ghost now . just a lonely ghost.\n\nI don't know how to be better, everyone in my life is mediocre or else I'm the mediocre one in someone else's life. Everything good has left me", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jy3ids/alone/", "title": "alone", "social_network": "reddit", "user": "i_hate_tarantulas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1605928282, "permalink": "/r/DecidingToBeBetter/comments/jy3ids/alone/", "nsfw": false, "first_save": 1635438461.288513, "replies_charged": false}