{"id": "t5_2tand_t3_f50fz1", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": " Weird...so much connotation can be derived from this word that collectively repeats a singular argument: not accepted, underwritten, unneeded. What might we expect to result in such accusations? Remorse? Conditioning? Rebuttal?\n\nWhat we decide is weird and what is normal is subjective. Many cultures are weird to outsiders, but we are to accept the collectively accepted of a culture and not of the personality of the individual when they are one and the same. Why is it that we are sliding towards collectivistic thought processes when it comes to what's weird between each other? These are the questions I find myself pondering as of late. I don't seem to have an answer yet, but I do have some ideas...\n\nWhat one comes in contact with is set to distort their reality. If enough people come in contact with this set event in a similar order, they can collectively begin to have the same distorted reality. Then it is commonly respected as the correct distortion. Here's a simple way to look at this:\n\nSay if the majority of people poor their cereal into a bowl before the milk, this process is considered acceptable, but the reverse order might be considered weird by those without this set order of reality.\n\nWith this frame of mind, one might think that the correct way is only represented when enough people agree upon its normality. Interesting to note, we live in a universally misunderstood world (one which we don't know why we are here or for how long), but yet have the self-distinguished honor of presenting others with what is right or wrong in etiquette and purpose. Perhaps these etiquettes are required from a tribal survival method of group acceptance and coherency. But what is less coherent than the world around us which we know relatively nothing about? Who are we to say what is normal and what is weird?\n\nOur world is continuing upon a timeline of disconnected realities. Realities that no one understands fully. Though we do seek to pronounce the truth in such a way that is commonly accepted we can begin to fall into a dystopian trap. If we begin to assert what is the real reality, we begin to lose perspective and individuality. In today's society, it is seen as brave to be your individual self. We call the ones that are unsuccessful, weird and nominate the successful weird (used ironically) people as the leaders of our culture. But what is a culture to do when its people are afraid and distrustful of one another?\n\nIn today's society, we have few bonds that connect us. Our ideals are lost on physical identity: male, female, black, white, privileged and nonprivileged. We currently live our lives beset by the radical undertones of ruthlessly rigid identities. How is anyone supposed to grow if we are tied to only one trait?\n\n*Just because a toenail is part of a human does not mean a human is a toenail.*\n\nThe importance of the individual can not be overstated and it is the individual, not the collective that can make morally sound choices.\n\nMob mentality does not represent each individual's ideals or desires. It serves simply as an outlet for undue suffering previously conducted unto the individuals of the mob. We feel safer in these mobs as we are less judged for our radical actions. There is a trust between the mobsters to support each other and to tackle the scary unknown with fight and the power of numbers. We must watch closely in our society for those who feel similarly beaten down by our culture. For those people who seek vengeance on behalf of empathy do not seek true empathy, they seek to revile and discordance in order to feel accepted within their reality.\n\nAs we seek a uniform global society-globalism, we must be wary of the desire to act collectivistic in the absence of gods and religion that serve as a psychological transcendental truth of which should not and cannot be crossed. For a society that has no belief in god can believe anything. By God I do not mean any specific religions interpretation of God, but in the need for a truth that is the depiction of perfection. One that suffices all psychological needs: relatedness, competence, and autonomy. One human cannot be all of these things but belief in a God that is maximally related, maximally competent, and maximally autonomous, lends itself a guidebook (the bible for example) on how to live life.\n\nA guidebook on how to live life to achieve relatedness to God is to forever reach for moral sanctity. This kind of society is much more useful to the grand success of humanity than that which randomly decides what is accepted and unaccepted. I say randomness because it is of similarity to decisions made in present moments without full knowledge of the ramifications of such actions. Truth does not matter in people who act in only the present, only what is seemingly best for them in the present moment. However, we as a whole do not live just in the present moment. We have to look out for our future selves, and our future offspring, and their future offspring. See our responsibility is not ourselves but to our future genealogy. Our discipline for seeing this responsibility through comes from the understanding that our society is founded upon the sacrifices of our ancestors. \n\nSo what does all this mean for weird? It means that weird is a present, non-truth based reaction to what we believe is a presently acceptable distortion of reality. With no reliance on the ideas that connect us from a transcendental point of view, we will begin to form mobs of collectivism that seek not to better our future generations but to selfishly reside only in the present moment where no benefit is to be had, not even to the individual presiding within the mob.\n\nOur desire for individuality not only stems from the truth, but from the need for autonomy, which is hard to achieve when society says to be truly independent is to betray the mob. What we see as weird is only a perception, and true empathy is found not in collective actions, but through the hard work of the individual's story. This is what lets us truly know someone, which is an honor. To reject the honor of getting to know another individual is to reject your own story from seeing the light of day. So let's take what's dying in the dark, and give it light. Continue to think differently.\n\n\\- WPD", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/f50fz1/its_ok_to_be_weird/", "title": "It's OK to be weird", "social_network": "reddit", "user": "EcloVideos", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1581901055, "permalink": "/r/DecidingToBeBetter/comments/f50fz1/its_ok_to_be_weird/", "nsfw": false, "first_save": 1635437859.3577757, "replies_charged": false}