{"id": "t5_2tand_t3_m4ezh1", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I’ll start this off with saying, yes I know, I know, we all only have 24 hours in a day and you can’t actually MAKE time. \n\nBut I think that actually proves my point more. We all have the same exact 24 hours in a day. \n\nI used to think time would just open up and I would suddenly have the energy to do what I always wanted to do. I learned very quickly that if I kept waiting for that point, I’d be waiting forever. \n\nI’m currently working a 9-5 job, have a part-time job, run a small business, host a podcast, have a beautiful fulfilling relationship with my boyfriend that I live in a one bedroom apartment in, and focus on self-care every single day (which includes daily meditation & frequent physical exercise). \n\nI remember feeling drained just from my job. \nI remember envying people who seemed to have all the time in the world to accomplish their goals. \nI know that I do not have children, and of course that is a HUGE factor, but I also used to think I had no time at all. \n\nI finally understood that I need to create time in my day devoted to the places I want to be going. I am happy where I am and so proud of my journey but I didn’t get here by accident. I made this for myself. \n\nI just wanted to send this gentle push to you that you are the one who gets to create your life & decide how you spend your time, and its a huge disservice to yourself to not take advantage of that power we have. \n\nDon’t beat yourself up either. That only creates more self-sabotage & procrastination. It’s ok if you haven’t used your time in a way that you would like. It’s ok if you don’t feel like you’ve gotten to where you want to be. But just know, every single step gets you somewhere & starting today is a beautiful thing. \n\nSending you all love. \nGo do something good for you & create the time 🤍\n\n\n\nTLDR; the title lol 💕", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m4ezh1/you_dont_find_time_you_make_it/", "title": "You don’t find time, you make it.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 16, "down_vote": 0, "creation": 1615668289, "permalink": "/r/DecidingToBeBetter/comments/m4ezh1/you_dont_find_time_you_make_it/", "nsfw": false, "first_save": 1635435181.5329287, "replies_charged": false}