{"id": "t5_2tand_t3_nsy83c", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "\nSorry if this is all over the place I rarely post and I’ve still not confronted myself with this completely yet. \nI (17m) have been fat this change happened when I was 8ish some part of it were my genes the rest carelessness on my family side. For as long as I can remember my father(47m) especially after I turned 11 started calling me fat you need to work out and what not I’m very sensitive and easily cry and afraid of him coz he’s abused me my sister(20f) when she was younger and hit my mother he thinks he’s better than all for context my parents are In an arranged marriage and unfortunately in my country more than 60% of the women undergo domestic violence and divorced women are looked down upon. \n\n\nMy sister when in 7th literally was ghosted by my father and slapped because she was fat I was in 4th at the time and my mother and sister hid it from me because they wanted to protect me. (My father has a bad temper too when my maternal grandmother died my mother was pregnant with me and she was crying in her room and he came in and said “shut the fuck up or I’ll send you back to your home “ ).I have been harassed for my appearance to the point I loathe how I look and don’t even like to get my pictures clicked (I’m shaped like a diamond I’m fat ofc but I’m relatively tall so you can’t really tell I’m that fat but I do have a big butt ) my father over the years has called me a cow and what not he has forced me to run (ik I sound entitled but I don’t like physical activity as in running I’m fine with cycling but that too with friends and I used to be a national player in a sport and a medalist too ) I have always thought if I cease to exist will everyone be happy quite honestly the only thing stopping me is my sister and mother who have endured much more than me I have always suffered in silence because my father does this shit because it’s his way of telling he “loves” us. \n\nRecently I started diet I have lost 25 pounds in the past 5 months I’m far from looking what people consider fit but the main reason I started this diet was because I didn’t want it to become a health issue I’m still overweight but it won’t cause a problem in terms of health. Today my father who thinks he has a great sense of humour once again tried to start make me run by saying “I have taken it upon myself that I will make him run from tomorrow” at this point I just want to give up is physical appearance that important I know I’m not the best in terms of personality but I would like to think I’m kind I am on the last straw does this world really Kithe people like us at this point I genuinely believe I won’t ever find anyone who would love me and I just want to end this. \n\n\n\nI just want to be done with him when I grow up but I’m genuinely concerned about my mother I know for a fact she wouldn’t leave him even thought he is a toxic motherfucker to the point when a guy randomly texted my mother he made it look like she was cheating on him oh and I’m agnostic but all my life religion has been forced on me and I just fucking know if I tell my parents this they’ll abuse me verbally and quite possibly physically not my mother she’s kind af she might try to change my mind but if I stand my ground she’ll let it be", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nsy83c/ive_considered_suicide_atleast_once_a_month_ever/", "title": "I’ve considered suicide atleast once a month ever since I was 12", "social_network": "reddit", "user": "BikeAmbitious9662", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1622906963, "permalink": "/r/DecidingToBeBetter/comments/nsy83c/ive_considered_suicide_atleast_once_a_month_ever/", "nsfw": false, "first_save": 1635437990.354847, "replies_charged": false}