{"id": "t5_2tand_t3_532at5", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "1. When someone gives you a compliment do you receive it correctly?\n\nDo you say thank you right of the back, or do you take it in and let it flow through you, allowing  it to flow to your heart?\n\nI know it’s hard to answer especially if you haven’t ever thought about it in this manner. The correct way of receiving a compliment is letting it flow to your emotional center (i.e. your gut) then when you feel it’s time send it to your heart. It can sit there for as long as you wish, the point is to help you feel happy. And that’s it, see compliments are there to help us heal, they’re a gift.\n\n2. Are you carrying a lot of emotional baggage and do you know those signs?\n\nOne way to know is being overly emotional. There are different ways of releasing it, like having a really good cry or if that doesn’t work: hold the vision of what you want -letting the baggage go- take a deep breath and know in your mind it’s already gone and feel as if it’s gone. Last always be grateful by thanking the Universe/Divine/God.\n\n3. Can you forgive yourself?\n\nYes this is tough, but guilt is even worse! Why would you want to forgive yourself in the first place, simply because when you do your body and spirit are one in harmony with the Universe/Divine. Balanced and have inner peace. So why wouldn’t you want this? So, how do you forgive yourself? Look at the situation with a balanced perspective, detach from guilt. Your peace was stolen as soon as you started to blame yourself. But you need to release that burden of blame and judgment, which you implemented on yourself. What societies ideology is don’t place a sin to it, you’ve worked on that already and did it help? No, now look at it with that perspective, you are in control of yourself and your emotions, be strong, that’s when forgiveness comes. Remember Rome wasn’t built in a day, this too may take a little time. Peace, love and harmony to all. [Making Life All Better](makinglifeallbetter.wordpress.com)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/532at5/3_questions/", "title": "3 Questions...", "social_network": "reddit", "user": "MakingLifeAllBetter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1474038014, "permalink": "/r/DecidingToBeBetter/comments/532at5/3_questions/", "nsfw": false, "first_save": 1635437149.2844546, "replies_charged": false}