{"id": "t5_2tand_t3_gulzfg", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "I’ve hit rock bottom, a lot. Looking back at every situation that felt like the end of the world, I have a lot of compassion for what I’ve gone through. I’ve led both a hard and blessed life. I’ve had it worse than some and better than others. I now know that life isn’t an “either, or” kind of thing, but an “and”. Life is beautiful and ugly. Life is amazing and tragic. \n\nI get lost when I think it’s one thing. As humans we look for patterns and try to define things. At all of my rock bottoms, the time where I almost lost all hope, I couldn’t see what was waiting on the other side. I couldn’t understand that although everything was really hard in those moments, I would become a better person for them. I would learn, a lot. \n\nI’m working on feeling my feelings as they come, not reacting when I’m in an emotional state, but honoring whatever rises. Our emotions have purpose but they’re also rooted in a lot of illusions. My fears teach me about myself and they show me where work is to be done. But i am allowed to feel afraid. I am allowed to feel anything. And I have to, in order to release. In order to let go. \n\nI wanted to share these words of hope that even when it feels like all is ending, and it might be, a new order is on its way. It might not be easy. It can be hard and transformative. It can be divine and horrific. Remember that there is something coming, even when all feels over. Each ending promises a new beginning. I’m not sure of most things, but I am sure of that. And I’m positive that you can get through whatever is thrown your way. No matter the situation, you are stronger than it. You’re still here. You’ve made it. And you will continue to do so, and learn so much along the way.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gulzfg/breathe_you_will_get_through_whatever_life_throws/", "title": "Breathe. You will get through whatever life throws your way.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 93, "down_vote": 0, "creation": 1591023089, "permalink": "/r/DecidingToBeBetter/comments/gulzfg/breathe_you_will_get_through_whatever_life_throws/", "nsfw": false, "first_save": 1635435604.347705, "replies_charged": false}