{"id": "t5_2tand_t3_a9je6b", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I'm self-conscious about smiling. I always thought only people with perfect teeth actually benefit from looking pretty from smiling. Not people with crooked teeth and fangs like mine. The result is this awkward tight-lipped smile that just makes me hate my smile more.\n\nOn recent days I've become more conscious about how my passive face is always frowning, so I just decided to try plastering a smile in the privacy of my own home.\n\nAt first, my facial muscles twitched a lot trying to hold my toothy smile, and I was numb already for just 30 seconds of doing it. \n\nThen, my sister walked in on me thinking she would find my grin creepy, but she nonchalantly pointed out how I look cute smiling. That was a nice boost.\n\nSo I spent some time in the mirror trying and tweaking my facial muscles to experiment on different kinds of smiles and which ones look best on me. Then I was surprised to find out that the quarter-moon-shaped smile that I envy a lot from beautiful people is actually possible even with crooked teeth like mine! I thought that was only for people with perfect teeth. That encouraged me to smile even more. It might seem weird but I almost cried from such a simple thing.\n\nAfter that, feeling a little more confident, I took my smiling practice outside even though smiling directly at people is still out of my league. I just simply walked around outside with a passive smile on my face (no teeth but cheeks up) while mastering myself from feeling self-conscious. I dispelled thoughts about people thinking I'm crazy by glancing ever once in a while and confirming that nobody is looking at me like I've lost my mind. In this way, smiling helped alleviate my social anxiety a little bit.\n\nThen I started interacting with vendors/people while starting out with a smile, and I noticed that their body language is slightly more positive and welcoming, plus they smile back at me and talk to me with a nice tone. In this way, smiling made social interactions a little less scary. And on the occasions when I interact with grumpy vendors/people, they soften a little bit if I continue smiling through their gruff treatment. Even if they don't, I still feel proud of myself for smiling through it all, so I don't really have room for my social anxiety milking the way I was grumpily treated thinking I did something wrong or that I'm unlikeable.\n\nNow I'm on vacation at my mom's place, and I'm manning her store. I'm currently trying to apply smiling to greeting and interacting with customers. Children and elderly people are easy, though contemporaries are still a little bit of a challenge. \n\nSmiling for a week has taught me a lot of things. \n\nFirst, having a pleasant passive face makes smiling easier. I imagine it's like a bowstring drawn, when my facial muscles are poised, I can shoot anyone a smile while barely thinking about it! \n\nSmiling not only benefits yourself, it is actually even more gratifying to watch the effect of your smile brighten up someone else's face.\n\nSmiling makes me feel beautiful, even if I still hate my smile a little bit, I can confront myself in the mirror more bravely if I'm smiling.\n\nSimply smiling has made me feel a little more positive and happy for no reason somehow. And even when I think it's just placebo effect, who cares as long as it works?\n\nSmiling can help me shoulder through my social anxiety. The challenges of smiling in public, confronts a lot of similar concerns related to my social anxiety. So that's a cool bonus. I'm not a social butterfly by all means, but interactions feel less scary now and sometimes even pleasant, and that means a lot to me.\n\nSmiling braces me. When I'm about to do something out of my comfort zone, or a dreary task that would have used to warrant a frown from me, I force myself to smile, and then I instantly feel much more confident, brave, and patient.\n\nThat's all. I still have much to learn, but from now on I'll be smiling through it all.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/a9je6b/its_been_one_week_since_i_decided_to_smile/", "title": "It's been one week since I decided to smile", "social_network": "reddit", "user": "jedephant", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1545780706, "permalink": "/r/DecidingToBeBetter/comments/a9je6b/its_been_one_week_since_i_decided_to_smile/", "nsfw": false, "first_save": 1635437699.6036928, "replies_charged": false}