{"id": "t5_2tand_t3_40uw4k", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "Year after year I come into a new year with the same ideas, the same goals. For once I think it's sticking. I'm gonna get healthy, I'm gonna become a better person, I'm gonna forgive all the people who hurt me. What makes it different this time is that I'm not doing it for anyone. I'm doing it for me. I know, right? Cliche as all hell. But I mean I always had issues being..  Delightfully chubby, sad, and riddled with anxiety. Always picked on, made to feel bad about it.. Then I started embracing my body. And it's not that I'm unhealthy.. I just want to *be* better. I want to love my body. I want to feel comfortable in my skin. I want to wear whatever I want and not fear my anxiety of what people might think might hold me back. There's so much body positive stuff out there and I don't really feel all that bad about my body now. I just feel more determined than ever to start showing myself how much I can love myself. I am thankful to the universe for all the people it has brought me and everything I've seen. For once I truly am on the road to happiness. I feel so inspired and motivated to do these things and I've never felt this way before. I just wanted to post this. I never really thought Reddit could be an inspiring place in amongst all the trolls and what not. This place makes me laugh, makes me smile, makes me cry, makes me angry. Haha, there's a little bit of good to everything if you look for it. ✌", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/40uw4k/something_something_stereotypical_new_years/", "title": "Something something stereotypical new years resolution.", "social_network": "reddit", "user": "sugarfayce", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1452729005, "permalink": "/r/DecidingToBeBetter/comments/40uw4k/something_something_stereotypical_new_years/", "nsfw": false, "first_save": 1635436220.3992162, "replies_charged": false}