{"id": "t5_2tand_t3_pjhwqr", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "So this last six months, something happened. For most of my life (I’m 30 now) I had insatiable appetites for food. In general I was just addicted to a lot of things. Drinking, smoking. Marijuana/nicotine were prolific. But also the need for companionship and sexual fulfillment.\n\nIn 2019 I made a goal to quit smoking. I was done with marijuana for over a year, but I finally tackled nicotine. Took me several tries, but I hit 2.5 years. And then I hit a point where my eating habits were manageable. I realized it’s okay to feel hungry— and that most important, that eating too much is what was making me crave other things (drinking, smoking) because it was causing such a hard dopamine crash and making me depressed.\n\nErgo, quitting one addiction helped me quit the rest. Smoking made me want to drink and eat. When I quit smoking, drinking became less appealing. After two years, I decided I was done with drinking. Well, my appetite felt more subdued. And now in the last two months, I’ve replaced my time going out to the bars with cycling. And now my appetite feels more manageable. I’m laying in bed at 1:30 AM hungry, but not that buzzed hungry where I’m insatiable and am putting on my slippers to grab a happy meal.\n\nI’m excited to see where this takes me. I haven’t been living a clean life style ever since I hit my 20s. Now all I do that I consider “addictive” is video games, but I set aside time for it twice a week, and it’s the last thing I do. Errands, family time, and personal exercise comes first. It’s my reward for a long week.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pjhwqr/i_feel_like_i_finally_getting_my_addictive/", "title": "I feel like I finally getting my addictive personality under control.", "social_network": "reddit", "user": "JGWol", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 24, "down_vote": 0, "creation": 1630998113, "permalink": "/r/DecidingToBeBetter/comments/pjhwqr/i_feel_like_i_finally_getting_my_addictive/", "nsfw": false, "first_save": 1635436711.535162, "replies_charged": false}