{"id": "t5_2tand_t3_kywu4n", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I just wanted to send this message out that it is TOTALLY POSSIBLE to be the person you want to be. \n\nI remember feeling so low, and thinking that I had way too far to go in order to be a good person. This is obviously a false thought, but deep in my pain and suffering that was so often caused by me and my thoughts, I didn’t think I was capable of changing that much. \n\nAnd then, one day, a questioned popped up: what if I try to be who I want to be instead of just spend my time thinking about how I can’t be that kind of person? \n\nI’ve spend the last 6+ years finding out the answer to that: if you actually want to change and commit to taking action in that direction, you can be and achieve anything that you want to. \n\nIt’s not about quick fixes. It’s about lasting commitments that you make to yourself overall that you have to stick to. Sometimes it’s hard. Others it’s easy and automatic. Sometimes I forget and then I figure out a month later that I’ve been stuck in my head instead of doing something. But the reminder always comes back, and in those moments I know that I am the person I wanted to be and that the world is limitless if I just continue on this path of leaning into growth instead of running away from what’s different because it’s not what I’m familiar with. \n\nI’ve finally gotten to the point that I know doing what’s out of my comfort zone is usually what’s best and I can recognize when I’m being complacent or stuck in fear. \n\nMy life is vastly different than it was 5 years ago. I know how much I’ve committed to my own evolution even though some days it doesn’t seem like it. \n\nHonor how far you’ve come. Also know that it’s actually very possible you can live a completely different life if you decide to and commit to that decision. \n\nYou are the one who dictates your life. \nAnd it’s so nice to finally realize how true it is. \n\nSending you all love.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kywu4n/you_can_be_the_person_you_want_to_be/", "title": "You can be the person you want to be.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 48, "down_vote": 0, "creation": 1610848847, "permalink": "/r/DecidingToBeBetter/comments/kywu4n/you_can_be_the_person_you_want_to_be/", "nsfw": false, "first_save": 1635436034.168909, "replies_charged": false}