{"id": "t5_2tand_t3_pgoees", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "Long story short I've been depressed for the majority of my life but severely depressed for the last two years. In the last several months I've come to face this fact for what it is and have been slowly but surely trying to improve my life and become happy. It is an incredibly bumpy road that regularly goes up AND down but I guess I'm ultimately doing better than I was.  \nThat being said, with online school being as soul crushing as it is, I'm quickly losing passion for computers, the one thing people know me for. I simply cannot find the motivation to commit to something that doesn't actually bring me a sense of purpose and accomplishment. I do love technology and find it most fascinating, but I'm not going to spend the rest of my life sitting behind a desk staring at a screen writing unbelievably complex programs that serve little to no function in society, or being the IT guy that maintains a shitty network and fixes people's PCs. The problem is, I don't know a whole lot about anything else. I'm the tech guy but not rightfully so. I don't know shit. And even less about literally anything else under the sun. \nHow do I find a major that at least somewhat applies to what I actually want to do? How do I even discover what I want to do and what drives me to get out of bed in the morning? Two things that bring me the most joy is being outdoors and being a part of a community. In fact my best dreams always heavily involve lots of people. What can I do now to work towards a career that involves being outdoors, in a community, and maybe make use of my tech skills?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pgoees/losing_passion_for_the_one_thing_everyone_knows/", "title": "Losing passion for the one thing everyone knows me for, feeling hopeless searching for something that brings me purpose", "social_network": "reddit", "user": "HottTamales", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1630609425, "permalink": "/r/DecidingToBeBetter/comments/pgoees/losing_passion_for_the_one_thing_everyone_knows/", "nsfw": false, "first_save": 1635437302.687461, "replies_charged": false}