{"id": "t5_2tand_t3_mek9nt", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "Shit, typo in the title, anyways:\n\nIt started 2002/2003 with a few Books like \"Time for the Truth\" (roughly translated) and equally shitty titles. A few month/years later I have become a guy who was thinking of himself as a kind of leftist truthseeker, in reality I ushered some really radical right wing shit without realising it. Guys and Gals: This is a fucking trap. I allowed myself to be brainwashed big time. If you are in a vulnerable time of your life, this might happen to almost anybody.\n\nAfter a few peers called me out for beeing far right, i began to think, and the doubts where on the rise. It was a long way out. Realising that i have lived in a dreamworld for many years and accepting that fact was hard, but after that it just was a slow sort of retirement. It took years though,...\n\nFast forward a few years: In 2018 I startet beeing honest about my past to colleagues, friends and family. In April 2020 lockdown, I had some time due to changing jobs, so i started a Youtube channel to try to speak in public and see how that would turn out. I choose responding to german speaking conspiracy theorist channels, and it turns out the responses where quite considerable. After 3 videos a big german radio station (Radio Berlin Brandenburg) invited me for an Interview to appear in a well designed reportage.\n\nI upgraded my gear to present my contend in HD, and bought a Mic and Lights. I made an unannounced winter break and did not upload anything for 3 Month. The peer pressure to release content got higher, and i decided to spit one out, low effort style. I was tackling a guy who was in turn attacking a woman who does educational work towards conspiracy theorists, because she was raised in a cult.\n\nShe saw my video and liked my reaction so much, that she shared my video with her quarter million followers on Facebook. My  channel got some steam from that, and now the TV stations just wont stop calling and e-mailing me.\n\nYesterday i finished shooting the last part for a Documentary, produced by some real domestic TV legends, and two very professional camera teams. It will go live on 14th of April on State TV in Austria at Primetime. And. I. Am. Hooked. I want to further my work as an educationl person, and see how far I can take it.\n\nThere was some serious work involved, but also a shitton of sheer luck. I love my life now. 15 Years ago it was a miserable shitshow. Thank you all for reading.\n\nP.S.: If you are curious, just check out my userprofile and scroll down a littel, you will find anything you need to know. I guess you have to be a german native speaker, since austrian dialect is a bitch if you just have your german degree. German and english subtitles will be introduced in the next few month.\n\nEdited for Typos.\n\nEdit 2: More Typos. Also: Thanks for the awards strangers,....", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mek9nt/i_was_a_full_blown_consipiritard_for_about_10/", "title": "I was a full blown consipiritard for about 10 years. I'm now fully clean for like 5 Years. A Year ago i started a Youtube Channel. Now I'm on National Primetime TV (Austria) trying to educate people on how to get out.", "social_network": "reddit", "user": "Ascendancer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1365, "down_vote": 0, "creation": 1616871881, "permalink": "/r/DecidingToBeBetter/comments/mek9nt/i_was_a_full_blown_consipiritard_for_about_10/", "nsfw": false, "first_save": 1635437471.9630113, "replies_charged": false}