{"id": "t5_2tand_t3_oopin0", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "Want a way to give up control of your life? Take whatever life gives you? Some days you might feel happy, some days sad, others lethargic, others bored. This is the road that having no goals will lead you towards. \n\n\nYou ask nothing specific out of life, and you will get just that. You go through life without an objective, without a plan or strategy. Years tick by, and you wonder why haven’t I had love; why am I not confident; why have I not started writing that book; why? Well, because you haven’t focused on one thing long enough for it to come to fruition. \n\n\nThe importance of goals is immeasurable. Even the way our perception works is by focusing on things within our visual field. Imagine if you tried to focus on everything your eyes pick up at all times. You simply can’t. By focusing, your mind has a goal in mind of what it wants to focus on. Every part of our biology has goals that are working in harmony to keep us alive. \n\n\nThe nice thing about our situations, most of the time, is that we get to choose our goals in life. There are certain responsibilities and goals that get forced upon us. Maybe you have children, deadlines, health problems that need managing, so what you can choose to do becomes limited. Or perhaps you’re on the opposite spectrum, where you have so much freedom that you don’t know what to dedicate your time towards. You might believe we’re born with a purpose, or destiny, and ask a metaphysical entity to reveal what yours is. You might get an answer, you might not. But waiting will not get you closer to fulfilment. Analysis paralysis is a real thing. Same with radical freedom. We must not only choose a goal, but continually keep choosing things all day, every day of our lives. No wonder many people want to go with the flow. It becomes tiring, repetitive, stressful, even boring to continually reaffirm and choose the same goals day in and day out. But don’t be mistaken, that’s the only way to achieve success. \n\n\nGoals are the foundation upon which we become better, we become disciplined, we progress. So, perhaps you’re still asking – yes, I get it, goals are important, but *what should I aim towards*? You don’t need to decide what you want to do with your entire life. Start with the day. Set goals for the day. For the hour. For the next ten minutes. Hit it. Celebrate a small victory. Plan bigger. Or vice versa, think about what you want out of life, then plan backwards. \n\n\nGoals, strategies, and plans will change, but they will navigate you in a direction that you are presently interested in, even if that’s not what you want when you get there. You’ll have learned more about yourself, you’ll have become a person that is accountable, you’ll become disciplined. You’ll be a person that sets their mind to something and accomplishes it. Once you develop these skills, and know more about what you want, then you’ll have more self-confidence because you’ve done it once, you can do it again. \n\n\nWhat you can’t escape, however, is the need to set them. Sooner or later, life will force goals upon you and your own freedom will diminish.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oopin0/how_to_give_up_control_of_your_life/", "title": "How To Give Up Control Of Your Life", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1626872866, "permalink": "/r/DecidingToBeBetter/comments/oopin0/how_to_give_up_control_of_your_life/", "nsfw": false, "first_save": 1635437126.3740613, "replies_charged": false}