{"id": "t5_2tand_t3_pbv29z", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "In the past (maybe like last year and before that), whenever my exams are nearing, I used to feel very nervous, like I'll feel a sense of urgency to go study, mostly because I always study at the last minute, as in the day before (and I still do it now). However, I've just had an exam slightly less than a month ago, which I started studying very late for even though I had a whole month of break just before that. I realised that I started studying unusually late because I didn't feel a sense of urgency to go study like I did for previous exams. Now, I'm going to have another exam literally a few hours from when I'm writing this, and I have not started revision, and somehow, I still don't feel the sense of urgency that I used to feel. If I did, I would be panicking massively right now. I'm starting to get worried about this because I have a major exam this year and these two exams (the one I just had and the one I'm about to take) are in preparation for that major exam. If I can't get this under control, it's going to be a huge problem.\n\nWhen I'm not studying, I'm literally doing anything else: playing games on my phone, watching youtube, scrolling through Instagram etc.. I've tried to delete those apps, but I end up downloading them again. And when I'm unable to download back those apps, like in the past when my parents controlled what I could download, I would still literally do nothing. So, it's basically anything besides studying. It's not like I don't want to study. I do. I definitely don't like failing. But I can't seem to start studying. Even if I were to start, I would need to get in the zone if I wanted to complete my revision or any work, which is rare.\n\nI'm thinking it has something to do with procrastination, but I would procrastinate in the past and still feel anxious as the exams neared.  I'm also thinking it may be because I'm dehydrated, but I don't feel thirsty. I do see other symptoms though (not clear urine, general tiredness, going to the toilet less than 4 times a day).\n\n\\*And if anyone is wondering how I did for the previous exam I studied very late for, I would think that I did a decent job, not fantastic by any standard, I think I was either average or slightly below average in my cohort. Here is the breakdown of my score (I take the IBDP):\n\n* HL Business Management: 6\n* HL Physics: 5\n* HL Math (I totally didn't study for this): 3\n* SL Lang & Lit: 6\n* SL Chemistry: 7\n* The official exam for the last subject was already taken last year, so i just have 5 subjects left.\n* Total for this exam: 27/35\n\nAnd the last exam where I still felt at least a slight sense of urgency to go study which was my promos last year, my overall score was 33/42. So I think it can be ruled out that it's because I did well for my previous exams that's why I'm feeling less anxious.\n\nPlease help, I don't want this to get any worse.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pbv29z/why_do_i_not_feel_anxious_when_my_exams_are/", "title": "Why do I not feel anxious when my exams are nearing anymore?", "social_network": "reddit", "user": "prata69", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1629965376, "permalink": "/r/DecidingToBeBetter/comments/pbv29z/why_do_i_not_feel_anxious_when_my_exams_are/", "nsfw": false, "first_save": 1635437987.7681124, "replies_charged": false}