{"id": "t5_2tand_t3_kiug3z", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "I took some much needed quiet time for my own well-being recently. I’m a pretty open person, I typically share a lot of my experiences and thoughts because writing really is such an important part of my life and I am passionate about helping people, so merging the two always came naturally for me. \n\nThere came a point that I realized I was using this once cathartic tool (writing) as a crutch to define my worth through how well it was received. How many upvotes, how many likes, how much engagement, yadda yadda yadda. \n\nEventually it became so draining I knew I had to pull back and go within. This is a practice I come back to pretty frequently once I realize I’m being drained by something that once really energized me. \n\nNothing is inherently good or inherently bad but we can use things as a way to move us forward or to feed our ego. I am still figuring out the balance. Even writing this I wonder if it’s for you or for me? But usually when I come back after a long break, I’m clear in my intentions. The inner work I did really helped clarify why I do what I do, how to notice when the intentions have an ulterior motive, and how to not take action when that’s the case. I think I’ll be doing this work for the rest of my life, but right now I feel grounded which is a big change of pace compared to the last few months. \n\nWhen you constantly deduct your worth based on someone else’s definition, your life becomes void of its magic. I’ve spent most of my life believing that if I didn’t achieve what someone wanted me to, I was a failure, if my parents were disappointed in me, I wasn’t worthy, if my boss didn’t like the job I did, I sucked, if my friend was mad because I didn’t give them the attention they needed, I was a horrible person, if my significant other didn’t act like I was the best person in the world or got upset with me, I was absolutely undeserving of love, if someone wrote a negative comment or said I’m wrong, then I don’t know what I’m talking about and who the f am I to put anything out there: the list can keep going. \n\nThe common theme of these are based on someone else. If they xxx, I’m not yyy. What if I finally change the narrative? What if there is no condition of my worthiness or if I’m deserving of love? What if I just am, because I’m here. What if you just are, because you are here? \n\nIt’s time to stop thinking our worth is based on what we do, how well we do it, and how much we accomplish. We are not machines. We’re humans having a human experience. Some people are good at things and others are good at something else. Sometimes accomplishing tasks takes skills that someone else accumulated over the years, and comparing yourself as a beginner to them does absolutely nothing but discourage us from taking action. Sometimes people are miserable in their own life that they use you as a way to get their own misery out. \n\nGrowing up, we could only relate outside circumstances to ourselves. My dad died, therefore everyone will leave me because I’m not good enough. My mom is mad and it’s because of me. We all do this, we’re wired for it. And then when we grow up, that wiring is still there and we get impacted by all the things around us and think it’s personal. It’s not. \n\nNothing is personal unless you make it that way. If someone hates you, and you think you did something to deserve that hate, it’s time to forgive yourself for not knowing better at the time you took that action and then strive to do better today. Beating yourself up does nothing but keep you acting in shame and perpetuates toxic behavior. \n\nIt’s time to understand our worthiness exists independent of someone else. You cannot be defined. You’re worthy. You’re lovable. You’re deserving. Period. And when you take action from that place, instead of one thinking you need to prove something to yourself or someone else, the whole world opens up. \n\n\n\nTL;DR\n\nIt’s time to understand our worthiness exists independent of someone else. You cannot be defined. You’re worthy. You’re lovable. You’re deserving. Period. And when you take action from that place, instead of one thinking you need to prove something to yourself or someone else, the whole world opens up.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kiug3z/stop_depending_on_others_to_define_your_worth/", "title": "Stop depending on others to define your worth.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 134, "down_vote": 0, "creation": 1608735152, "permalink": "/r/DecidingToBeBetter/comments/kiug3z/stop_depending_on_others_to_define_your_worth/", "nsfw": false, "first_save": 1635438450.3298128, "replies_charged": false}