{"id": "t5_2tand_t3_mj5qoq", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a"], "text": "I'm a 22 year old man child, I game even though the world I've built for myself is inadequete and I've got no real direction in life and I feel pretty bad about it. Nothing wrong with gaming, I just hate how lazy I am. I keep saying to myself I'll stop using social media and I keep saying I'll stop playing games unless I've had a productive enough day (so completing a well thought out to do list), in which case I'll let myself play games for a bit in the evening. I set this pretty achievable sounding plan in motion and I'll manage this successfully for a whole week or two and wouldn't you know it I'll feel more happy and less agrivated by the thought of me wasting time. Suddenly this productivity will be interuppted by a minor inconvinience. Maybe I'll go drink with some friends and be hungover for a day and use social media or watch some youtube because I'm not feeling too great. Without even realising I'm right back to where I was!!! I'll do it the next day and the next again just sucking on the nipple of comfort youtube supplies like an infant... Its not until much later I remember like some sort of flashback after getting amnesia that I was supposed to be quitting this fucking thing in the first place and look at myself in my big man baby nappy and realise that I've regressed another 14 years and that I can't wipe my own ass anymore. \n\nLook I only really use youtube and reddit, youtube being the worst thing for me. I'll spend hours a day watching things that bring me no joy at all like I'm plugged into the matrix of mediocrity. I've seen everything you could possibly see on the internet to the point the only thing that suprises me anymore is the amount of people willing to sit through 10 unskipable adds for an 11 minute video. It's genuinely gross to me that I can avoid growing up without any thought and without even noticing like this. But hey I guess I shouldn't complain too much if I was born in the early 1900s my growing up would have been killing nazis so I haven't got it that bad. \n\nHere's all I can think of so far:\n\n- Make a reminder for when I wake up not to use games or social media at all until I've done my to do list. \n\n- Setting limits on how much certain apps can be used \n\n- Give myself reminders around the house and on items I own like a post it note on my PC monitor and notes on my to do list not to use social media or game until a reasonable amount on my list has been achieved. \n\nI need a better strategy to avoid doing this shit over and over, if someone has any advice and has commented, I love you, I need it, this advice is going to a good home, this is not fun, Thank you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mj5qoq/does_anyone_have_advice_for_getting_out_of_social/", "title": "Does anyone have advice for getting out of social media and gaming addiction?", "social_network": "reddit", "user": "LivingMyselfToDeath", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1617444616, "permalink": "/r/DecidingToBeBetter/comments/mj5qoq/does_anyone_have_advice_for_getting_out_of_social/", "nsfw": false, "first_save": 1635437329.4265523, "replies_charged": false}