{"id": "t5_2tand_t3_iz1j6i", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "Modern media has corrupted our minds. \n\nConversations about controversial topics are hostile. For the most part, generalizations are thrown left and right, people become ENRAGED at the other person because they do not hold the same beliefs as they do. Instead of listening, and gaining a new perspective about the conversation topic, they view this as an opportunity to assert intellectual dominance over the other person. Nothing is taught. People become passive aggressive about those topics amongst each other, which breeds even more toxicity.\n\nThe truth of the matter is, your views and opinions will depend on your life experiences. There is no objectively right or wrong stance, because if it were not a controversial topic, there wouldn’t even be a division in opinion in the first place. \n\nHold your beliefs and recognize your bias that was built on your life experiences, but do not chastise someone for the way they think. Try and put yourself in a position to understand why they think the way they do. I feel like, at least from personal experiences, not enough people practice this these days, and it hurts me to see so many people blinded by their emotions that they won’t think about the other side.\n\nLet me know if you’ve noticed something similar, or leave a comment about why you disagree with this stance. Thank you\n\nEdit- spelling error", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iz1j6i/replace_toxic_arguments_with_mutually_beneficial/", "title": "Replace toxic arguments with mutually beneficial discussions", "social_network": "reddit", "user": "nickckelly", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1600968198, "permalink": "/r/DecidingToBeBetter/comments/iz1j6i/replace_toxic_arguments_with_mutually_beneficial/", "nsfw": false, "first_save": 1635435430.3714595, "replies_charged": false}