{"id": "t5_2tand_t3_m456d4", "request": ["883794f3-030f-4844-8950-6e28281dfa3f", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "It’s hard when the day ends and you got nothing done. Maybe you did your best and it wasn’t enough. Maybe you hid from your goals because they scared you. Maybe you didn’t know where to start. \n\nI’ve experienced all those, and they all feel awful.\n\nDread and anxiety are the pauses between knowing what the right thing is and actually doing that right thing. Discipline removes that pause. Discipline is your way out, but not in the way you think. Maybe you associate it with orders from authoritative drill sergeants or having your freedom taken away, but hear me out: Discipline is easier than what you’re doing now. Let’s talk about why.\n\n*“You do not rise to the level of your goals – you fall to the level of your systems.” - James Clear*\n\n**Discipline just means having a system you can follow and doing it every day.** Anyone can get inspired to work hard on something for one day, but big goals take more than one day. You need to have a system where you can make 1% progress for 100 days in a row. A system you don’t have to think about. A system that takes motivation out of the picture – because you’re not going to feel motivated every day. \n\nOnce you have a system you can follow without thinking, you move forward even on the bad days. It’s not a question of “Do I feel like writing today?” It’s just a routine that you write one page every single morning or journal for 20 minutes before bed. \n\nEvery master was once a beginner, so don’t put off beginning. It doesn’t have to be perfect. The fact that you are doing it will give you experience and make you better over time. Waiting to start or waiting to feel like you’re good at it is not going to make you good at it, but regular practice will. And you can take tiny steps as long as you keep moving.\n\n# Positive Feedback Loop\n\nThe good news is that by simply keeping that promise to yourself every day, you’re going to feel better. **Finishing things you said you would finish daily feels better than doing them perfectly rarely.** This is critical because once you have a system of finishing small things, you’ve entered a positive feedback loop that creates those good feelings every day. Let’s talk about that feedback loop and what it boils down to: **Good actions create good feelings.**\n\nDon’t you feel proud after you exercise? Or after you finish a page of the book you’re writing? Or after you clean a room of your apartment? Those good feelings come from knowing that you got something important done. Feeling like you made progress. \n\nAnd how do you feel when you lay on the couch all day, putting off important work and letting it loom over you and ruin time that should have been relaxing? Not good. This is what we want to avoid.\n\n# Momentum Toward Goals\n\nThe system creates momentum. Instead of waiting for days for when we feel motivated to do work, we can make small steps forward every day and create good feelings. I cannot overstate how critical this is. Waiting for good feelings does not work, and motivation does not show up often enough to accomplish big goals. \n\nThe most radical part here is that once you have the discipline to follow your systems every day, you have so much more control over the quality of your days. When you know how to create feelings of accomplishment and progress, you free yourself from the whim of fleeting motivation. \n\n# Discipline equals freedom\n\nEveryone’s system will be different, but you can work on finding what’s effective for you to maintain your momentum toward goals. I have a list of activities that I do every day like journaling, taking a walk, writing one page, listening to 20 minutes of an audiobook, taking a five–minute gratitude practice. All of these support goals of mine, and all of them make me feel good. It’s not like I run a marathon every day or work 16 hours. I would burn out after a day. Even when I wake up feeling bad or something negative happens at work, I know what routines create good feelings for me, and I can follow them without thinking because they are such small bites. Over time, they have created incredible results because I have been consistent.\n\nYou can be free from needing motivation to get things done. You can be free from a bad day derailing all of your goals. And you can be free from wondering if you’re doing enough. You can create a system that fosters momentum toward goals and consistently stirs feelings of accomplishment and satisfaction because you know you are moving forward – that positive feedback loop that can keep you going. You can start keeping promises to yourself and earn self-respect. \n\nDiscipline will set you free – but only if you do the work. Are you ready?\n\n––––––––––––––––\n\n**Further Reading**\n\nFor a fantastic book on how to systematize routines that supercharge each day and start you on the right foot, check out *Miracle Morning* by Hal Elrod. He walks you through a great system for being consistent with great habits – it changed my life. I’ve also gotten several friends into this and I love that it puts my goals on autopilot. Plus, I can modify the system over time as my goals change. Make it the system you need; I promise it will help.\n\n**Acknowledgement**\n\n“Discipline Equals Freedom” is from retired Navy SEAL Jocko Willink, who is fantastic for a ton of reasons and has a great podcast and some books you should check out also. His catchphrase really captured the message I wanted to convey here, but he’s got way more to say in his books for those who are interested.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m456d4/discipline_equals_freedom/", "title": "Discipline Equals Freedom", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 46, "down_vote": 0, "creation": 1615637780, "permalink": "/r/DecidingToBeBetter/comments/m456d4/discipline_equals_freedom/", "nsfw": false, "first_save": 1635437999.8109894, "replies_charged": false}