{"id": "t5_2tand_t3_kyyxkj", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "After breaking up with my girlfriend, getting covid, and going into a social isolation for several days, I spiraled downward faster than ever before. 2 days ago, I attempted suicide for the first time in 6 years. I went to lunch with my ex yesterday and she gave me some advice, later that night, I decided I’m not going to let myself keep feeling depressed and hopeless. I was letting my younger self down.\n\nI woke up this morning and read some horoscope things and they were really fitting and insightful. Even if you don’t believe in zodiac stuff, the messages are still pretty motivating.\n\nI came to realize that if I went through this 6 years ago and survived, I can survive again. I looked back at how I improved myself last time when I was a lot younger, with no therapist and only one friend who lived 700+ miles away. How did I survive heartbreak and depression and loneliness? Not to mentioned this was before I transitioned from female to male.\n\nI was optimistic. I wrote notes to myself that I would open at the end of the year and in one I wrote “optimism ftw amirite?” Optimism and love was one of the only things that saved me. I wrote songs and drew so much art expressing every emotion I had so I had the mental space to be optimistic.\n\nSo now, my journey to heal begins, for the second time. I will be journaling daily, drawing when I feel mad or sad or in love, writing music for the ones I ache for, and making notes to myself for the end of the year just like I used to.\n\nIf a lonely, closeted 13 year old could survive through this, then I, a post-transition 18 year old with a therapist, friends, and stable family, can survive it as well.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kyyxkj/learning_from_my_younger_self/", "title": "Learning from my younger self", "social_network": "reddit", "user": "snailgoblin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1610856183, "permalink": "/r/DecidingToBeBetter/comments/kyyxkj/learning_from_my_younger_self/", "nsfw": false, "first_save": 1635437602.0170765, "replies_charged": false}