{"id": "t5_2tand_t3_nf25pg", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "Hi all,\n\nI don't know if this belongs here. If not, can you point me to the right subreddit?\n\nSo, on Thursday, May 13th, I had a massive fight with my only friend. I said some absolutely horrible things because I was stressed out with money and my motorcycle and other stuff, and I needed to blow off some steam.\n\nI took it out on her. It was just a phone call.\n\nShe was and still is the most important and amazing person I've ever met.\n\nI was also angry at her because I was feeling ignored and neglected. But I failed to take into account her own mental health. I was selfish and cruel, and I will regret what I said for the rest of my life.\n\nShe blocked my number, my Instagram, my Snapchat, and my Epic Games account.\n\nThen on Friday, less than 36 hours later, I got called in for 2 job interviews, and I got some money I was waiting for. I paid for my motorcycle insurance, and as of today (Monday), I got both jobs.\n\nI like fixing and building things. I'm good at it, too. I can fix most things if I put my heart into it. I'm really good at puzzles, too. I used to build them all the time. People are puzzles. And I like helping people. I fell in love with this woman. And she is one of the most complex people I've ever come across. I think I might the most complex person I've ever met.\n\nHer birthday is in about 50 days, and I've been writing her an apology letter and ordered 24 tulips for her. I think I'll try and change the order tomorrow and have the flowers delivered to her place, as well as 7 roses. We were friends for 7 months, and she's turning 24, and I told her I was available 24/7. I've also been making a playlist that I will put on my iPod to give to her.\n\nI struggle with emotions, and music is the only way I can express my emotions properly.\n\nThe apology letter is coming along pretty well. It helps that I'm a writer.\n\nThe playlist is another story. I've been trying to recreate it in iTunes from a playlist I have on YouTube. There are a lot of songs.\n\nI'm doing all this because I told her I was working on my mental health but kept failing to prove it. I got the motorcycle. But that's not much? I mean, I could have spent the money on sex and drugs. Instead, I chose the high road and bought a motorcycle. I'm taking meds for my OCD. I've quit drinking and cutting. I'm still smoking.\n\nDuring our last phone call, my friend told me I was a fucking psycho who didn't know how to be a friend. I asked one of my therapists and the escort I see regularly and got 2 *extremely* different answers. They didn't conflict, but instead, they seemed to compliment each other. It was weird, like that George Lucas quote about poetry and rhyming.\n\nSee, our friendship had been falling apart for a while. I didn't know why. Maybe I did, but I was too scared to admit it or something. But now that she's gone from my life, I think I can finally see where, when, why, and how it all went wrong and how I can fix it.\n\nI think if she's willing to talk things over, I might be able to explain what went wrong and how I've changed. Sure, it'll only have been about 50 days, not enough for most people to change who they are, but I'm not most people. And neither is she.\n\nThe very last thing she said to me was she wished me well. Well, her wish came true. And I fulfilled my promise to deal with my bike and my money. If we had waited just 4 days, I think we could have fixed this friendship.\n\nI think the best-case scenario is I prove to her that fairytales are real. The worst-case scenario is I get arrested and charged. Maybe a restraining order. I think the most likely scenario is she ignores my gifts and apology letter.\n\nI want to be a good person, I want to help people, but I needed to help myself first. I just haven't been able to do that. At least not until now.\n\nEXTRA DETAILS.\n\nSurprisingly, there's a lot I left out. I'll fill it in here. I was a selfish, cruel, narcissistic, vile, despicable person to her, and I treated her like shit. And she was the first and only person that ever made me feel like  I was worth something. I fell in love with her, and I repaid her kindness and generosity with cruelty and lies and manipulation.\n\nIn my absolutely measly defence, she failed to tell me important details until it was too late, and her pattern recognition is so bad to the point where it seems like it doesn't exist. I'm autistic, and one of the things we're known for is fucking pattern recognition. And a complete inability to understand basic human emotions. I only know what emotions are because of pattern recognition.\n\nIt's been a long four days. I've been walking up and down hills for at least 12 hours since Friday, and I said some of the worst things I've ever said in my life to one of the kindest, most understanding people I've ever met, leading her to call me a fucking psycho that doesn't know how to be a friend.\n\nI'm going to log off of everything for a while. Hopefully, something longer than a few seconds. Something closer to 3 days would be better.\n\nThanks for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nf25pg/i_lost_my_closest_friend_because_i_was_stressed/", "title": "I lost my closest friend because I was stressed out and angry and needed to blow off some steam. I have spent every waking hour since trying to make up for all the wrongs I did to her. It's a looooooong post.", "social_network": "reddit", "user": "Trick_Enthusiasm", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1621315526, "permalink": "/r/DecidingToBeBetter/comments/nf25pg/i_lost_my_closest_friend_because_i_was_stressed/", "nsfw": false, "first_save": 1635436726.4663908, "replies_charged": false}