{"id": "t5_2tand_t3_qfmjcj", "request": ["b69cf201-6737-4217-b486-9096135546b8", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "***im in college atm, i havent made a real friend yet but i want to make friends where i can talk about my aspirations and future plans. talking to people isnt my strong suit.*** im awkward but i try. ive started to journal everyday for the past month. it hasnt really helped but it has made clear where i should be improving.\n\n*\\[ I have seen a reddit post on how to make friends but i feel like its flawed due to the fact that its subjective in certain areas:*  [*(5) How to Make Friends like a Normal Person : socialskills*](https://www.reddit.com/r/socialskills/comments/15abhq/how_to_make_friends_like_a_normal_person/) *\\]*\n\nive tried changing myself. im trying to read more books that sound cool. and im trying to learn new things everyday but im purely lazy. im stuck at home all day except when im in college but i want a social life outside of education. never had that. and i fear that i'll be in the same place that i was last year. im more optimistic that last year where i was to the point where i was sad all week/months. sometimes im worried that ill lose a good friendship from my desperate needs. i just want to be happy talking to someone on days where im lonely or make plans. i just want to leave my house. \n\n**i want to change my life while i can now as a 16 year old rather than later.**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qfmjcj/how_can_i_make_social_interactions_and_make/", "title": "how can i make social interactions and make meaningful friendships?", "social_network": "reddit", "user": "RecognitionVisual901", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1635184900, "permalink": "/r/DecidingToBeBetter/comments/qfmjcj/how_can_i_make_social_interactions_and_make/", "nsfw": false, "first_save": 1635436442.8322363, "replies_charged": false}