{"id": "t5_2tand_t3_kgfq0w", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Link to original: https://www.reddit.com/r/DecidingToBeBetter/comments/h0smyw/ive_decided_to_finally_kick_my_porn_addiction/?utm_medium=android_app&utm_source=share\n\nIt's been 6 months but I've finally done it!! I've kicked my addiction and I can seriously say I am never going back to that filth again!\n\nI feel better than I have in years and I owe it all to u/chakijz, without the book he linked in my original post I'd still be in the trap today. This'll probably be buried in new but if anyone's curious the book is [EasyPeasy](https://pmohackbook.org/easypeasy.pdf).\n\nThis book has helped me more than anything else and I seriously urge anyone wanting to kick their porn addiction to read it. I've tried quitting porn for roughly a year now, maybe a bit longer but didn't really get serious about my goal until my last post. I'd tried using the willpower method (using once every x amount of days) and only caused myself more harm than good. I've tried reading about what porn can do to both your brain and body and even though it shocked me, it didn't do the trick. I had honestly started beating myself up about it (no pun intended) which only made me use more. I had just about given up on quitting when I decided to do a small overhaul of my life. I won't get into those details, this is already long enough, but after a few months of working on my self confidence and how I saw myself the only thing left to deal with was the porn monster. \n\nI had seen this subreddit show up in my feed before and it came to mind as a resource/source of inspiration. When I read u/chakijz's comment on my post I was hesitant to read the book, part of me didnt want to 'give up' my addiction. It took a couple weeks but I finally got around to reading it and quit for 3 weeks! Unfortunately I fell back into the trap as I had gotten into a mindset the author mentions and hadn't realized it. A couple more failed attempts later and here we finally are. I'm about a week clean (honestly can't remember my exact date of quitting but that's good in some aspects) and I feel absolutely amazing. Some might ask how I can be so confident after a week and all I can say is it's my frame of mind. I know I don't need porn to handle life, so I simply won't ever watch again. \n\nIf this long post helps even just one person then it's worth it. I hope my story can help to inspire someone like so many here have for me. Hang in there and if anyone needs a cheerleader then DM me, I'm happy to provide support in any way I can. \n\nAnd one more thing, I seriously can't thank you enough u/chakijz. Giving me that link helped me return to a much more confident me and I'm loving every moment of it. I hope you're also doing well with kicking your addiction.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kgfq0w/update_i_kicked_my_porn_addiction_finally/", "title": "(UPDATE) I KICKED MY PORN ADDICTION FINALLY!!!", "social_network": "reddit", "user": "UnimportantGuy2291", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 16, "down_vote": 0, "creation": 1608410094, "permalink": "/r/DecidingToBeBetter/comments/kgfq0w/update_i_kicked_my_porn_addiction_finally/", "nsfw": false, "first_save": 1635437536.0619743, "replies_charged": false}