{"id": "t5_2tand_t3_myswrq", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I am almost 40 and I have accomplished plenty, on paper. However, none of it matters to me. I haven’t achieved any of the things that I have wanted to achieve: writing books, making people laugh (as an entertainer or author), singing professionally, etc. \n\nThough this may sound a little egocentric, I am good at these things. Even when I’m in the depths of self-loathing, I am aware that I am a talented singer, I am funny and quick-witted. I write better than a lot of my peers. \n\nAlso, I am brimming with anger and resentment. \n\nI have felt unseen my entire life. This is not to say that I am unloved or not cared about. But I was the first sibling of two, and I think my parents’ anxieties manifested as very strict feelings about certain “valuable” achievements. Good grades, pick a plan for your life, off to college, immediately into the career you studied for. That was the law of the land in my household. \n\nBut ... only for me. For my younger sibling, things were much more relaxed (a common dynamic, I’m told). Mediocre grades? That’s fine, honey. Lack of interest in school? Of course; you’re a creative kid. All you want to do is play your chosen instrument? That’s very good, we believe in you!\n\nBut when I tried to pump the brakes on the life plan laid out for me? Conferences with therapists and teachers were called. My various musical talents were never seen as anything more than a real nice li’l bonus for those college applications. And my creative writing was stifled by teachers who wanted me to write by the rules. \n\nA lot was expected of me as a child, and even more so as an adult. And I ticked all the expectation boxes like a good first born, completely neglecting to make any choices for myself that might result in the pursuit of my own, true goals. And, in fact, I lost sight of what those goals might even be. \n\nMeanwhile, my parents paid for my younger sibling’s entire life. They moved back home and lived there rent free until the age of 26. All meals, bills, spending money: taken care of. \n\nFast forward to now and I feel like my life hasn’t even started while my sibling is an internationally recognized and respected musician. Fans all over the world. Articles being written about them. Yes, they put in the work and they deserve every inch of their success. But they didn’t have to worry about doing anything BUT that. \n\nI realize that 1) I have enjoyed a privileged life, 2) everything is hard work no matter how it may seem and 3) comparing myself to others is poisonous. But I can’t help but feel inferior. \n\nHow can I change my mindset and start taking more action toward my goals? How can I just be happy for my sibling and stop wishing I’d had it easier like them? How can I get out from under this resentment and disappointment and learn to be courageous and powerful in my own way? How do I start my life?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/myswrq/how_can_i_stop_comparing_my_place_in_life_to_my/", "title": "How can I stop comparing my place in life to my well-known sibling’s and START MY LIFE?", "social_network": "reddit", "user": "secondchancesmcgee", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1619425619, "permalink": "/r/DecidingToBeBetter/comments/myswrq/how_can_i_stop_comparing_my_place_in_life_to_my/", "nsfw": false, "first_save": 1635437846.441628, "replies_charged": false}