{"id": "t5_2tand_t3_pj47z0", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "&#x200B;\n\n* 27 & recent grad. Finally  received an opportunity to interview with a successful firm that was paying salary instead of hourly, health insurance, paying for my daily transportation 2 work, and in my favorite part of town that i always dreamed of working in. Went to the in person interview, and got hired on the spot the day after my birthday.\n* All this was great, but I started to feel depressed and unaccomplished as soon as I walked in. The employer was happy to have me on board, but i met my trainer during the interview and immediately received unwelcoming vibes from her.\n* On the job, I remember feeling like trash for 3 days b/c of the feedback  I received her from her on my very first assignment (after I was given contradictory instructions).  Was also legitimately bullied  by her on  my third day in a way that didn't pertain to projects perse, and excluded from important work related discussions only to be pointed out by a different supervisor that I didn't know X (in a discussion I was excluded from).\n* I started feeling extremely anxious coming to work; the being belittled and exclusion from important work discussions that nearly all other team members were part of just made me feel like I didn't belong. Eventually, I got tired of it and remembered thinking \"If i get fired  idgaf b/c I'm tired of explicitly being spoken the only one spoken condescendingly to for things that aren;t entirely my fault \". Some time went by, and I eventually did get fired. not for performance reasons, but for some interpersonal /political reasons which were difficult to deal with, but certainly within my control if I had the \"I won't let others get in the way of my goals or self esteem\" vs \"Idgaf about getting fired\" attitude.\n   * I started \"not giving a crap\" if I was fired not b/c I didn't care about the job, but because I could no longer see where it was getting me. Most people see the purpose of a job b/c it helps them pay bills, but I did not see the joy in that as at the time, I  Was suicidal/depressed from the job. Have exercised cooked, and ate healthy consistently for at least 1-  2 years. But started getting to a point where I stopped eating. stopped exercising. just came home and went straight to sleep without brushing my teeth.  Not b/c of work stress, but b/c I just felt worthless from/at the job and I've always centered myself around work/school success. it's always been my life. I didn't know how see the job as a means to end rather than an end itself.\n   * I remember wearing makeup/dressing cute after work just to feel human again b/c I get a lot of attention whenever I go out. I'd even wear makeup at work at look cute just to avoid feeling worthless .\n   * didn't see the point of a job where I felt like my sole purpose was to organize papers, suck at it, and let the \"sucking at it\" make me suffer in other areas of my life (stopped seeing friends b/c I felt dumb, stopped brushing teeth, stopped exercising and stopped eating whenever I could)\n* I realized only after getting fired that:\n   * job success is measured differently than the way  success is measured prior to having a job (school, internships, etc). Even If i wasn't the best at my job , the fact that I could keep a job was the only thing that really mattered(As a recent grad who struggled to even find a job). Keeping the job shouldn've been my priority, as opposed to anything else.\n   * While working in the job, I  also wasn't aware of exit options which only started appearing (after I got fired). BIgger firms starting asking me for interviews , but only after I got fired so the interviews with (great firms)  successful had I not been fired .\n   * I didn't need to the \"best\" or even \"included\". all that mattered was the fact that I received my dream job opportunity in my field without prior experience & was finally able to support myself with it when those closest to me doubted that this would have even been possible.\n* I am now getting paid hourly instead of salary (15/hr vs 35k per year), in a not so optimal location,  and have to drive my old car to work vs getting paid to take a bus. It is for a less prestigious firm, so idk how helpful the expereince at this place will be in order to find a better opportunity :( hiring mangager said she would review my pay every 6 months to compensate for the lower pay since I have a degree..but I'd do anything to make the LIVEABLE STARTNG PAY instead of  waiting 1-2 yrs whether to SEE if the manager will allow me to earn what I was before\n* And although you can see I learned tremendously from the firing experience, my question is how do I convince myself that regret is not the right way to go? I went from being basically broke and not having a place to call my own home to a receiving an unheard  opportunity that allowed me to overcome all of this.  **Now I'm making exactly minimum wage..and idk how to not live in regret since what happened was my fault?**\n   * I've learned lessons but at what cost- minimum wage and lack of job security? I know I've learned lessons (at the ripe old age of 27) but I'm curious how to convince myself that not living in regret is I should be doing?\n   * **Basically, not wallowing in regret is hard to do b/c I don't understand how there is any justification for what I did. I can handle making mistakes, But idk how to accept making a mistake that doesn't make sense....**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pj47z0/how_to_get_over_the_guilt_of_being_afforded_a/", "title": "How to get over the guilt of being afforded a much needed job opportunity and then getting fired from it b/c of my own mistakes/fault. How to convince myself that wallowing over making a bad decision is not the right thing to do?", "social_network": "reddit", "user": "Cat_Eyed_Goddess94", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1630949776, "permalink": "/r/DecidingToBeBetter/comments/pj47z0/how_to_get_over_the_guilt_of_being_afforded_a/", "nsfw": false, "first_save": 1635437301.2622786, "replies_charged": false}