{"id": "t5_2tand_t3_ggvdjd", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I'm a (16M) and I think that I'm a little bit too fearless, reckless or impulsive when it comes to confrontations whether I'm the one that's doing the confronting or not. I have zero tolerance/patience for a lot of things especially when it comes to a thing called disrespect and physical harm. Every time a person I don't really know gives me a tiny bit of disrespect I pop off at them boy or girl. For example, in around late March me & my friends decided to go ride our dirtbikes in the woods and the empty construction site from 1PM to 7PM. So we met up, had some fun doing stunts, races, wheelies, going up steep ramps and going down steep ramps plus more.\n\nBut then this middle-aged couple in a truck came up to us while we were taking a water break because of all the stuff we was doing. I seen the truck coming towards us and I'm a empath so I can sense when something is about pop off so me sensing that I automatically check to see if I got my knife in my pocket and I did so I just stood there just waiting for them to say or do the wrong thing. Which off the jump they was on butt saying that \"get y'all asses off this private property\" which got me heated so I punched the guy in the mouth x3 he grabbed me trying to take me down so I bite his thumb and I kicked him in the nuts. His wife or whatever tried to stop it but I thought they was trying to jump me so I got up kicked her in the gut and when she fell down I kicked her in the back. The guy got up punched me in mouth around 5 times and got my mouth bleeding which left me no choice but try to stab him.\n\nBut, I only cut him a few times to make him back off and he did. I thought about killing the woman because I was filled with anger so I went up to her but my friends stopped me which I'm surprised they didn't earlier.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ggvdjd/how_do_i_become_more_calm_smart_in_confrontations/", "title": "How Do I Become More Calm & Smart In Confrontations?", "social_network": "reddit", "user": "BriefSugar", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1589087414, "permalink": "/r/DecidingToBeBetter/comments/ggvdjd/how_do_i_become_more_calm_smart_in_confrontations/", "nsfw": false, "first_save": 1635435786.3269157, "replies_charged": false}