{"id": "t5_2tand_t3_mmthdw", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "**Quick background:** I am a psychology student who lives in top 3 suicidal country in the world. In 2017 I started volunteering at suicide hotline, learned A TON about people, got experience, now teach other newbie volunteers how to give emotional support for the people in need.\n\n**It is magical** to hear hopelessness lift after an hour of conversation with suicidal person. And if active listening can help in situation that serious it can help in other relationships too! It definitely helped in mine. I learned the skill and then taught my gf how to listen to me when I have a shit day. \n\nObviously it's a skill that needs quite a bit of practice, but the start is easy:  \n\n\n1. you decide to listen\n2. watch what's happening inside your head\n3. ask what happened\n4. reflect feelings\n5. and **shut the fuck up!**\n\nWhy watch inside yourself? Because you will get STRONG urges to:  \n\n\n* Interrupt.\n* Give advice.\n* Share your experience.\n* Jump to the other topic. \n\nIt's completely normal. It's human nature. But you don't do these things. You focus, ask what happened, reflect feelings and nod.\n\n**Example:** your gf/bf/roommate comes pissed from work.\n\nYOU: what happened?\n\nGF: my boss shouted at me.\n\nNOW y*ou observe YOUR URGES:*  \n\n\n* *anger: \"I told you to be more assertive with that dumbass!\";*\n* *problem solving, anger: \"I'll call him and get this fixed in a half an hour\";*\n* *pity: \"Oh, poor you. I'm very sorry dear. He's a bad man and he's just hurting you so so bad. Truly an awful situation\"*\n* *one upping: \"Tell me about it! I remember the time MY boss was the asshole\"*\n* *self talk: \"Yeah, it's tough, but you haven't yet seen what happened today to my minecraft server...\"*\n* *problem solving: \"right, you need to quit this job. This is what we're going to do. I will hire fiverr guy for the the CV, then we'll print them and then...\"*\n* *and so on...*\n\nWhat these responses do is set you further apart. So what you actually do is take a deep breath, notice the URGES and then say:   \n\n\n* Yikes, sound like a tough day. Can you tell me more about it? \n* GF: yeah I was having lunch and then he came and got pissed about that report I just wrote. Then that another thing.. And another and blah blah blah\n* YOU: *nodding like mad*\n* GF: And then there was that and that and that. \n* YOU: *still nodding*\n* GF: and after that, there was this thing...\n* YOU: I can see you're angry at him\n* GF: no shit, Sherlock!  He's the biggest asshole there is. \n* YOU: \\[could take this Sherlock thing personally, but you don't cause it's her anger talking so you acknowledge it\\] yeah, angry you are indeed. What happened next?\n* so on... \n\nI know it all might seem like a common knowledge for some of you, but people generally don't listen very well. For example I thought I was the best listener in the world before learning what the listening actually is. And it's not only my suicidal country, I also lived in the UK for a few years, spent a year in the US and it's all the same - people just don't seem to listen that well. The response is usually ridden with advice and a need to solve the problem.\n\n**Why I wanted to flair this post as HELP?**\n\nBecause I need to understand **why people don't learn these skills?** I saw some courses online that teach active listening, but they seem subpar. In general this industry seems half-dead. I couldn't even find a blog on the topic!!\n\nCountless coachers teach public speaking, leadership, emotional intelligence. **Where is active listening??** Am I missing something? Please help me understand. Has it ever came across your mind that it's a good skill to have? Or am I fixated on the idea and slightly delusional?\n\n&#x200B;\n\nCheers,\n\nDom", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mmthdw/how_i_realized_the_value_of_active_listening/", "title": "How I realized the value of active listening", "social_network": "reddit", "user": "Domkius", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 27, "down_vote": 0, "creation": 1617893469, "permalink": "/r/DecidingToBeBetter/comments/mmthdw/how_i_realized_the_value_of_active_listening/", "nsfw": false, "first_save": 1635435870.3893547, "replies_charged": false}