{"id": "t5_2tand_t3_ppei57", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "So for a bit of background I'm 27, Male and I never payed much attention when I was in school (to my detriment). I regret not putting in the work and being attentive to what was going on in the classroom and I want to educate myself in all areas, or at least in enough areas to cover most of the important topics in life. Think of the idea of the renaissance man, like Leonardo Da Vinci. Someone who had knowledge in multiple subjects, which could range from Science to Philosophy, History and Physics etc.\n\nI guess my goal for starting out would be to have a basic understanding of a variety of important subjects by reading books that would give me this foundational understanding where I could improve upon later if I so desired. So perhaps the best thing to do is maybe give a list of subjects like; 1. Philosophy, 2. History, 3. Politics etc. Kind of like the subjects one would get in school, and then give a book recommendation for that subject that would give me a basic understanding of that subject.\n\nThe goal here is, as the title suggests, to become a truly well rounded, educated person on a wide range of subjects. I would love to have this kind of educational so I would be able to converse with basically anyone I meet on any number of topics. At the moment I feel I'm very introverted because of my lack of educational and not being able to join in on a lot of conversations people may have. \n\nThanks in advance.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ppei57/list_of_books_to_become_a_well_rounded_self/", "title": "List of books to become a well rounded, self educated person", "social_network": "reddit", "user": "XHeraclitusX", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 352, "down_vote": 0, "creation": 1631802916, "permalink": "/r/DecidingToBeBetter/comments/ppei57/list_of_books_to_become_a_well_rounded_self/", "nsfw": false, "first_save": 1635435067.9160972, "replies_charged": false}