{"id": "t5_2tand_t3_frj5vm", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Right now, we have a lot of free time. And think about it, whether you choose to make the most of this time or not, this time will pass. Do you want to come out of this as an improved, happier and healthier version of yourself, or stay where you are? Don't let this precious time pass by you. Get up and do something, anything to help yourself improve and grow into the person you've always wanted to be. \n\nIt might seem like it's not worth it, like maybe you won't get to your goals because they're so big and maybe you won't have enough time to accomplish what you want. But, you'll still have improved by the end of this time, if you just try. It'll bring you closer to your goals than you ever were, and that is a big accomplishment. \n\nThis month's choices are next month's results. Would you rather look back and think, damn, maybe if I just tried last month I'd have made some progress, or think, wow, last month I made some great choices and have made some good progress? It's your choice. Your life is your choice and it's what you make it out to be. So make it something awesome, and let yourself have the satisfaction of saying that you chose your life, rather than settled for it. \n\nLet these words sink in. Stop waiting for something to \"glow up\" for, like a special occasion or special person you want to impress. Glow up for the rest of your life, and for yourself. \n\nGood luck guys, hope this motivated and inspired you to help yourself to be better 💕✨", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/frj5vm/life_becomes_more_meaningful_when_you_realize_the/", "title": "Life becomes more meaningful when you realize the simple fact that you'll never get the same moment twice.", "social_network": "reddit", "user": "mya-is-confused", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 657, "down_vote": 0, "creation": 1585537833, "permalink": "/r/DecidingToBeBetter/comments/frj5vm/life_becomes_more_meaningful_when_you_realize_the/", "nsfw": false, "first_save": 1635438127.6537852, "replies_charged": false}