{"id": "t5_2tand_t3_ow45yf", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "I’m not sure if anyone has had a similar experience, but ever since the pandemic my  social anxiety had increased exponentially. I only ever went out when it was necessary, and I became TOO comfortable in my solitude. \n\nI rejected every invite even though those people had been vaccinated, tested, etc. I’d pretend I was busy when in reality I had began to fear seeing people.\n\nThis week I beat that one year fear of mine and I went on a trip with a friend for three days. I didn’t realize how much I needed to just.. talk to someone. Face to face. I feel so much lighter.\n\nI have also left my school and enrolled into a homeschool. I had a lot of bad memories there that I can’t get into, along with strict six-seven hour schedules everyday online. It may seem like a small achievement but after discovering that the main source of my  depressive episodes was that place, after I left I haven’t had one in months. It feels amazing to finally find the will to get out of bed, to start taking care of my health, to feel like I’m normal. It’s such a big relief, the kind where you feel as if you’ve been holding your breath and now you can finally exhale.\n\nI am also two years self harm free. No suicidal ideations, and have completely quit cigarettes with the support of my friend and my sister.\n\nI hope that as I grow older I’ll become a better person and be able to pursue my passions, but for now I am happy with where I am. Thank you to everyone in this community for helping me and for posting amazing advice. If I hadn’t discovered this place, nothing would have changed. I still have a lot to learn at my age but I’ll get there.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ow45yf/i_15f_powered_through_my_social_anxiety_and_left/", "title": "I (15F) powered through my social anxiety and left my source of stress", "social_network": "reddit", "user": "Amberthms", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 360, "down_vote": 0, "creation": 1627865386, "permalink": "/r/DecidingToBeBetter/comments/ow45yf/i_15f_powered_through_my_social_anxiety_and_left/", "nsfw": false, "first_save": 1635435997.2822437, "replies_charged": false}