{"id": "t5_2tand_t3_dyv0u5", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "Every morning for the last seven shifts, I’ve had caffeine and am up and attem when they call and say not to come in. In days of better mental health I’d do something worth while with this sudden batch of free time. Instead all this week I just chugged three beers to cool off the caffeine, turned on Netflix, and slept. Basically it’s led to a fruitless cycle of pursing one disappointing dopamine binge after another (smoking CBD, drinking beer, eating unhealthy food, internet, video games, TV). I had a short lived but very exciting relationship this year that now two months out from her moving away, I’m aware our fling had reset some patterns Of focusing on immediate gratification like sex and drinking and smoking and such. But after neglecting the meaningful stuff, several months of trying to still be excited by the meaningless stuff has made these dopamine fixes even less powerful, which in turn has made me just try to do them with ever increasing frequency. Like when I was with her, suddenly sex was POWERFUL again, just a single thought or a single text could derail my mind all day and I’d be blissful about it, like I was stoned. Now, alone, just trying to think about sex doesn’t have that affect, so I try to think about sex A LOT, as if frequent thoughts of sex could add up to be as powerful as a loving relationship with a vibrant human being. So dumb right? Tell it to my sub conscious. \n\nI guess this is just a journal entry I didn’t know what I’d write when I opened this. Maybe I just needed to say some stuff. My next therapy appointment is 2 weeks, I think I’ll have an earful for him by then. I want to have good news to report to him, I want to start taking care of myself before then.\n\n\nI just feel like putting it out there. I am, starting right now, going to return to my more meaningful pursuits, like music, writing, relationships with friends and family- even though they aren’t the dopamine dumps to which I compulsively cling. \n\nWhen I cling to these compulsions I find the recurring thought in my head “life would be so much better if...” (I were sexier, I were younger, weed were legal, I was rich, if I were wildly successful and surrounded by amazing times and interesting people at all time, WHATEVER)\n\nWhen I practice what I find meaningful in life, I find the recurring thought in my head “I am so grateful for _____ in my life” (people, interests, hobbies, goals, my health). \n\n\nI just really, really, really am struggling with saying no to these immediate dopamine fixes, so that I can return to the meaningful aspects of my life. \n\nBut this valley too is a part of the journey I so value. I look forward to the day when I look back on this time and realize what it taught me.\n\nI love you all\n\nI do feel better having written this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dyv0u5/im_deciding_to_be_better_ive_struggled_with/", "title": "I’m deciding to be better. I’ve struggled with depression and compulsive behaviors all my life. I’ve worked on my mental health to have a pattern; work days is all about work (ICU nurse), off days I exercise and am productive until dinner. But my work shift was cancelled last minute all week.", "social_network": "reddit", "user": "pWaveShadowZone", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1574215800, "permalink": "/r/DecidingToBeBetter/comments/dyv0u5/im_deciding_to_be_better_ive_struggled_with/", "nsfw": false, "first_save": 1635435637.4234314, "replies_charged": false}