{"id": "t5_2tand_t3_iaqri7", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "alright so I'm 19/f. Im in college for my 2nd year and this lockdown has been an absolute mental breakthru for me. It made me truly realize how much of a LOSER i have been all my life. growing up my family was pretty poor yet i was a very happy and bright child up until about high school when i was kind of arrogant and lazy. I also isolated myself a lot. Wouldnt talk to kids in school, acted like i was better or more mature than them. I spent all my time online just being a loser watching youtube videos. Honestly that would often times be the highlight of my day. Friendship-wise I was kind of those Im-not-like-other-girls type of girl so i often would try to act like a smartass. I was a part of some extracarriculars that took up a lot of my time but i kind of hated them and was pretty depressed becus of them and never quit for just for the sake of \"not being a quitter\" i kind of assumed that i had more time and it was completely lost on me that i only gave 1 hs experience. i basically took that time and many opportunities for granted. Anyways, now im coming up to my second year in college. I dont know what to study but i kind of am just trying to focus on enjoying myself. during quarantine i realized how much time i had wasted, how much energy i wasted all my life and how i basically had only 3 years left to kind of enjoy time among my peers.  I see my peers from hs on social media they are kind of grown up and enjoying thier own lives. I never was a jealous person before but this quarantine made me realize how little ive seen and done throughout my life and also how little of a personality i have. I guess this is to say that i am going to try to change. Im goint to try to put myself out there and talk to people and also try new hobbies. Im trying to become positive. My mental health has also deterriorated during this pandemic situation and i lost 25 lbs. i weight like 88 lbs now and its hard for me to sleep and move around because i can feel my backbones agianst anything i touch. Luckliy though im seeing a therapist and shes helped  me alot. So ill make the effort to change. Illl try to be a better person but how do i get over my past self. Im beginning to feel heavy amounts of regret and resentment for my past attitude to life and its making me want to give up. How can i clear my head and be better?? how can i approach people also so that i can be socioable because social anxiety is an issue for me as well.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iaqri7/decided_to_stop_being_a_loser_todayyyy/", "title": "Decided to stop being a loser todayyyy", "social_network": "reddit", "user": "LeopardSensitive5585", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1597577184, "permalink": "/r/DecidingToBeBetter/comments/iaqri7/decided_to_stop_being_a_loser_todayyyy/", "nsfw": false, "first_save": 1635437028.6902156, "replies_charged": false}