{"id": "t5_2tand_t3_afrn9k", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "As I lay in bed last night I realized that writing, for me, was like entering a dimly lit corner composed simply of a soft, yellow, down cushions and all I had to do to experience the most natural joy, the greatest sense of belonging was to get up and nestle myself in the center. It reminded me of how a dove sits in a nest that she has built from straw and twigs. The nest fits her perfectly with edges that curl up around her with assurance. After a long, weary day of dove-like troubles and concerns, that nest is always there. For me, writing will always be a place where I can stop, put everything down, and examine the most essential parts of the spirit. A place where, through my diligence, I can bring forth worlds of beauty and meaning.\n\nPerhaps this is what people refer to as a ‘calling.’ It is not so much a fight or battle to construct one’s dream, but rather a long yearned release. I merely had to place myself there, in that warm, sunny place of possibility, and let my mind go, my fingers race. It’s delightful how easy life can be when everything is aligned, how chasing one’s dream is, in reality, like riding a bike downhill, with gravity and destiny pulling you forward even if you don’t pedal. It can be scary. You may go fast and you may not be able to comprehend what’s happening. You may fall and scrape your elbow. But you’re moving. It was just a matter of getting on that bike.\n\nMasters do not master their craft because they find it easy. To them, their art is simply necessary. It is movement. It is color. It is daily breath. Life simply would not be, if it were not for them filling the working hours of each day with the imprint of their voice, with the child-like excitement of engaging in their intellectual faculties, with the solemn pleasure of singing their most authentic song. Ultimately, masters are those who are best at being themselves. In their minds, there is no question, no hint of doubt as to why they spend chilly early mornings and long silent nights chiseling away at their blocks of wonder.\n\nIronically enough, there is no good reason to why one should access their creative being, become their highest self. As Oscar Wilde famously proclaimed, “all art is quite useless.” To become a true professional is to steep oneself in the bath of sublime urgency that flows from the deepest recesses of one’s heart. Like art, purpose is greater than reasoning simply because reasoning can be justified while purpose cannot be distilled into lesser, more fundamental components. How does one deconstruct intention or love? The burning desire to pull from the whirlpool of the unconscious a droplet that one can dare to call art?\n\nLet emotion, energy in motion, guide you. It is a wave that, if you choose to ride, will take you to a place much farther, much more secluded, and that appears to be a foreign reflection of your inner world. Explore that new and yet oddly familiar place. Do not try to create the wave or capture it. Let its warmth envelop your body. Quiet yourself, and let Yourself speak.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/afrn9k/on_being_oneself/", "title": "On Being Oneself", "social_network": "reddit", "user": "neotenousmenace", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1547437044, "permalink": "/r/DecidingToBeBetter/comments/afrn9k/on_being_oneself/", "nsfw": false, "first_save": 1635436215.389037, "replies_charged": false}