{"id": "t5_2tand_t3_aameom", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Hello. I am 37 years old, and have autism, I have a small part time job, live otherwise on disability support, and am 18 months into receiving help. In that time I have a practical social worker, an addiction counselor for the drinking, initially harm reduction though now I am 65 days sober, and a therapist for the CSA and other unusually serious issues from childhood. Overall things have improved a great deal, practical and emotional changes I had not achieved on my own in almost 20 years of adulthood, but I have an issue I do not know how to deal with.\n\nThis happened the day before yesterday, I got all emotional and wrote a long rant, then stopped myself. I figured if I waited a day until I calmed down what to do would be more obvious, but I am still not sure what to do. My uncle showed up at my house. He has schizophrenia and a meth issue, and wanted help fixing his Apple product, to phone the Apple store from my house as he does not have a phone. He has had an issue with these products for many months now, wanting me to fix them. I try to explain that I do not know how, that my ability is limited regardless, but Apple products are entirely different than everyone else, but he gets paranoid and does not believe me, he thinks I am intentionally refusing because I am playing games, or part of a large conspiracy. I have allowed him to phone the Apple store previously, but I did not want to yesterday.\n\nHe is a 60 year old drug addict with mental health issues, the phone calls take an hour, he gets irate and yells at them, and this is a bachelor apartment so privacy in a separate room is impossible. I tried to explain my reason, I did not want to just say no without an explanation. I do not know if it was passive aggressive though, all I said was that I was tired of demands dressed up as requests, this is a real issue in my life with others as well as him, people saying a request, but really the only answer is yes or they throw an angry fit and yell.\n\nI tried to make it clear it wasn't solely him, tried speaking softly, he get enraged and yelled, shouting and stomping and leaving, returning 5 minutes later to yell a bit more. This is a thing with him, and it has been a year and half of incidents coming up, and cutting contact seems logical, I emotionally do not want to do this every other week any longer. He gets paranoid, the dope does him no good at all.\n\nAnd well I have a lot of confidence in him having a good heart and my ability to stay safe, I cannot guarantee it. He has a lengthy criminal history, serving 7 out of 9 years total on a bunch of small bits, and several years combined in hospitals. Cutting contact sounds more obvious than it is to me though. He is trying, and has been for years. He won't do therapy or take medication for the schizophrenia. But he hasn't been in trouble or hospital in 10 years. He has maintained an apartment for that time, before that he was largely homeless and in and out of places, in the last 10 years he even maintained a job for a few years and had a relationship for that time.\n\nHe was kind to me as teenager, I was around a lot of terrible things, criminality and abuse, he lived with my grandmother when he wasn't homeless and would simply sit with me when we visited, he made me feel seen and heard during a childhood that did not have that. That was a long time ago, I am 37 and he is 60 now. But he has nobody else. He is a lifelong unreformed drug addict who literally never left the 70's culturally. Most of his old friends are dead, his relationships with younger people in the drug life are chaotic, and me and his brother, 1 of his 5 siblings are the only family who will talk to him any longer. As well this is a smallish town, I will see him on the street without question. And I am in recovery, I am working with the practical social worker to make life changes whereas my uncle only deals with them to keep his apartment, but we do share the same social worker. With the drugs and his age I don't know how many years he has left, it hurts to consider cutting him off, but this paranoia and rages every 2 or 3 weeks is getting hard. I just not sure what to do, thank you to anyone reading this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/aameom/looking_for_advice_on_how_to_handle_a_relative/", "title": "Looking for advice on how to handle a relative.", "social_network": "reddit", "user": "gurneyhallack", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 16, "down_vote": 0, "creation": 1546100133, "permalink": "/r/DecidingToBeBetter/comments/aameom/looking_for_advice_on_how_to_handle_a_relative/", "nsfw": false, "first_save": 1635438284.3257341, "replies_charged": false}