{"id": "t5_2tand_t3_oirqpc", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": "In the past, I'd been extremely judgemental about people cribbing away about some problems in their lives that seemed to me like they had obvious solutions. \n\nThen life happened, and I went from being a fit high potential fresh graduate out of college to a stressed corporate slave weighing 240 pounds and looking like a mess. To make matters worse, I fell into family inherited debt issues that wiped out everything I had and made me put my further education plans on a backseat. \n\nWhile I continued to work my ass off, I felt like shit for an year, let things impact my relationships with everyone and blamed everything around me. I felt especially furious when friends at that young age cared about things which felt much easier than what I was going through.\n\nAt 25, It felt like rock bottom on most of the days and there was no progress as everything felt linked to everything else - commute was 2.5 hours but I wasn't able to quit because I had debts to pay and prospects were good at this company. People kept progressing in life while I felt like I was filling up holes from the past, starting negative. \n\nFinally I decided it was time to change something drastically, so used my network within the company to move countries, got paid more and starting saving & investing. By the end of that year, I'd cleared the debt and lost 40 pounds, life was seemingly coming back on track! \n\nAt 30, Fast forward to today, when there's issues, I still feel they're really big. Arguments with parents or my partner, not being able to travel in pandemic to see friends or family, feeling stuck at my job despite multiple promotions because I feel I missed out on experimenting with other options or getting my masters degree. When I think logically, the magnitude and impact of problems I have today are no where close to what I've been through, still on bad days I feel as demotivated as I was years ago when nothing was working out. I try and draw motivation that I can get through everything, yet I feel scarred from my past and feel I've lost resilience and everything feels like hell sometimes. \n\nSo looking back, I want to say, no matter how seemingly easy some solutions might look like to other people's problems, never underestimate how heavy/difficult/stuck they might feel and don't dismiss them for short!\n\nAfter all, it's the last straw that breaks the camels back...", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oirqpc/realization_peoples_problems_feel_hard_to/", "title": "Realization: People's problems feel hard to themselves, no matter how easy or difficult they might seem to a third person", "social_network": "reddit", "user": "Amazing_Obligation97", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 155, "down_vote": 0, "creation": 1626098157, "permalink": "/r/DecidingToBeBetter/comments/oirqpc/realization_peoples_problems_feel_hard_to/", "nsfw": false, "first_save": 1635436243.3440213, "replies_charged": false}