{"id": "t5_2tand_t3_iia1uk", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "One of my principles is *Bring Order to Chaos*. I believe that by adding structure to most of the important things that you do, you can become more efficient and productive. I believe that the more organization and *self-organization* you add to your life the better and more predictable results you can achieve.In this article I have listed several areas which can benefit from adding more structure. I have concentrated on everyday things that you would not normally consider, because you usually *have always been doing them this way*. Each of these paragraphs is a conversation-starter and I have listed further articles, or books that can help you to actually self-organize.\n\n## Time to read\n\nTime to read: **15 minutes** (based on 150 works per minute).\n\n## Why do you need structure?\n\nHave you ever looked at your email and thought to yourself, \"I need to get this sorted *some day*.\" How about your drawer? Do you spent precious minutes searching for a particular peace of clothing, or in general for something to wear? How about your desk? Does it look clean, orderly, and just invites you come spend time on it? Or is a pile of papers, things, empty packages? Do you spend hours searching for a particular document or file on your computer?You are not alone. Most of the people in the world make promises to themselves to organize their lives more and fail to do it. In this article, I will tell you how to self-organize and add structure to the most common *things* in your life. I will start with tangible *things* like you email, files on your computer, your desk, your drawer and your notes. I will continue with more intangible things like your meditation practice, your morning routine, your exercise, your sporting activities.\n\n## What is the benefit of structure?\n\nBut what is the problem that I am trying to solve? \"What if I am happy with the structure that I have?\", I hear you say. Well, that is fine, if you believe you are set. But I personally believe that outer harmony (your desk, your documents, your drawer) leads to inner harmony. Especially now, when we still cope with the impact of the COVID-19 pandemic and we prepare for a potential second and wave, it pays off to get to that inner peace that you need to keep living. The main benefit of getting things around you in order is two fold. First of all you spend time doing it, which takes your mind off the problems that you would otherwise consider. And, the result is a space where you find possessions easy so that you can concentrate on productive work or other things that make you happy.\n\n## Whey do I write about structure?\n\nI see my life as an endless struggle to bring order and organize the otherwise chaotic world. There are people who watch TV for fun (so do I, from time to time). There are others who like to play sports (again, I love that too). But what I do for fun is to collect and organize information, knowledge. I spent months carefully organizing and sorting my archive files, only to realize that I can delete 75% of them. What I believe in is reducing clutter. Living simple. Having fewer things.\n\n## How can you add structure to ...\n\n### 01. Your email\n\nI will start with one of the things which needs the most attention, in my opinion. Every day most of you receive hundreds and maybe even thousands of email. Email is what other people *want* from you. Never forget that. If you spend all your day reading and answering emails, you are not bringing a lot of value. What I consider actual work is that you do between emails.I have several simple rules for keeping email organized:\n\n1. Use folders for the things that you might need in the future. I have a dual system of marking emails - by sender (e.g. my boss, my colleague, my wife) and by object (e.g. my team, my org, my home, my car, my tennis club). And I have a folder for each of these. My brain is good at remembering who sent me a piece of information.\n2. Use labels for the actions that you need to do. I have a list of 10-12 actions that might result from an email (e.g. to read, to do, to reply, to remember) and that I expect when I send an email (e.g. awaiting reply, awaiting action). I use these labels (and search/smart folders to get easy access to them) to make emails that for *follow-up*.\n3. Discard and archive. I discard any email that I do not think is important. And I archive them so that I can search in the future.\n4. Do in five minutes or less. Anything that I can do in five minutes or less, I just do right away. This keeps my \"*to do*\" pile smaller.\n5. Check four times a day. I only check email four times a day - in the morning, before lunch, in the early afternoon, and in the evening.\n6. Remove notifications. This is just a constant source of distraction.\n\n### 02. Your desk\n\nI spend about six to seven hours on my desk. Next to my bed, this is the physical area that deserves the most attention. My philosophy here is also based on simplicity, structure, and functionality. I have an area where I do work (called white space) - read documents, write, takes notes etc. I have an area for my keyboard and my mouse. My setup is a monitor and a laptop and I have reserved different sections of both screen for specific things - my calendar (i.e. I plan my day on a calendar making sure I time box all my tasks), my task list (i.e. I have a list of three Most Important Tasks for the day and a list of Nice To Do Tasks), my notes. And, I also have an area to *drop stuff* \\- a document that I want to review later, my headphones when I am getting off a call, and other small items.\n\n### 03. Your drawer\n\nThis has been my favorite topic for the last year. When we moved houses a couple of years ago our *small things* occupied one hundred and thirty seven boxes. It took three people (actually five including my spouse and I), a truck, and twelve hours of work to load (most of the stuff was pre-packed), move, unload, and unpack all our stuff. There are some boxes which are still intact in the basement. I thought (and my spouse shared the sentiment) that this is ridiculous. So, in the last years we became advocates of Minimalism. We threw out more than 60% of our *stuff*. Everything that we had not used in more than six months, we either gifted, donated, or threw out. Our next move took a fraction of the time, the boxes, and the effort.But I did not stop there. I wanted to also add structure to my drawer. This is when I found this book (The Life-Changing Magic of Tidying Up). The author was a Japanese *cleaning consultant* Marie Kondo. Using the techniques in this book, I reduced all my apparel to one drawer and one hanger (plus a few jackets and boots, but that's it). I started organizing my t-shirts, socks, and underwear. And even though it looks intimidating at first, by only spending several minutes every week to put the laundry back in order, this technique has been a life saver.\n\n### 04. Your files\n\nI read somewhere that we are becoming *digital hoarders*. Just because digital *space* is huge, we tend to keep all our old photos, documents, papers, everything. And when we try to order stuff we actually make things worse. One of the best algorithms to find something is to search for it. And also, most of the things that we think we might need later, are useless. My philosophy is simple - I keep all my files sorted by the year when I acquired them. And inside each folder I have a handful of high-level file categories - business docs, tech docs, and important projects that I have done in that year. Finally, I put the date on which the doc is acquired as a prefix to the name. This way searching for something goes like this: When do I think I worked on this? Which high-level category it falls to? Roughly when (i.e. month) did I work on this? By the third question my list of options is already down to a handful.I also maintain a *cache* of frequently and recently used items. This is very useful, because the more you use a file, the higher the probability that you will use it again. On the very end, everything that I have not used in a year or so, goes to an archive (i.e. an external USB hard drive). And finally, some of the important files, go into an encrypted section of this archive.Another book that I would greatly recommend here is this Algorithms to Live By: The Computer Science of Human Decisions.\n\n### 05. Your notes\n\nI tried my notes in a very similar way like my files. I keep the *current notes* (i.e. from this year), broken down into several high-level categories (let's call them *notebook stacks*). Inside each category, I have a small number of sub-categories (*notebooks*). And finally my notes are inside, prefixed by the date on which I took the note. I also maintain a cache (*favorites*) with the most recently used notes. I archive most of my notes at the end of the year.Think also about having templates for the most important notes that you need to take - interview notes, meeting minutes. Instead of creating the structure on the fly, you can only duplicate the template and start filling it in. You can also have templates for the documents that you need to write in a day - reports, emails, confirmations, etc.\n\n### 06. Your meetings\n\nNow this is something that you will often see called out. More and more professionals report more and more time spent in non-productive meetings. Meetings, in general, are a waste of time if they do not result in spreading information, getting to a decision, getting to a solution. The way I approach meetings is like this:\n\n1. Start with agenda. Hours, days, and even weeks before the meeting, I prepare and send out the agenda.\n2. Share goals. If you share upfront what the goal of the meeting is, then you will be able to get the correct people on the meeting, and actually achieve the outcome that you have been hoping to achieve.\n3. Drive the meeting (using the agenda and the goals). Do not let the discussion drift away. If you own the meeting, you need to drive it.\n4. Capture notes and especially decisions.\n5. Share your notes, and track next steps.\n\n### 07. Your meditation\n\nNow, we go into the interesting area of the intangibles. First all, I believe it writing down everything (see my notes section). The best way that I have found to add structure to my meditation is to visualize it before hand, do it, and then review and make changes. I meditate for twenty minutes, about five to ten minutes after I wake up. And I have divided these twenty minutes into three parts - concentration, affirmations, visualization. In the first part I concentrate, I follow my breath, I clear my mind. In the second part, I state my affirmations to get me into the state of mind that I want to be. And finally, I visualize my day. I am not planning it, because I don't know what kind of tasks I have, but I visualize my attitude, my approach to the day. I use a timer to alert me at half time, which means that I should switch from affirmations to visualization.\n\n### 08. Your morning routine\n\nOther than the meditation, I have also organized all my morning routine. This is the one to two hours that I have planned in a great detail to get myself in the correct mindset before I start the day. Once again, I have planned, written down, and corrected my habits carefully. Adding structure to your morning routine is the single, most beneficial action you can take to change your life. Other than the need to organize it, there is no special formula for this. You need to experiment, test, and make sure you choose the best sequence of activities.\n\n### 09. Your exercises\n\nThis is another area from which I benefited a lot. I believe that daily exercises improve my mood, my productivity, my attitude, my willpower - all the important ingredients of success. I have tried many different approaches, but the one that works the best for me is body-weight exercise at the beginning of the day. The best way that I found so far is to dedicate each day to a different muscle group. And to keep reviewing the exercises and the reps every six months in order to feel progress.\n\n### 10. Your diet\n\nWhat you eat each day has a tremendous impact on your bodies, your minds, you longevity, your energy, everything. It always amazes me how careful some people are with their cars. They only make sure they put the best gas, oil, and other products. And at the same time, they put all kind of junk in their bodies. I am not a nutrition expert, so please do not follow my tips without consulting a doctor or an expert, but I would recommend reducing saturated fats and eliminating trans-fats from your diet. Reduce as much as possible all the processed foods that you eat.Once again, I would like to quite a book that helped me a lot with my diet: Eat, Drink, and Be Healthy.\n\n### 11. Your habits\n\nFinally, I want to only touch upon this. There have been many books about this, so I am not going to get into a lot of details, but more than 50% of our daily life is governed by habits. This is one of the best and one of the worst features of your brains. The more your learn about your habits, the more fascinated and the more scared you will become. My advice is to start monitoring your habits, writing them down, and pinpointing the ones that you want to change, because they are not beneficial for you.Another book, to help you on your journey: The Power of Habit.\n\n## Summary\n\nYou can only benefit from having structure for all the things that you do. The more time you spend in preparation (i.e. defining the structure of a meeting) the more time you can spend on actual productivity (i.e. getting the decisions from the meeting that you would like). Schedule some time today to think about structure and how to improve all the everyday things that you need to do.\n\nTin Mayer\n\nAuthor", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iia1uk/eleven_areas_in_your_life_that_can_benefit_from/", "title": "Eleven Areas in Your Life That Can Benefit From More Structure", "social_network": "reddit", "user": "tinmmayer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1598631407, "permalink": "/r/DecidingToBeBetter/comments/iia1uk/eleven_areas_in_your_life_that_can_benefit_from/", "nsfw": false, "first_save": 1635435501.4346673, "replies_charged": false}