{"id": "t5_2tand_t3_4mi00t", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "Might be better posting in TrueOMC or Zen idk...\n\nI was saying to my dad that after seeing one of my old school friends at Macchu Picchu for their birthday, that I felt insecure about that and thought I wasn't doing enough with my life. Which may or may not be true, but I have been volunteering and returning to the gym, etc. Right now I simply do not have the funds for a worldwide trip. I also said I felt overwhelmed by FB, even the mundane statuses which just kept rolling in. Anyway, he said he dislikes Facebook because it encourages people to be constantly unhappy and insecure, always comparing themselves to others and trying to live up to an impossible ideal 24/7. What is wrong with being an average Joe, he says? What is wrong with my son Xemnas volunteering at XYZ? Why is that not special? Why must we advertise this? However, most places these days would reject his mindset. I've just been banned from one self improvement community for having depression and anxiety issues, which means that I am apparently not one of the elites they desire…equally there are a plethora of blogs out there dedicated to \"get ripped quick\", \"body transformations\", \"how to become a millionaire\" and so on. And these are not scams; people spend their entire lives (or years if not decades of it) dedicated to these dreams of success.\n\nIt seems to me that everyone has been affected by the disease of neurotically seeking validation. It manifests in my father in different ways, for example he told me to 'apologise to your sister for the house being a mess'…I could not see it. I asked my sister and she said she couldn't either. We literally cleaned up before she came…to clean. He just always think it's too untidy or messy, even when it's not. \n\nMy issue is of course I do not want to be a parasite, an emotional vampire who says \"got a problem? Who cares! It's fine as it is.\" Because that isn't a healthy mindset to have. Sometimes, things *are* a problem. For example, I cannot accept how I am chronically late, or go to bed chronically late. I cannot accept how aggressive I get when arguing with my father-or how often we argue over tiny things. I cannot really accept how much social anxiety I have IRL, particularly with women my age (for obvious reasons, being a young man in his early 20s.) These are things which *need* to change, and *should* change-for myself and for others I care for. The gross irony is one thing that needs to change is my not projecting my insecurities about not being good enough onto future relationships. It was *the belief I was not fundamentally trying hard enough* and despairing over that in a passive aggressive way which pushed my ex away. How am I supposed to get rid of that urge? I have read many self-development books, sat many exams, lifted many heavy things over the years-and still that self-critical, negative voice, that *Ego*, follows me everywhere. We can't escape it. We can only learn to live in harmony with it-embracing it like a monkey on our back, without being pinned to the floor by its whims and forced to obey its irrational screeches. \n\nJust seems that many people these days are seeing problems where there are none. Dad's 'unclean;' house being one. The 'fact' that not being at Macchu Picchu on  my birthday must make me a loser. But then, who am I to determine what is and isn't a problem? Perhaps I need to get over myself. \n\nCurious to hear your thoughts. :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/4mi00t/can_selfacceptance_ever_be_a_component_of/", "title": "Can self-acceptance ever be a component of self-improvement?", "social_network": "reddit", "user": "Xemnas81", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1465041129, "permalink": "/r/DecidingToBeBetter/comments/4mi00t/can_selfacceptance_ever_be_a_component_of/", "nsfw": false, "first_save": 1635437145.5048018, "replies_charged": false}