{"id": "t5_2tand_t3_pcagpu", "request": ["f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "**(Please, please be nice in the comments. I feel pretty bad right now and just want help)**\n\nI've (20F) been together with my bf (22M) for almost a year now. It feels like we connect on every level and I really believe that he is my person.  I love him so much and everything is going great! The only problem is my jealousy. As the title says, I can't stop thinking about his ex and it's destroying me.\n\nI have a \"self destructive\" behaviour, so when I'm sad (or get triggered by something that I can connect to his ex) I think of her and I often check her social medias. Everytime I remind myself how much prettier she is than me and she probably is a great person as well. I think about how their relationship was; if he loved her more than he loves me, if their sex was better, what he loved about her, what they did together, where they went etc. I get very upset by these thoughts. I feel sick, sad, disgusting, worthless, ugly and also angry. I mostly feel like this for a day or two.\n\nThe only way I can controll these thoughts are either by going to bed (if I can) or if I start telling myself things that are bad with her. Everyone tells me these are bad coping mechanisms, but there is no other way for me to feel better. I have noticed that I often have a need to feel like I'm better than others. I just want to be better than her.\n\nI had this problem in my first relationship as well, and it was actually one of the reasons why I ended the it. I've been going to a therapist for a few months now but I can't see any difference in my behaviour. Another problematic thing is that I sometimes find something negative in what my boyfriend does. Eg, if he tells me that I'm pretty, I sometimes get sad because he doesn't say that I'm the prettiest girl he's ever seen. My brain automatically thinks \"Maybe his ex is the prettiest girl he's seen?\". I know it's a small thing, but it would actually make me feel better.\n\nHave anyone else felt like this? Did you overcome it and if so, how? I feel so desperate and I just want to change.\n\nTL;DR: I compare myself to my bf's ex and is scared that she is better than me and that he still values her and their relationship. It's destroying me and I have no idea how to stop these thoughts.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pcagpu/i_cant_stop_thinking_about_my_boyfriends_ex/", "title": "I can't stop thinking about my boyfriend's ex", "social_network": "reddit", "user": "wwwaluigi", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 136, "down_vote": 0, "creation": 1630017927, "permalink": "/r/DecidingToBeBetter/comments/pcagpu/i_cant_stop_thinking_about_my_boyfriends_ex/", "nsfw": false, "first_save": 1635438390.1280062, "replies_charged": false}