{"id": "t5_2tand_t3_kpooz9", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "For a little bit of context: my mom was saying that when you grow up you realize that to fit in society you have to be thin, dress well, etc; and I responded that I understood her point about how society kind of pressures you to be a certain way, but it isn't necessary to be happy or live (like if you don't follow that \"image\" society will not kill you or you will not be unhappy because of it as it's more about perspective and how you feel about yourself). She kept telling me it isn't that way and I kept furthering my point until she yelled \"SHUT UP\" with her whole body language screaming agression.\n\nI didn't do anything or felt anger at that point, I was just very confused cause I was talking really chill and she reacted that way. She then started to say a lot of shitty things about me.\n\nIn the past, the things she said today could've easily made react in a bad way, letting my emotions control my actions and words. But this time it didn't, instead I just let her say that stuff while internally thinking \"There's no point on responding, she's letting her emotions take control, and I understand that what I said triggered some part of herself that she may not be able to acknowledge, so that's why she's reacting like this\".\n\nThe thing is that my past self would've understand this and still respond saying shitty things like she was doing because I would get angry, but today when I felt that urge to do so I stopped and analyzed why I felt irritated about this if I understood the roots of her actions, and that's where I realized the roots of mine's.\n\nShe was like this her whole life, so when I was a kid and in my early teenage years this stuff happened and all the shitty things she used to tell me really affected the way I grew up seeing myself, which led to having a very low self-esteem, not being able to feel comfortable with the body I had and always thinking I was an awful person. I was resentful towards her still having these manipulative and toxic behaviors that affected me from a young age making me have to spend a lot of time and effort building self-esteem as well as reprogramming unhealthy mindsets and perspectives she passed to me.\n\nIt was eye-opening, almost like an epiphany to suddenly become conscious about it, so while she kept saying shitty things, I found myself thinking \"you get why she does it and you get why you have impulses to do so too, are you really going to spend the energy on caring about what she says and \"deffending yourself\" by saying toxic tuff to her too? you know it's not the right thing to do and that those comments come from a place of fear. You worked a lot to understand and accept that there's nothing wrong with not being \"perfect\", and you accept your flaws and recognize when you feel like doing shitty things in order to change for the better, so even though in the past her comments left a wound, you healed and became a stronger and better person\"\n\nI was able to think rationally, not let my emotions take control and also face the situation with tranquility and thinking critically. I can really see all the time spent on accepting myself and self-improvement showing on my mental well-being and behaviors, and im so proud about it. I love my mom and I forgive her for what she does and used to did, she has stuff to work on too and it isn't an easy thing to do.\n\nIm sorry if I wrote sth grammatically wrong, english isn't my first language, but im just geniunelly happy and felt like sharing this :)\n\n\n\nEdit: Thanks for being so sweet in the replies! I appreciate and take into account what you all say.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kpooz9/f17_i_was_able_to_respond_to_a_negative_behavior/", "title": "(F17) I was able to respond to a negative behavior coming from my mom with compassion and understandment, and I also controlled the impulse of responding in a negatuve way by understanding and being rational with my sentiments and emotions.", "social_network": "reddit", "user": "romacc27", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1663, "down_vote": 0, "creation": 1609695139, "permalink": "/r/DecidingToBeBetter/comments/kpooz9/f17_i_was_able_to_respond_to_a_negative_behavior/", "nsfw": false, "first_save": 1635438437.2645054, "replies_charged": false}