{"id": "t5_2tand_t3_cugy3d", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "This might be a semantics argument but in my case, I feel there is a distinction between \"training oneself to speak softly\" and \"training oneself to be MINDFUL of speaking softly\". \n\nSometimes I catch myself mid-sentence. Sometimes I catch myself before even speaking. But mostly I never even think about it. \n\nHas anyone else struggled with this? \n\nOr had success with this?\n\nRather than just \"be more mindful\", I wonder if anyone has a little mental trick that is easy to adopt, and which would improve my success rate. \n\nAlso, as a preface, I know that technology isn't going to instantly solve anything. But I'm going to throw this out there. I had an idea for a technological \"assistant\" (ie, not a solution, just a little helper). Anyone know if a product like this exists? I don't know the first thing about audio equipment.\n\nPicture a microphone or audio device. I host a ton of meetings from my desk (in person or on the phone) so in my case, I'd plant this device front behind my keyboard. The device has a little light meter on the front of it. When I hit a certain decibel level, the meter goes from green to red. Or maybe the device makes a little warning beep. I like the idea of the device itself displaying this, versus connecting it to a computer and seeing the volume levels in an application. I feel like I'd consistently notice it in front of me, whereas if the 'meter' were on screen or the beep was piped through my computer, I bet I wouldn't catch it as often. Again I know something like this isn't going to work magic, but knowing myself as well as I do, an eye-catching device like this would probably help me maintain more consistent mindfulness.\n\nThank you for any advice, and to anyone else struggling with this, best of luck!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cugy3d/this_is_my_default_volume_when_speaking_any/", "title": "THIS IS MY DEFAULT VOLUME WHEN SPEAKING. Any suggestions on training myself to *be more mindful* of speaking softly?", "social_network": "reddit", "user": "defaaago", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1566580917, "permalink": "/r/DecidingToBeBetter/comments/cugy3d/this_is_my_default_volume_when_speaking_any/", "nsfw": false, "first_save": 1635438246.8716667, "replies_charged": false}