{"id": "t5_2tand_t3_oydoiv", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "I've had some rough months behind me, and although I noticed that depression and anxiety are coming back less and less lately, when they do come back, they knock me down hard. Automatic negative thinking, guilt, self-blame, worrying about the future, hopelessness - the whole nine yards. It's so bad and disappointing that I lose hope quicker and quicker everytime that I'm ever gonna climb out of this hole of mental problems.\n\nI've been meditating almost everyday in the past like 3 months, I go outside at least 2-3 times a week for groceries or just simple walks around the blocks. I try to balance my (lot of) free time by doing healthy stuff like gardening, doing crosswords, helping out at home, journaling, etc., and I usually do around the equal amount of \"unhealthy\" things like playing video games, watching videos on Youtube or editing my own clips. Sometimes I do short yoga exercises or stretchings, but other than that, I don't do any sports. I also don't have a job yet, so my options are kinda restricted financially (no registered sports classes, no psychologists). I'd love to like running or do workouts, but sadly I tried both and don't enjoy either of them.\n\nI have a supporting family and friends, but to be honest, I feel like I've relied on them so much this year that I'd feel guilty saying that I've hit a mental roadblock again. Not to mention that they probably have their own problems too. So I'm asking you redditors to help me out: how do/did you manage to ease your severe depression and anxiety without much money to spend?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oydoiv/what_helped_you_with_depression_and_anxiety_in/", "title": "What helped you with depression and anxiety in the long run?", "social_network": "reddit", "user": "anxiety___throw", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1628154235, "permalink": "/r/DecidingToBeBetter/comments/oydoiv/what_helped_you_with_depression_and_anxiety_in/", "nsfw": false, "first_save": 1635435245.5359623, "replies_charged": false}