{"id": "t5_2tand_t3_oioi3o", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "My self-hatred has a long past as my parents are narcissistic, however some neglectful friends deepened this issue last year and currently I see no way out. I'm feeling ashamed for the person I am, I see no positive traits in myself and I reached a certain level where I cannot experience any joy in my life. I'm on the edge of giving up my goals and despite I've always been the \"never give up\"-types, I started to lose motivation even in the smallest challenges. I believe that my friends will sooner or later leave me and I will end up lonely and there is no way to avoid it. I will just, you know, end up lonely, a failure with no dreams, no success and possibly not in a shape I would accept looking into the mirror.\n\nI would say that there is no moment in my everydays that feels good or right.\n\nSo, I spent the past weeks in some kind of pretty painful self-reflection and also did my research and I realized that this is a truly escalated case of self-hatred which I'm willing to defeat. The relevation itself did not change the way I'm thinking about myself, but I'm trying to understand in deep that this is a temporary situation or, you could say, an illness that I need a cure for.\n\nI have a therapist and I'm planning on sharing this with them this week, but any advice is welcomed as I know that I need to push through a lot of pain and sense of shame. Where should I start overcoming this self-hatred? How could I secure my way out? I'm afraid that if I'd just start to allow myself doing things I could possibly like, taking up challenges, doing things anyway despite the shame and suffering I would just throw myself into an even deeper pit and it would never get better. So I want to secure that whatever I'm doing it will lead me to the end of this situation and it won't escalate it further.\n\nThank you so much in adavnce! ♥", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oioi3o/overcoming_selfhatred_need_advise/", "title": "Overcoming self-hatred, need advise", "social_network": "reddit", "user": "LexHCaulfield", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 37, "down_vote": 0, "creation": 1626085444, "permalink": "/r/DecidingToBeBetter/comments/oioi3o/overcoming_selfhatred_need_advise/", "nsfw": false, "first_save": 1635437299.0005465, "replies_charged": false}