{"id": "t5_2tand_t3_pa65a2", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Hi All,\n\nIts been a while since I posted, but I am still striving to be better. I have been locked in on working out and spending time for myself. Buying Green chef boxes and Factor premade meals has done wonders for me. I am also at the point where I am only drinking water or coffee when I am home. This is big progress for a huge soda drinker. My relationship continues to have highs and lows, likely driven by my own insecurities. When its good, its so good. But when its bad its pretty bad.\n\nToday I will hit Legs and shoulders in the gym. I will spend the night cleaning my apartment and relaxing. Ive let my apartment go a bit since Ive been on the move. Today I meditate on not sweating the small stuff, any attention I give to any action should be proportionate to its worth.\n\nHow do you control your frame when you are drinking? I find that once I get drunk, I can no longer hold back what bothers me. It all just seems to flow out. I am starting to think I need to cut drinking out all together. There is one thing that constantly bothers me in my relationship and that is my girlfriend staying out at bars until 4am with her single friends. I dont see a solution to this as she does not see anything wrong with it. Fundamentally its just not something I want a girl im serious with to be doing.  Nearly all of our fights boil down to this dynamic and my disapproval for it. When Im sober, I can maintain frame of mind easily and ignore that it bothers me. \n\nThank you for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pa65a2/day_10_deciding_to_be_better/", "title": "Day 10: Deciding to be better", "social_network": "reddit", "user": "Ohboyburgers", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1629744425, "permalink": "/r/DecidingToBeBetter/comments/pa65a2/day_10_deciding_to_be_better/", "nsfw": false, "first_save": 1635438046.8663638, "replies_charged": false}