{"id": "t5_2tand_t3_mq02sk", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "I’m 21, I’ve wasted way too much time already, I come home from work, rub one out, play some games and do it all over again. I stay inside and decide that I don’t want to grow up and tackle the outside world because it’s scary and a fucked up place. \n\nHowever, this fucked up place has a lot of fucked up people. people who are hurting and people who hurt others, people who have lost those closest to them and struggle everyday, people who live on the streets because they have no where else to go, people killing themselves because they feel they have no one left. \n\nI can’t replace what someone lost, I can’t help those who decide they don’t want help, I can’t relate to those who struggle because I don’t struggle myself, I can’t be there for everyone, I can’t help everyone.\n\nBut I’m going to try\n\nI want to be a light to everyone I meet, I want to make a random persons day by complimenting them. I want to make someone smile. I want to make someone laugh so hard that they pee themselves. I want to be someone that people feel they can be comfortable around. I want the people who remember me to also remember the feeling they got when we interacted. I want those who know me and are hurting to know they can talk to me, and that I’ll listen to them. \n\nI can’t be a light that replaces or get rid of the darkness, but I want to shine so brightly that the darkness itself becomes brighter. \n\nI don’t exactly know where to start, or how to do it, I have bad social skills and I’m shy, but I don’t want to lose my motivation and my reasoning, so I’m not sure if this is the right subreddit but I plan on posting something every week. Something that shows my efforts towards my goal. I’ll be going on a trip tomorrow and I think I’ll start there, I don’t talk to my family much, but I need to be better to them.\n\nWish me luck!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mq02sk/i_need_to_change_i_want_to_be_a_light_to_everyone/", "title": "I need to change, I want to be a light to everyone I meet", "social_network": "reddit", "user": "Diggydog323", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2010, "down_vote": 0, "creation": 1618312334, "permalink": "/r/DecidingToBeBetter/comments/mq02sk/i_need_to_change_i_want_to_be_a_light_to_everyone/", "nsfw": false, "first_save": 1635436199.775187, "replies_charged": false}