{"id": "t5_2tand_t3_jeyg9e", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I was extremely depressed and sucicidal for most of my childhood. Eventually I stopped blaming myself and directed my feelings towards my mother when I was 16ish. When I was 17 I went to live with my dad and I instantly started to improve. Somewhere around this time I built up some insane walls. I had friends and I was social at times, but it was only when I wanted to, which wasn't that often. At most once a week. I was careful to keep my distance from others. I was very private about my life. I preferred to live in the moment. I was comfortable with being by myself. If I wanted to do something I went and did it. Ive traveled the world and made some amazing memories, but most of them were by myself.\n\n\n\nIve neglected so many friends and relationships over the years. I never had the need for a romantic relationship. If a person showed interest in me, I did my best to avoid them. Im amazed Ive hung on to as many friends as I have. \n\n\nLast year I meet someone and it shattered everything. My walls were completely destroyed. I was completely overwhelmed with unfamiliar feelings. I realized just how lonely I was. Sadly, we decided to just be friends. While I was completely heartbroken I am thankful they are still in my life. \n\n\nThey really made me reflect on my past and realize how distant I've been to some of the best people I've had the privilege to know. Its time for me to fix this. I started therapy and I've realized that my independent lifestyle was a lifestyle rulled by fear. I was so scared of intimacy. I am still scared of it, but at least I acknowledge it now. Im hoping to reconnect with past friends and I look forward to new ones. Just one step in front of the other and I'll get there. I look forward to being the person I want to be.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jeyg9e/finally_starting_to_let_others_in/", "title": "Finally starting to let others in", "social_network": "reddit", "user": "dopiertaj", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1603227433, "permalink": "/r/DecidingToBeBetter/comments/jeyg9e/finally_starting_to_let_others_in/", "nsfw": false, "first_save": 1635437854.4456072, "replies_charged": false}