{"id": "t5_2tand_t3_hkdg4n", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Hi! So I am new to this subreddit. It sort of sucks that I am saying this, but I really do think I am a toxic person. I think as a kid, I didn't necessarily have the best childhood and I sort of noticed the way my parents favored my siblings( males), i am a girl, over me and sometimes excluded me. I don't want to use this as an excuse for my behavior, but I think I internalized this and let it affect the way I act. As a child, my mom would tell me that no one would love me, and always blame things on me when my brothers would be clearly in the wrong, and stuff like that. She's sort of grown past this and realized it, but she hates to admit it and sort of denies it. Again, I don't want to excuse my behavior. I just hate how I seem to drive people away and I don't do it intentionally. I also have all this anger and sadness just bottled up in me and I don't want to live that way. I just want to be better and I don't know how. I promised myself multiple times to be better, but I just revert to my old ways. I honestly just wish I had someone to talk to. I have severe trust issues and don't have anyone to talk to about anything that isn't positive. Also, I only seem to notice that my attitude and anger is more prevalent around my family. Around my friends, I am okay but I just hide a lot of things especially my mental health and things that bother me or make me sad. I honestly don't know where I am going with this post, but I want to put it out there so I can hold my self accountable.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hkdg4n/i_realized_i_am_toxic/", "title": "I realized I am toxic....", "social_network": "reddit", "user": "tayliaa", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1593754303, "permalink": "/r/DecidingToBeBetter/comments/hkdg4n/i_realized_i_am_toxic/", "nsfw": false, "first_save": 1635436519.5134974, "replies_charged": false}