{"id": "t5_2tand_t3_lkd85t", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I haven’t cut myself since December 2019. We are in February, 2021, yet when my brain is pushed to its limits, it will always “go there” and make me question if I should relapse or not. I know this is part of the healing process. I know cutting is an addiction and just like addicts who stop using drugs for years and years, still have to deal with possible relapses, cutting is no different. \n\nMy thing is, I’m a more positive person now and live a more positive lifestyle. I work out 4 times a week, I lost 5 inches on my waist in a year, I eat healthy and pray and meditate twice a day. I am spiritual and sage my house often. I wear wrist malas everyday to remind me not to hurt myself and that I am loved/life has purpose. I’m prescribed medical marijuana for my ptsd and trauma and get to medicate legally. Yet no matter how positive I get, my brain will always scream at me, “cut yourself” if I feel pained or very overwhelmed. I usually meditate to make the urges for away or I take my medicine but they always come back. Last night, after Valentine’s Day dinner with my boyfriend, I got too drunk and we had a fight. He had the spend the entire night trying to calm me down because I was dead set on trying to cut myself. I woke up this morning with all the knives hidden. He hasn’t done that in over 2 years. Why am I like this? Can I not even drink alcohol without going crazy? \n\nI just feel like I shouldn’t even drink because getting drunk makes me impulsive and that was my biggest thing with cutting; just doing it, without even checking my brain or questioning the logic behind it. Just letting emotion consume me. Even when I’m sober, if I feel like I need to dig through my tool box of coping skills, my brain will always tell me that cutting is still in that box even though I have better options than cutting 100% of the time. When will I finally heal? When will I reach a point where I won’t even consider cutting myself? I come off as a hypocrite to my friends and family because one week I’m doing all these positive things with my life and I post positive quotes and projects online, and then the next week, I inbox them or call them, telling them I want to die and I feel like cutting myself for whatever reason. It’s like I’m not even doing better at all on the inside even though I’m taking the healthy steps to change my life on the outside. What do I do to finally become better and beat this sickness? Please help.\n\nEdit: wow guys thanks so much for the overwhelming support. Thank you for the awards too, but the advice that is down here is worth so much more than internet awards. I will comment on each of them once I’m back home from work. I love this community and I’m thankful for all the people/survivors/kind people that gave my question a shot and answered. 🙏🏾 Thank you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lkd85t/i_havent_cut_myself_for_over_a_year_how_do_i/", "title": "I haven’t cut myself for over a year. How do I continue to maintain this long-term though? My brain still considers it as an option whenever I’m very low, even though it’s been a long time since I cut.", "social_network": "reddit", "user": "HealthyMmm", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 703, "down_vote": 0, "creation": 1613394094, "permalink": "/r/DecidingToBeBetter/comments/lkd85t/i_havent_cut_myself_for_over_a_year_how_do_i/", "nsfw": false, "first_save": 1635435791.3362145, "replies_charged": false}