{"id": "t5_2tand_t3_hje5jb", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Hi, I’m 23 years old and I’ve never once worked out or adjusted my diet or anything. (I’m on mobile so apologizes if this is formatted funny).\n\nMy parents (who are great people) are overweight and growing up I only ever ate pretty crap foods. I only really learned how to cook pasta. I now live with my boyfriend and he’s also overweight, but does try to help himself. He’s taught me how to cook healthier dishes and such. I will have ADHD and medication which causes my appetite to not be too big so my weight has never really been a problem. (I’m 5’6” and weigh around 145 lbs, which is the biggest I’ve ever been, up until last year I was max 128lbs).\n\nHowever, what is a problem is I’m extremely weak. Like I get winded going up any stairs and can barely carry in groceries because I have no strength. I work from home now and never leave my apartment and I don’t know how to improve it. Gyms are terrifying (especially now because of the pandemic) and I’m moving across the country in August so it’s not like I can join one right now. \n\nI’m get so anxious and stressed because I have no idea how to start working out or maintain working out and am really not sure how to even begin this. I know if I don’t start working on healthy habits my metabolism will wear off as I get older (it already has started) and I’m terrified of becoming complacent and taking on my parents lifestyles and becoming extremely overweight. \n\nSo I guess my question is, how do you start working out/healthy living when you can’t join a gym or anything and have never done any of it before? I don’t have any friends/people to help me stay accountable either so I’m terrified of starting and not keeping it up.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hje5jb/im_extremely_weak_and_i_dont_know_how_to_help/", "title": "I’m extremely weak and I don’t know how to help myself but I want to", "social_network": "reddit", "user": "gotmespacingout", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1593622611, "permalink": "/r/DecidingToBeBetter/comments/hje5jb/im_extremely_weak_and_i_dont_know_how_to_help/", "nsfw": false, "first_save": 1635436055.341487, "replies_charged": false}