{"id": "t5_2tand_t3_pttvjp", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "b69cf201-6737-4217-b486-9096135546b8"], "text": "So my story begins in a 3rd world African country. My childhood was pretty decent(except death of father when 4). So to provide for us my mom departed for the  USA and left me under the guardianship of my granny. I was really good at school mainly due to the fact that we got whooped thoroughly if we underperformed. So that fear kept me in line and my grades up. Fast forward freshman year of highschool I was 15 and a deviant teenager just like most teenagers and I became desensitized to the whoopings just like a hardened criminal would. Even if I got whooped it didn't phase me no more. That period in time was also when my p*rn and masturbation addiction began.\n\nAnd one of my great and numerous regrets is that I seeked acceptance and validation from my peers in HS. In the process becoming a class clown. And as you can predict by the end of sophomore year my grades were slipping down a slippery slope. My poor mom who was working 2-3 jobs to take care of us and who already had enough stress of her own, was getting worried and anxious for me. However, none of that mattered to me at the time.\n\nIn my senior year of HS my mom got me a Visa to come and live with her in the states since I was old enough to discern right from wrong and not be easily influenced just like a typical, cautious and conservative African parent's thought process would suggest. I experienced a huge culture shock when I got here, everything was different. The accent, the date format and even units of measurement. Overnight I found myself in a whole different continent. \n\nI stayed at home my first 4 months waiting for my documents to be processed. It was in this time I went from weighing 138 lbs to 210 lbs mind you am 5'7. I was overweight for the first time in my life. All within the space of 4-6 months. I was at home binging on nutella, chicken, milk you name it. My confidence and self esteem took a huge dive.\n\nI also developed a severe phone addiction, would you believe me if I told you I averaged 15+ hrs of screen time daily since 2017.  Through this I have been sleep depraved for the past 4 years. And my sleep deprivation started affecting me cognitively. I can't recall and store some memories and it even affected my balance, my fingers and feet involuntarily tremor. Despite all of this I am still not able to stop.\n\nAnother effect that trickled down from this chain reaction is that I developed a personality and speech disorder. Previously I was the textbook definition of extroversion. I was super social, I had like 100 friends growing up, was never afraid to approach someone and start a meaningful conversation. But now talking to a person seems like a gargantuan task. Am second guessing myself and then opting out of talking and asking questions. Anxiety was a foreign concept to me but now it's ingrained in my daily life. I have been here 4 years and yet to make a single friend.\n\nMy anxiety and phone addiction then turned to procrastination. I was putting off school work. Last fall semester I had a calculus class with a professor who I was familiar with. I took a previous stats class with him. My phone addiction and procrastination almost failed me that class. I had a C in midterm but I pulled my bootstraps in the final quarter and got an A. Thanks to the teacher dropping the lowest test grade and extending a crucial homework deadline. I got lucky. Imagine if that didn't happened. There were several classes that I would have aced if only I had put in a little bit of effort. \n\nAs of right now, as I type this it's 6.50 a.m and I got a class at 11.00 but yet am glued to my phone watching endless YouTube and surfing the net. I get visions of what am destined for sometimes and what am capable of achieving but without actions they remain only visions. I know what am supposed to do to make things right but it feels like am under some invisible mental shackles that I can't break from. The other day I came across a snapchat memories that I posted in December of 2018 that read the following. \"Am closing all my social media accounts and getting rid of my smart phone by JAN 14. The amount of time and energy I spent on my phone this year is crazy tbh I don't know how 2018 went by.\" Reading this had me in my feelings and bawling out. It's been 3 years since I posted that and nothing changed.\n\nI haven't had a job in a year. Overweight, low confidence, super anxious and confined to bed. Might I  also add a porn and masturbation addict. My brain juices are fucked. My dopamine levels are maxed. Am super disgusted with myself. If you told me I would be reduced to this 4 years ago I would have laughed you off. Am a shell of a person. A failure as of right now.\n\nAny tips, advice and suggestions would be highly appreciated. Thank you if you made it this far.🥰", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pttvjp/need_urgent_helpintervention/", "title": "Need urgent help/intervention 😪", "social_network": "reddit", "user": "zxd1738", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1632399233, "permalink": "/r/DecidingToBeBetter/comments/pttvjp/need_urgent_helpintervention/", "nsfw": false, "first_save": 1635435248.5074182, "replies_charged": false}