{"id": "t5_2tand_t3_m7e4w9", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Hey guys I’m Kevin. I’m 24 years old from NYC. I’ve been through so much with my OCD for almost four years now.. Where I had to leave college back in spring 2017.. I haven’t made it back to college since and I used this time to improve on my mental health, went through many therapist and I’ve struggled and wasted a lot of time until I found a therapist that specializes in OCD. Took me almost a year to help me get better.. I tried doing to a hospitality school that last for 6 months and I struggled with Social anxiety and I began to overthink a lot and a lot to the point that I left school. And saw a regular therapist for my social anxiety and I have group therapy for my OCD. So I worked on myself for a few months than Covid came and everything shutdown, than In August I applied and got the job at Home Depot.. I only spend a week there because at the position that I was doing as a cashier, I was a bit slow in counting the change and social anxiety getting in the way of things, so I quit after a week. And now fast forward to now, I’m now at the point where I really want to change and really improve on myself and get back on track and yes I’ve posted here before on this topic but now more than ever I really want to change and gain experience.. My friend gave me constructive criticism and told me about the friends that we know and told me, you’re the only one not doing anything and he knows I have OCD but he told for my own good, and told me that he needs to limit our time to talk because he wants to improve on his self improvement journey and he goes through Social anxiety.. So in part it made me realize that I’ve wasted time and now I’m 24 and entering my mid 20s of never dating, barely a job experience, and out of college since 2017. So, I have been volunteering for the past month now.. I’m gonna improve my Spanish even though I’m advanced but I really want to improve on my Spanish grammar and considering being a translator.. But not 100% sure on what I wan to do with my life.. I want to improve my social life and have more friends especially female and to start dating once I find a job and developing new skills and career.. I need to be more independent and not procrastinate a lot.. So I have lots to work on but I’m more than ever to change for the better. Thank you!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m7e4w9/hey_guys_im_24m_im_at_the_point_in_my_life_where/", "title": "Hey guys! I’m |24M| I’m at the point in my life where I really want to get better. I’ve been through Mental Health stuff like OCD, Social Anxiety and Depression, and I’m at the point where I’m in so much pain that I’ve really want to change and start living life to the fullest..", "social_network": "reddit", "user": "kevmart96", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 37, "down_vote": 0, "creation": 1616025145, "permalink": "/r/DecidingToBeBetter/comments/m7e4w9/hey_guys_im_24m_im_at_the_point_in_my_life_where/", "nsfw": false, "first_save": 1635435100.93166, "replies_charged": false}