{"id": "t5_2tand_t3_ju6l0q", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "The pandemic has caused some terrible impact in my life it has made regress to my worst self in a way and made me improve to my best self in another way.\n\nI don’t seem to have any control of myself, the trauma I’ve been having for the last 4 years, flourished and It’s so hard for me to deal with all the bad things that have happened to me. I try to wake up everyday work out, eat healthy, work hard at my job, study hard at school, but last month I’ve been drinking a lot, I don’t seem to have any control and I’ve been ignoring responsibilities and it sucks because I’m really trying with all my heart to be better, but I still feel like shit. Yesterday, instead of being a responsible adult, me and one of my best friends went on a bender, I’ve even let my friend to drink and drive we arrived at his home and wake his parents up, I’m still in my friends house and I’m so ashamed of myself, I don’t know if I should just leave but I wanted to talk to my friend heart to heart that we didn’t think right yesterday and we should really improve ourselves, once we are on vacations we could go out and have some fun, but we still have responsibilities we need to oblige for I will not let my addictive personality take control of me.\nI know I can be so much better than this, but the shit I’ve been trough keeps me wanting to be numbed and never deal with it. It’s just that it hurts so much that whenever I feel those feelings I don’t have to courage to deal with them and I numb myself with alcohol, sex, porn, whatever I feel in the moment and it hurts my soul because I know that I need to be better, I will never let myself and the people I care about make stupid fucking decisions. I will be better! \n\nAnyhow sorry for the long post, but I’m just hoping If someone has been trough a lot of trauma and stress know how to deal with those awful feelings and knows how to help ourselves and your friends from this shit!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ju6l0q/i_fucked_up/", "title": "I fucked up", "social_network": "reddit", "user": "Elegant_warrior", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1605378355, "permalink": "/r/DecidingToBeBetter/comments/ju6l0q/i_fucked_up/", "nsfw": false, "first_save": 1635436546.2434573, "replies_charged": false}