{"id": "t5_2tand_t3_pwr7t9", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Hi to everyone, \nA lot of time passed since I started my self-improvement journey and my mindset upgraded a lot together with my resolution to become a better person. Lately I've been facing more walls than I expected and living again with my family (University is still half online and I'll return living alone in November) proved to be a bigger drag than I thought. \nI've never asked help in my life but this time I've reached the bottom, I'm fed up with this dopamaniac (dopamine maniac) me and I need someone who feels in a similar way in order to help each other.\nToo many times I thought I could do it alone but I'm tired of my mind's lies. \n\nMainly I'm searching for someone (I don't care if this person is male or female or whatever) who is in a similar situation or someone who overcame it. My idea would consist in sending each other daily reports based on the accomplishments of the day which should be related to long term goals (maybe a peer would be more suited).\n\nSome of my goals are:\nBeating dopamine\nFinancial freedom (trading, side hustles, dropshipping, etc..., this is really important)\nPeace of mind\nLearning how not to give a fuck of other people's judgement \nGym and physical activity (I'm more and more a gym rat)\nKnowledge in general\nLearning languages \n\n\nI gladly welcome philosophical conversation and psychological support if needed (however at your own risk, I'm quite too direct but I'm good at solving problems)\n\nIt's pretty much all,\nThanks for reading and if you want to start this idea comment here or send me a message.\n\nIf you read but you're not interested, no problem however if you have something to say (opinions, ideas, suggestions) feel free to comment.\n\nThanks again,\nFMM", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pwr7t9/needing_a_selfimprovement_partner_or_mentor/", "title": "Needing a self-improvement partner or mentor", "social_network": "reddit", "user": "FMM00", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1632778549, "permalink": "/r/DecidingToBeBetter/comments/pwr7t9/needing_a_selfimprovement_partner_or_mentor/", "nsfw": false, "first_save": 1635438311.3666604, "replies_charged": false}