{"id": "t5_2tand_t3_pga1jv", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "I’m 22 and I graduated college in May of 2020, right at the start of the pandemic. I’m currently living with family to save money. I have a remote job in tech making about 70k a year. About 29k in student loans. I feel lost because I don’t know what to do next or where to go. All of my friends moved to new cities because of work, so they were forced to start a new life in a different place. Because I work remotely, I don’t know what’s next. I sit at home everyday and work, don’t see anyone because I have no friends here, and it feels like I just wake up and do the same mundane routine every single day. My company allows me to work from anywhere. I have a co worker working from Barcelona right now for a few months just for fun. I think it’s time to leave home, but to where? I feel like everyone says your 20’s is about learning more about and finding yourself, but how do I even do that? All of your younger years you focus on getting into a good college then, then getting a good job, but after that’s said and done, what do you do? What am I working towards? I feel like I don’t have any hobbies. I’ve been thinking about packing up and jumping around europe for 6 months and just seeing what happens, but I just feel scarred to leap into the unknown with no plan. What am I planning for? What goals am I trying to achieve? I know I should not thinking about planning or goals right now and just try to live in the moment, but that’s hard for me to do.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pga1jv/my_life_feels_directionless_and_i_dont_know_what/", "title": "My life feels directionless and I don’t know what to do next", "social_network": "reddit", "user": "turtlecove11", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1630554520, "permalink": "/r/DecidingToBeBetter/comments/pga1jv/my_life_feels_directionless_and_i_dont_know_what/", "nsfw": false, "first_save": 1635436784.1647234, "replies_charged": false}