{"id": "t5_2tand_t3_hxtuxu", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I am in the last year of university and had a challenging 4 years. In the country I live exams delayed and finally I got the last exams. And it does not look good. All of my 16 courses I failed 4 of them and I have to repeat an entire year. In the last couple of days, I made myself comfortable with the idea. Instead of having stressed and shaming myself to depression, I am accepting whatever happens. Because I still have %1 chance to pass--- ıt is an average issue and I dont know the grade of an exam.\n\nBut if I fail I wanna use this year to my advantage. I had been a very successful student for years, last four years I had babysat my little sister(as yesterday 5 yo). Now she will start school in kindergarten I guess.\n\nWhat are the habits and goals I can set for myself this year? I also wanna give you all some context.\n\n* I want to learn to speak French and/or Spanish \n* I always wanted to publish a book but school/taking care of my sister/part-time job trio was an issue. And now I feel like I do not know how to write. It used to come so easily. But I even didn't read any fiction books for almost a year or so. Everything I write sounds like It came from a property law book. No one wants to read that sh\\*t.\n* I want to earn some passive or limitly active money. (I have no skills)1$=6.8 ₺ and I earn only 8₺ in an hour. I also have around 8k ₺ debt. \n\nI would appreciate any advice or road to achieve some this goals or others. I am open to trying new things. I wish I could also open myself to travel this year but the whole world situation doesn't help.\n\nThank you for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hxtuxu/i_am_not_graduating_this_year_so_i_want_to_use/", "title": "I am not graduating this year so I want to use this year to my advantage. What can I do tomake that happen?", "social_network": "reddit", "user": "daybreak530", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1595709752, "permalink": "/r/DecidingToBeBetter/comments/hxtuxu/i_am_not_graduating_this_year_so_i_want_to_use/", "nsfw": false, "first_save": 1635435131.6631255, "replies_charged": false}