{"id": "t5_2tand_t3_olxiby", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": "Hi all,\n\nToday marks my 5th day abstaining from smoking weed, drinking alcohol, or another vice of mine which I’ll leave blank for now. I work in a corporate setting and have been pretty burnt out from the pandemic. I have honestly just been rolling out of bed but not really being an active participant in my own life. My team has undergone some drastic changes since the pandemic as  well as my company entirely. \n\n I’m 25, grew up in a pretty poor family and so I’ve held this constant stress on myself that I need to make a lot of money to support my parents and make sure they are taken care of as they are aging. I mention this because at work I’ve been trying to get a promotion but have been unsuccessful due to a reason I won’t go into (but just note it’s not performance related according to my leaders, more so external factors). I’ve struggled with anxiety and depression my entire life but obviously the pandemic ramped it up to extreme levels and couple that with imposter syndrome I feel like I’m kind of in a perfect storm. \n\nBefore the pandemic I was so motivated looking to do a certification and then go to graduate school. I since have scrapped the certification plan and tried to study for my entrance exam for graduate school but just haven’t been able to get into it really. I want to go back to that motivated person I was but it just feels so hard. I feel hallow inside at times and honestly have had some dark thoughts (I do take anxiety meds). \n\nI guess I’m just looking for an outlet at this point. I go to the gym and sure it helps but just doesn’t feel the same. Sorry for the long rant I think I just needed to vent it out somewhere.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/olxiby/battling_depression_anxiety_and_fillers/", "title": "Battling depression, anxiety, and fillers", "social_network": "reddit", "user": "Joshg23", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1626496677, "permalink": "/r/DecidingToBeBetter/comments/olxiby/battling_depression_anxiety_and_fillers/", "nsfw": false, "first_save": 1635436299.836535, "replies_charged": false}