{"id": "t5_2tand_t3_ndwll1", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "I've been pretty much single my whole life - a handful of casual fun relationships, just sort of, enjoying myself. Its been good I've enjoyed it, and I enjoy my own company. However I got myself into a very serious but also fun relationship a while back, it felt, very good, I thought I'd found my person, I got sober, we had a lot of fun together for around 8 months or so, made a lot of plans, felt like she was it for me. However a couple months back she decided she needed to get back with her ex. Which left me devastated - first heartbreak at the age of 35!! Man. It sucks. I'm trying really hard to move on tho, we have pretty much cut contact, I'm getting more exercise than I ever have before, signing up for classes, etc. Suddenly tho, I find myself in a position I never was in before - I feel like, now I know how good it feels to be in a relationship with someone you truly deeply love -- I just want that again (obvs ideally once im over her :/) . I live very rurally and I'm pretty queer so most folks around here just are a different vibe to me, lot of hicks, blokes and hillbilly types. Moving is not an option for me I'm tied to the land here. I knooowww people say shit like love comes when you least expect it blah blah blah - all I can do is work on myself etc-- I'm just struggling a bit to imagine a fulfilling and good life as a single woman (something I want to work towards as it feels like kind of the only thing I have control over?) WHEN NOW I KNOW WHAT IM MISSING OUT ON by not being in a relationship!!\nAny words of advice out there ?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ndwll1/heartbreak_how_to_be_happy_single/", "title": "Heartbreak, how to be happy single...", "social_network": "reddit", "user": "maidensnakes", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1621195329, "permalink": "/r/DecidingToBeBetter/comments/ndwll1/heartbreak_how_to_be_happy_single/", "nsfw": false, "first_save": 1635437263.2625926, "replies_charged": false}