{"id": "t5_2tand_t3_kotiw0", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "**Hi dear friends! I wish you all a happy new year!** 🎁🎄🎉🎊\n\nI hope you're all doing well and going strong in every aspect of your lives! and if Not, It's Ok I'm here with you and we'll try to fix that!\n\nThis is the first time that I'm gonna write anything here, so this will probably be a long article and not a flawless one since English isn't my first language but I hope you find it helpful!\n\nFirst I'm gonna talk a little about myself and my journey. I'm 24 years old and got my bachelor's degree in computer science last year and currently studying for the national university entrance exam for master's degree for the second year in a row because I didn't get the results that I wanted last year. I was never a hardworking kind of student, I was always told that I'm smart by my parents but they've never told me about the importance of hard work so that led me to the delusion of :\n\n\" It's Ok you're Smart so you don't have to world hard as others! \"\n\nI grew up in a religious and stressful family where my dad was the type of a bad tempered and self-righteous person who always had a lot of reasons to get angry and my mother was the loving and caring one who was always trying to protect me. Don't get me wrong they both love me equally it's just that my father didn't know how his behaviors could've affected me in a destructive way which it certainly did!\n\nTo be honest I'm not blaming them because that's just the way most parents were and were taught that way , that means I've had to learn these lessons the hard way and by myself like many of you!\n\nI've learned a lot during these trials and errors and I've developed a Lot, I'm sure these tips can be helpful to some of you and can be used in your Life in order to build a better version of yourself!\n\nSo here we go :\n\n&#x200B;\n\n**1. Be Grateful**\n\nYou cannot be completely happy in your life if you're not already aware of what you already have! Why? because you're always chasing something you don't have and even after getting it, it's the same damn cycle over and over again!\n\n\" I'll be happy when I get rich! \"\n\n\" I'll be happy when I cracked that exam or got that grade! \"\n\n\" I'll be happy if only he/she behave me better \"\n\n\" I'll be happy if my parents be that way \"\n\nPeople Please! Stop bullshi\\*ting yourself!\n\nLife is a journey, Not a Destination! so learn to enjoy all of it.\n\nMake a list of everything that you've been blessed with in your life and look at it every morning. You have to always appreciate what you have **While you still have it!** Don't take everything for granted, celebrate every breath, Be thankful!\n\n&#x200B;\n\n**2. Your Past Doesn't Define Who You Are**\n\nWe all have our regrets and fuck ups in life, Nobody's Perfect! But just for a minute sit and think about how exactly can you change that if you keep thinking about it for countless hours, days, months or even for years for someone like me! It's Past, It's Gone!\n\nDo you really want to sit again in a month, a year or even 10 years and regret about the days you're wasting now? Don't let your mind be wandering all the time about could haves and should haves of your life!\n\n&#x200B;\n\n**3. You Cannot Control Everything**\n\nOne of the things that led to my failure in last year's exam was the fact that **I wanted to be Sure** about the outcome and tried to control it like I did with many other things before that. But it doesn't work that way and it doesn't need to be. Thinking about the things you cannot control will only lead you to become more stressful and anxious over the time and it'll really affects your productivity!\n\nWhenever that you find yourself thinking too much about something that it's out of your control simply let go of that and **see what can you control** in that area and start working on it!\n\n&#x200B;\n\n**4. Love Yourself For Who You Are**\n\nAs I've mentioned before, Nobody's perfect! So why even bother seek perfection? We all have our flaws as well as our beauties. If you're not satisfied with yourself how do you expect others to love you? Nothing is more destructive than a Bad self image. Learn to acknowledge your beauties, and let go of the things that you cannot change in yourself. Believe me no one will ever critic you as bad as yourself!\n\n&#x200B;\n\n**5. Surround Yourself With Positive & Successful People**\n\nRemember that **others people don't define you!** But it's very important whom do you hang around with! as the saying that goes **\" Show me your friends and I'll show you your future \"**\n\nhanging with these kind of people will lift your sight and standards drastically, on the other hand you should stay away from negative and small minded people! Being around them will simply discourage you. If you can't get away from them (they're family), encourage them to change their perspective of life but don't waste too much time and energy for a person who doesn't believe or don't want to change.\n\n&#x200B;\n\n**6. You Don't Know Everything And That's Ok**\n\nThe delusion of being a mastermind in everything only leads you to failure and misery. Being aware of the fact that you don't know everything motivates you to keep learning and seeking help from others (not every person!) to help you grow and see your problem through other perspectives.\n\nRemember that you are not Always Right!\n\n&#x200B;\n\n**7. Develop The Right Mindset**\n\nMindset is everything! Doesn't matter how much you've tried or accomplished, If you don't have the right Mindset you'll be back to square one as soon as the first setback or relapse hits you in the face! Always look at how far you've come instead of how much you have to go, Practice positivity in every situation, turn your weaknesses to your strengths. everybody has setbacks and relapses but the winners are those who know how to learn and recover from it not to sit and cry for themselves!\n\nSome people may misunderstand being positive with being unrealistic but remember everything will appear \" Unrealistic \" to a limited mindset!\n\n&#x200B;\n\n**8. Better Habits Leads To Better You**\n\nMotivation is what gets you started but Habit is what keeps you going!\n\nMost of us know what is good for us and what should be our habits but it ain't worth sh\\*t unless you actually make a plan to make you life better and act on it. But don't overwhelm yourself with a lot of work to do at once! Work on one thing to improve at a time. You can progress faster as you go forward and become more disciplined and organized.\n\n\\- Fixing your sleeping schedule.\n\n\\- Meditating everyday in fresh air, Reading more self-improvement books rather than binge-watching hours & hours of Netflix or YouTube.\n\n\\- Exercise daily for at least 30 minutes at any cost! (Super Important!)\n\n\\- Eat only about 80% percent of your stomach, Drink more water, Avoid junk food\n\n\\- Limit social media as much as possible (You'll be alright after a few days trust me it's worth it!)\n\n\\- Start your day with a small task done such as making your bed.\n\n\\- Never ever start your day unplanned even if you don't have many specific tasks for the day. Use a notebook or a task management app to write everything that you wanna do that day.\n\nThere are so many more worth to be mentioned, make a list of what habits you want to develop and bring them into action one by one!\n\n&#x200B;\n\n**9. Forgive Yourself For The Mistakes You've Made And Move On**\n\nOur mind & body has a limited amount of energy per day. Thinking about your mistakes constantly doesn't change the fact that you've made them but it'll certainly consumes a huge amount of your daily energy and then what'll happen? You'll do nothing that day and find yourself saying to yourself at the night :\n\n\" ah sh\\*t ! here we go again ! I might as well procrastinate and start tomorrow ! \"\n\nRemember, there is no such thing as failure and mistake as long as you **Keep Learning** from them and trying not to repeat them again!\n\n&#x200B;\n\n**10. You're 100% Responsible For You Life**\n\nI guess many of us get used to keep looking for something or someone to blame whenever sh\\*t doesn't go well in our life, right?\n\nAs long as you have not fully accepted that you're the only sailor of you ship, Nothing will change in your life and if something does you wouldn't even notice it!\n\nBe completely honest with yourself and think about every failure and relapse that happened to you, were you in charge of doing it or did anyone tied you in front of your screen while threatening you with a gun, making you to watch porn and masturbate? yep that's what I've thought!\n\nI can guarantee you can find something you could've done better in everything that you failed at!\n\nAnd even if there's some external forces and other things involved you still have a full control over making your choices based on the situation, So don't lie to yourself!\n\n&#x200B;\n\n**11. It's Not Always About You**\n\nYou should be realizing that every person that you meet is fighting a battle that you know nothing about! So don't be so quick to make everything about yourself, Don't judge people easily!\n\nLearn to Listen better and you'll understand better.\n\n&#x200B;\n\n**12. Be Humble**\n\nLife has many ups and downs so Never ever ever look down on anybody because you don't know how bad you may fall yourself one day!\n\nBe kind, Forgive others, help them without expecting anything in return!\n\nI Promise It will return to you!\n\n&#x200B;\n\n**13. Focus On Today**\n\nTo be honest I rather say only focus on your next hour!\n\nYou should have plans for your future and no one is denying that but focusing on anything more than your following day and hours has a great chance of stressing you out and making you more nervous!\n\nTake one step at a time, make a list of what you wanna do for the day, finish the ones which can be done in less than 2-5 minutes first and then take care of the rest with a more clear mind!\n\n&#x200B;\n\n**14. Create The Right Environment**\n\nDon't expect yourself to be fully functional when you're sitting in a chaotic room!\n\nBetter Lighting, Air conditioning, organized desk and etc. will all majorly help you to focus & work better for longer periods of time!\n\n&#x200B;\n\n**15. Get Comfortable With Being Uncomfortable**\n\nIt's funny how we don't give a pass to others easily whenever they do against our desire, but we keep giving ourselves passes without hesitation!\n\n\" I've procrastinated today so I'll keep doin' it and start from tomorrow! \"What happens after? ---> \\*procrastinates for a week straight\\*\n\n\" It's October 28th, I will relapse everyday until November starts! \"What happens after? ---> \\*relapses on November 3rd\\*\n\n\" It's 9:34 AM I'll study at 10:00 because I'll get cancer if I start right now it has to be at 10 sharp! \"What happens after? ---> \\*gets laziness cancer\\*\n\n\" I'm really overweight and I have to start exercising but let's just finish this pizza right now! \"What happens after? ---> \\*whines about getting rejected by every girl in a 2000mile radius\\*\n\nDo you wanna see massive changes in your life? then Say goodbye to your comfort zone, NOW!\n\nLife means nothing if you don't take Risks!\n\n&#x200B;\n\n**16. Set Goals That Move You Everyday (Even Scare You!)**\n\nHaving high aspirations and big dreams is a must for life, You may have heard about S.M.A.R.T. Goals = Specific , Measurable, Achievable, Realistic, Time-Bound\n\nThese are some good rules to follow in my opinion.\n\nYou should exactly clarify what you want otherwise it'll remain just an idea in your mind and you'll have no idea how to break it down into smaller doable chunks. Don't tell yourself earning a million dollars in not achievable and realistic so I cannot put that at my list!\n\nIf anybody has done it before then it falls into S.M.A.R.T. category.\n\nSo don't make lazy ass excuses!\n\nAlso don't forget to Visualize yourself when you've achieved them! If you can visualize yourself achieving it, that means it's meant to happen and just needs your effort! and if you can't visualize, it means you still don't know what you're capable of!\n\n&#x200B;\n\n**17. Be Hungry - Hard Working - Patient**\n\nJust having a goal doesn't mean that you'll achieve it no matter what! regardless of how big it is,\n\nIt's all about how bad do you want it, how hungry you are, how many hours are you willing to put into that to make it happen and **most importantly** how patient you are! Because if you lack any of those you'll not last the first 2-3 failures & setbacks!\n\n&#x200B;\n\n**18. Lower Your Expectations of Yourself**\n\nThis may seem completely opposite of the last two tips but hear me out first, you should understand that you're not a robot or machine, You're a Human! You'll get tired, you'll get discouraged, you'll burn out, you'll lose faith, you'll get to a point when you just wanna Quit.....\n\n**But!** you have to realize that you're trying your best and know when to quit and take a break!\n\nKnowing that under what conditions or rules you function best is essential in order to not feel guilty when you need to take a break. Enjoy it and then get back to work stronger!\n\n&#x200B;\n\n**19. Talk To Yourself Everyday**\n\nMany people are naturally confident or have a sense of self worth either because of how they raised or what they've accomplished! But what if you're someone who doesn't have either of those?\n\nIn that case you'll train yourself, you'll help yourself and you'll talk to Yourself for every goddamn day until you believe it!\n\nMake a list and read it for yourself every day, write things such as I'm smart, I'm this, I'm that but only things that'll boost your f\\*cked up self-esteem!\n\nAnd you don't have to be realistic! because your reality certainly hasn't paid off for you!\n\n&#x200B;\n\n**20. Life Is Not Fair**\n\nOne of the things that saved me of lot of overthinking and bullshi\\*ting myself was realizing the fact that Life isn't fair and it will never be! You'll fail more often, but knowing that nothing has to change in universe in order for you to be more successful is necessary. You don't need luck, Try harder, plan smarter, Be aware of your mistakes and identify the cues and triggers and luck will keep coming to you, It's Simple as That!\n\n&#x200B;\n\n**21. You Always Have A Choice**\n\nI'm sure that a lot of my tips are complement to each other and that's totally normal.\n\n2020 is gone and all the years before that, But from this moment on you have to choose how you want to spend your seconds, hours, days, months and years! and you always, always have a choice!\n\nWhether it's denying an urge to procrastinate for one more hour or making a career changing decision, both will still have an effect on your life. So don't overthink about what could go wrong, a little stress may be good for you to keep you from being totally careless but don't let that sabotage your mind guys!\n\nMake your days count instead of counting them, The best is yet to come Believe me!\n\nMy exam is on May 28th (About 146 days), I'll promise myself and you guys that I'll not make the wrong choices this time!\n\nWish Me Strength ❤ Thanks For Reading\n\n\\+ Don't Settle for Being Average, You are Phenomenal! +\n\n&#x200B;\n\n\\*Edit : Thanks for your kind comments, I feel there's something else that needs to be more highlighted here :\n\nMy dear friends, Knowing about all these tips and reading self improvement books and more, is great but none of them would even make any difference if you don't **Act** on them!  \n\nA person who acts but doesn't know much about these kinda tips & hacks is miles ahead of someone who has all these knowledge and doesn't apply it make his/her life even slightly better, because the one who acts will eventually learn more and more!\n\n I wish nothing but the best for you! ❤🙌💯", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kotiw0/21_tips_for_building_a_better_you_in_2021/", "title": "+ 21 Tips for Building a Better You in 2021 +", "social_network": "reddit", "user": "Floydddd47", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 34, "down_vote": 0, "creation": 1609573777, "permalink": "/r/DecidingToBeBetter/comments/kotiw0/21_tips_for_building_a_better_you_in_2021/", "nsfw": false, "first_save": 1635435576.1848192, "replies_charged": false}