{"id": "t5_2tand_t3_p9s2am", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "Hello all,\n\nI just wanted to share kind of a breakthrough moment for me.\n\nI'm... messed up. My father was abusive and my mother was emotionally neglectful, so I've had a lot of mental issues for a while. The main one is horrible anxiety, and just a ton of self preservation. My father would always tear me down by telling me to \"not be so proud\" and made me apologize for things I genuinely wasn't at fault for. I grew very guarded, feeling an intense need to protect my truth.\n\nSo, my sister and I argued. It wouldn't be the first time, of course, but most times it would end with us saying nasty things and not talking to each other for a few days until we were cooled off. The whole weekend had been tense since we were moving to university, and stress was high. Needless to say, we were frustrated at each other.\n\nThings escalated tonight when everything kind of overflowed. We had issues with the toilet and my anxiety seriously betrayed me. I said some really nasty things and, although she countered, I was being the meanest by far. She walked away and I was determined to stick to my guns and ride out the days of tension. I even started typing up a whole post on whether I was the asshole in this scenario. My thoughts started getting out of hand, my mental health was all over the place, and I just... I decided that it wasn't worth it. \n\nI apologized. Properly. I said that it was stupid, and that I didn't mean the things I said. I said I felt bad. I said that it didn't matter if it was my anxiety since I have to take accountability regardless. I said the words \"I'm sorry.\" And you know what? It felt good. She forgave me. She understood, and thanked me for apologizing. She told me that next time we're stressed, we should just talk. She even recommended watching a TV show together whenever we get the chance.\n\nI don't know. I wasn't convinced that I'd ever be posting something positive on this subreddit. You need to understand that we're very emotionally withdrawn people because of our upbringing. We don't cry and we don't talk about our feelings. So this was really big. Just wanted to share. Thanks for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p9s2am/i_apologized_and_she_forgave_me/", "title": "I Apologized, and She Forgave Me", "social_network": "reddit", "user": "ApplePaintedRed", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 26, "down_vote": 0, "creation": 1629691480, "permalink": "/r/DecidingToBeBetter/comments/p9s2am/i_apologized_and_she_forgave_me/", "nsfw": false, "first_save": 1635437625.6193147, "replies_charged": false}