{"id": "t5_2tand_t3_q2c962", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "b69cf201-6737-4217-b486-9096135546b8"], "text": "I am a 30 year old male. I used to love playing music. And I still do.\n\nBut I don't have free time. I have two kids, a wife, a house, and a full time job.\n\nI wanted my life to look different but I kept being patient and doing what I felt was \"right\" in life by others standards.\n\nI wanted to play music with my friends well into my adulthood. I still do but it's not as much as I'd like.\n\nI work hard at trying to \"make it\" in music but I feel like I will never be able to tour or make my living off of music. Or I fear that by the time I reach that stage in my career I won't even want it anymore.\n\nI feel bitter toward young artists who get lucky because I wish I was them. I wish I was 19 again, but this time with a booming music career ready to write and create for the rest of my life.\n\nAll I want is to create music and I am stuck working a full time job and taking care of my family. I recognize that I have good things and I am trying to see that as positive. I just always felt that music was the #1 most important thing to me, and now it is squashed down to almost nothing.\n\nI don't want my son to resent me like I resent my father, so I want to be a good example to him and teach him better than I was taught.\n\nI don't want my wife to regret marrying me, so I do my best to be a good husband and care for her needs. I communicate with her but, while she tries to be supportive, she also gets very frustrated with me chasing after music from time to time.\n\nI do love my family. I just wish that I was opened to more creative possibilities when I was a child. I would have learned more young and thrived as an adult. I was very talented from a young age but never knew how to market myself. I never believed in myself because I was taught not to.\n\nInstead of having my eyes opened to possibility as a young adult, I was taught that nothing matters except for \"Jesus\" and that I could never make a living from doing something creative like music.\n\nI was taught that liberals are always wrong and conservatives are always right, without much explanation.\n\nI was taught that Hollywood is of the devil, the public education system is wrong, and so many more lies.\n\nI now hate religious upbringing and resent my childhood. I hate conservatives and I envy creatives who got it right early in their careers.\n\nI am going to counseling and I need to bring these points up to my counselor. I need to feel out what my next step is in life. I need to work on enjoying the moment while working towards my dreams. I need to work on enjoying my family while working towards my goals. Balance is hard.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q2c962/i_need_help_not_becoming_a_bitter_person/", "title": "i need help not becoming a bitter person", "social_network": "reddit", "user": "MusicianMusician", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1633491214, "permalink": "/r/DecidingToBeBetter/comments/q2c962/i_need_help_not_becoming_a_bitter_person/", "nsfw": false, "first_save": 1635435219.6559892, "replies_charged": false}