{"id": "t5_2tand_t3_9y714b", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Recently I realized how there is an overwhelming amount of  distractions for us. Especially for me and those living in a elite  positions where we have access to an unlimited selection of tv shows and  movies at one’s disposal – not to mention high speed internet where one  can go on and do whatever they want on there.\n\nI’ve been questioning me and my position as an ‘elite’ lately.  Meaning, me as someone who can – and does live at times –  overly-indulgently. How essentially living and being in such a position  is quite a good trap for the world system and consciousness in keeping us preoccupied by indulging constantly in these luxurious.\n\nLike I have access to three tv streaming services, with a plethora of  my favorite shows. It is almost too easy to just indulge and forget  everything, and I am beginning to look at how these streaming services  are designed to keep us elite humans entertained and happy while we  forget and lose touch with the real problems going on in the world. *There was a specific research article once that said those who are unhappy watch the most TV…*\n\nI see that it is us as the collectives fault within all of this. Ee  are becoming a society where everything is given to us so quickly, and  almost ‘free’ in a way that we forget what it means to create things  with OUR OWN HANDS. Everything we seem to touch is a distraction and a  way to divert ourselves and the mind from what we are really going  through within.\n\nAdditionally –  it dawned on me that if I can’t sleep I’ll watch TV. I  figured out it was a way for me to avoid things going on in me. It’s  just too easy to try and divert yourself and problems by watching  something engaging and entertaining, while the  things within are still  not being resolved and will still affect me the coming day – until I do  something about it, or I walk into my own consequence.\n\nThis is certainly a wake up call for me and I hope other people too  when it comes to being more aware of who we are with the amount of  entertainment, social media and online distractions we are participating  in – as means to feel something other than what we are feeling within.  To become more aware of why we are going to our phones, picking up the  remote, or watching a movie and see how we can balance that out  entertainment with practical work like taking care of the home, and  oneself by figuring out how to deal with personal problems.\n\nFor me, the era of overly self-indulgence is coming to an end. I know  I have a lot of work to do, and I don’t want to continue neglecting  things that truly need to be taken care of. Will let you know how it  goes! Thanks for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9y714b/distractions_that_pleasures_the_mind_but_not_our/", "title": "Distractions that pleasures the mind but not our being", "social_network": "reddit", "user": "virgosjourneytolife", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1542556681, "permalink": "/r/DecidingToBeBetter/comments/9y714b/distractions_that_pleasures_the_mind_but_not_our/", "nsfw": false, "first_save": 1635437768.6260865, "replies_charged": false}