{"id": "t5_2tand_t3_g6i5ap", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I can't sleep, and it seems that posting here is helpful.\n\nSo, over the past 5 weeks basically I got rut doing several things that I supposed got over it.\n\nThis includes:\n\n* bad nutrition.\n* bad sleeping.\n* social media, stalking people that are not in my life anymore.\n* watching unuseful content on the Internet.\n* masturbating every day.\n* no exercise at all.\n\nAnd the effects from all of that have been heavily drop down my productivity.\n\nLost some friends and professional opportunities with them.\n\nLost the motivation to learn new stuff. And forgetting another learned stuff.\n\nThis semester I have planned to finish college and I don't want to blame or point fingers about anything or the current situation, because, by fortune, I have this chance to stay at home with no guilt. \n\nSo I'm working on the project that will help me to get out college and get a job. Systematically the semester ends by July. \n\nIt's been a hard time to get over this things but *I realize* that at this moment I have the opportunity to become a better version of myself by just 'hard resetting' my life. I'm aware of  bad things that I'm doing and I want to stop doing them.\n\nIn the end I feel optimistimic because I've been going through even hardest times by dealing with depression and social anxiety when started college, and more things in the past. \n\nBy fortune my progress through college is going as planned, I mean, I've just spent the expected 4 and a half years of college. \n\nI want to post this as the new begginning of the life I've always wanted.\n\nThe clock is running.\n\n\"You owe You\"\n\nI decided to be better.\n\nFinishing college it's just the begginning for a new life by doing what I love, and being useful for the people I love, I don't care about graduation parties or diplomas, I'm ok with just being useful.\n\nI remember Slipknot's Sulfur, which, listening to this type of music was at least a good partner during this rough times.\n\nI love reddit.\n\nThank you for your time reading this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g6i5ap/only_2_months_left_to_finish_college/", "title": "Only 2 months left to finish college", "social_network": "reddit", "user": "farsun-nine", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 54, "down_vote": 0, "creation": 1587625896, "permalink": "/r/DecidingToBeBetter/comments/g6i5ap/only_2_months_left_to_finish_college/", "nsfw": false, "first_save": 1635436639.9643738, "replies_charged": false}