{"id": "t5_2tand_t3_o1d9oc", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "How do you get to be happier? \n\nOne word. The art of fulfillment (okay that was more than one word) \n\nWhat is the art of fulfillment, and how do you learn it? \n\nWhat the art of fulfillment means at the most basic level is finding out what drives YOU. \n\nIf you know your passions, what you love, what you hate, what you're interested in, what's important to you, then you can tailor your activities and more importantly your life in alignment with those things. \n\nWhen you do this, everything begins to feel right. You begin to naturally wake up feeling content and happy with your life every day. \n\nWhy is it called an art? \n\nBecause everyone is different. What fulfills you is going to be different than what fulfills me. \n\nYour life experiences are completely different in a lot of ways then mine, and everyone else's. \n\nThat's why modelling other people in terms of trying to achieve something will work but will never work in terms of what fulfills you. \n\nMost people think getting things will make them happy. Getting more money or more accolades. \n\nThose things might make you happy for a few minutes a day, but long term, you and I both know they never will.\nThe things that make us happy are doing the things we love every day, learning about things we are interested in every day, and aligning our work with our passions, every day. \n\nIf you can honestly answer those questions I wrote above - what are your passions? What are your likes, your dislikes? What do you love? What do you hate? What are you interested in? - and then do more of those things every day, then that's how you become 2x or even 10x happier.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o1d9oc/the_art_of_fulfillment/", "title": "The Art of Fulfillment", "social_network": "reddit", "user": "TheKuzzinator", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1623871894, "permalink": "/r/DecidingToBeBetter/comments/o1d9oc/the_art_of_fulfillment/", "nsfw": false, "first_save": 1635436694.4262884, "replies_charged": false}