{"id": "t5_2tand_t3_nltltw", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": " Pressurizing (young) people to pursue their passion actually makes a lot of those people depressed and miserable, since a lot of people will simply not be able to convert their passion into a job. Realistically a lot of us are simply not good enough to be successful in competitive fields in which a lot of people have a passion (e.g. music, sports, arts etc.). And a lot of us don’t even really have a meaningful passion.\n\nI’m not trying to say that, if you have a passion, that you shouldn’t go for it since you will probably fail. By all means go for it if that’s really what you want to do. What I am trying to say is though, that if you do end up at a job that you’re not necessarily passionate about, then you’re not necessarily going to be unhappy for the rest of your life.\n\nA lot of you will probably be able to feel totally happy with your life if you work a job that isn’t particularly fancy, but still challenges you, lets you work with co-workers you really like and pays you enough. Especially if you have other sources of happiness/fulfillment in your life other than your job (e.g. good people, other hobbies, personal projects etc.). Just make sure that you don’t fucking hate what you’re doing, because yes, then you will probably be miserable.\n\nYou don’t have to change the world to feel fulfilled. You also don’t need to get your life fulfillment from a job. A fulfilling life can also be achieved through making positive impacts on the people around you.\n\nAnyways, that’s just my perspective. If you thought these ideas were garbage, then feel free to put this shit into the trash can. If you did like it, then consider applying it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nltltw/if_you_feel_miserable_since_your_life_isnt_really/", "title": "If you feel miserable since your life isn’t really going in a direction in which you will ‘do what you love’, then here’s a perspective.", "social_network": "reddit", "user": "chickenmelato", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 198, "down_vote": 0, "creation": 1622069256, "permalink": "/r/DecidingToBeBetter/comments/nltltw/if_you_feel_miserable_since_your_life_isnt_really/", "nsfw": false, "first_save": 1635436709.0895178, "replies_charged": false}