{"id": "t5_2tand_t3_mlrtxb", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I am the dying breed of man. The aggressive outlaw. Raw, unfiltered, energetic, neurotic, quasi-narcissistic, cynical, generally unpleasant to hear speak, unless Im working. Professionally I am a unit salesman, and a damn good one(narcissistic traits). I am also highly intelligent. \n\nI am 25, see a therapist (for a variety of reasons), and as a hail mary, My therapist believes that if I can  \"fake\" My word processing and vocal tones to a pattern of speech that is lighter, kinder, and more pleasant to be around, that it will subconsciously rewrite My own \"contextual filter\" over enough time. A \"fake it til you make it\" approach. \n\nThe issues I find often being a social black sheep is that my thoughts and ideas are very closely intertwined into the emotions I feel when I speak about them. They are also very unpopular, often crass and incredibly cynical. Because of this, very few people can stand to be around Me. Personal life? Forget it. Random quarterly hookups, occasional tinder match that I downgrade for. \n\nMy therapist is concerned because of My age, history, and cognitive perception of reality (half empty, pointless) if I refuse to acknowledge this problem, it will become part of my overall personality and forever wreak havoc in my personal life, professional life, and my on overall life experience. \n\nBeing that I have been a black sheep for so many years now, I have developed a perception that generally people are not worth the energy You present to them. So from age 10-11, I stopped caring how I came across to others. For this I was bullied and ostracized in school. I learned to speak to women incredibly later than most men, not out of shyness or anxiety, but because I spoke in such a manor that\nmakes Me appear angry, hateful, and other things like that.\n\nI learned to sell, but not before years of professional failure and self inflicted economic disaster. This is an active ongoing war.\n\nI am cognitive and mindful of My emotions at all times from therapy over the years, but My forethought to think about how my words would make another individual feel never developed. So up until I did My own research on personality development (the cynic will look at the sky to check to see if its blue after you tell him it is) I never cared, or was aware of the underlying gravity of My situation. I am in a race against time. If I do nothing, Ive hypothesized a number of outcomes, all eventually leading to My early death in misery and loneliness. \n\nThis is the egotist who is fully conscious of his own ego's cry for help. I have absolutely no idea where to begin.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mlrtxb/i_need_to_learn_how_to_speak_to_people_in_a/", "title": "I need to learn how to speak to people in a kinder manor.", "social_network": "reddit", "user": "laust_kaws2357", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1617761417, "permalink": "/r/DecidingToBeBetter/comments/mlrtxb/i_need_to_learn_how_to_speak_to_people_in_a/", "nsfw": false, "first_save": 1635435817.599666, "replies_charged": false}