{"id": "t5_2tand_t3_n6y16k", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Hey there folks just thought i'd write out this post to keep myself accountable and road map the direction I want to head in. I'm currently finishing my university hand ins and having to spend almost all my time working, meaning i've had to sacrifice some stuff I value (healthy food, exercise) and have also given into my vices (porn, alcohol, weed) due to the stress of my course.\n\n&#x200B;\n\nHowever, I finish in under two weeks now and I cannot wait to get back on track. For the past year i've been trying to quit alcohol, porn, and weed - which has had its ups and downs. I managed to go on a 45 day sober streak fairly recently and have definitely cut it down so so much compared to this time two years ago. I would smoke weed every day, go out and get very drunk very regularly (I have since realised that I have a problem with alcohol) and use porn without even batting an eyelid. However, since the first COVID-19 lockdown I have been reevaluating my life choices, and decided that porn alcohol and weed are not for me, and serve no purpose in my life apart from fleeting pleasure. Since then it has been, at times, a struggle to keep on top of these vices. i've read multiple books on these topics and tried different techniques of trying to quit. I have slipped up many times, but overall, i have 100% made progress in my journey and I hope it continues this way. However fairly recently due to stress from my assessment hand ins I have found myself turning to porn and alcohol again. I have also stopped exercising (i'm currently injured - i normally do calisthenics) and stopped eating healthy because i'm having to spend most of my time working.  I've also stopped meditating and journalling the last couple weeks and I feel like I hold a lot of guilt/shame/self deprication when i'm not doing as well as I know I could be and when I turn to things like porn and alcohol. I feel like i'm maybe quite hard on myself at times and I need to work on this.\n\n&#x200B;\n\nSo therefore, below is a list of where I want to be after I finish my hand ins and head into summer.\n\n\\-Sober. Porn free. Alcohol free. Weed free. Able to deal with stress and negative emotions without having to turn to these vices\n\n\\-Regularly working out 4x times a week\n\n\\-Meditating for 30 minutes a day\n\n\\-Eating completely home-made food and cutting out sugar\n\n\\-waking up early at 8AM - journalling in the morning and evening\n\n\\- limiting the amount that I go on my phone/internet, mindlessly scrolling\n\n\\-spending most of my time on things that improve my wellbeing and life. My career aspiration is to be a successful musician so i want to spend a large majority of my time learning, practising and improving.\n\nI know this is achievable because i've been working towards this the past year. I just thought i'd write it out to actually have it down on paper (or virtual paper lol)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n6y16k/where_i_want_to_be_sober_productive_and_healthy/", "title": "Where I want to be - Sober, Productive and Healthy", "social_network": "reddit", "user": "lordsundaze", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1620392697, "permalink": "/r/DecidingToBeBetter/comments/n6y16k/where_i_want_to_be_sober_productive_and_healthy/", "nsfw": false, "first_save": 1635437752.2545924, "replies_charged": false}