{"id": "t5_2tand_t3_q4uq1z", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "TL;DR:\n\nI moved to Florida about three years ago to help take care of my parents. The job market has been horrible and the people here are just insane.\n\nI took a long shot and contacted a recruiter in Colorado at the start of September, and I just got a job offer for a good tech position. We're working out some details, but I'm 90% certain I'm finally getting out of Florida.\n\nLonger Version:\n\nI left a job at a major tech company in California to teach English in Japan - which had been a lifelong goal.\n\nWhile in Japan, my father had a stroke, so I move to Florida to help my mother care for my father.\n\nFlorida is really strange place. Lots of neck tattoos, meth addicts, and, in general, people come here to make bad choices.\n\nI struggled to find work - and eventually ended up working for the county health department where, over the course of six months, I was promoted to the lead of the COVID-19 response team.\n\nDespite how much pride I take in doing that position, I still hate it here. There's no quality people to date. There's no one to bond with over things that I enjoy. In fact, a lot of my coworkers express amazement that I lived in Japan (as well as France). For some, it's beyond their comprehension that people can do that.\n\nI went back to California at the start of September to see my friends. It was a bitter-sweet reminder of how much I have missing here in Florida.\n\nWhile I'd love to be near my friends, California itself is expensive. I have family through out Colorado, so I contacted a recruiter out there. Three weeks later, I had a job offer. \n\nI'm in shock and initially turned down the position because it all happened too fast, but the recruiter is working on improving the offer and getting me some help with finding housing.\n\nI'm scared shitless, and I've wanted to throw-up for the past few days (that's how my anxiety manifests itself, sadly). But I am likely going to take this position. By mid-November I'll be out of Florida and getting ready for snowshoe season in Colorado.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q4uq1z/i_did_it_im_finally_leaving_florida/", "title": "I did it, I'm finally leaving Florida.", "social_network": "reddit", "user": "fire_breathing_bear", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 828, "down_vote": 0, "creation": 1633815753, "permalink": "/r/DecidingToBeBetter/comments/q4uq1z/i_did_it_im_finally_leaving_florida/", "nsfw": false, "first_save": 1635436932.5223083, "replies_charged": false}