{"id": "t5_2tand_t3_c6blb8", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "[Yesterdays post](https://www.reddit.com/r/DecidingToBeBetter/comments/c5vjgq/i_know_this_will_help_someone/)\n\n&#x200B;\n\nYou all showed  interest on this subtopic from yesterday! I responded today to a comment asking..\n\n&#x200B;\n\n\"What amount of eye contact is acceptable in a conversation?\"\n\n&#x200B;\n\nThis sent me on a looong train of thought.. (thank you. that's your gift to me), and here is my response!\n\n&#x200B;\n\nEverything I state is backed with only the intention of love and respect.\n\n&#x200B;\n\npeace and blessings to you all x\n\n&#x200B;\n\n\\--------------------------------------------------------------------------------------\n\n\"What amount of eye contact is acceptable in a conversation?\"\n\n&#x200B;\n\n&#x200B;\n\nIt's hard to give you an amount of time. It's more of a feeling.\n\n(It is a bit touchy because it does come down ones ability to feel social cues. Some people see cues differently, or don't see them at all which is fine! So. I want to give people the advice that will work for them.)\n\n&#x200B;\n\nIf you feel you can read social cues coming from the other person properly then...\n\n&#x200B;\n\nEye contact is letting someone look at what you're feeling inside at that moment. Plain and simple. That's why it's inherently so terrifying. You're giving them you, without the mask you choose to wear to get through it all.\n\n&#x200B;\n\nIf you're lying, they'll know. Be smart. Be you.\n\n&#x200B;\n\nMy juju deep advice would be to\n\nfind peace within yourself, you'll be able to stand comfortably in your own body and give that comfort to whoever you're talking too through your eyes.  \n\n&#x200B;\n\n&#x200B;\n\nPRACTICAL ADVICE - Practice every day in every passing interaction you have. The most efficient ones are level 1-3. Here's what you do.\n\n(IT REALLY HELPS TO THINK OF THIS AS A VIDEO GAME WITH YOURSELF) takes the pressure off. If you \"lose\" you just respawn in a new store later on and try again! Whew!\n\n&#x200B;\n\nTask - Deliver your words (coffee order/small talk) to the other person, while maintaining relaxed, unbroken (by you) eye contact.\n\nLvl. 1 - Starbucks order\n\nLvl. 2 - Grocery store teller\n\nLvl. 3 - Waiter/waitress while ordering food\n\nLvl. 4 - A friend!\n\nLvl. 5 - A loved one!\n\n&#x200B;\n\nThings to remind yourself right before your performance!\n\nSTAND UP TALL!\n\nDEEP BREATH IN!\n\nBIG CHEST FORWARD!\n\nCHIN STRAIGHT!\n\nBREATH! RELAXED, SLOW, DEEP BREATHS.\n\nYOU GOT THIS!\n\n&#x200B;\n\nnow that you're strong, tall, and calm\n\nStart your initial eye contact with your genuine hello (with a smile if you're feeling spicy!)\n\n&#x200B;\n\nYou -  \"hello\" (into their eyes with the peace and love that's already in you.)\n\n&#x200B;\n\n(Not breaking EC)\n\n&#x200B;\n\nThem - \"hi, what can I get you?\"\n\n(Give them the opportunity to say this into your eyes! Hopefully they do, that's up to them!)\n\n&#x200B;\n\n>(Collected, calm, and clear, tell them your order while maintaining EC with and through every word you say)\n\n\\^ the hardest part. Know it's hard. It's supposed to be hard. You're striving for progression not perfection. We're practicing to nail this part and every verbal exchange beyond it! Woo!\n\n&#x200B;\n\nADVANCED - (*If it's still going well at this point. EC should not be broken by you first* (M2F/F2M). (M2M adapt accordingly for testosterone reasons)\n\n\\^ this is the real golden nugget in all of this, that's a bit difficult to get across through text. I'll try and explain further down\n\n&#x200B;\n\n(If you're grabbing for money or genuinely looking at something else it's ok to break EC. But come back after stronger. It will knock people off their heals!)\n\n&#x200B;\n\nSay your goodbye with your relaxed EC, smile and go on with your day! Nice!\n\nAlright! How did you do!\n\n&#x200B;\n\nDid you nail it?! Go you! Do a little dance!\n\n&#x200B;\n\nDid you stumble your words and look down on accident after the third word in your sentence?!\n\nMe too!\n\nPractice practice practice!\n\nYou have your whole life to practice this, and one day...you'll unravel your superpower!\n\nThis is why I think cashier's and people who work with dealing with strangers have an amazing opportunity to refine their superpower!\n\n&#x200B;\n\n&#x200B;\n\n\\----- alright.. now the deep stuff..\n\nEVENTUALLY THROUGH PRACTICE AND TIME I want you to be what I call \"The other person's anchor.\"\n\nYou will get to a place where you're offering your eyes to the other person as a sanctuary. You're calm and full with love (the opposite of fear) at that moment, and feel comfortable enough to allow the other person to look in, away, and back into your eyes as they please! Your gaze is locked into their soul, through their eyes, and they drink deeply from the pool you're offering them as they please. (if you made it this far in real life, you know \"the line\" at this point. You've danced on the line a million times by now)\n\n&#x200B;\n\nIf you're able to get here, which I know with Practice all of you are! You will unlock one of your many inner super powers!\n\n&#x200B;\n\nNow... Now you have time to look into their eyes and see what's going on! Finally! The window to the soul is an understatement! You don't need to hear what a person is saying. You don't have to see what they're doing (or pretending to do). If you're lucky enough to hold a nice amount of EC with another human being (especially the sex that you're attracted to), not only will you know more about them than they do, you'll see the reason why we're all on this planet. Time will stop, love will flourish, and you'll realize whatever that little light is behind their eyes that you've connected with at this moment, is the same light that's in you, and in all of us.\n\n&#x200B;\n\nEnjoy this. Enjoy the whole process. Enjoy repeating your order to yourself for the prior 3 minutes in line, getting to the counter, looking into his/her eyes.... brain goes blank... LOL CMON! next time I got this! Good thing I got years ahead of me to practice this.\n\n&#x200B;\n\n\\---It's about finding peace within yourself enough to be able to stay in that peace in the presence of others---\n\n&#x200B;\n\nLove y'all. Please share this with the people you know this can help. That's all I ask. I wrote this as a stream of love consciousness, and I want this love to reach the people that really need it right now. That's it.\n\nx\n\nPS. I'm not a psychologist or doctor or expert. This is what I've learned in my personal experience, and I'm sharing it with you to hopefully add a new layer of love and growth into your crazy unexplainable journey through life. It's all love. My intention is never to come off disrespectful. I will be straight with you though! You got this!\n\n&#x200B;\n\n&#x200B;\n\n(you're giving them a peek into what's going on inside, so if you make what's inside awesome, outside will be a masterpiece.)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/c6blb8/eye_contact_additional_exploration_thanks_to_the/", "title": "EYE CONTACT! - Additional Exploration Thanks to the Overwhelming Love From Yesterdays Post <3", "social_network": "reddit", "user": "cinabang", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 146, "down_vote": 0, "creation": 1561672293, "permalink": "/r/DecidingToBeBetter/comments/c6blb8/eye_contact_additional_exploration_thanks_to_the/", "nsfw": false, "first_save": 1635436550.6454499, "replies_charged": false}