{"id": "t5_2tand_t3_m1bn6d", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "When I was young, I used to hunch over my desk because I was obsessed with how perfect my handwriting had to be. Into middle school, I would do the same thing because since then I’ve gotten more praise for my organization skills and “self discipline”.\n\nThe straight A’s led to a power game with people around me. If I had straight A’s, people had reason to see my value that I never appreciated from the jump - which would have prevented this whole inner civil war (but thats my perfectionism talking). Everyone in high school, as college was knocking on the door in four years, wanted a smart best friend because it’s like having the answer key. Your “answer key” friend (aka me) will work even better if they are people pleaser due to not getting parental recognition at home. The people pleasing exacerbates even more when that parental recognition is capable but is given to other outlets. \n\nAt first, my soft side was mad at this. I tried to communicate to my parents how things seemed to me, but not in the best way. They scoffed at my concerns and often engaged in arguments that included LOTS of gaslighting.\n\nThis gaslighting led to this disillusionment of who the hell I was. Sure, the people around me loved the fact I was useful per se. I pleased my parents’ goal of a “gifted child” due to immature standard set on me. I realize that this gifted child identity I lived in served me, but only it served me so much. \n\nI’m currently in college (19, sophomore) and I know that I love the novelty of learning and creativity, but trying to be perfect in executing my creative avenues and academic/career goals has failed me. It’s hard to admit this because it feels like perfectionism has served me so well in life - it’s attracted girls, authoritative praise, money (form of authoritative praise), prestige (yet another form, I guess). \n\nI’m so attached to gaining fame, money, and luxury because it fills that void of actual loving myself. If I really were granted to the wish to be perfect, I would have nothing to work on with myself essentially. I think life would have no meaning if we were all perfect - no momentum to keep going. Besides, now that I think about it, perfect has a definition that would be quite limiting to reform to: \n\n(adj.) having all the required or desirable elements\n\nFor what, though? Haha. No seriously, having all required or desirable elements .... relating to what though? For Society? Nope, done that. For Parents? Nope, done that. For the typical masculine man? Nope.\n\nSo, it makes me wonder if I even want to subject myself to perfectionism for the sake of someone else’s rubric/judgement.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m1bn6d/my_perfectionism_is_killing_me_i_realize_that_now/", "title": "My perfectionism is killing me... I realize that now.", "social_network": "reddit", "user": "050692", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1615311355, "permalink": "/r/DecidingToBeBetter/comments/m1bn6d/my_perfectionism_is_killing_me_i_realize_that_now/", "nsfw": false, "first_save": 1635436860.1269238, "replies_charged": false}