{"id": "t5_2tand_t3_nyq4ee", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "\"Hey, the general manager wants to see you in his office'\" is rarely something that a guy on the bottom of the totem pole wants to hear.  This is what was told to me when I was a lot porter at the Porsche dealership that I worked at.  Basically I washed the cars, swept the floor, took out the trash, and just made sure the dealership looked good.  I had no seniority or subordinates and was definitely the lowest paid.\n\nWhen dusting off the showroom cars, where insurance alone is 2-months pay for me, I bumped into a gentleman that used to work there and we struck up a conversation.  He asked what I did and I said  \"ahhh, I'm just a lot porter here. It's a good job for a college kid, but nothing too flashy.\"  We parted ways and I continued on with my day.  A few hours late I'm being summoned to the general managers office.\n\nHe sat me down and said that he just got done talking to a good friend of his, the same man I conversed with earlier.  Then he said \"You know, I heard something very alarming from him. He told me that you said you were 'just a lot porter.' Is that true?\"  I told him yes.  He then told me something that I have never forgotten.  He said \"Look, you're not 'just' anything.  You're a lot porter, not just, not only, you're a lot porter and you're just as, if not more, valuable to this team than the guys selling the cars. I see you every day making sure this place looks sharp, and without that, these sales guys don't sell anything. If the cars are dusty, or theres dirt on the floor, they are going somewhere else. And we all know that they are going to be dusting the cars.  You're not 'just' a lot porter, remember that.\"\n\nI've never forgotten that, and to this day I've caught others with the similar thought.  So, if you are using the word \"just\" in front of your job description, I'd encourage you to drop that part.  You're needed in your position, and not \"just\" anything.  If your position was that irrelevant it would most likely be automated.\n\nAll this said, there's something to be said about toxic environments, being happy in a position, morale, or the many other reasons why you're dissatisfied with your position.  Those are all important topics, but just for your own sake, don't' use \"just\" anymore, and for those who are in leadership positions, don't use it to describe your subordinate positions either.\n\nI hope this serves you and those you work for, alongside, and over.  It has served me many times over and has brightened both my self-pride and worth as well as those whom I have had the pleasure to lead.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nyq4ee/never_use_this_word_to_describe_yourself_or_your/", "title": "Never Use This Word to Describe Yourself or Your Career", "social_network": "reddit", "user": "Ok_Hamster3522", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2227, "down_vote": 0, "creation": 1623564642, "permalink": "/r/DecidingToBeBetter/comments/nyq4ee/never_use_this_word_to_describe_yourself_or_your/", "nsfw": false, "first_save": 1635437733.34036, "replies_charged": false}