{"id": "t5_2tand_t3_pyc7hj", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Far too often, we show smiles when we are hurt, we feel guilty when we are not strong, we hesitate when someone offers help.\n\nI  would like to share a very personal story with you. While hiking with my fiancé's family in the Grand Canyon, the most unimaginable scenario unfolded. A quarter-mile from the top of the canyon, a large rock tumbled down from the side of the cliff and hit directly on my head, resulting in over 50 skull  fractures. It was the most frightening time for my family, friends, and me.\n\nI  recovered astonishingly well and fully regained my  physical and cognitive abilities. **However, it was not because of what I did but because of the people around me.** I learned first-hand what the power of  love and support could do for someone that is hurt.\n\nI challenge you to embrace your feelings, accept support from others, and offer your love back into the world. **I hope from this post is that it motivates you to send a message to someone telling them that you care.** \n\nIdeally, this story to motivates you to reach out to someone that may be in need of help - or help someone to come to term with their situation and see a path to regain their footing. Sending your love out into the world is something that not only motivates you, but the recipient tremendously. I can't imagine going through this without having people reach out to me expressing their love. Thanks for reading my short blurb and hope that you are doing well.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pyc7hj/personal_story_how_to_motivate_and_heal_the/", "title": "Personal Story - How to motivate and heal the injured", "social_network": "reddit", "user": "ElectrikForce", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1632975436, "permalink": "/r/DecidingToBeBetter/comments/pyc7hj/personal_story_how_to_motivate_and_heal_the/", "nsfw": false, "first_save": 1635437215.2383218, "replies_charged": false}