{"id": "t5_2tand_t3_5gelb8", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "We think that we really want to know what it is that we want to do in life. We want to work hard, and sing songs aloud, so that our children grow up in an environment conducive to play at work. But there’s also a storm brewing outside, and its a jungle out there – waiting for its next predator while its prey hopelessly shivers in the lark. So what is life then? And why can’t I know what I want?\n\n2 reasons. And neither of them involve you or your sad story. Because you, like everyone else are going through the same cycle of thoughts on auto-pilot. Waking yourself up before the flight lands, is the trick of the journey. And after you see the world for what it really is – a whole world of possibilities open up beyond the cabin, and its air pressure – maintained so preciously on limited O2 levels, trying to keep us smiling and sedated.\n\nImagine if someone forced your dying grandmother to die peacefully while smiling continually for almost a day. What if a doctor came in and told you that she can die one in two ways – happy and peacefully, or sad and in pain. What would you choose? You’d want your grand mother to decide at that point, because you couldn’t take her decision for herself. You don’t want to be the God of someone, knowing that they might turn around and blame you for making a bad decision. In the same way, there is no God upstairs waiting for you to come to him/her/it. Because no explanation can justify why God did the things that he did to you. None. And so another possibility opens up. What if you’re God and what if we’re all God – simply scattered and split into multiple entities.\n\nNow if you are God, then there isn’t anything wrong or right, there’s no bad decisions – there’s only decisions. There is no heaven and hell, there’s only the earth. And the earth is only spinning cycles around the universe, instead of having a fixed path that it should follow until death.\n\nSo what do I do in life? Why don’t I know what I want in life?\n\n– The secret is in never finding out that you’re God. That’s when everybody will start going mad and start building houses, constructing properties, finding particles inside particles, and start imagining a better future. But wait a minute. Why are they doing all of these things? Why are they hell bent on improving their lifestyle? Is life only about avoiding pain and seeking pleasure in its rawest form? Should I become a dare-devil instead – since the normal 9-5 bores me to death. What do I do in life?\n\nDo nothing.\n\nAnd when nothing bothers you, do something. And if something bothers you, then stop doing it.\n\nAnd if nothing brings you true joy, then find something. Find love, find happiness, find peace, and find purpose.\n\nHappiness becomes in itself a receptacle of blessed joy, when you start talking non-sense. That non-sense is you. Your inner self trying to break free from your own boundaries.\n\nYou’re indecisive because you want to know why you’re here. And what is the meaning of life.\n\nHere’s the answer to your questions. The desire to know the truth in all its aspects, will always keep you anxious until you learn that the deepest thoughts of our universe – revolve around us being God. When you realise that you’re God and we’re God, you can finally breathe out. Nirvana is that Sanskrit word for breathing out.\n\n“The big man upstairs doesn’t enjoy the game from the sky, but from within ourselves.”", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5gelb8/when_you_cant_talk_yourself_out_of_this_one/", "title": "When you can't talk yourself out of this one", "social_network": "reddit", "user": "sanchitkhera9", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1480840608, "permalink": "/r/DecidingToBeBetter/comments/5gelb8/when_you_cant_talk_yourself_out_of_this_one/", "nsfw": false, "first_save": 1635437189.342336, "replies_charged": false}