{"id": "t5_2tand_t3_mwllvz", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "\nFor the first time in my life I want to be alive, and I’m excited for whatever the future may bring\n\nFor the first time in my life I love what I see in the mirror\n\nFor the first time in my life I love myself.\n\nThis alone has transformed my perspective and my happiness. I’m a better parent now. I’m a better person again. I feel good things again. My ptsd and trauma has taken a serious toll on myself and my life. \n\nThree months ago I was planning on eating a bottle of pills and greeting the big sleep, finally. I had completely given up my fight. I had completely lost the will to go on, therapy was my last attempt to find an escape from everything in my heart. And I am finding it. I’m finally winning.\n\nEdit: I woke up to a jillion notifications wow thanks guys you are all really sweet and thank you so much for the kind words, Reddit has really become a safe and special place for me lately and I’ve met some of the most wonderful, WONDERFUL people. :,) you’re all the best, thank you for being you\n\nEdit: therapy has basically gently shown me where my lens is incorrect, it’s helping me change my perspective and HOW I think and see people and value. It’s arming me with emotional coping skills, it’s helping me heal from many years of physical and emotional abuse by deconstructing the people and feelings behind it. As miss Tammy says, when you have this emotion you must sit down with it and pour it a cup of tea, you must explore it. Identify, accept, manage. And also the five basic needs have been taught to me as well. I’m learning to fully and functionally handle my impulsions and explosive emotions and adhd complications without any meds and I’m very lucky to have found the perfect lady to help me at just the second therapist I was switched to. I am fortunate to be a quick learner, she is merely placing the seeds in my lovely brain, and eventually the pieces click with me and I understand things a lot better. I can’t say everyone will have this luck, but if you go in willing to change and willing to see your past mistakes and not repeat them then you will come out even stronger.\n\nBut the most important thing, yesterday is YESTERDAY: today is today. Today is where the growth begins and you can’t focus on today if you live constantly in yesterday and fight or flight. Changing and growing is painful and hard, but if you face those hard parts you will come out on top. I have faith in each and every one of you. I believe now whole heartedly how much people can grow and change, don’t give up on yourself and others💖", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mwllvz/ive_been_in_therapy_for_two_months_now_and_my/", "title": "I’ve been in therapy for two months now and my entire life has changed", "social_network": "reddit", "user": "whyamIonly5fttall", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1143, "down_vote": 0, "creation": 1619146272, "permalink": "/r/DecidingToBeBetter/comments/mwllvz/ive_been_in_therapy_for_two_months_now_and_my/", "nsfw": false, "first_save": 1635436614.9771845, "replies_charged": false}