{"id": "t5_2tand_t3_ojkpb6", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "After months of wanting to change, I am making moves. I signed up for a CrossFit foundations class that starts the first week of August and I’m so excited to take a big step toward my goal of getting stronger. I won’t back out because I can’t afford to lose $160!\n\nI’ve been deeply depressed for years and feel like I hit rock bottom recently. I eat like crap, I don’t exercise, I don’t have a full time job anymore, and my marriage is falling apart. I tried and failed to sell my art full time over the past year. I knew I needed to reevaluate my life choices. \n\nLast month I started a part time job. It’s not much but I’m feeling good about getting out of the house and having social interactions while I continue applying to full time jobs. \n\nI also started learning Spanish online and am working on doing that more often in my downtime instead of just scrolling the internet.\n\nCrossFit feels like a big step in all this because I know it’s going to be demanding and I’ll have to truly push myself at it. I hope to feel better physically and feel more confident in my ability to overcome challenges. \n\nBasically wanted to make this post as a reminder of my optimism and hold myself accountable. Hopefully in a few months I’ll look back and be proud I actually followed through.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ojkpb6/making_changes_signed_up_for_crossfit_ready_to/", "title": "Making changes, signed up for CrossFit, ready to put in the work", "social_network": "reddit", "user": "behindasynthesizer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1626198109, "permalink": "/r/DecidingToBeBetter/comments/ojkpb6/making_changes_signed_up_for_crossfit_ready_to/", "nsfw": false, "first_save": 1635437468.5873687, "replies_charged": false}