{"id": "t5_2tand_t3_gal9nu", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "02754bd2-1501-4057-b4ae-2ac097eb5da1", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "At age 23, Tina Fey was working at a YMCA.\n\nAt age 23, Oprah was fired from her first reporting job.\n\nAt age 24, Stephen King was working as a janitor and living in a trailer.\n\nAt age 27, Vincent Van Gogh failed as a missionary and decided to go to art school.\n\nAt age 28, J.K. Rowling was a suicidal single parent living on welfare.\n\nAt age 28, Wayne Coyne (from The Flaming Lips) was a fry cook.\n\nAt age 30, Harrison Ford was a carpenter.\n\nAt age 30, Martha Stewart was a stockbroker.\n\nAt age 37, Ang Lee was a stay-at-home-dad working odd jobs.\n\nJulia Child released her first cookbook at age 39, and got her own cooking show at age 51.\n\nVera Wang failed to make the Olympic figure skating team, didn’t get the Editor-in-Chief position at Vogue, and designed her first dress at age 40.\n\nStan Lee didn’t release his first big comic book until he was 40.\n\nAlan Rickman gave up his graphic design career to pursue acting at age 42.\n\nSamuel L. Jackson didn’t get his first movie role until he was 46.\n\nMorgan Freeman landed his first MAJOR movie role at age 52.\n\nKathryn Bigelow only reached international success when she made The Hurt Locker at age 57.\n\nGrandma Moses didn’t begin her painting career until age 76.\n\nLouise Bourgeois didn’t become a famous artist until she was 78.\n\nWhatever your dream is, it is not too late to achieve it. You aren’t a failure because you haven’t found fame and fortune by the age of 21. Hell, it’s okay if you don’t even know what your dream is yet. Even if you’re flipping burgers, waiting tables or answering phones today, you never know where you’ll end up tomorrow.\n\nNever tell yourself you’re too old to make it.\n\nNever tell yourself you missed your chance.\n\nNever tell yourself that you aren’t good enough.\n\nYou can do it. Whatever it is.\n\n- Drew Forrester\n\nEdit; thank you very much for the awards kind people!\n\nEdit 2; wow I'm amazed at all the love and support in this group! You all are amazing!\n\nThank you so much for the other awards good people.\n\nSorry if I couldn't get to everyone's comment.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gal9nu/what_do_you_want_for_yourself/", "title": "What do you want for yourself?", "social_network": "reddit", "user": "ChickenCamelClutch", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5708, "down_vote": 0, "creation": 1588206187, "permalink": "/r/DecidingToBeBetter/comments/gal9nu/what_do_you_want_for_yourself/", "nsfw": false, "first_save": 1635436620.9092824, "replies_charged": false}