{"id": "t5_2tand_t3_mubjog", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "I want change in my life. I’m sick of being miserable. People always tell me to get a hobby or start exercising to feel better which I agree are good things to do but I find almost impossible to get out of bed unless I have to go to my part time job. I just lay in bed miserable until I have to work get home and either watch tv or play video games to an ungodly time then I sleep late and stay in bed until I have to shower and go to work. I didn’t even eat today because I stayed in bed for so long. I tell myself I’ll go to sleep earlier and turn things around but then I just end up not being able to sleep and even if I do sleep at a normal time I’ll end up messing up the new sleep schedule almost immediately. Other than the fact that I want to feel better I have zero motivation for anything in life. There’s no career or hobby I care to pursue. I sometimes think it would be nice to have a certain job to make a lot of money and have nice things would be cool but I don’t really care about material wealth. There are no friends or family near me that give me motivation to continue forward and even though I would love to have a relationship I don’t think I could ever trust a future partner to not cheat with how unstable relationships are nowadays. \n\nI’m just so frustrated with the world and I feel so powerless to change anything for the better so instead I just occupy my mind with media, masturbation or drinking until I can finally sleep to forget my problems for a few hours then repeat the whole cycle over again. \n\nSorry this turned into a rant I just want to be happy or at least pursue some sort of goal in my life. I’m sick of just existing but that seems like the only thing I’m good at.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mubjog/how_do_i_break_this_cycle_of_me_doing_nothing/", "title": "How do I break this cycle of me doing nothing?", "social_network": "reddit", "user": "PositiveJourney", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 43, "down_vote": 0, "creation": 1618869152, "permalink": "/r/DecidingToBeBetter/comments/mubjog/how_do_i_break_this_cycle_of_me_doing_nothing/", "nsfw": false, "first_save": 1635437212.7076104, "replies_charged": false}