{"id": "t5_2tand_t3_qhhxgl", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "This might be a bit premature but I took a big step for myself just now and I felt this would be a positive outlet to share. \n\nBrief context: built a multi-million dollar investment firm with a friend from college. We parted ways on bad terms. Shortly thereafter all my money in it has become inaccessible to me and all my distributions stopped. No access or insight into the company. Etc. \n\nI have had a crippling fear of dealing with this. I’ve gone a few years now ignoring it and rebuilding myself telling myself it was so I could deal with it once I was in a position of strength. Though, likely, it continues to be in my pattern of escapism and avoidance behavior. I went to a good business school and got a good job and have been working to build that strength. I feel good about where I’m at but I still can’t afford a $500K lawsuit against him so I’m still in the rebuilding phase. \n\nA couple months ago I was filing my taxes late and my accountant mentioned my years numbers were different than I expected and it was because I apparently made a profit from selling one of the building I own. I had no idea about this and it turns out my business partner sold a building we owned together, reported my share of the profit via a K1 but naturally never told me about it (we haven’t spoken in about 3 years except for two instances our lawyers talked) and I haven’t seen a penny of the profit or my principal investment. I don’t even know which building of mine was sold or for how much. \n\nI’ve been swinging from depressed to anxious to angry to upset to sad again during the times I can’t push it out of my brain and pretend it doesn’t exist since learning about this. Bad dreams frequently, etc. However, guys, I just emailed my attorney on reengaging his services told him what’s going on and took the first step towards getting my ****ing money. \n\nIt’s not a demand letter, it’s not an actual legal action, but it’s the first step towards moving past this massive emotional blockade and I’m very very very happy about it!! I hope I can continue to keep up the strength and take the next steps and not feel beaten down, ashamed, embarrassed, and powerless in the face of this loss like I normally do. \n\nAnyway, thank you for your time in reading and the unconditional support you all offer one and other.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qhhxgl/small_step_to_overcoming_a_crippling_fear/", "title": "Small step to overcoming a crippling fear", "social_network": "reddit", "user": "SirMonkey687", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1635407866, "permalink": "/r/DecidingToBeBetter/comments/qhhxgl/small_step_to_overcoming_a_crippling_fear/", "nsfw": false, "first_save": 1635436444.262154, "replies_charged": false}