{"id": "t5_2tand_t3_j4uaap", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "Imposter syndrome is something that I have been battling with my entire life. Often times I get the feeling that whatever success  I have acquired over the years might have just been luck or maybe things worked out because I partnered with the right people who did all the work while I reaped the fruits.\n\nThis feeling started all the way back in school when I scored the highest marks in an exam which everybody else struggled with.\n\nAt the time I was convinced that the only reason this happened was because I was lucky enough to have studied that one question in the syllabus which nobody thought would appear in the exam but ended up appearing.\n\nBut here’s the thing, because I felt like a fraud I ended up studying harder for the next exam with the fear of being exposed as someone who just got lucky in the last one. So is this feeling really a bad thing?\n\n# ‍Why does imposter syndrome occur?\n\nFrom my personal experience, I can say that imposter syndrome mainly occurs in people who have self taught themselves the skill that they are currently using to make a living.\n\nIn my case it is software development. I was not particularly good at it in college even though I was studying computer science. I was just an average student if not below average.\n\nAfter I left college I started working in early stage startups where there is no structure or someone to teach you stuff. The only option is to do your own research and learn things yourself. Google and Stack overflow were my only true friends.\n\nBecause I never really went through a “standard program” I always have this self doubt and I never know if the way I am doing things is the right way or not and the fact that there is no defined right way of doing things in software does not make this any easier.  \n\n\n# How do you use this as a strength\n\nMy co-founder and I built a business that we grew to $25k MRR. Because of my imposter syndrome I have convinced myself that most of it was luck. We were in the right place at the right time.\n\nThe fact that we did 2 months of research on the market and product, spent a lot of time figuring out where we would get distribution from even before writing a single line of code seemed to have conveniently slipped my mind. The reason we even did all of this in the first place was our fear of not being good enough.\n\nWe have now started a new venture and hired a team. Now because of the fact that we had a successful venture in the past, I am now under immense pressure to make this new one a success otherwise I might get exposed as a “fraud” or someone who “just got lucky”.\n\nBecause I have no other option but to make this a success I am going to work hard once again just like I did in my last venture. I would like to think that this imposter syndrome has turned into a strength. It is a feature and not a bug.  \n\n\n# Closing notes\n\nSome amount of self doubt is healthy and it keeps you on your toes. It also prevents you from letting your previous success go to your head and always be open for new learnings.\n\nIt enables you to be open to the suggestions given by your teammates which you might otherwise ignore just because they are less experienced than you if you had no self doubt at all.\n\nHaving said that, it is also not right to doubt yourself to an extent where it starts impacting you in a negative way. For instance, what if your teammates catch wind of your immense self doubt and they start losing faith in you? This is also not something you can afford.\n\nOne must have a healthy balance of self doubt and faith in yourself that you are moving in the right direction.\n\n&#x200B;\n\n\\- [Originally posted on my blog](https://www.sankalpjonna.com/posts/imposter-syndrome-is-it-a-bug-or-a-feature)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j4uaap/do_you_ever_feel_like_a_fraud_turn_this_feeling/", "title": "Do you ever feel like a fraud? Turn this feeling into a strength", "social_network": "reddit", "user": "root993", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1601792242, "permalink": "/r/DecidingToBeBetter/comments/j4uaap/do_you_ever_feel_like_a_fraud_turn_this_feeling/", "nsfw": false, "first_save": 1635437627.5176947, "replies_charged": false}