{"id": "t5_2tand_t3_f853ec", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I'm a 23 year old man who's completely changed my life in the last 7 months. I got addicted to an MMO (Runescape) and found myself playing for 8-16 hours a day. I had over 450 days of continuous play time on one account and one game, keep in mind I played more than one game. I dropped out of 3  colleges a total of 4 times, and got kicked out the last time for academics. I was such a mess and started neglecting my health to the point I had constant back pain, multiple root canals, constant sinus infections, wouldn't take showers, hardly ate anything, hardly brushed my teeth, didn't go outside, slept during the day and was up at night. I wound up completely quiting all video games 7 months ago and life has gotten substantially better. Since quitting I:\n\n* Got a job at an Amazon Warehouse and worked harder than was required to build my work ethic. Got top performer for my warehouse on a number of days and never got a single attendance point.\n* Moved out of a bad situation, was renting a room with grandparents who smoked 5 packs of cigs a day in the house. I actually get to put on clean clothes now and have a sense of smell.\n* Went to 150 or so 12 step recovery meetings (eg AA), this helped so much to talk to others and be honest about my situation instead of telling myself lies that I came to believe. It also helped me with my resentments towards my parents for both being alcoholics. In addition it made me a better speaker, more empathetic towards others, & more sociable.\n* Cut down on my Sugar/Caffeine Intake, Was drinking 6 cans of soda a day + candy as a meal. About 500g of sugar a day. I drink a lot of water and unsweetened tea now.\n* Started brushing my teeth right, no longer half assing it, trying to restore some of the damage I did to my enamel by: using a waterpik, high flouride tooth paste, vitamin D pills, and actually flossing.\n* Overcame about 1/2 my anxiety, I was so anxiety ridden I could hardly talk to strangers and i certainly couldn't admit everything here I've just admitted (because what if someone I know saw). Going to keep working on it until it's gone.\n* Avoided drugs, gambling, or alcohol. To much potential to derail everything.\n* Cut back on frivolous spending. Trying to get my finances together - work in progress.\n* Adopted Practical Minimalism, I try to avoid having to much stuff lest it distract me from my goals. Still working on this but made major progress. I gave a lot of stuff away to good will.\n* Overcame major depression for the most part, relative to where I was I now have no reason to be depressed since life has gotten so much better. Still have my days from time to time but I can see the light at the end of the tunnel.\n* \\+ other minor things that I'm forgetting.\n\nWhat really helped me achieve all of this was not taking a victim-hood mentality and being brutally honest with myself/others and not hiding behind half-truths (e.g. It's my parents fault). I took things one step at a time instead of overloading myself and burning out like I did in the past. Even now my sleep is completely messed up but that's fine because I can't change everything at once and expect things to work. Right now my focus for the next 3 months is undoing the physical self neglect with diet and exercise. Before that it was moving out and keeping a clean environment. For that 1st month or so it was just staying off video games. Another huge help for me was to keep a log, I made/make youtube videos on a weekly basis and had 20 subscribers or so, I felt accountable to myself and these people to not let them down and show them whats possible. If I gave up they may give up to and it's a sorry man who lets someone else down like that - it gave me a sense of accountability to something. Putting my face on the videos and speaking things aloud is also what's really helped me with my anxiety.\n\nAlso a big help to me has been focus. I'm a very ADHD person who finds it easy to get distracted. So I got a lot of the distractions (eg things & people) out of my life so that I could focus on recovery. I deleted my Social Media and consolidated as much stuff as I could. Even things as simple as my phone I deleted all the Iphone apps I don't truly need and they all fit on one page now.  I gave half my belongings to good-will as they in no way enriched my life. My bedroom has only a bed and nightstand in it so there's no TV to distract me. I don't have cable - one less distraction. I got bad people out of my life and try to be good to the few people I have left. It gives me the clarity of mind to focus on recovery / self betterment.\n\nI find myself having to reassess on an hourly basis to make sure I'm on track with my goals and not drifting back into complacency. I've come to really enjoy working on self discipline & self mastery and I'm optimistic about what the future holds.\n\nEdit: Thanks for my first Gold\n\nEdit 2: Some of you asked about my YT:  [https://www.youtube.com/channel/UC792XRosekQGYBd3GPkTroA](https://www.youtube.com/channel/UC792XRosekQGYBd3GPkTroA)\n\nEdit 3: Thanks to everyone for the kind words and to those who gave me the awards (not sure who?)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/f853ec/changed_my_life_addicted_to_video_games_4_time/", "title": "Changed my Life - Addicted to Video Games, 4 time College Dropout, Massive Self Neglect, Depression & Anxiety, Loser", "social_network": "reddit", "user": "Gallardo44", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1469, "down_vote": 0, "creation": 1582435019, "permalink": "/r/DecidingToBeBetter/comments/f853ec/changed_my_life_addicted_to_video_games_4_time/", "nsfw": false, "first_save": 1635436038.2303805, "replies_charged": false}