{"id": "t5_2tand_t3_gc4min", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Hi,\n\nSo I have always tried my very best to help others when needed. Just like to put it out there that if you are ever feeling down or hopeless or unmotivated or like a crappy person try to do something good for someone else. It doesn't have to be big. It can be something as small as letting the person behind go first. Try it and trust me it will make you feel so much better. It will make you feel good. It's strange how life works as I always find if I do a good deed that it always comes back to me. The next day a stranger will help me in some sort of way and I will smile knowing that the universe is truly working in my favor. \n\nI encourage you all to be kind. To be kind in any way shape or form. We all are doing our best and figuring out how to do life. The world is hard enough without people being mean. A little help can go so far and restore someone's hope back in the world. It's like those stories of people who decided to help someone who was struggling only to discover they didn't go ahead with committing suicide or hurting themselves because of that person's kind actions.\n\nKindness big or small is powerful. Don't forget the power it holds. And remember you will be the receiving time at some point and be on the giving side at another point.\n\nEvery day I have been going on Reddit and replying to those on this forum and other self-improvement forums.  Passing on my advice and support. It's my way of being kind and helping others.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gc4min/the_power_of_being_kind/", "title": "The power of being kind.", "social_network": "reddit", "user": "alyssaa71", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1588417263, "permalink": "/r/DecidingToBeBetter/comments/gc4min/the_power_of_being_kind/", "nsfw": false, "first_save": 1635436523.1035597, "replies_charged": false}