{"id": "t5_2tand_t3_kbfgwq", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "At the age of 30 I was typical of what the incel community would have welcomed on their forums. Short, skinny, male, Indian and a virgin. From the age of 18 - 30 I never experienced so much as a kiss or going on a date. I was still sociable, had a lot of friends but I would always be the third wheel, attend weddings alone and had a crippling fear of rejection which prevented me from talking to women. I did not believe I had anything to offer someone in a relationship. I was enormously embarrassed about my situation and typically covered it up by saying I wasn't interested in finding someone or at times trying to make it seem to friends like I was seeing someone but just being secretive about it. I passed myself off as someone who was just biding their time. \n\nAt the time I turned 30 I lived in a shared flat with a totally loved up couple which was a constant reminder of what I was missing out on. I realised I was slowly becoming very bitter and jealous of them. I still felt  happy for anybody who was lucky enough to find love but would always think to myself why them and never me?   \n\nThe fix to this was to change my perception of myself from an \"undateable\" to someone who had something to offer. I had to change the narrative I was telling myself every day that I was a loser. I did this in baby steps:\n\n1. Fixing my dead end career. \n\nFor about 7-8 years after leaving higher education I was shifting constantly from temp job to stints of unemployment and then awful jobs. When people asked what I did for a living I had no idea what to say and I had no sense of direction or purpose. Persistence and patience got me through in the end. I signed up to so many different job agencies and was willing to travel pretty much anywhere for work. Even when unemployed I would still wake up early, get dressed and just hope for phone calls offering a shift the same day. Agencies realised I was willing to do anything they had and I finally lucked out and landed the job I wanted albeit as a temp: for 1 week during which I lived out of a hotel room. I truly busted my ass working crazy hours and landed the permanent role. I was finally somebody with a real job title and job security. The confidence and self-belief this gave me transformed me completely. \n\n2. Improving my physique\n\nI started with something as simple as growing stubble to lose my baby face appearance. I had zero body confidence due to my short skinny appearance so I hit the gym hard. 4/5 days a week without fail - motivation at the time was easy just to get out of the flat and far away from aforementioned loved up couple every evening. I got my first ever unsolicited compliment from a woman about my body. A colleague at work mentioned how big my arms had gotten. It was a passing comment but it did wonders for my confidence. \n\n3. Hitting the dating scene for the first time in my life. \n\nI took to Tinder as it was the only app I knew where you could hide your height which I was still self-conscious about. I was nervous as hell and Tinder was a brutal experience; I would get maybe 1 or 2 matches a week tops and most of the conversations went nowhere. I was constantly changing and tweaking my profile. Patience was important. Acknowledging that the odds were against me in terms of male to female ratio helped me not to get too deflated and to be honest I was getting much better at handling rejection. I found very quickly that going on dates and being rejected was not as bad as loneliness. It was still hard at times not to get deflated and when I felt down I had my work badge to  remind myself what I had achieved and that I was somebody now; if I just kept going I would find the right person. I read somewhere that most people can expect to go on a minimum of 20 dates before finding success so I realised this had to be a long haul thing. I kept a diary during the time which helped.\n\nLooking back now, as someone in a long term relationship, I no longer recognise who I was back then. For years I told myself I wasn't good enough as an excuse to avoid facing my fear of rejection. It was essentially a cop out and something of a self-fulfilling prophecy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kbfgwq/i_was_a_30_year_old_virgin_and_thought_i_would_be/", "title": "I was a 30 year old virgin and thought I would be alone forever.", "social_network": "reddit", "user": "Half-job-bob", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1107, "down_vote": 0, "creation": 1607734741, "permalink": "/r/DecidingToBeBetter/comments/kbfgwq/i_was_a_30_year_old_virgin_and_thought_i_would_be/", "nsfw": false, "first_save": 1635438330.6196406, "replies_charged": false}