{"id": "t5_2tand_t3_gupo5z", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff", "f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "***TL;DR*** *you're worthy of love and always capable of change because you're someones soulmate. when you find this person, try your best to not hurt them and most importantly, never take them for granted. Show people how to love well.* \n\nThis is the person who you have a romantic chemistry and compatibility with. Things with them are just, comfortable. Comfortable is not to be mistaken with complacent. People may call them soulmates. \n\n**A person who feels like your perfect match. They complete you.**\n\n* You're eerily alike in countless ways -- from trivial likes/dislikes/habits to larger experiences/desires/pains\n* Your differences are what makes you compatible -- you both are curious but different things spark your interests\n* You can't keep your hands off them\n* You feel at ease around them -- you can just be yourself without any judgement\n* And you accept them for who they are -- their imperfections are endearing, it makes you love them even more\n* You want to become a better person for them\n* You find yourself doing and saying things you've never done/said before\n* You find yourself slowly changing for the better without even noticing\n* Because you're too busy wanting to help make their worries, fears, and pain subside\n* You want to do everything to see them smile, hear them laugh\n* They make you overly emotional and make irrational decisions\n* You apologize, even if it's hard, because what's harder is seeing that you've hurt them\n* You put your own wants and needs aside for theirs, you compromise willingly and happily\n* But you're not afraid to speak up when things aren't right, when you know things need to change, to be better\n* *You're afraid you're not good enough, what you'll do won't make them happy enough, but really, it's none of those things --* ***you've just never been more afraid to lose someone***\n\n**Instead of running away from your fears, YOU NEED TO LEAN INTO IT.**\n\n* Whenever you look at them and think how amazing they are, how lucky you are to have them, how beautiful/handsome they are, how much you love them...**whenever these thoughts cross your mind, tell them in that moment, always.**\n* **When they're sad, defeated, or afraid, hold them close and tightly.** Even if you're the one who's caused them pain and it's hard for you, push your own shame/guilt aside and hug them. Make them feel safe in your arms. Let them know you got them. \n* **When they're stressed, frustrated, or upset, let them speak and listen.** Then, ask questions to better understand what's causing them to feel the way they're feeling / saying what they're saying. **Ask them what you can do to help** \\-- Don't assume you know what they mean. Don't let your own insecurities / biases / experiences get in the way of truly hearing them. \n* **Find out as much as you can about them by asking questions.** What are their favorites? What makes them sad? happy? What are their simple pleasures? What are their hopes? dreams? fears? What makes them feel loved? -- **Never stop wanting to learn more** \n* Use what you've learned to **do small things for them regularly** to show them you care. Little surprises, gestures of appreciation, it doesn't have to be fancy, grand, or expensive. **It's the smallest, simplest things that makes us feel the most loved.** \n* **Always show your affection towards them in public.** Hold their hand, sneak a kiss, give them a squeeze, a wink, a smile. Make them feel wanted. \n* **When they do something you appreciate, tell them.** No matter how seemingly trivial or random, tell them about the things they do that make you feel cared for.\n* **Find the adventures and make it fun.** Everything has the potential to be fun, even a tedious task. Sometimes you just have to create it yourself. \n* Don't be so quick to criticize. **Take a moment to think if your feedback is something they don't already know and if their behavior is something that requires change because it's hurtful to others / themselves** \\-- We're all our own worst enemies and there are plenty of people that make us feel worse about ourselves. Don't be one of those people. \n* If their behavior requires change, tell them with compassion. Set aside time to bring it up when they're not emotionally charged and prepared to listen. **Tell them how their actions are impacting you / others and what you want / need and why.** \n* **Tell them when you've messed up, that you're sorry, and how you'll work towards improving. AND leave it at that.** No ifs, thens, or buts. No pointing out their flaws. Usually they'll know where they went wrong, and if they don't realize in the moment, trust that they will...sometime in the future. \n* **Don't expect anything in return for your actions or words.** Do it because you want to make their day a little better, because you're sorry, because you want to help. Expecting something in return leads to resentment. \n* **Never stop trying to impress them and taking them out on dates.** It can be stupid, it can be silly. **Just plan everything and surprise them.** It doesn't matter because it shows them you made an effort. \n\nWhen you come across this person, even if you weren't looking, trying, or wanting, try your best to never let them go. \n\nGo after what you want and do everything in your power to keep them. Put your own fears and insecurities aside. **Don't listen to the voice inside that makes you question your own self worth because if that person is worth it, you're worth it.** \n\nDo this for everyone in your life that matters to you. That makes you feel safe and accepted even if they don't always understand you. Let the people you care deeply for, love, and cherish know it. \n\nTake a chance on those people. Show them you care, even if they may not always show it in return. Don't expect anything in return. In time, hopefully they'll take notice and reciprocate. **Sometimes it just takes you making the first several moves for others to change for the better.** Show others how to love fearlessly and well.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gupo5z/when_you_find_the_one_how_you_know_what_to_do/", "title": "When you find \"the one\", how you know & what to do", "social_network": "reddit", "user": "thinkinoutloud078015", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1591035167, "permalink": "/r/DecidingToBeBetter/comments/gupo5z/when_you_find_the_one_how_you_know_what_to_do/", "nsfw": false, "first_save": 1635436053.792213, "replies_charged": false}