{"id": "t5_2tand_t3_oyl6r1", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "8e5fe1ef-2706-4539-b5ef-34d7e826cdff", "b69cf201-6737-4217-b486-9096135546b8", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "802203c7-ca80-4c23-ad08-f571694cfc55", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "# Introduction\n\nMany people spend a sizeable chunk of their day thinking about living their dream life, but it usually stops there. As years go by, complacency smothers their aspirations and they lose the spark in their eye.\n\nSome of the coolest people on the planet are in their 40’s and above — yet, are most people in their 40’s cool? **Age doesn’t refine — age amplifies**. If you’ve been acting like a loser throughout your 20’s and 30’s, do you think you’re going to become a badass at 40? No, you’re simply going to become an even bigger loser, an *advanced loser*. Continue the trend and by the time you’re 60 you’re going to be a *loser virtuoso*.\n\nTherefore, if you actually want to be part of the very small category of people that actually live out their dreams instead of spending their time absently watching *Netflix* while getting angry over how Samantha from accounting subtly disrespected them, you have to start NOW. **Failure is not an exception, failure is the default**\n\n## How to produce massive change\n\nMassive change is massively difficult to attain. Start paying attention to the following dynamic (*you will eventually notice it even in your friends and family*) — Following some sort of unpleasant event or a long stretch of unfulfilling days, the person decides they’re going to turn their life around. They start planning out their day carefully as to have enough time to include yoga and training for a marathon in the morning, building a business in midday and learning Russian in the evening. Check in on them two weeks later — they do none of that stuff anymore, and they’re back to watching Netflix. They’ll probably go through another similar phase a few months later. A perfect exercise in futility\n\nSo, how do you bring lasting, massive change? This is what this essay will teach you. It’s a sensitive waltz between planning, action and reflection, a waltz that once gotten right will submerge you in your dream life faster than you can imagine. You will one day stop and realise — *holy shit, I’m actually living the dream*.\n\n## The key to making lasting change\n\nMany people have a distorted idea of what *successful people* (*read as living their dream life*) live like. They imagine this hedonistic carousel of peak experiences — *scuba dive with dolphins in the morning, fly a private helicopter around town just before having lunch with the president, and finally end up the day with a massive orgy comprised of the most attractive 100 people you can imagine*. While some people actually do get to experience this, they only go through it for a few days at most. Imagine actually living like this — your brain would be absolutely fried from the stimulus within a week and you’d be unable to feel any pleasure whatsoever; after seeking refuge in hard drugs, you end up in a 5 star morgue.\n\nIt’s clear that over the top *hedonism* is likely not what you want your dream life to look like. Then, if living a life of compulsively seeking peak experiences is not particularly enthralling, how would you actually go about cultivating a great life? The answer, as far as I can tell, is changing how your daily life looks like. It’s not about crazy dopamine overloads, but about making your day-to-day boring tasks be less boring. It’s about gradually tweaking the common until it becomes great. When most things you do in your day-to-day are interesting and fulfilling, what will your life be then?\n\n## Tweaking your life into greatness\n\nThe main question then becomes — *Where do you start? How and what do you start changing?* This is where the **actionable, step-by-step** part comes in. I’ll give you a framework that will help you structure your day-to-day as to resemble your dream life in the shortest time I know is possible. How short of a timeframe are we talking about? After applying what I’m about to teach you, I’ve realised my life sorta looks like what my ideal life would — after 1.5 months. That’s it (*although I was still figuring out some of the stuff I’m about to show you, so it might be possible to notice results even faster*).\n\nThere’s *4 parts to this formula*, with a nice little name to go along with it — **The Blueprint**. This formula is not meant to get you to live *my ideal life* — it’s simply the skeleton on top of which you can build your own vision. It’s specific enough to clearly guide you, but abstract enough to make it your own. With that said, let’s jump right in.\n\n## The Blueprint\n\nThe Blueprint is a set of short tasks broken down in *4 categories* that you have to do **everyday**. The important thing to note is that **you must do these actions everyday, NO MATTER WHAT**. I’ll explain why consistency is so important.\n\nOur minds are extremely *malleable* — if something is repeated or experienced often enough, it becomes *truth in our mind*. The world is so complex, that most mental frameworks can be proven true if you start looking for evidence. The fact of the matter is that most people live unfulfilling lives because they are not proactive in selecting their sources of truth. Instead they rely (*without realising*) on their environment to dictate their reality. By pure repetition, people will accept others’ mental frameworks as their own. But now, I want you to ask yourself — *How common is success in society? How often do you see people actually living their dream lives?* If the frameworks upon which most people have built their reality have lead them to unfulfilling lives, why would you accept to follow the same mental models? When deciding whether to even consider what a person is saying, first look at the circumstances of their lives — would you take advice on how to be happy from chronically unhappy person?\n\n*As a short note: I believe you should never,* ***EVER*** *share what you’re doing or the way in which you think with people that live mediocre, unfulfilling lives. They will only crap over ideas that have brought you success, yet they have never applied. All they will do is sow doubt in your mind and make it more likely that you will succumb back into your old ways. The old saying in the Bible, “don’t throw pearls at swine” holds truth.*\n\nFollowing the steps I’ll describe are in a sense the last strand that connects you to the potential of a great life. At points life will be shit, there’s no escaping it; if we don’t have some sort of practice that keeps us rooted in the process of seeking our dream, some sort of connection to more valuable ideas, hard times will completely knock us off the path. Making sure that you follow the steps I’ll describe, even if you’re sick and even if you just came back from the club at 4AM hammered out of your mind, will ensure that you’ll keep in touch with the potential of something greater. If you do not, you will succumb to the pressures of society, you will accept the mainstream way of thinking and you will drown in mediocrity.\n\nWith that being said, here are the 4 *pillars* of the Blueprint\n\n## 1. Aim\n\nBefore embarking on the journey, you must clearly know where you want to go. You must think of how the type of life you’d love to live actually looks like. To start, you must write down a list of characteristics this life will have. These items should be clearly measurable and well defined, as opposed to abstract concepts (*e.g. “I want to have $3 million in my possession in the next 10 years” is better than “I want to have a fuckload of money”*).\n\nBelow is my own definition of what my ideal life would look like. You can use it to guide you while writing your own.\n\n&#x200B;\n\n&#x200B;\n\n* Feel good most of the time, have laser focus and presence. I want to be able to reliably make myself feel like that fast.\n* Have in my possession $3mil before I’m 35 years old\n* Work on a project I’m passionate about remotely, while travelling\n* Be able to meet and have fun with a new girl I deeply like every 2 weeks.\n* Be close with my family and friends, do cool things together.\n* Have a circle of friends made out of cool, inspiring people\n* Constantly travel to new places and try out new, fun activities\n* Create a community I consistently provide value to; in return they treat me with gratitude, like a small celebrity\n* Be social and able to meet people anywhere\n\n&#x200B;\n\n&#x200B;\n\n## 2. Plan\n\nEveryday, you must plan out what activities you will carry out that will bring you closer to this goal. I prefer to do my planing in the evening for the next day. My planning is broken down in 6 categories that ensure I evenly distribute my effort when seeking out my dream life. These categories do have a meaning behind them, however I will save the in-depth explanation for a future article (*or the article will span to 6000 words*). The categories are as follows:\n\n* **Nourish** — ensure that my body is running at peak performance. I do this by prioritising sleep, eating good food and engaging in activities that promote my wellbeing (*saunas, massages, meditation*)\n* **Win** — complete difficult tasks; Be them things you’ve been avoiding (*anything from taking out the trash to getting your teeth whitened*) or things that are causing you stress (*paying late bills*), stacking wins is great for two reasons — first, it gives you a nice dopamine spike that will help with your confidence, and secondly it makes it easier to tackle bigger wins\n* **Contribute** — share value with the community, be it by changing the dead lightbulb in front of your block of flats or by teaching people about something you’re knowledgeable in online *for free*. Contributing to the *“tribe”* will raise your status and make your confidence sky-rocket. It’s unfair to try and summarise the ways in which contribution positively changes your life because of the overwhelming number of benefits it carries. This will be discussed in a separate article.\n* **Purpose** — follow some sort of goal that’s bigger than yourself — help starving children, build a business or build a cathedral with your bare hands. If you have some sort of purpose in your life, you are way less likely to get distracted by pointless drama or generally unimportant things.\n* **Face Fears** — this one is big; if you want to carry yourself with pride you must grow beyond what you already are; this usually comes at the cost of facing your fears. Doing things that scare you on a daily basis will create a confidence that no amount of new shoes or instagram likes will get close to matching.\n* **Live** — experience new things. Living live within a routine, no matter how positive, will smother your soul. Often you will rebel against your routine and shatter it to pieces simply to prove that you are alive (*Dostoyevski really got this one right*). To counter this and actually live an interesting life, go ahead and try out unique activities — try out a new cafe, travel by yourself, freeze yourself in liquid nitrogen for a few minutes. These will all give you a story to tell\n\nMy daily plan may looks something like this\n\n&#x200B;\n\n&#x200B;\n\n**Nourish**\n\n□ eat greens x 3\n\n□ meditate\n\n**Win**\n\n□ go to the Gym before 8:00 AM\n\n□ pay bills\n\n□ finish x-task at work\n\n□ learn about x new technology\n\n**Contribute**\n\n□ write a Twitter thread about how people can get more likes on their posts\n\n**Purpose**\n\n□ work on my game engine, add particle effects\n\n**Face Fears**\n\n□ introduce myself to 3 girls\n\n**Live**\n\n□ try out Cryotherapy\n\n&#x200B;\n\n&#x200B;\n\n*Note: Try to limit the amount of items to 10 with a maximum of 15. Adding more more tasks is a trap — you either won’t be able to finish them all or they’ll be so mundane that you won’t get any satisfaction out of them. Either way, you’ll feel worse about your day*\n\n## 3. Reflect\n\nIf you do this for a while, you’re inevitably going to come across some things that work and other that won’t. It’s important to make a note of these as you come across them. The mind is not to be trusted with important information — memories tend to get distorted with each recall, principles tend to get corrupted. That’s why is extremely important to get everything down in writing. If you make note of the outcomes that specific actions have, you’re less likely to bastardise ideas or to misunderstand cause-effect relations.\n\nYou should write down everything that you find notable during the day, even if you strongly believe that the information is so fundamental that there is no way you’ll forget it. This is a lie — the mind doesn’t work like that.\n\nAn example of what this could look like:\n\n*“I went to sleep late last night because of watching dumb YouTube videos. Because of this I woke up late and missed the gym; from there, the entire day went to crap — I felt tired and grumpy and got less done than I usually would”*\n\nAt the end of every week, you should go through every journalling entry you’ve made and extract the essentials. At the end of every month, you should go over every summary you’ve made and refresh that. When doing a recap I usually structure it like so:\n\n* A description of the lessons learned\n* A list of things I should keep doing\n* A list of things I should stop doing\n* A list of things I should start doing\n\n## 4. Avoid Traps\n\nAfter journaling for a while, you’ll start to notice certain patterns emerge. Perhaps that every time you drink more than two glasses of wine you wake up with a nasty hangover and as a consequence mess up your entire day. After this happens a few times, you should make note of it in a separate list — this is going to be your **Traps** list.\n\nAn entry of this list should include **the action you should avoid** and the **specific reason why**. Clearly state the cause-effect relation.\n\n## Permanence\n\nThe key to making this all stick is *consistency*. To make this process work, you need to hammer these ideas down every single day.\n\n**You must read the list that describes your perfect life** ***EVERY DAY***.\n\n**You must read the list that describes the traps you should avoid** ***EVERY DAY***.\n\n**You must plan your day,** ***EVERY DAY***.\n\nThis is the key to it all — *repetition, repetition, repetition*. Again, if you allow space between these practices, doubt will start to creep in. Let enough doubt build and you’re done; your mind will start thinking that you were fooling yourself and that what you were doing was pointless (*even if it brought you real, tangible results*). You’ll start cringing at yourself for doing these things and breaking so far out of social normalcy (*even if you were stunting on most “everyday” people*). You’ll be back to square one faster than you can imagine — never underestimate the omnipresence of social pressure; unless you’re constantly and proactively fighting it, mediocrity will consume you.\n\n## Life after the Blueprint\n\nYou’ve been following the advice above for a little more than three months. You’ve just finished reading the *description of your ideal life* and your list of *traps*. You’ve planned the following day and have a pretty good feeling about what’s to come.\n\nYou’ve invited a cute girl you’ve met earlier this week to join you for a *Russian Banya Sauna*; sure, grabbing coffee with her might have been nice, but you simply don’t have the time — your friends want to introduce you to someone that has a business idea to present to you. After, you’re all going to get a few drinks and shoot the shit, but you won’t be able to stay for too long — tomorrow you have a flight to *Barcelona*; you’ve decided to treat yourself and use the extra money you’ve got from your new gig to work remotely from a nice city.\n\nAnd then you take a moment and realise, in awe — *holy shit… I’m living my dream life.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oyl6r1/how_to_create_your_dream_life_an_actionable/", "title": "How to create YOUR dream life - an actionable, step-by-step plan", "social_network": "reddit", "user": "better__ideas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1628178570, "permalink": "/r/DecidingToBeBetter/comments/oyl6r1/how_to_create_your_dream_life_an_actionable/", "nsfw": false, "first_save": 1635435075.742434, "replies_charged": false}