{"id": "t5_2tand_t3_q3km6z", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "This is a bit like the Rich Dad Poor Dad - I will never have enough time.\n\nThis started since the last lockdown. I was not so miserable with myself before. In the lockdown, I started a self development journey that caused me to almost break.\n\nThe moment I have some time to myself, I decide to fill it with all kinds of useless stuff.\n\nMy schedule is always power packed to the brim. Have 1 hr extra everyday? Plan a Udemy course. Have just 8 hrs of work?  Try to do stuff, plan your day to the minute in advance to be more and more productive at work. Got a promotion? Good! Start looking for a new job. Start working for the next hike/promotion... You get the gist.\n\nRecently I decided to pursue a distance MBA, just to get an idea of how management courses are structured and to know if the content interests me. Just a month back, after having not played any sport/excercised even a bit ever in my life, I joined a gym to get in better shape. More recently, started a complicated skin routine.\n\nOn top of all this I had started freelancing and was dedicating 4 hrs a day to that.\n\nYou can guess what happened.\n\nI got my first grey hairs through all the stress, almost cried, had no energy to proceed, and in general developed depression.\n\nI have decided a recovery path - Doing nothing for 4 hrs a day.\n\nThat means Nothing. No work. I can watch a movie go for a walk, have a little bit of light fun, but no strict planned FUN events. Just chill.\n\nI plan to do this for half a year and then see the results.\n\nDo you all think this is a good idea? Or am I still overcommiting to something actually undoable?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q3km6z/deciding_to_be_a_slob_for_some_time_until_i/", "title": "Deciding to be a slob for some time until I figure my life out.", "social_network": "reddit", "user": "reactivespider", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1633646746, "permalink": "/r/DecidingToBeBetter/comments/q3km6z/deciding_to_be_a_slob_for_some_time_until_i/", "nsfw": false, "first_save": 1635435082.6015134, "replies_charged": false}