{"id": "t5_2tand_t3_moc250", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": " \n\nIt's been a year since I posted, I've been really busy since this my first year of college, and covid. This is a re-upload of a old post. I hope everyone is doing well. I plan on posting more and more since I started a podcast, and I've been trying to expand my knowledge.\n\nChapter 1\n\nThe main point of this chapter is to highlight the fact that criticism often does more harm than good. He stated that most people often react to rewards or positivity. Blaming someone does not solve the problem. So instead we must be positive, because that offers more productivity. People often shut down due to criticism, and that leads to no good results. He also states that, instead of criticizing another man’s flaws, we should improve upon ourselves.\n\nChapter 2\n\nHe starts by saying that the only to make someone truly do something is to make them want to do it. He also reinforces the concept that everyone likes a compliment. The fact of the matter is that it must be sincere. If it’s not sincere then it will end up having the opposite effect. He also states the everyone craves a urge of importance, and that is equivalent to sex and eating. If you want to motivate someone to do something for you, then add a sense of importance to the request. Everyone wants a sense of importance, and each person derives it differently. He shows that people will go insane for importance, so imagine the effect that it has in reality.\n\nChapter 3\n\nHe starts this chapter with the thought that, instead of talking about what we want, we should talk about what others need. That’s the best way to attract people, because they find it easier to relate, then, to your needs. Since the day we were born we all wanted something, and if you want to get something then we most exploit others desires. He also states that arguing is the worst vice to have. Instead of proving your point and damaging another pride, it is better to be empathic. If you do this is it is much easier for you to see eye to eye with another. The main point of this chapter is push the point that one who can see another's perspective and see their desires has a bright road ahead. (basically get people to eagerly want something).\n\nChapter 4\n\nHe states that it’s easier to be interested in someone than getting someone to be interested in you. People are not interested in anything but things that concern themselves. Truly profound was something written by vietnamese psychologist which we can be simplify as “ those who are interested in the concerns of others are often the worst of us.” He shows an example by talking about president Theodore and his love of people, and how he greeted everyone equally. Another thing that he states was that if we want to befriend people we must first do things for people that show we care.\n\nChapter 5\n\nThe first point made in this chapter was the fact that actions speak louder than words. It doesn't matter the clothes you wear if you don't have a likeable personality. He also states that most people are better off smiling, and that if they do then have a better chance at life. He also states that, unless you’re having fun doing something, you want put your all into it. IF YOU WANT TO BE HAPPY YOU MUST THINK HAPPY THOUGHTS. He states that acting is the first step, then soon true happiness will follow. People look for happiness. So if you’re happy, then people will follow.\n\nChapter 6\n\nThis chapter teaches you how to make people like you. He starts off by saying that to make someone like you, you have to compliment something about them with honesty. He then states that there’s nothing wrong with complimenting someone without an ulterior motive. The most important thing about human conduct. Basically the fundamental law is that you most make others feel important. “ The desire to be important is the deepest urge in human nature.”. This rule applies to everyone. You don’t have to be a public or political speaker. He states that many lives could have been different if they felt important.He states that every man he met was superior in some way.\n\nChapter 1B\n\nThe main point of this chapter is to highlight the fact that most times arguing damages both sides. Basically kindness often helps you more then being obsessive over the right answer. Instead of purposely getting aggressive over who’s right. Don’t worry about it, because often times all it does is make them go on the defensive and get more rooted. He states that a drop of honey goes a long way. The best way to get them to see the light is to be nice and suave about it. Make them see that they're in the wrong in a nice way, or don’t argue with them at all.\n\nChapter 2B\n\nThe main point of this chapter is to show you how not to make enemies. The best way is to never say that they are wrong. If you can’t even be sure that you're right, then what right do you have to judge them. That’s basically saying that \"i’m saying I’m smarter than you\". That will hurt someone’s pride, and it’s a sure fire way to make enemies. The point is similar to the point made in 1B, that we as people know nothing, and as such all we can do with confidence is make them see our way, but not through force, but through subtlety. Instead of judging them, you must understand where they came from.\n\nChapter 3B\n\nThe main point of this chapter is to highlight the fact that in most scenarios is better to just admit that you're in the wrong. He does this by highlighting the pros and cons of admitting you're wrong. He states that if you say all the things you're in the wrong for, it will de-escalate the situation. Not only does this take away their ammo on things they can talk about, but it also feeds their sense of importance. It also ends the problem quickly and efficiently.\n\nChapter 4B\n\nThe main point of this chapter is to express that, in most scenarios, getting more angry does nothing but increase hostility. In most scenarios it will be better to talk it out normally. If you get angry all it does is to escalate the situation. It lets others know how what they're doing is affecting you, and, in most cases, they will probably try better and harder. To conclude, he’s basically saying that being nice works a hundred times better than being rude or angry.\n\nChapter 5B\n\nHe starts off this chapter by talking about an ancient greek philosopher. Then he talks about that often people's pride interfere in rational thought and it makes them bitter. Then he talks about how, in most cases, if you take the time to talk to others about what they're interested in, you might understand why he said 'no' and you can make them turn around. A negative answer doesn't mean that it's over. All that it means is that you must retry your approach. You will find often that if you get people to say 'yes' then you have won.\n\nChapter 6B\n\nThe chapter is basically labeled how to handle complaints. He starts off by saying that everyone has a point. It will be better for you to listen to what others say. He states that sometimes we have to step back and let others speak. He states this by giving an example on a relationship between a mother and daughter. The moral of that story is once all communication ends, the conflict is bound to lead to negatives on both sides. When you give commands without listening to the struggles of those who perform those acts. A simple solution to this matter is to let others talk.\n\nChapter 7B\n\nIf you want people to cooperate with you, then must make deals with them. You must give something to get something. He highlights this by telling a story of a boss saying that he will do certain things, but then he asks what he should expect in return. If you want people to do something, you must make it seem like a commitment, not a drag. He states that by letting others think that it's their idea, it convinces them and makes them more dedicated. Instead of asking other people to get something or sell something, you should conversate about the situation and it will often sell itself.Chapter 8B\n\nChapter 8B\n\nEveryone can be wrong sometimes. If you don't understand their thinking, then talk to them. It will be more beneficial in the future help you make a decision. He applies this to people and their desires. He says this when he talks about a time he saw a couple of boys making a fire to relax and camp out. He could have been extra mean and used laws and facts to make them leave and ruin their fun, and build up resentment and cause them to ignore him. Instead he saw how he looked from their point of view, and realized that, with words of kindness and caution, he could make them and the park safer and keep their enjoyment.\n\nChapter 9B\n\nHe states that often we should be understanding to another person's situation. We are only what we are because of the people in our lives. So instead of wasting our time judging their mentality and belittling them, we should understand where they come from and why they think like that. It will be of use for both of you to show some empathy.\n\nChapter 10B\n\nA good way to get people to do something is to appeal to the goodness in their heart. He says often people have two reasons to do something: the look good reason and the real reason. If you want someone to do something then appeal to their basic goodness. For instance, if someone takes pictures of you, then appeal to their beliefs, and ask how would they feel if someone did that to their family. We go to understand that all humans are built of beliefs and values, and we can use that to get people to do something.\n\nChapter 11B\n\nMake your ideas pop out more specifically by making them more dramatic. If you want people to react and talk about your ideas, you should make them interesting. You can just express ideas but what can make them interesting it acting them out. Most people will have a hard time not being interested in dramatic things. It will get you their attention, and then your words will keep them focused.\n\nChapter 12B\n\nA good way to get people to do something with earnestness is to support competition. It will stimulate their pride to do better. When you see someone doing something better than you often you'll want to do it better then them. So it will have a reciprocous effect that will push both of you to do better. The second thing you can do to boost productivity is to add a little challenge in the long term. It will push others to be better. It will make them search for ways to overcome the obstacles.\n\nChapter 1C\n\nThe best way to criticize someone is after a compliment. It will cause them to appreciate what you’re saying, and it adds that you’re on their side. It will make them understand that you’re not doing this to better yourself, but to help them for the future. It shows that you have their best interest at heart. It adds more emotional impact. It shows that you believe in that person, but letting them know there are things they can do better.\n\nChapter 2C\n\nThis chapter is to highlight the proper way to critique without hate. He talks about how different people used the same way to make people change their ways. By not reprimanding people with negativity, and by using kindness, it can make them appreciative and make them think a second time when doing something that might upset you. The best way to do this, is by making them realize their mistakes with subtlety.\n\nChapter 3C\n\nThis chapter is basically an extension of chapter 2C. It’s basically another way to critique people on their mistakes. He states that if you emphasize that you made the same mistakes, it can lessen the blows from your critique. He states that if you have more experience, don’t forget that you were in the same position as them. Instead of hurting their pride, just let them know their mistakes but also that they re not alone in that position.\n\nChapter 4C\n\nEveryone hates to take orders. So instead of giving them direct commands, it’s best to ask them questions. Let them come to their own conclusion on what's needed to be done. Often it will result in the same end. It will give them a sense of freedom, but also less of an oppressed feel.\n\nChapter 5C\n\nThis is brought up in an earlier chapter, but the point of it is to highlight the fact that letting others save face is often beneficial to both parties. When you push to hurt others' pride, it just damages your rep as much as theirs. Be the better man, and often it will come to benefit you going forward. It will help you make less enemies.\n\nChapter 6C\n\nIf you want people to live a good life, then you must compliment their good decisions. Not just some of them, you must compliment all of them. If they understand that good things happen when they make good decisions, it will lead to their betterment.\n\nChapter 7C\n\nThis chapter's main point is to highlight the effects of giving someone a good name. If you give someone something to live up to, then they will to try to live up to your expectations. It will make them do this because it adds a sense of failure. If they fail to live up to the expectations of one person that believes in them they feel distressed. So, to avoid the pain, they will do what is expected of them, to keep that good name.\n\nChapter 8C\n\nThe main point of this chapter is pretty simple. If people think that they have a fault that’s too big to fix, then what motivation do they have? So you have to encourage them and reassure them that they can do it if they believe. No fault is too big to fix (except death).\n\nChapter 9C\n\nThis chapter is pretty simple, because it just goes over everything you read. If you want people to do something, then you must want them to do it of their own free will. The best way is to mix-match. For instance, making them think it's their own idea, or ask questions that will lead them to that path their own way.\n\nShoutout user for fixing my errors and making the summary more understandable.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/moc250/how_to_win_friends_and_influence_people_by_dale/", "title": "How to Win Friends and influence People by Dale Carnegie Summary", "social_network": "reddit", "user": "terrorist_kid", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1618085422, "permalink": "/r/DecidingToBeBetter/comments/moc250/how_to_win_friends_and_influence_people_by_dale/", "nsfw": false, "first_save": 1635435454.394515, "replies_charged": false}