{"id": "t5_2tand_t3_o0xnn4", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I know it’s a punch of a title, but seriously, I am done. \n\nFor some background; \n\nI’ve been using pot (it’s legal in my country) for about 2 years everyday. Through those 2 years I’ve experimented with lots of psychedelics, uppers, downers, and other substances. These (and my stupid decisions) have put me into harmful situations. Summarizing all of these, my brain feels pretty fried after two years. \n\nIt’s only as of the past few weeks where I’ve realized how my family sees me and how my friends see me, let alone my own poor self image. \n\nI’ve decided I’m done. I don’t want to take these things anymore, including pot, which I started for mental health reasons (PTSD night terrors could only be cured by a joint). But, now that these health reasons have dissipated, I have no need. It’s addiction and being surrounded by addicts that keeps me going down the drug hole. \n\nUnhealthy food and laziness ties in together. It’s self explanatory. I eat a constant stream of fast food and sit on the couch doing nothing but being fried and consuming television. \n\nFor being a doormat, all these factors have helped me become very passive to every person in my life. My family, friends, and partner. I feel half asleep to everything passing me by. Even when something bugs me I don’t have energy or power to speak on it. I don’t feel strong or that I matter.\n\nPutting these all together, I’m done.\nI’m done doing drugs to make me a half-dead zombie pawn in life. \nI’m done eating like shit and not actually being active in this life. \nI’m done being complacent to situations I’m uncomfortable in. \nI’m done. I’m not even in my twenties yet and I feel like I gave up hope on myself. \n\nThese past few days I’ve been eating healthier, quit ALL substances (one joint the other day, I have my faults), and been brutally honest to the people around me about my unhappiness. It’s been difficult being completely sober and mentally I feel drained, but I know this is the first step on my way up. \n\nThat’s the only thing keeping me going, knowing that once I start, it’ll only get better. \n\nI make this post reaching out to others who are in the same situation, we can and will get better as long as we focus on the destination ahead: happiness.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o0xnn4/kicking_drugs_unhealthy_food_laziness_and_being_a/", "title": "Kicking drugs, unhealthy food, laziness, and being a doormat.", "social_network": "reddit", "user": "hellfairiez", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1623821687, "permalink": "/r/DecidingToBeBetter/comments/o0xnn4/kicking_drugs_unhealthy_food_laziness_and_being_a/", "nsfw": false, "first_save": 1635436022.759815, "replies_charged": false}