{"id": "t5_2tand_t3_md8rds", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "\"*I don't perform better than you because I'm smarter than you. You're pretty smart yourself, actually. See, when there's a* ***deadline***, you can get a ton of work done in a short amount of time.\n\n*The difference between you and I, is that I don't need a deadline to do that. I can do that* ***on command***. *You, however, have no control over it and therefore you fail. So let me show you how to get it.\"*\n\n# The background\n\nAs someone who has performed decently well both sports and academics, I wanted to share with you my take on motivation, thought it will help some people out here.\n\n**I'm a very emotional person**, who's also very impulsive, can't sit still and probably have ADHD. Meaning, if I don't feel like doing something, I won't do it. I might even really want to do it, but still not make myself do it. Which goes against everything every success coach says, \"*Do it even if you don't feel like it*!\", but I've tried that many times, doesn't work. So I was forced to find a way that worked for me, for a feeling-based person.\n\nThrough trial and error, I eventually ended up with a very strong ***\"Inner motivation\"***. When most success coaches talk about inner vs outer motivation, I cringe cause it's no concrete stuff, just general blaberbab. This, on the other hand, is **concrete stuff** you can apply to get it. You do it by adjusting two parameters:\n\n# Overarching concepts - \"tenning\" and \"spenning\"\n\nThe first one is \"***tenning***\". It's a Norwegian word, meaning to light. On one end you can have very low tenning, being ice-cold, emotionless and rational. On the other you can have very tenning, being angry, loud and instinctive.\n\nThe second parameter is \"***spenning***\", another Norwegian word, equivalent to tension. Even even though you can be ice-cold, you can still have high spenning, leaving you determined, tense and focused. Or you can have low spenning, being relaxed and nonchalant.\n\nNow, imagine that you can tune these two up and down, from 0-10 (or 1-10, whatever you prefer). Then you have a grid with 100 different modes you can access. By adjusting these, you change how you feel until you find one that **clicks for you**, that just get you going.\n\n*(Some more examples: While being fiery with high tenning, you can have low spenning, letting you speak your mind and wear your heart on your sleeve. Or have high spenning, mixing determination with anger to compete your best in a physically demanding sport)*\n\n*(I'm sure you can pick a few characters from you favorite series and place them on this grid)*\n\n# What works for you\n\nEveryone works the best with some combination of the two. It varies from person to person, but through this framework, you can begin finding what works for you. Also, different situations might require different combinations.\n\nFor me, to get started with studying or work, I need a spenning of 9 or 10. ***If I don't have it, I simply won't start***. But thing is, once I have it, it works really well for me. I can vary the tenning, but with a high spenning, I just get going and it's very hard to stop me.\n\nThis probably doesn't work for everyone, but for someone like me who lacks discipline and lives quite impulsively on my feelings (*I hate to admit it, but it's the truth*), it really works. **I don't have much of a choice**, I must use my feelings to my advantage, and this is the best way I've found to do it.\n\n# Accessing tenning and spenning\n\nSome people say *\"You can't just change your feelings on a dime\"*. I honestly don't know. I just imagine a **knob or a bar in my mind, where I either turn it up or down**, and I begin feeling it. It depends on the situation though, sometimes it's hard to turn down tenning when I'm hurt and emotional for example. But more often than not, it's a matter of listening to my feelings and guiding them. Like directing a river, rather than stopping it, if it make sense.\n\nBut that way of accessing tenning and spenning is what works for me. Perhaps it's different for you, you gotta figure out what works for you. Either way, whether it's hard to access or not, I think it's good to be aware of this in managing your feelings when it comes to motivation. **If nothing else, it's sorta like a compass** that gives some structure to an otherwise messy world, I guess.\n\nI hope some of you found this helpful! I tried highlighting certain parts of the text to makes it easier on the eye and to skim through. Let me know if you have any questions or insights, I'd love to hear them!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/md8rds/my_take_on_motivation_former_athlete_and_straight/", "title": "My take on Motivation (former athlete and straight A's student)", "social_network": "reddit", "user": "Starter_OTGG", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1616707284, "permalink": "/r/DecidingToBeBetter/comments/md8rds/my_take_on_motivation_former_athlete_and_straight/", "nsfw": false, "first_save": 1635435190.124026, "replies_charged": false}