{"id": "t5_2tand_t3_gdoewc", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I’m such a failure. A huge fuck up. I’ll try to paint this pathetic picture for you if you can bear it. \n\nOCD infected me at a very young age when I started to get obsessively worried about being sick. My parents told me to pray to god and everything would be fine. Thus my first compulsion was born. It went from that to staying up all night making sure the blinds were straight or turning all the lights on and off millions of times and never feeling right. And I was always hiding my compulsions in shame from other people. That shaped my whole personality. To this day at 26 years old still no one really knows me. None of my family members really do. The few girlfriends I had years ago they didn’t either. I’m secluded and cut off from everyone whether they realize it or not. I keep up a wonderful act. \n\nMy physical compulsions somewhat subsided in my teens and it became anxiety about everything especially social situations. I think this was triggered or at least made worse by my weed use starting at 15. Freaking out that I was going to have a heart attack and manifesting chest pains. \n\nWhen I became an adult it became anxiety about growing up and life stuff. Terrified of having to get a job or doing job interviews so much so that I put them off for years. My parents didn’t force me to get a job so I gladly kept avoiding it. I also never told them it was because of my fear and cowardice and to this day they don’t know. Disgusting privilege allowed this to happen and my immense cowardice. I didn’t have a “job” until one was basically offered to me and I just said yes. This was when I was *22*. It wasn’t even a real job anyways it was a dumb position for a church and I barely did shit. \n\nAfter this a new period of my life started which was marked by my rejection of “god”. Started to heavily use weed and ocd came back as a new monster. Fear of suicide. Terrified I would kill myself. Obsessively worrying about morality, mortality, and existential questions. Somehow during all this I managed to graduate college, probably my only real “accomplishment” but I doubt even that. I had no plan for my life and I never have and I still don’t. I’ve been graduated for two years now. No job. At home with my family in my childhood bedroom at 26 years old. Haven’t touched a girl in 5 years. Probably never will again. A lot of the time I don’t see a way forward since I have such a lack of job experience and sexual experience. I missed the normal progression. I was destined to. How can I explain to any potential employer what a piece of worthless trash I’ve been. How will I ever build a life for myself when I’m so far behind? Have a place of my own so girls will actually want to date me? I have no money I live completely off my parents. My siblings are younger than me and moving forward in life and I’ve always been behind. Always. \n\nAnd now with current times? As if I wasn’t already fucked. I mean I had no plan before the crisis but it’s definitely putting my life on pause even though it was already on pause. Guarantees me being without intimacy for at least another year and honestly who knows how many more after that. None of us do. I may never feel comfortable going outside again. I’m just gonna keep living here, wallowing in my privileged misery, while life passes me by as it already has. Clearly my problem is that I’ve never had to do anything for myself and that has made me a coward. Good times make weak men. I am the prime example of this. Just thinking about myself as the fourty year old virgin with no job living at home... I can’t take it. I  can’t stop obsessively thinking about that future character that I am destined to be.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gdoewc/my_life_has_been_wasted_current_times_have_only/", "title": "My life has been wasted. Current times have only made it more certain", "social_network": "reddit", "user": "st0nervirginsunit3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1588641610, "permalink": "/r/DecidingToBeBetter/comments/gdoewc/my_life_has_been_wasted_current_times_have_only/", "nsfw": false, "first_save": 1635437852.4918659, "replies_charged": false}