{"id": "t5_2tand_t3_h0ifk0", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "I’ve been a constant pot smoker and alcohol drinker since I was 16. For me at the time it was depression that led me to substance use. I always thought weed was not a bad drug since it never leads to overdose deaths and things like that so I used it every day. Alcohol was more of an occasional thing. Whenever I smoked pot or used any drug I temporarily forgot about my depression, but when I sobered up it hit me even harder leading me to more use. \n\nEventually I started being exposed to more things and just trying it as it came along. Pills, and psychedelics at first. I never took enough of one thing over a long period of time to develop a habit, so I thought I was good, being responsible. As I look at it now, I never went a week without doing some kind of drug. I was addicted then, even though I didn’t tell myself that. \n\nIt wasn’t until years later, after a stint of being homeless that it got much worse. I was working now and had a place to live, but I also had more exposure to substance abuse. I tried cocaine, and I enjoyed it, but it wasn’t until I toured in a rock band that I started regularly using it. Sometimes I would even take whatever some one offered me, leading me to using meth for the first time. I was a rocker, I loved to party and drink and get fucked up. I used to say when I was younger I’d never touch those hard drugs but now I was using like it was nothing. \n\nRecently I’ve been seeing a decline in my health and energy. I drink just to take the edge off. I felt disgusted with myself. My dad was an alcoholic and my sister just relapsed back into the booze, which has lead her to have seizures and many other problems. My rock bottom was when I took heroin. Just to feel something other than my brokenness and lack of love for myself. I felt great until the after effects. And then I took it a second time...\n\nIt wasn’t until a day or two after that second time shooting up that it really hit me. Hard. I woke up and smoked some weed. Got really high and then started to feel like shit. Like I was going to die. My body would get numb and then cold and I’d feel a strong tingling go all the way up to my head. My heart was pounding and fluttering and I had a fever. I was sweating profusely, but I had to go outside in the 95 degree heat to feel ok. I almost checked myself into the hospital but I took a walk instead and started to feel better.\n\nWhen I got back home I threw it all away. My pipes, bongs weed all of my parephenelia and I told myself I’m done for good. I never want to feel that way again. I haven’t really got to know my sober self throughout my life and now at 25 I will start to. \n\nSeeing my sisters health decline from drinking and how my fathers abuse affected our family makes me wonder how I let it get this far for me. I felt for a long time that I might want to clean myself up, but the immediate satisfaction and the fun I was having kept me from making the leap. Well now it’s not fun any more, it scares me but I have to do this. For me, my family and my future. Today I’m deciding to be better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/h0ifk0/i_finally_decided_today_is_day_one_of_sober_living/", "title": "I finally decided, today is day one of sober living.", "social_network": "reddit", "user": "Xitobandito", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1591818057, "permalink": "/r/DecidingToBeBetter/comments/h0ifk0/i_finally_decided_today_is_day_one_of_sober_living/", "nsfw": false, "first_save": 1635438141.6974895, "replies_charged": false}