{"id": "t5_2tand_t3_q1h1es", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "Ok to the mods, please remove this post if it is against any of the rules. I really don’t know where to post this. \n\nTo;dr - I fear I may be domestically violent and I don’t know where or how to get help before it gets worse. \n\nI’m on mobile so I am sorry if this becomes a wall of text rant. \n\nI am 26, female. I have been mentally ill for a while and haven’t been treating it properly. Tbh I don’t even understand what’s wrong with me. Im in a long term relationship. We have been together for about three years now. We are open and ethically non monogamous. The fights in the relationship are neither here nor there, but they are getting increasingly scary for me. I have always been a yeller and I was emotionally and verbally abused by my father growing up.\nMy partner and I fight (the about a are irrelevant to this story) and I have always had a hard time controlling my emotions and attitudes during a disagreement. Lately I have started doing things. It started with clapping while I yelled, then one day I clapped so hard I bruised my fingers (the start of my fears I may be domestically violent) then our next big explosive fight I went into the bedroom to get some space and calm down but he followed me (calmly not like a cornered me situation) but I was so mad I ripped the drawers from my dresser and threw some of my clothes onto the bed. Nothing broke, but come on that’s scary behavior. Flash forward to today. We are fighting and sitting across from each other at a table. As I yelled, I was slamming my hand on the table. He asked me to stop doing that. Next thing I know I have picked up a candle to blow it out (who knows why I felt I needed to do that right this second) and accidentally poured hot candle wax all over my face and body and got spray of it all over the table and floor. It took me about an hour to calm down and my partner had left the house. He told me I am domestically violent after the fight with the dresser drawers and it’s been weighing on me heavily. I hate to say it, but I am a clean cut, college educated white girl 5’7” and he is a 6’ bigger man who is mixed. If cops got involved they would be on my side, even if they knew I was the abuser. I mean, look at the gabby patito body cam footage. I called my mom and freaked a bit asking her advice and she doesn’t think I am domestically violent. My fear is that i am not making these decisions to do the crazy and borderline violent (maybe actually violent) things. So what if it gets worse? What if next time I break something and then punch a wall and then hit him?! I’ve never got anyone in my entire life, never don’t a violent sport or played video games or anything so I never though I was a violent person or had violent tendencies. But what if I am? People always talk about get away from domestic abusers and how they won’t change or they tell the abuser to “get help” \nSo I guess this is me begging that someone in this Reddit knows where to start?  How do I get help? How can I prevent this from getting worse? And how do i tell the differ nice between angry outbursts that maybe are ok/healthy and violent tendencies? I’m afraid of myself and if I was a man people would be afraid of me too.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q1h1es/help_i_think_i_am_becoming_domestically_violent/", "title": "Help. I think I am becoming domestically violent and it scares me.", "social_network": "reddit", "user": "IthinkImamonsterhelp", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1633386597, "permalink": "/r/DecidingToBeBetter/comments/q1h1es/help_i_think_i_am_becoming_domestically_violent/", "nsfw": true, "first_save": 1635435776.6887677, "replies_charged": false}