{"id": "t5_2tand_t3_pyazq4", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "To give some background, I spent 4 years in the Air Force working Aircraft Maintenance. It was a job that I didn't enjoy, but I paid my dues. I separated in January, and tried to move off to Utah to pursue a degree in aviation with helicopter flight training. Due to the VA suspending the program temporarily, and a large obstacle in getting my FAA medical, I decided it wasn't a viable option, and moved back home to Alabama. Since then I have tried to find what I want to do for the rest of my life. I know beyond a shadow of a doubt that my career lies in the military, but where? It would be smart to use my GI Bill to pay for college, and then commission into whatever field I wanted. But that's where the paradox comes in. I have so many choices that I don't know what I want. Some jobs sound interesting, but none jump out at me. I want to feel fulfilled by my job, and I want to be given the opportunity to take care of my people. But beyond that, I don't know what to major in, which branch to try and commission in, or what job would fulfill me. I have the opportunity to go anywhere, and yet my dreams are so vivid I can't even see them. \n\nI'm not really sure what the reason for this post is; whether it's to get some advice, or just get some weight off my shoulders. But I hate the fact that no matter how much research I do, nothing sticks. Every time I think \"Let's go for that!\" It doesn't even take a week before I'm back at the drawing board. \n\nI've already seen what it's like to be in a job you dislike, surrounded by people you don't fit in with, and having no way out. It's not pretty at all. And I don't ever want to be in that situation again. But the only way to do that, is to figure out what I DO want, and settle for nothing less.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pyazq4/the_paradox_of_choice/", "title": "The paradox of choice", "social_network": "reddit", "user": "Dareelbomb259", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1632970842, "permalink": "/r/DecidingToBeBetter/comments/pyazq4/the_paradox_of_choice/", "nsfw": false, "first_save": 1635436699.2559674, "replies_charged": false}