{"id": "t5_2tand_t3_obpst5", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I have been struggling with anxiety and stress for a few years now. Last year I tried out meditating and noticed that it helped me. However, I am also really really bad when it comes to treating myself good. For a long time now, I have always exploited my physical and mental health in favor of work and friends, only to find myself on the edge of burnout every 6 months. On the days when I felt good, I skipped meditating and workout and only did it when I was feeling really sick. It is really hard for me to establish and keep routines.\n\nAbout a month ago, I reached this point again, rock bottom. This was when I realised: I can't go on like this, I will always get to this point over and over again - only filling up my energy to waste it on things that lead me nowhere until I am burnt out again. I realised: If I want to have a good life, to establish a good and stable mental health, I need to care for myself and be mindful not only on the bad days, but also on the good days. \n\nI made mental health my #1 goal for this year discarded other goals like getting a pay raise.\n\nInstead I started a small meditation and mindfulness routine, started doing sport at least once a week and started to leave work on time. I sticked to the meditation routine even if I was extremely tired or not feeling like it at all. I also skipped other tasks in favor of the meditation. \n\nToday I reached my milestone for meditating 20 days in a row and I feel so good. I finally feel that I have a chance for feeling good, that I am being good to myself and that I am worth it.\n\nEDIT: Wow, thanks for the awards and your supportive comments! You're a great community!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/obpst5/finally_made_mental_health_my_1_goal_and_reached/", "title": "Finally made mental health my #1 goal and reached a milestone today", "social_network": "reddit", "user": "MazeL41", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 543, "down_vote": 0, "creation": 1625157937, "permalink": "/r/DecidingToBeBetter/comments/obpst5/finally_made_mental_health_my_1_goal_and_reached/", "nsfw": false, "first_save": 1635436499.072491, "replies_charged": false}