{"id": "t5_2tand_t3_o369dt", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Hi guys! I’m apologizing in advanced for this  super long post\n\nI (20f) feel like everything about me is wrong, like I’m living my life wrong. I been out of school for the past year because I just don’t know what I want to do with my life. I have no major and I don’t know what I really like enough that I would be able to pursue a career in. I feel like I’m running out of time and it stresses me out to the point where I just want to cry all the time. \n\nI’m such a crybaby and cry a lot. Like I mean a lot. It’s almost embarrassing to think of how much I cry. I’m super sensitive to everything and sometimes I take things way too personal. I feel like it’s because I already know that I have so much that is wrong with me that I get hurt and act defensive. \nI don’t have any social media anymore because I have low self esteem/ a lack of confidence and I tend to constantly compare myself to other girls. I used to not be so insecure and had a lot of confidence, but for some reason within the last year or so, it’s been hitting me really hard. My confidence will comes and go, but I really just want to feel confident at all times.\n\nI also feel like I am too dependent on my boyfriend and would like to stop being so dependent on him. I notice I get anxious and overthink everything when he hangs out with his friends and sometimes even jealous because I don’t really have that many friends and wish I did. I try so hard to change the way I look at these situations, but my feelings get the best of me and it’s so frustrating because I always end up feeling guilty because I know I should have a better mindset going into these types of situations and not think in those ways.\n\nI really want to be better and get better, not only for myself, but for those around me as well. Any advice and help is greatly appreciated! Thank you for taking time out to listen to me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o369dt/i_feel_like_everything_about_me_is_wrong_and_that/", "title": "I feel like everything about me is wrong and that I am failing myself.", "social_network": "reddit", "user": "buyerprue", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1624070139, "permalink": "/r/DecidingToBeBetter/comments/o369dt/i_feel_like_everything_about_me_is_wrong_and_that/", "nsfw": false, "first_save": 1635435096.435938, "replies_charged": false}