{"id": "t5_2tand_t3_oid7lr", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "b69cf201-6737-4217-b486-9096135546b8"], "text": "We try to be better.  We watch self help videos and take advise from others and we try to replicate their methods to fix our personal issues.  The problem is that our issues are our own.  Others might have tips to help you tweak your methods but there is no one out there that has the exact playbook for you to follow except you.  Personally I have ADHD and that means my brain doesn’t work the same as a normal person.  I’ve had to change my behavior based on my situation that is different from the situation of others.  So stop looking at what other people do and look at what YOU need to do.  Ask yourself these questions\n\nWhat are the main things holding me back?\n\nWhich of these things is the easiest to fix?\n\nWhat are small things I can do to fix the major issues holding me back?\n\nFor the first question dissect everything that you are doing and pick out the things you know are not good both for you know and the you of the future. \n\nFor the next question, triage you list from question 1.  Put them in order from easiest to hardest.  Then pick the easiest one and focus on improving only that aspect of your life.  You don’t want to divide your efforts into to many different areas at once.\n\nFor the last question, once you’ve picked the thing you want to work on, think of small things you can do to improve that aspect of yourself.  Big sweeping changes are great if you can pull them off but small changes are much easier and and have just as good if not better an effect.\n\nThis process doesn’t even have to be a physical written list, you can just do this in your head.  You can even, and I’d recommend, put on the list that one day you want to make it physical and write it down.  \n\nFor me personally when I was at my lowest, depression, anxiety, untreated ADHD (tho i didn’t know that at the time), I knew i needed to first seek help.  After i talked with my parents and found a therapist i focused on my physical health.  I was eating to much so i started intermittent fasting.  I was to tired to go to the gym so i found a gym partner who motivated me and started using preworkout to give me energy.  Now I’m focusing on improving my social life.  The beautiful thing is that each improvement you make will make the next one easier.  Trying to improve my social life as the depressed fat lazy ball of shit i was would’ve been impossible, but now with more confidence, a better attitude, and a better physique I’m in a much better position to be better. \n\nOne by one just focus on the easiest changes you can make and i promise you’ll see results.  Stay strong everyone, you got this 💪", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oid7lr/the_art_of_being_different_do_what_works_for_you/", "title": "The Art of being Different, do what works for YOU.", "social_network": "reddit", "user": "Famous-Date5136", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 51, "down_vote": 0, "creation": 1626039552, "permalink": "/r/DecidingToBeBetter/comments/oid7lr/the_art_of_being_different_do_what_works_for_you/", "nsfw": false, "first_save": 1635435392.1666758, "replies_charged": false}