{"id": "t5_2tand_t3_konz8u", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "e234981c-b061-4d83-8134-70d441847f74"], "text": "Like a lot of people, 2020 was a rough year. From the end of 2019 and into the start of 2020, my physical and mental health was in tatters. After numerous visits to the doctor's and blood tests, no one could identify what was wrong with me. I was struggling to study at University because I was falling asleep  involuntarily, or if that wasn't the case, I would have nosebleeds during my classes and have to leave - missing most of my lecture and being left feeling dizzy and lethargic. After months of this (and falling so far behind) I just wanted a break...\n\nThen my university was closed in March due to COVID. Exams were cancelled and the semester was based 100% from coursework. I'd hardly done any of it because of my poor health and I was banking on exams to pull my grade up. \n\nLockdown happened. All my flatmates returned home and I was in the flat solo for a few months. It sucked and the lack of routine or external input made me more depressed. I waited until the contract expired before I moved back to my Dad's because he was quite physically/emotionally abusive. \n\nEventually, I returned and had my head set on revising for my exam resits later in August. I couldn't get much done due to my dad constant abuse and I was trapped with him. \n\nAugust rolled around and I received my exam timetable. I had 4 exams and 2 coursework pieces to complete and I had to start the next day. Myself and a group of close friends had planned to go to a bar that one of them works at to catch up, as we'd not seen each other in months. I figured it would help me relax for my upcoming exams. \n\nI got racially-charged comments thrown at me by some guy - who then proceeded to sucker punch my friend in the nose. Out of fight/flight reaction, I pushed the guy off my friend and we all start fighting it out before the staff split it up. My friend went to A&E (Accident and Emergency ward at our local hospital) with a broken nose. A few hours later once the adrenaline had worn off, I realised how much pain I was having in my back. After being bedridden for 3 days I was advised by my doctor to go straight to A&E to get an x-ray. He thought I could have fractured my spine.\n\nIt was just muscular pain, but for weeks I struggled to walk even 5 minutes down the road. The police didn't do much. My depression worsened and I had to take a higher dosage of medication since I couldn't feel them working. I still had to do my exams.\n\nAfter finishing my exams, I decided enough was enough. I was borderline suicidal already and my dad offered minimal support and just made my life harder than it already was. For a month straight, me and some friends decided to look for a place and move out. We found somewhere and moved during October. \n\nIt's not all sunshine and rainbows but generally, things are looking up. After much introspection, research, talks with friends and counselling sessions, I'm on the waiting list for trauma focused CBT as it's likely I've been suffering from C-PTSD. I've been abused on-off for around 10 years and I'm finally starting to heal from my wounds. I've been listening to the audio book for: Complex PTSD by Pete Walker. Definitely recommend it and it's made me more mindful of triggers and flashbacks. \n\nI've been smoking weed most days of the week for the past 4 years. It was originally just recreational but it turned into a way to numb myself from the abuse. I'm finally committing to stopping as I've moved out and I am in a safe environment. I've taken month-long breaks before so I know this will be difficult but I'm determined to ride it through. Today was day 1 and I felt myself wanting to give into the cravings but I got through it.\n\nThis year, I am aiming to reestablish positive relationships with friends and family and do the best I can in my degree program. The first semester has gone badly but I'll try my best to turn it around - even if that means redoing some modules or even the entire year.\n\nThanks for reading, much love and I wish you a blessed 2021. 🥳", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/konz8u/i_wont_leave_2020_behind/", "title": "I won't leave 2020 behind.", "social_network": "reddit", "user": "ThatTallBlackGuy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1609551430, "permalink": "/r/DecidingToBeBetter/comments/konz8u/i_wont_leave_2020_behind/", "nsfw": false, "first_save": 1635435591.2388906, "replies_charged": false}