{"id": "t5_2tand_t3_for4u2", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "A few minutes ago, I just clicked the **\"Deactivate Account\"** option on my Facebook account. I've been using this social media platform for months and months now, mostly due to work-related things, however, this recent global pandemic has led me to visit it for more than just checking up on messages about work. \n\nRecently, I've been more attuned to scrolling for news or updates about the COVID-19 situation. Honestly, to me, I have been doing my part and am fortunate enough to be able to stay at home and be financially stable. The only issue is that here, in our country, **The Philippines**, quarantine measures are a tad bit extreme yet very... I won't go into the Politics of it. You can just check it out for yourself on Google. \n\nGoing back, I've been trying to keep positive about the whole thing, and make sure that our pantry is stocked but it's proving to be a difficult notion now, as there are extra measures that were placed, which is now leading to us being unable to *even go out for necessities such as food (!!!!!) or medication (!!!!) and to me, that is extremely debilitating.*\n\nMaking sure that unnecessary travel is avoided, sure, I'm all for it, but I have **zero** empathy for anyone who stops someone from actually going to the store to buy essentials/food. The quarantine was to make sure unnecessary travel is avoided, but **not** to lock people in their homes without food.\n\nThe final straw was when I saw a message on our college friends' group chat, and mentioned how the Military was going to take over for a Nationwide quarantine this March 28th to April 15th. Her uncle works in the Air Force and told her that even *stricter* measures were going to be applied, and to make sure to stock up for 2 weeks more of food etc. I'm perfectly capable of buying food for two weeks for the fam, but *why must it come to that?* Why must I struggle to purchase my necessities in a time where everyone is already high-strung as it is, and now people aren't even going to be allowed outside for FOOD RUNS?!\n\nI started getting a migraine, and I haven't had migraines for so long. It totally messed up my body. I started feeling woozy, and nauseous, and angry, and worried, and scared. That one message just totally threw me the fudge off.\n\nI decided that it was time to **end** my toxic relationship with social media. I decided that it was time to end all of the worry, and the pain of knowing what's up, and rather just talk to the officials of our little baranggay without checking the news. I'll know what's up when it happens. I **don't** want to be part of the panic society, the fear-mongering society, or *any* society that enables me to think for one second that they will make me cower in fear.\n\nI've deleted my Facebook apps, and soon, my messenger apps will be deleted as well. I don't plan on reactivating it. I **hate** Facebook. I hate the toxicity, the fake news, and the ever-spreading panic. Don't ever ever *ever* go on Facebook if you want to have your sanity. Fake news always finds its way, no matter how small your friend group is.\n\nChoose yourself. **Choose your mental health. Deactivate/Delete.**\n\nOkay, end rant. \n\nSending love and hopeful vibes to everyone", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/for4u2/if_you_want_your_sanity_back_from_all_of_this/", "title": "If you want your sanity back from all of this COVID-19 news, please, I implore you, deactivate/delete your Facebook.", "social_network": "reddit", "user": "SeriousResident", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 39, "down_vote": 0, "creation": 1585146241, "permalink": "/r/DecidingToBeBetter/comments/for4u2/if_you_want_your_sanity_back_from_all_of_this/", "nsfw": false, "first_save": 1635436640.3497224, "replies_charged": false}