{"id": "t5_2tand_t3_mpkbop", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Hey all,\n\nFirst post here and I just wanted to share my progress over the past several months.\n\nLast October I was dumped; it hurt me so badly, I ended up saying some pretty mean things, and her reaction caused me to realize there were parts of me that I was not proud of. I had spent the months before that during the pandemic being very \"kind\" to myself, letting myself become lazy. I played a lot of video games, I smoked a lot of weed, my diet was.. okay.. (not terrible but not great). My body was soft, and my mind was mushy.\n\nAfter the breakup I felt I had hit a new low in my life, and I immediately started making changes. I stopped smoking weed, I started eating much healthier, I started exercising every day, twice a day (the first is an ab exercise I do every morning, the second is either weight lifting or a longer run, 6-8 miles), I play games only with friends now, I read, I took a couple classes, I meditate, I journal, I started going to therapy (first one-on-one and now group), I shifted my sleep schedule so I go to bed at 10 and wake up around 6:30, I lost 18lbs very quickly and gained 8 back very slowly (I think in muscle). I'm in talks with my manager for a promotion, that should happen some time after I finish a project I've been given to lead.\n\nTo say the least, my life has gone through a great upheaval, but recently the changes I've made have started to feel normal, and I've felt as though I'd hit a plateau, stagnant. Well, a couple guys from my therapy group invited me to a workout session yesterday, whereafter they take a look at and update everyone's goals. This was my first time in this session and I saw that someone in the group wanted to be able to do muscle ups, which have been a goal of mine for like a decade.\n\nAfter the session I was deciding on what I wanted my goals to be and I thought muscle ups would be a good one, but I also had another thought. I've been weighing down my pull ups by 40lbs for the past few months (I weigh 175).. I figured I'd go try to see if I can muster one out.\n\nTurns out I can do muscle ups! I tried and failed a couple times, but they were so close that I didn't want to give up. On the third try I got it! My very first muscle up in my life, and it was \\_super\\_ clean. I ended up doing four more (with several failures strewn in between) just to make sure it wasn't a fluke.\n\nIt made me feel as though this was a truly great plateau to be at. Now my problem is to figure out what else I can do to improve myself.\n\nAnyway, that's my story so far. Thanks for reading!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mpkbop/new_milestone_in_my_physical_strength_and_overall/", "title": "New milestone in my physical strength and overall wellness", "social_network": "reddit", "user": "awwfishsticks", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1618252889, "permalink": "/r/DecidingToBeBetter/comments/mpkbop/new_milestone_in_my_physical_strength_and_overall/", "nsfw": false, "first_save": 1635438247.6920598, "replies_charged": false}