{"id": "t5_2tand_t3_ne4jfj", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7", "67305ca4-ce30-4c37-9a02-05d70fe958db", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Throughout my school years from first to ninth grade I was a complete outcast. The only friends I had were the ones living on the same street as me and even they'd make fun of me from time to time. At school it was even worse, I was weak in mathematics (to this day even) and I constantly got teased and embarrassed about it by the ones who did know a lot about the subject. This made me feel very insecure and often times I'd lie to my mom that I feel sick so I could try my luck to stay home and I ended up not telling anyone about this.\n\nMoving onto high school it was different. I was in a class with literally two other boys and the rest were girls, one of the two boys I've known throughout my whole life really. He was and still is my neighbor, Josh (random name for him). Josh was the type who'd mess with me when we were younger so he could look good in front of the others, but when we were alone, he'd be my best \"friend\". I forgave him during high school though we never talked about this, I never talked about it because I didn't want to sound like a whimp. That's the issue with boys and men in today's world and I think since ever, really. If you show emotions or different thoughts you are instantly a crybaby, weird, soft so on and so forth. The other guy me and Josh both met there was a kid named Mike (also a made up name). Mike is a country kid, working hard on his father's farm, studying and working away from the country during summer break. He was a cool, smart, hilarious and a friendly guy. He helped me with mathematics throughout high school.\n\nWhen high school ended for the three of us this was the true decider. Collage. Well Josh and Mike enrolled in the same collage because they both saw interest in it, while I kept searching and searching but I couldn't find anything that interested me. The two tried to get me to enroll with them but I just couldn't see myself going through something I did not want to. I ended up taking a gap year. Completely alone now, a loner, an outcast again, but I felt safe and good knowing that I didn't have to put up with school and other people. I felt okay. Went on solo walks outside daily, rode my bike alone, went to secluded places around my small town that I deemed \"secret\" spots, one being around the train station that had a beautiful view. So I was completely alone pretty much. My mother and father kind of hoped I'd enroll into some collage but yeah it didn't happen.\n\nAfter a few weeks I started feeling this heavy feeling. I don't know if it was sadness, anger or depression, it might've been something, but all I remember is that I just felt very exhausted even though I wasn't doing anything, I wasn't working or anything. I'd have literally days where I'd stay in my room, blinds shut, TV on, laying in bed the entire day. I wouldn't feel like getting up at all. I'd only get up to eat food and to use the bathroom but other than that, nothing. My father wasn't helpful either, he'd come to my room from time to time, telling me how I'm wasting my life, doing nothing. He was right though, I respect that. Probably wasn't the best thing to say to me at that point and time but he wasn't lying. I was just trying to ignore him as much as I could.\n\nOne night I received a text from my cousin Emma (yet another made up name). Emma is one and a half or two years older than me. She invited me to come with her and her two best friends that she knew since high school, a guy named Patrick (made up name) and a girl named Eve (made up once more!). My first reaction was \"N-O-P-E\" but I kept looking at the text and I said \"Alright... whatever\" and I ended up saying yes. I wasn't expecting much really, just some coffee and a short walk before I leave. But to my surprise I really found the trio funny. They were quirky, highly intelligent, interesting topics were spoken, everyone was included and I think for the first time I smiled and laughed at something that wasn't an online meme or some video on Youtube. Patrick was the type I could have that guy talk and we could kick it off as good friends, Emma she was the one who got me there and me and her go way back since we are family obviously, but Eve... she was something else. She shined a ray of sunshine each time she looked at me with her smile. She was smart, fun to talk to, had a unique sense of style, smelled nice even without perfume and I don't know what else to say cause there's so much to list, she was just the epitome of the word 'perfect'. She gave me that vibe of being that one girl in a movie that would end up saving the main character. Well she did, she definitely saved me.\n\nAs weeks passed me and the trio would pretty much become a group, though they were already a group of three only now I was also included. They let me in on all their little quirky and weird inside jokes and I started doing and using the same ones around them too so that really made me fit in with them. Granted they had a lot of collage work and I didn't, I respected their time and would go out whenever they were free. But in the meantime I randomly started texting Eve and me and her would end up literally texting every single day. And it wasn't like a one or two text hourly, I mean like we were texting each other throughout the entire day, every minute. I think within a week with texting her I created a chat that was the longest one out of all my chats that were as old as me being in ninth grade. At the time I was also going out with this other girl named Amanda (made up name!). She was really smart and fun to be around. Me and her were really kicking it off nicely, we had very passionate moments and whatnot. Though after some time she stopped texting me and I respected it, thinking that she just needed time for school or her personal life... but I think anyone can text someone \"Hey I'll be working for four-five hours, I'll text you later\", but she would leave me with no text for a day or two at times and I'd never ask her about it. Shortly after we both ended up... well ending it. We never texted each other again, never hung out, nothing. Now this didn't get me feeling sad or mad or anything at all because I was so drawn to the little group I was now in and especially Eve.\n\nMe and Eve at this point also started going out. Now I have to stress how important it is that me and her, never, ever went out in a romantic way, we always went out as very close friends who just enjoyed each other's company. Even though she had a lot of collage work, we would meet up every single day, each night... sometimes even meeting up during the day, going home and then meeting up at night once more. I mean we were really joined at the hip as some would say. We were inseparable pretty much. We would share deep secrets, exchange music, listen to music, I even took her to my many secret spots and we'd spend hours there just talking. I went to her place once when she needed help with something more deep, she comforted me outside in two A.M when my parents were arguing so loud I swear it would feel like they were next to my ear even though they were a room away.\n\nAs a few months passed me and her would regularly go out together and people thought we were a couple. Though after some time things got bad for me, really bad. My parents were constantly arguing and this was something that dates back since I was in fifth grade maybe. Though at one point it disappeared so I didn't have to think about it but at one point it returned again. I tried to avoid them but I swear I would get like some sort of PTSD out of the way they'd behave and I say this because every time I went to sleep and got up the next morning, I'd barely open my eyes but I'd hear one of them from the other room talking loudly or being loud in general and I swear my heart would jump and I would get up, nearly falling over, thinking something was happening only to open the door and see both of them laughing... it felt like some sort of mind game really. I felt like I was in boot camp in the military and that was the training. I started having long nights where I couldn't sleep... and I'm only talking about staying up until six, seven or nine A.M. At times I wouldn't even sleep I'd just stay up until the next day. And this wasn't like one day in the week... this was like five days of the week. My health really deteriorated because of this issue, I would feel very weak, sick, wouldn't eat but I still tried to go out with Eve as much as I could. I obviously told her all about this and she'd be the only comfort I could get and when she comforted me it felt nice... I felt human again, loved. I felt like I was in heaven and I think it's because she showed me attention to my issues, something that nobody did. If I asked my mother about these issues she'd say \"You're just imagining things\" which was true I was, I was thinking that they are fighting when they weren't (even though at times they were.) and my dad would go aggressive on me telling me how I'm overreacting, I'm lying and so on. If I asked my grandparents about this they'd instantly take my mother's side without seeing MY issue and how I'm struggling personally. Other than Eve and my sister who lives in a different town, I had nobody I could truly sit down with and say \"Hey this is bothering me, what should I do?\" because everyone thought the issue was different to how I saw it as.\n\nThough at some point I started developing huge anxiety issues. I couldn't go outside because I now started fearing being around other people, crowds, closed spaces and most importantly places where I couldn't escape, i.e waiting in line for something, the mall in a shop, collage classes (this wasn't happening since I wasn't in collage but the thought of it made me not want to ever enroll into collage) and many more places. Now Eve found out about this since I would text her about it and she supported me... but as time passed and I am talking weeks after weeks after weeks, I started getting worse and worse and because of this I would deny and deny going out with the group and especially Eve. I even had one traumatic moment where I actually randomly pushed myself to go out with Eve and we went so far from my house or what I deemed my \"safe place\" and I literally started puking like six or seven times without prior eating anything too much. And that was something that I'd start to be scared of after that, I would say \"What if I do that again\" thus making me not want to go out even more. Now put yourself in Eve's shoes for a moment, you became such close friends with a boy (me) and went out with him every single day, shared secrets with him, found comfort around him and many more positives and he randomly started ignoring you now and pushing you away. Well that's what I did... I started pushing everyone away from me, my family, the group, Eve and even on occasions Josh and Mike too. Anyone I deemed unfit to understand my issues at core or even nudge or push me a little bit I pushed them away. Well Eve was really frustrated with the way I treated her but I just couldn't keep up with her, she constantly wanted me to go out with her and I constantly denied her because I felt very unsafe and nervous being outside of my room. I didn't want to disappoint her either by being weird around her... yet I disappointed her either way. She stopped texting me after some time and I swear that felt like as if I was an ant being crushed by someone. I developed major trust issues... I was always alone, in my head and what was even worse my father would tell me constantly \"You're wasting your life\", \"You're going to be a nobody\", \"What a disappointment you are...\" and so on...\n\nBut that's what I truly felt like, I never took these things as offensive because that is what I was and still am I think. A loner, who does nothing but disappoints people left and right, hates himself, hates the way he is, can't help himself. After I lost Eve I started moving away with my sister in her home with her husband which was in a different city as mentioned earlier I believe. I'd remain there for like two weeks, then I'd come back for like a week and then go back for a week or two again. They supported me and treated me nicely. My sister would have these long talks with me about all my issues and especially our parent's issues because believe it or not she went through double the worst times when I wasn't born and her husband would include me when gaming, we'd go for walks around the park, play basketball and just in generally he made me feel like a \"dude\" again who could chill out and play stuff and just forget about issues. Slowly but surely they patched me up. A broken soul, patched slowly.\n\nI started feeling more and more comfortable being outside, I was comfortable around other people, I went to the shop a lot even though sometimes I didn't even have to or need to go I would just go because I now could, I did everything like I used to. I then moved in back with my family and honestly the arguing toned down again so I could focus on being more \"me\" again. Five months have passed since I saw or heard of Eve and the friend group... I really am disappointed at myself with how I treated Eve, I think she truly believed in me.\n\nBut even now, me being much better, getting back to playing guitar, going out again, being even more comfortable I find myself torn with how I treated Eve. And for some odd reason, deep down in me I can't find any strength to confront her about it since it's been so long. Even though my sister told me I should casually approach her with a text that is an apology, I don't have to go out with her, I can't even bring myself to do that either, I can't do it because I feel like a worthless person when I try to think about Eve or even compare my past self with my new self. I wasn't good then and I am not good now with how I treat her... I don't know why but I just can't for some reason. And what's even worse is the slightest thoughts about her or even like when I see a complete stranger wearing a similar style to her or hairstyle lets say I instantly think about her and it makes me feel a little on edge and uneasy.\n\nAnd that's why I wish I was someone else... everyone has problems that are deep I understand that... but I'd like to be someone who I can only dream of being...", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ne4jfj/i_hate_being_me_long_story/", "title": "I hate being \"me\". (Long story.)", "social_network": "reddit", "user": "SADandFRIGHTENED", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1621218903, "permalink": "/r/DecidingToBeBetter/comments/ne4jfj/i_hate_being_me_long_story/", "nsfw": false, "first_save": 1635436991.2867572, "replies_charged": false}