{"id": "t5_2tand_t3_kjvrse", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "I’ve been wondering why I’ve been feeling so crappy and I think the problem lies in how I’ve been treating myself. I’ve been neglecting self care which is something I tend to do when I get anxious and depressed. Feeling ugly and fat makes me not want to get up in the morning or look in the mirror. But I’ve decided to take the next steps to fix what I can control. So this is an accountability post to list my goals and hopefully stick with them.\n\nSLEEP\n-I will get a full 8 hours of sleep every night and go to bed by no later than 12am. \n-I have a bad habit of taking extra long naps... like 6 hours.. and it messes with my sleep schedule. So if I want to take a nap I will limit it to 1-2 hours maximum.\n-I will sleep in my room instead of the couch at least 5 nights out of the week. \n\nSHOWER\n-I will start taking my showers at night time instead so that I have more time to relax and focus on cleaning every inch of my body.\n-I will make sure to exfoliate and or shave once a week. (I just bought some exfoliating gloves and a scrub that smells like mangos :) )\n\nHAIR\n-I will oil and wrap my hair every night before bed so that it’s not as dry.\n-I will get a hair cut sometime next month and create a curly hair routine so that it stays healthy. \n\nSKIN\n-I will make sure to wash my face morning and night and moisturize my entire body after I shower.\n-If my eczema starts to flair up, I will put my cortisone cream and NOT scratch. \n-I will not pick my acne even if that shit is annoying... it will scar.\n-I will put on sunscreen every morning.\n\nTEETH\n-I will brush my teeth every night before bed and make sure I have my rubber bands on so these braces come off. \n\nDIET\n-I will drink half a gallon of water every day.\n-I will make sure to each at least 2 meals a day and cut down on the amount of fast food I consume. \n-I will only get Burger King spicy nuggets once a week.... it’s probably not even real chicken...\n\nWEIGHT\n-I will weigh myself once every two weeks\n-I will try and get at least 30 minutes of exercise in a day. Whether that is simply walking around my neighborhood or playing Just Dance.\n-I will not beat myself up or expect to see changes right away. It takes time. \n\nTIDINESS\n-I will make sure my room stays clean and make my bed at some point during the day every day. It doesn’t have to be right in the morning. \n-I set a day to do my laundry every week— let’s say Friday morning is laundry day. \n\nOkay so this seems like a good start! I will check back in to add anything as I begin to create a routine for myself. I will become someone I can look at every day in the mirror. I will create good habits and it may be hard now but in a few months I won’t even have to think about doing them because they will just be second nature.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kjvrse/accountability_post_and_my_goals/", "title": "Accountability Post and my goals", "social_network": "reddit", "user": "dobetterfeelbetter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1608884632, "permalink": "/r/DecidingToBeBetter/comments/kjvrse/accountability_post_and_my_goals/", "nsfw": false, "first_save": 1635435892.3492434, "replies_charged": false}