{"id": "t5_2tand_t3_jl2v8q", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "don't even know where to start so I'll preface and quite honestly I'm unsure whether or not my parents are normal/stressed out or if they are PD's:\n\nQuarantine has not been easy by any degree. I am 20 years old and have had my fair share of uphill mental health battles. In second grade I was diagnosed with ADHD, in middle school depression and generalized anxiety was added, towards the end of high school major depression, generalized anxiety, ADHD and OCD. I grew up in an affluent home with two physician parents with all the resources in the world at my disposal. I have trouble accurately perceiving my past home life from time to time and tend to oscillate between feeling like my parents could not meet my emotional needs and were at times cold, dismissive, critical/overbearing, to feeling like I am selfish, entitled and ungrateful for feel such due to everything they provided me with knowing I was by NO means an easy child (lots of behavioral problems) and that they did there best, to a combination of these two thoughts (grey thinking). Overtime I began to fixate on the negative side and tried to talk to my parents about such which ultimately ended up turning into what felt like a blame game (starting my senior year up to my sophomore year of college). I engaged in drug abuse (which I solved/ended on my own though I do use psychedelics from time to time and smoke weed every night), angry outbursts, passive /aggressive tendencies, severe lack of sleep, self-harm behaviors, chronic depression, disordered eating, etc. during this time. I very much so was concerned with myself/my needs and gave little thought to how the people around me were being affected which would then shift to a hyper-realization of how it had been affecting people (friends, family, etc.).\n\nSometimes my upsets/qualms were met with a sympathetic ear by my parents but more times than not was turned back onto me hearing statements such as “I’m so sorry I failed as a parent/ that I was such a terrible parent.” But sometimes it would end up being a very sweet/empathic conversation. I feel like I put too much on them/ was very unfair with my rehashments. Consciously I know this (guilting/ passive aggressive response to having hurt someone) isn’t an appropriate response at all but I also understand the defensiveness as I am not a parent and realize they are human not perfect. This is why since a couple years ago I’ve made a considerable effort to validating the truth not perception of people I have conflict with and refuse to mitigate their experiences. I always fear accidentally entering manipulative/gaslight behavior as I know I have engaged in such in the past (or am sure I have). And because of a lot of guilt / shame from these situations I see myself as non-redeemable and everything I’ve tried to do after feels fake to me because I know what’s in my past. I acknowledge my wrong doings whether externally or internally but it still doesn't feel like enough. Also acknowledge things is different than truly understanding the weight of those actions/events.\n\nMy parents worked heavily (dad was at work 5-6 days a week but drove me to school in the AM's / took me to sports practice)/ when my mother was home she was often doing work around the house, errands, or working from home. Regardless they were present for all my plays, my sports events, parent school nights, etc. and were proud of me. Unfortunately we all had little common interest (minus movies/TV and cooking) and I was often told as a child to “entertain myself” not necessarily a bad thing but nonetheless sad to reflect on. My mother upon reflection could become very passive aggressive/ sarcastic with me (something I've realized I've absorbed to some degree and all humans engage in from time to time). The most hurtful thing would be when she'd laugh in a cruel /fake/passive way when I was hurt/angry or upset by a conversation / she was hurt and it made me want to lash out. I often times feel like she holds secret resentment against me when we live apart but the feeling vanishes when back together and I become confused. I was also scolded from time to time for wearing “girls” clothes, playing with makeup, etc but was also allowed to? I was reassured being gay was okay too but I don't think they really understood queerness. I felt very closed off from my family / didn’t feel like I actually knew them (while knowing them extremely well). I often felt like my sister was the kind of child they’d expected/hoped for and that unconcniosuly they seemed to care for her more even though my negative behaviors garnered far more of their attention. I remember them being highly disappointed / sometimes angry with my failures/ lack of effort in school and dismissing me voicing that It was bc I was sad/anxious. I was even told at one point from my father that “nobody likes the sad kid” and that there was “nothing to be sad about.” Fortunately they did put me in therapy in 7th grade after I suffered a sexually traumatic experience at sleep away camp (I believe this caused my fear/OCD of semen and my hyper-sexuality along with finding porn at a young age) and I have been in ever since.\n\nGrowing up I have very specific memories of my mother and father and I getting verbal and physical with one another. We have all said incredibly nasty things to one another. My mother and I would be more yelling/ passive aggression where my father and I would be that but physical as well. He and I would often escalate over things such as school, etc. We would begin to raise our voices at each other as I always felt extremely criticized by him and often times felt like he was unable to empathize (he was able to Channel his ADHD in a way I could not). Either I would say something to him or would shove him (losing my temper something I never did with friends), after this point I would know I had gone too far and that the situation was unsafe. Instead of us walking away from one another his anger would escalate to rage and he would grab me by my shirt collar and pull me up the steps, shove me back or scream at me while my mother watched / only intervened when it was going too far. I often wonder if this scared her/ if she felt it was appropriate. As I’ve gotten older I’ve also noticed the have a tendency to be passive with each other. When these things are brought up to him he is unable to recognize such/apologize. I don’t blame him though, he had a tough childhood and his father is without a doubt an abuser and he had to emotionally take care of himself for the most part. His mother is a WWII survivor and I know intergenerational trauma is a real thing. I also know I took a lot of my anger out verbally, emotionally and physically on my sister who is only slightly younger than me. While we have a decent realtionship now and have always been close I know I have inflicted harm onto her and feel like I have failed as an older sibling. My father is loving, caring, loyal to a fault and does seem to have high empathy from time to time, he is extremely goofy/a bit childish at home and is hyper-professional, serious and laid back at work. While I do love him he has always tried to manage my life in an overly helpful way (something I’ve fallen back on) and takes a lot of credit for my success has even stated he’s the reason I’m at college. He hasn’t really ever allowed me to truly fail at something (though I have failed on my own times and had to deal with it) he has always seemingly swooped in to help/fix— I am thankful for this and I’ve been able to get more on my feet but also feel like it has disservices me. I worry if I have the perpetual mentality of a child that needs mommy/daddy’s help. I also have access to their money to some degree and am allowed to use a their credit card for things like food, groceries, school supplies, etc and often feel guilty about such/ my financial dependency. I don’t overspend but occasionally I will impulsively shop even though I know I am by no means entitled to their money and almost wish they’d revoke it from me as I did not work to deserve. I often times find myself pining for a different experience of growing up, that I had been a different child, that my parents had treated me different. Been hyper-empathic, stayed home with me when I was sick, acted more emotional when I was sad, had encouraged my most authentic forms of expression, had gone to therapy with me/as well. But those things cannot be changed I can only give them to myself now.\n\nI often times felt like I was left alone growing up with my thoughts and found comfort / often times developed codependent-like or enmeshed friendships where I derived my courses of actions, advice, and almost treated them like parents from time to time (babysitters as well). I became too much for a lot of individuals and know I was a bit toxic throughout middle and high school but still had a solid group of friends. I often times felt outcasted, bullied, like I didn't fit in, etc growing up. After I became more myself post-coming out / finding people I never wanted to feel the way I did ever again. If I had friends/chosen family and their/my own approval I didn’t need my parents. I think this caused a level of district to authority within me. My parents were always there however to offer a listening ear/would ask what was wrong but would mostly give me space/ give up if I shut them down (what did I expect?). I feel like their parenting style, my mental health struggles and production of certainly what can be described as a false self from hiding my queerness for 16 years has made me a vulnerable narcissist. I worry I am entitled, manipulative, delusional, lack empathy and that I’m just pretending to be who I am when the reality is I’m often times a nervous, shame filled person who can’t escape past misgivings (something I have been vulnerable/ open about though with most of my friends) or maybe I'm both/all I don't know. I often times become lost in my own thoughts/world in deep / heavy self-reflection, guilt/shame spirals about the ways I’ve harmed people in the past, fear of people finding out about the darker / more harmful things I’ve done not because I fear reputation damage on a superficial level but that they will no longer see me for who I have strived to become/ the parts of me separate from those actions and that I will lose everyone. I don’t know the line between having privacy of my best and what needs to be divulged, vulnerability has to be natural not forced and I feel like almost all of my relationships are fairly vulnerable. I have many close friends/friends but I often times feel like I’m not doing enough to maintain/cultivate those relationships or that I am cold/emotionless a lot of the time. I have interest/hobbies but have a hard time continuously committing to them and often times hyper-focus on something from time to time. I have fluctuating self esteem from time to time as well often not thinking of myself as good/bad but merely myself and then dipping into either higher or lower points situationally. My gender identity/expression is also semi-unstable as I could never authentically present it till college and I worry if this means I am hollow. I also excessively read about personality disorders and fear the way’s they’re describing a pathological narcissist is actually the thing that I am. That was is being written is in fact my reality that I’ve gotten so good at denying.\n\nPart of the reason I think I'm a covert/ some type of narcissist is because I occasionally have fantasies of having a perfect love (crave being in love), having a job I love/ in the field I desire being apart of even though I’m not particular good at all the subjects (I am pre-med/health) and am very aware of such/ don’t pretend otherwise.\n\nSome of my negative traits that I think indicate that I'm probably a narcissist myself:\n\n1. being secretly hurt by certain things but remaining calm on the outside and internally processing ( I tend not to hold grudges though and allow lots to slide but it does remain on my mind and by no means lash out at all forms of perceived slight/criticism)\n2. When I do voice hurt/upset about being critiqued I often feel like I’m being unfair/overly dramatic or creating too harsh of boundaries\n3. disregard to others' personal spaces (I’ve gotten better at this though)\n4. I think I lack empathy and compassion from time to time more on an affective than cognitive level (or I question if what I’m feeling is or isn’t empathy, where Is the line between empathy and projection?) sometimes I feel like I’m being cold/unmoved by what’s said and I remind myself to tap into “their shoes”\n5. Emotional numbness ( I cognitively know how I feel but I question if I really feel like I’m feeling it or not)\n6. Fluctuating perception of others but overall I am able to see people as grey not black or white even if they’ve caused me harm (I don’t split but sometimes I do in moments of upset/anger but more internally)\n7. Low self esteem (but sometimes stable/ good self esteem but I fear these are just narcissistic defenses kicking in and are not genuine)\n8. Extreme, often unrealistic perfectionism that never plays out in the way I desire while also setting the bar for myself at average\n9. Suppressed aggression that occasionally has come out as raw anger in the past but I can better control it now with self-soothing techniques/words\n10. inability to react appropriately on occasion\n11. self esteem roller coaster when feeling unstable (from hot shit to piece of shit)\n12. Going from limited capacity for social interaction to need / desire for such (I isolate from time to time)\n13. get distracted extremely easily\n14. engaging in a lot of self-pity\n15. Sometimes wanting to be the center of attention but often times feeling fine not being\n16. While I’m good at cognitive empathy and know I do experience affective empathy for friends, family, movies/books, strangers I sometimes find defining affective empathy difficult and wonder if other people are better at it or experience something else than me / if I’ve simply learned to mimic emotion extremely well / adapted emotional grammar to sound like I understand when I may not\n17. Expect praise and feel disappointed having not received it but not crushed/ can understand not everything I say / think is novel/great\n18. a lot of my fantasies are about finally being able to prove I actual am smart (something I’ve been told but only believe from time to time/ I don’t intend to fish for compliments but when they’re received I often times look down and thank the person but disagree/ don’t truly accept them)\n19. I rarely dream (but I do smoke weed each night which surpasses REM)\n20. Feel like a lot of the time I’m depressed, anxious, elated, lonely or numb. I’ve read these are the emotions most narcissist experience and not on a deep level and that I actually have shallow emotions/feelings)\n21. struggle with long term goals ( I know I want to go into medicine/science but from time to time I’m interested in Journalism, international policy/law, history, etc. and sometimes don’t know what I want to do/ if I’ll actually do medicine)\n22. quarter-life crisis from time to time (what am I / who am I becoming?)\n23. Engagement in people pleasing behavior from time to time but NEVER use it to guilt people (this is wrong, you do something to do it not to gain)\n24. irresponsible/impulsive\n25. Either too assertive or unassertive\n26. Shoplifted in high school with no remorse after a point in time but now regret it/ have tried to move past it\n27. Using sex/hook-ups as an unhealthy coping mechanism\n28. Engaged in toxic behavior when forming a deeper relationship with someone I have strong feelings for (fearful-avoidant attachment style to some degree)\n29. Unsure if I search for “narcissistic supply” or if I just want validation/comfort as I can’t differentiate in literature between “extension of self” v.s what an authentic friendship would look like as I believed all my friendships are authentic/ wonder if I’ve surround myself with Narcs\n30. Engage in gossip but have realized a lot of qualms had are shadow projections and I try to keep that in mind\n31. Difficult time believing my own narrative/truth, distrustful of myself from time to time and am unsure of my intuition/ my perception on things (shows up after heavy contemplation of such as seeking conformation from those I trust)\n32. Have a tendency to talk about my own problems a lot but also make an effort to also listen to my friends/families and help them out/ just listen, I ask friends opinions on situations, ask them to analyze with me and only feel calmed for a period of time after talking to them (eventually have to self-soothe and move past even though I’ve been confiding less recently)\n33. I don’t know if I gloat my “achievements” or not there’s only one I feel particularly proud of which is making it far in sports which I miss dearly\n34. Either think with my emotions/feelings or try and analytically process how to go about things/ how to feel ( I feel like I unconsciously try and control certain outcomes by feature planning/thinking due to anxiety)\n35. Overly critical internal monologue that I actively try and reprogram with nicer thoughts/more gentle thoughts when they come up\n36. Always self conscious. Always wondering if I was in the wrong/ that I was wrong. That I was bad. That I should be ashamed. Always anxious about if I’m being myself and if I’m enjoying my life.\n37. Paranoid friends/others speak about me behind my back/secretly fear me and are only friends with me out of some kind of unknown obligation/connivence\n38. Unsure of what I bring to the table\n39. Bad object permanence\n40. Know a lot of my weaknesses and strengths but tend to believe I have more weaknesses than strengths\n41. Blocking outside stimuli / try to avoid difficult emotions unsure if I accesses them properly\n\nI have realized that I surely do have narcissistic traits (and I know its a spectrum/everyone has them)— and I try to avoid/suppress them as the very last thing I want to be is a narcissist (even though I know NDP is out of individuals controls). I want to be kind, understanding, level headed, loving, attentive, respectful, contemplative, outgoing but slightly introverted, empathic and caring. Things I am told that I am but I often just fear it’s a mask I wear. When alone I feel numb, lonely, sometimes bored but often times think about myself / my mistakes from the past. I never try to “fake emotions” I think it’s pointless and only creates a further facade. However often times I am distressed /disturbed when someone says something to me and I almost feel slightly bored or unaware of how to feel. Sometimes when people are talking about certain things an unsettling/embarrassing desire to laugh overcomes me. I fear I’m not actually experiencing the emotions I should be/ or think I might be (like I should be feeling something burning/intense/know it when you feel it the moment but don't always/ I have a hard time recalling if I do). I am always there to be a listening ear to friends/loved ones and I do feel like they feel like I provide sensitive and real advice. But I’m worried I am just a delusional narcissist that has surrounded myself with codependents, enablers and supply to help feed my delusion of normalcy to make it easier to deny further issues. I have talked to my therapist and friends about all this and they deny that I am a narcissist. Nonetheless my friends do love and care about me deeply as well as my family. Sometimes when I say “I miss you” or “I love you” to a friend or family member I almost question myself/ feel embarrassed like I’m potentially not feeling those things which terrifies me because does that mean I have zero capacity for those things. But I also know (or maybe just want to believe) I do experience those things in the way I think I should. Love and missing people though are actions as well as feelings not just “feelings.” When catching up with people/meeting people/developing a relationships I always try to ask curious questions, ask how they’re doing, remember things to ask about in the future to check in, etc and take genuine interest in their lives. Regardless of my reflection on things / obsession with it I often times wonder if this just means I’m a “self-aware narcissist” trying to learn how to better mask myself. The reality is I just want to know if somethings wrong and how to fix myself. I try to read a lot, re-assure myself that I’m probably overthinking things, that these behaviors could be due to a multitude of things and that I’m fairly young but it keeps nagging at me. My worst fear is being a pathological narcissist. I don’t want to become / or be one and it makes me frightened to have kids.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jl2v8q/intense_perpetual_fear_of_being_a_covert_narc/", "title": "Intense / perpetual fear of being a covert narc / having NPD", "social_network": "reddit", "user": "Southern-Primary-593", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1604084286, "permalink": "/r/DecidingToBeBetter/comments/jl2v8q/intense_perpetual_fear_of_being_a_covert_narc/", "nsfw": false, "first_save": 1635436631.2343707, "replies_charged": false}