{"id": "t5_2tand_t3_o6svtx", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Don’t be afraid to start over. This goes for anything you do. You might have spent some time immersed in your project and the length of that time differs for anyone. Say it is writing a book. You are 2 years into the project and feel it is dead. You’ve already killed off too many characters. The story is not advancing. You are getting bored with the whole thing. Should you push on thinking it might get better? No. By all means, start over. From fresh? Maybe. Or, you might think of an editor telling you to get rid of your first 3 chapters and start there. Are you insulted? Maybe. But, you need to listen to your editor. Save them. Make them into another book someday. But, don’t be afraid to get rid of what you have written. Say, rip it back to where you killed off the first guy you discovered you need later on in the story. \n\nOkay, it’s gone. Saved. But, gone. Now what? Plan better. Take a refreshing spa day and plan again. By yourself because it is really important that you not have any interruptions. Go someplace pleasant. I’m thinking of a meadow. Bring with you whatever will make you happy for a few hours. Maybe a bottle of wine and a picnic lunch. Make it special.\n\nThe idea is to give your characters a voice. You’ve already given them a voice in the story but you are the one who has been directing traffic all this time. So, you’re sitting in the middle of a beautiful meadow. Nobody can hear you at all. You are alone. Start talking. You are not writing the book. You are now talking to your heroine in the book. You might feel funny but go ahead anyway. “Hi, Kitty.” Be poised with pen and paper and write whatever Kitty wants to say or just record it. She says, “Hi yourself. How come you always call me Kitty?” “Because that’s your name.” “You could call me Katherine every once in a while. My mother always called me Katherine.” “Really? Would you like her to be in the story?” “No, not really. You are working this one up to be a detective story and I’m supposed to get in trouble a lot. I don’t think I should be crying to my mother. I’d rather have a hunk of a boyfriend.” “What?” “What, what? You don’t think your characters have sex lives?” Whatever you take away from your meadow spa date with the characters in your book is a win-win situation.\n\nAt the same time, you can rampage through your story. Maybe it needs a pick-me-up. I remember one time I laid down on my bed with a tape recorder. I talked for 10 minutes and got 6 months of writing out of it. The book was eventually rejected by 7 publishers and even though it was never published and languishes under our bed I feel that I learned so much by writing it. Because of it I feel I can call myself a writer. A blank piece of paper no longer frightens me.\n\nStarting over could be with crocheting. There was a time when ripping out work was an admittance of failure. Why? I learned something. During the time I messed the project up I was developing my tension. Hey, that’s one of the important parts of crochet, isn’t it? And, how important is tension? Very.  It prevents one sleeve from being about 3 inches longer than the other. Also, if you were even to start a piece of crochet over again you would better understand the pattern. Your tension from the beginning would be better and whatever you are working on can be shown off to others. Personally, I’m into granny squares. I just love them. They are quick and you can build anything with them…blankets, clothing, cat furniture, household items, and toys. \n\nOr, what if it was a garment you were making? You spent $70 on the fabric. Yes, fabric is very expensive these days. And, you screwed it up. Or, you stopped working on it and gained 50 pounds. So, either lose weight and finish the project or use it in a quilt. Or, a gazillion cat toys. Or, make the garment using 2 sheets from Goodwill. There you only spent $10. And, then you can go spend another $70 to make it better. There is so much to know about sewing that will make any garment better. How to ease your armholes, how to finish seams. You can go fancy with a needle and hand stitch the whole thing like our great grandmothers did or you can use your sewing machine which, these days, is not that expensive. Maybe $100 or less can get you a serviceable machine. Hell, you really only need a straight and a zigzag stitch. Everything else is frosting.\n\nThere is never failure. We just push along and do better and make progress all the time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o6svtx/writing_crochet_and_sewing_how_to_keep_going/", "title": "Writing, Crochet and Sewing - How to keep going", "social_network": "reddit", "user": "pmevanosky", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1624506323, "permalink": "/r/DecidingToBeBetter/comments/o6svtx/writing_crochet_and_sewing_how_to_keep_going/", "nsfw": false, "first_save": 1635437666.1169863, "replies_charged": false}