{"id": "t5_2tand_t3_q6v976", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Things started out so promising.\n\nSo very promising.\n\nUp until about my first semester of college, overall I was a very happy kid.  I found my passion at an early age, and pursued it relentlessly.  I went to a magnet school surrounded by bright, creative minds, and I was truly happy.\n\nNaive, ignorant, and deeply convinced of what a great, good, kind, caring, and all around pinnacle of exactly the type of person who could do no wrong would be...yes.  Being too cowardly to even ask anyone out (unless you count staring at them awkwardly until they slowly walk away from you), and yet still so resolute in my self righteousness... definitely.\n\nBut happy, nonetheless.\n\nI left for college, and my first year was truly my first time experiencing life without these protective parameters.  Without a terrifying father whom demanded the epitome of flawless schoolwork, and punished failure severely.  Without the intellectual, \"decent human beings all around\" bubble I was in for so long.\n\nMost significantly though, my deeply misinformed view of how things should be, how people should be and act, and my general deeply stubborn and strangely prude ideals faced the real adult world.\n\nAnd I lost.  In almost every way.\n\nAt first, rage.  A new experience for me, other than the retrospective brutal fights I would get into with my brothers growing up, I never got angry.  And now, all I could feel was blind rage.  For years.\n\nAnd for real, I still dunno why such small incongruences were so explosive.  I still dunno exactly where all the anger came from, but it consumed me well into my early 30s.  I was right, everyone else was wrong, and that's what it was.\n\nI turned into a fucking asshole.  Treated people like shit.  Treated relationships even worse.  Nothing I ever said was honest.  I loved to get into confrontations, but always backed out at a certain point, because I was afraid of an actual fight.\n\nI cheated.  A lot.  Slept around like the dirtiest of sailors.  I judged other people cruelly.  If a friend or really anyone tried correcting me, or disagreeing with me, or really said anything I didn't wanna hear, I disappeared without a trace.  I got addicted to drugs and alcohol.  Severely.  Dropped outta college.  Started cooking at shitty restaurants.  I became depressed, which at first just presented as more rage and bravado, but eventually devolved into not getting outta bed for weeks.  Was institutionalized several times for suicidal ideation.\n\nMy friends evaporated over time.  The most important people in my life just gave up on me.  I found myself with a phone and literally no one to call.  I became a hermit, working obsessively on my passion, but had nothing and no one else.  Everyone I was around despised me.  My social skills, gone.  Zero sex life.\n\nIt was during this time that I also realized fully how all this downfall is my fault.  I fucked up, it's on me.  This idea of me being a great person...it was laughable.  \n\nI had become a fucking monster.\n\nCurrently, I am on the tail end of this self implosion.  I've come to accept me for who I really am (at least, I'm getting better at it).  I choose to be better than this.  I practice compassion.  Understanding.  Kindness.  It's deeply frustrating how hard those simple things seem to be.  I try to accept responsibility.  Admit when I'm wrong.  Compromise.\n\nI've still got miles to go, rough miles indeed, and a lot of past to confront, all wrapped up in a coward who lost the fight in them, but I didn't leave empty handed.\n\nAt last, I see hope.\n\nThere's no specific advice sought here, or point really to all this, I just needed to say it.  For me.  Go figure.  If anyone wants to chat or have someone to listen, trust me I could use the practice :)\n\nThanks for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q6v976/one_humans_life_story/", "title": "One human's life story", "social_network": "reddit", "user": "sittininit314", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1634071425, "permalink": "/r/DecidingToBeBetter/comments/q6v976/one_humans_life_story/", "nsfw": false, "first_save": 1635437209.6130643, "replies_charged": false}