{"id": "t5_2tand_t3_oaetcr", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "So here's the thing. I should be well of, I have a stable middle class background, parents have quite good middle class jobs, have always been good in school, pretty good looking and thin, but everything basically began to fall apart for me after high school. I had been depressed basically since I was 13, battling eating disorders, loneliness, and the great ability to push people away who love me and chase people who don't (just realizing this and I'm in quite some shame when I think about how i have behaved to really nice people in my childhood). And I just fell apart and was just NOT good at handling life in my early 20's. Now i have been in therapy for 6 yrs and have seriously improved, but I just REALLY need a serious life change NOW. I'm still so anxious, so anxious that the tensions in my body have made my ears ring and I now realize that this. got. to. stop.   \n\n\nSO now I have to just decide to STOP WORRY about EVERYTHING. The last six months I have been homeless, deaf, i've died alone, i have been completely broke and without any security net, all in my mind, and my body can't take it anymore. I'm 27 now so i guess now that i'm about to hit 30 i just can't put this much stress on my body anymore.   \n\n\nAnd i know that you just can't stop 100% like that. But my view on my self has always been \"i'm not a happy person, i'm not a person that does good in life, i'm not a person that someone falls in love with\" and the list goes on. And have this way of thinking made me loved and happy? Obviously not. So now I need a change. Everyday I worry, and everyday I try to tell myself \"look, nothing is happening right now, and it didn't happen yesterday, relax\". So guess i just wanted to say that i'm changing my life. This fall i'm going back to school to take my masters, and i will start dating again. hope you all have a nice summer.  \n\n\nNever thought i would ask this question, but if anyone have any ideas how to be more positive about yourself and your future so please say so.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oaetcr/deciding_to_stop_being_anxious/", "title": "deciding to stop being anxious", "social_network": "reddit", "user": "neurotic4ever", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1624993092, "permalink": "/r/DecidingToBeBetter/comments/oaetcr/deciding_to_stop_being_anxious/", "nsfw": false, "first_save": 1635438060.451387, "replies_charged": false}