{"id": "t5_2tand_t3_nd1sr3", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "(this is the first time I tell a story like this so I don't know if I've included too much info, and I'm sorry if it's too long)\n\n&#x200B;\n\nI went to a sports bar with a few friends a couple of days ago to watch a football game between Manchester United and Liverpool (Liverpool won 4-2, I'm a Liverpool fan btw). I'm a pretty big guy (201cm/6'7\" ; 120kg/260lbs) and I can consume large quantities of beer before getting drunk. My friends are also good drinkers but one of us wasn't drinking, so we ordered a beer tower (8 pints per tower) when we got there thinking it would last until the end of the game. The first half went by pretty well but we realised by halftime that we had almost finished the tower, so we decided we would need to order another one for the second half. We were also starting to get hungry, so I decided to order some chicken bites to share. The second beer tower arrived as the second half started, but by the 60th minute of the game, the food still hadn't arrived so I decided to go investigate.\n\nA bit of info about the bar: it's a sports bar in the UK, and at the time of going, pubs and bars were only allowed to have people outdoors because of COVID. This means that inside is really calm and quiet and you don't have to shout to be heard. Customers are usually only allowed in to go to the bathroom, as you order everything on an app or with a waiter that comes to your table.\n\nBack to the story. I walked up to the bar and spoke to the first person I saw behind the counter which happened to be this very pretty girl that I immediately took a liking to. I told her that I had ordered some food and I was wondering how much longer it would take to arrive. She immediately informed me that the kitchen was closed so they couldn't take any food orders and couldn't make any food because the chefs had already left. She then checked the app and the orders that had been received to see what had happened to my order. It turns out my order had been accepted and paid for, but for some reason, it hadn't been processed by the kitchen and therefore had not been made. I was starving when I heard this, so you can imagine my disappointment upon hearing that I would have to find another way to feed myself. I think she noticed this too and clearly felt sorry for me, so she offered me some bourbon biscuits (British chocolate biscuits, look them up if you don't know) which I laughed off thinking she was joking. To my surprise, she was genuine and got out a packet of bourbons from her bag and handed me the packet telling me to take some. Then to my even bigger surprise, she canceled and refunded my order and then offered me a free pint of my choosing. I was proper surprised by how nice she was being and gladly accepted the free pint. We started talking a bit while I slowly ate the bourbons (they are very hard to eat when you've had beer all evening), and chatted a bit about bartending and how we both enjoy it. Then at one point, Liverpool scored and half the bar erupted in joy while the other half slumped down in despair, as the game was all but over (4-2 with a couple of minutes left). Being behind the bar, she couldn't see the score so she asked me for it. When I told her, she was clearly disappointed so I asked semi-rhetorically if she was a United fan. When she replied she was a Liverpool fan, I dumbfoundedly told her that we were winning 4-2, not realising I had just ruined the prank her co-workers had been playing all night. Her face lit with joy upon hearing this and we spoke a bit about football.\n\nWhen I finally finished my bourbons, she asked me if I was interested in some sweets to which I replied enthusiastically, my stomach still craving the food I had promised it by ordering chicken bites. She told me she would bring some sweets to my table when she took her break to go smoke. Understanding the cue to vacate the bar, I headed back to my table all joyous about how kind she had been to me and the nice conversation I had had with her. As I walked back to my table, the 2 neurons in my head started to connect and I realised she might have been flirting with me.\n\nNow one thing to know about me is I am a very shy person and I am oblivious to any signals a woman might give me and am clueless about flirting. So whenever my brain tells me there is a chance someone was flirting with me, I brush it off as them being polite and I never make a move as I am petrified of misunderstanding the situation and coming off as a creep or worse.\n\n&#x200B;\n\nWhen I got back to my table, the game was over, and there were only about 2 pints of beer left in the second beer tower. My friends all looked at me and one of them asked me where I had been for the past HALF HOUR. At this point, I had registered the conversation with the cute bartender as having lasted only 5 minutes, so the realisation that I had spent 30 minutes talking to her increased the likelihood that my brain was right and she WAS flirting with me. I immediately told my friends about the past half hour and the possible flirting with the bartender, hoping they would be able to tell me if she was or wasn't flirting with me. Upon hearing my tales, they all confirmed it was very likely to be flirting, which sent my heart racing and my mind into overdrive as I tried to process what had happened and what I was supposed to do next.\n\nLuckily, I was interrupted in my thoughts by a hand tapping on my shoulder. When I turned around I was face to face with the person that sent my mind into panic mode. She smiled and gave me a half-opened pack of jelly cherries (sweets from Tesco) and told me to enjoy them. I was on autopilot when I thanked her and smiled back as she left to go smoke a cigarette.\n\nWhen I turned back to my table, my friends all smiled at me and one of them said it was definitely flirting because she wouldn't give her own pack of sweets on top of bourbons, a free pint, and a refund to someone just because she was kind and polite. I tried to process the whole situation and as I slowly realised that they were probably correct and she was flirting with me, a huge grin appeared on my face. I got back to talking to my friends and socialising, but my brain was now trying to figure out what to do next and how to talk to her again. A few minutes later, two of my friends left to go home leaving just myself and another friend to finish the two remaining pints of beer before we left too. At one point I brought up the topic of speaking to her again, and mentioned that the best scenario I had come up with was to walk up to her and give her my number and say something along the lines of \"can I repay you for being so kind to me tonight by buying you a drink?\". He laughed at the cheesiness of that sentence and told me I should just be myself because that's who I was when she flirted with me and ask her for her number before leaving. This however was inconceivable for me because I had never successfully asked a girl for her number before and therefore any time I would ever ask a girl for her number would end up the same way: rejection. I continued to mull over the idea of asking for her number and tried to find the perfect way to do so, unsuccessfully.\n\nWhen we finished the last drop of liquid courage, I realised that it was now or never and I couldn't spend the next decade thinking about how to ask for her number. My friend got up and said he had to use the bathroom, and realising I had to do the same, I followed him to the bathroom. When we walked out of there, I looked towards the bar and saw her in the corner. She saw me, we locked eyes and both smiled. She walked to the part of the bar that I would have to walk past to go out and continued smiling at me.\n\nAt that point, days, weeks, months, and years of experiences where I didn't have the courage to make a move, do the thing, talk to a girl, go on a roller coaster, jump off the highest diving board, talk in front of a crowd, dance in a party or club, introduce myself to new people, and so many other situations where I lacked the courage or the will to do something came flashing back at me.\n\nI stopped in front of her and smiled. \"thanks for being so kind to me tonight\". She smiled back and said it was her pleasure. I paused as I tried to muster up the courage to ask for her number.\n\n&#x200B;\n\nAt that moment I realised it was now or never. I realised if I don't do this now, I probably won't get another opportunity to do so and I'll spend the next decade dreaming about \"what if\" and wondering what could have been. I realised that I can't keep waiting for things to happen to me. I realised I need to go out of my comfort zone and seek what I want. I realised that the worst that can happen is she says no. And that might sound like the end of the world, but let's be real for 5 seconds. Is it really the end? All that will happen is I'll walk out of there a better and more experienced version of myself. There won't be anyone there to mock me and humiliate me. No one will film it and post it on social media. The world doesn't care about me being rejected. No one cares about it. Everyone has their own problems to deal with. I realised that all the things I hear when I listen to David Goggins, Joe Rogan, Yes Theory, Jocko Willink, James Smith, and all these other people who share their story in the hopes of helping others improve their lives and become better versions of themselves are true.\n\nIt's all in the mind. All the barriers that would stop me from speaking to someone or asking for someone's number are in the mind. Nothing is actually stopping me from doing what I want and going outside of my comfort zone to seek a better life.\n\nSo I jumped into the unknown.\n\n\"Can I give you my number so that I can take you out for a drink to say thanks for tonight?\"\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nThe 2 seconds between the end of my question and her answer felt like time had frozen. My mind raced and jumped to all the possible scenarios that flashed in front of my eyes and each one seemed worse than the previous one.\n\nAnd then I heard two words that sent my world crashing down on me and everything I thought I knew suddenly meant nothing.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n\"With pleasure\"\n\n&#x200B;\n\nIf it weren't for the fact I was in public and I don't know how to do one, I would have done 15 backflips out of sheer joy and happiness. I felt like I could run the MOAB 240 in under 1 hour or benchpress a car. I felt so light that I started to worry I'd float off into the atmosphere.\n\n&#x200B;\n\nI collected my thoughts as I came to the realisation that she did want me to give her my number. I took out a pen from my pocket and scribbled down the 11 digits of my phone number, making sure they were all correct and legible, before handing her the piece of paper with it. At that point, I realised that her coworkers had noticed the scene and had started teasing her about it. I chuckled to myself realising that she was probably also very nervous before I asked her. She took the piece of paper and put it somewhere safe as I thanked her and said my goodbyes.\n\nWhen I walked out of there, I realised how important what I had just accomplished was for my personal growth and wellbeing. I was a new man. She texted me a little later and said she'd let me know when she's free when she gets her new rota.\n\n&#x200B;\n\n&#x200B;\n\nAll this to say, the only thing stopping you from getting out of your comfort zone is your mind. No matter what happens, you'll feel better and be prouder of yourself and learn to love yourself more if you push yourself and do the things you're scared of doing.\n\nYou control your mind, not the other way round. Only you can push yourself and seek out what you want in life. No one will do it for you. You need to trust yourself", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nd1sr3/i_went_out_of_my_comfort_zone_to_talk_to_a_girl/", "title": "I went out of my comfort zone to talk to a girl and ask for her number", "social_network": "reddit", "user": "tmac-ncl", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1621093659, "permalink": "/r/DecidingToBeBetter/comments/nd1sr3/i_went_out_of_my_comfort_zone_to_talk_to_a_girl/", "nsfw": false, "first_save": 1635435803.5252326, "replies_charged": false}