{"id": "t5_2tand_t3_kih596", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "Like many people, the pandemic has hit me hard. I live in a small apartment and have been basically trapped in my 10 ft x 10 ft room for the better part of the past 9 months. Before the lockdowns, I was able to outside and hang out at cafes or libraries and come back home to mostly sleep and wind down; now, everything, including working and going to school (which were both escapes from my living situation) are in my room...\n\nSince graduating from college, I've been struggling to meet people and always did things by myself. It was bearable, as I'm trying to transition to a new career by taking classes and that brought some sense of excitement in my life and gave me something to look forward to. Even though I'm still on track for the new career, I've been losing motivation and my only source of excitement in life faded away. I tried getting into gaming, but none of the games really interested me. I used to follow sports religiously, but even that's not interesting to me anymore. I tried getting into new TV shows (I thought the Mandalorian was pretty good) but that didn't last long and I'm back to watching the same youtube videos. \n\nI'm not sure what I can do. Even before the pandemic, it was hard for me to be social and I wasn't good at \"having fun.\" Not to say my life is meaningless but I really don't feel any \"joy\" or \"excitement\" and it's getting hard to even wake up in time for work.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kih596/i_cant_find_joy_in_anything_not_sure_what_i_can_do/", "title": "I can't find joy in anything. Not sure what I can do...", "social_network": "reddit", "user": "iamfromjobland", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 180, "down_vote": 0, "creation": 1608680684, "permalink": "/r/DecidingToBeBetter/comments/kih596/i_cant_find_joy_in_anything_not_sure_what_i_can_do/", "nsfw": false, "first_save": 1635437291.8009815, "replies_charged": false}