{"id": "t5_2tand_t3_g0nn24", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Does anyone miss their “old selves?” I miss the confidence, joy, nativity, compassion, optimism, charm, CONFIDENCE, and the emotional intelligence I once had when I was 17-20 years old. I used to be able to talk to anyone and everyone with enthusiasm, genuine interest, curiosity, and excitement. It was infectious and I knew it.\n\nI’m 23 now, very irritable, lack motivation, and have a 50/50 chance of being anxious in social situations. I don’t do much at all and sometimes struggle with navigating conversations. I’ll end up thinking about my own thoughts versus thinking about what the other person is saying. I laugh when I don’t think things are actually funny, and I’d rather be quiet than put effort into holding a conversation or say my opinion. \n\nI miss my old way of interacting with others. That person was genuine and a dose of amazing positivity. They were captivating, riveting, and again... confident! \n\nPeople would say my kindness was fake, that I over-explained myself a lot, I wonder if those negative comments changed who I was? Or if my mindset has changed who I’ve become? Or maybe age changes you? Or perhaps being overly conscious and aware that everyone is right and wrong in their own ways and I just have nothing to offer to a conversation. To me, everything is what it is. \n\nI’d like to be the free-spirited, passionate, opinionated and energetic person I once was but idk how to go back to that. I guess you can’t “go back” but I’d like to become awesome again. \n\nHas anyone experienced anything similar? Have you been able to find yourself again? How? \n\nThank you!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g0nn24/me_then_me_now_me_later/", "title": "Me Then, Me Now, Me Later", "social_network": "reddit", "user": "noodlespoodlesdoodle", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1586799452, "permalink": "/r/DecidingToBeBetter/comments/g0nn24/me_then_me_now_me_later/", "nsfw": false, "first_save": 1635435828.296958, "replies_charged": false}