{"id": "t5_2tand_t3_p20mfy", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "Hello!\nI'm Danny, 18 years old, introverted, innocent, baby inside, and here is my story.\nAt 17 I joined my college. After a few days of joining a group was created and then I texted some dumb things and then everyone lost their respect in me even though they can't express it I could see it in their eyes. After this exact moment I realised that I'm sooo dumb. Here dumb in the sense I have zero knowledge of the world around me, I was immature etc, etc. To give an intuition you know that one dude in school who is weird, what he spoke didn't make any sense, no one gave a shit about him, couldn't fit in, everyone would crack jokes on him and along those lines. Even more intuition would be Canute(from Vinland Saga, before his awakening) and some part of Forrest Gump(from the film Forrest Gump, Tom Hanks ;-D). I realised I was such a dude. All those years before I was 17 I was doing that same thing and didn't realise that people were trying to put me away. Well now here is where the real problem began. I went down a wrong path. This realisation was so new I didnt know what to do. I stared to analyse it and analyse it but didn't reach any conclusion. Then I looked back on all the social interactions I had in the past and thought to myself \"whoa I was this dumb and didn't realise it?\". And thus entre self hatred and anxiety. After this realisation I was overthinking everything, I got sweat and my heat rate increased whenever I wanted to talk to someone even with the teacher.  Everyday I blamed myself. I get so scared to do something that's social. Whomsoever reading this might think \"what the hell you are upset about such things\" and as I already said this overthinking was a wrong path I had chosen. Hmm I hope you understand it I'm really poor at expressing myself. \nOhk now,, fast forward a few days..\nwhen I was in my depth of my anxious thoughts, there enters the first ever girl in my life. She started a conversation with me and I was holding my anxious thoughts and spoke normally. Again after a few days she says that I was important to her. Now before that I was hating myself and just thinking a lot and right after she said these words it gave me some self validation. Like after she said those words I was like \"whattttt, am I really worth being important whatttttt is this even real??\" Now another wrong path I had taken. I got attached to her I became a simp for her. I was thinking about her every single second. I was overthinking about her instead about overthinking about how dumb I am. At this point I was having so much feelings for her. Then after a few days the frequency of texting between us kinds decreased. Then my anxiety kicked in saying \"bruh you were never important to them she just said it for fun like all social beings do but you took it to the next level, they were just being nice\" then these thought were becoming intense and I fricking broke into tears, yeah I cried for this small reason. I was crying thinking to myself \" bruh why did I this why the frick I invested a lot of my feelings on her and now this what happens\". Well I didn't send any dumb bull crap texts to her. I was completely normal. What all was going was going in my head and head alone. Then I was sad about it. Thinking about it every single day. Ohk then what happens. A small incident. One dude asked me to take a picture of a girl he was friend with and asked me to share it to him. And be being the absolute dumb crap took the photo and I shared it with him. And this dude  sends that pic to the girl he was friends with. And surprise suprise that girl in the picture is friends with the girl who talks with me. So both of those girls gang up on me snatched my phone when I wasn't away yell on me. And then I told these things to that dude whi asked me the pic. He called those girls up and said something I not sure what he said. And then later the girl who talks with me was apologising for yelling at me. But I didn't really listen I was pretty sad that I made someone fell bad. I just shut myself. Didn't eat, didn't attend college for two days. I got some texts from that girl which I ignored and then I responded later. She said come back let's talk you are important. My useless a$$ started simping her again. I later realised that they were just being nice. Ohk next. It was all normal, my overthinking kinda reduced. Next entre covid and lockdown. I was texting her normally. Simping her mentally. Duh I don't have any sexual thoughts about women. Well again frequency of texts decreased and then I felt like crap again cried thinking \"bruh I'm literally wasting my time my feelings for someone who really don't care about me\" Then I gathered some courage then texted her saying \"why you do that. I'm not imprtant to you but why you say?  you only use me right?\" She responds \"your words make me cry you are important to me don't say that\" bruh I was shocked. Then next day I texted \" you gotta reply to my texts even if a nuclear warhead drops on your house\" yes ladies and gentlemen I became selfish, without knowing. I realised I was becoming selfish after watching Kaguya sama(some anime). Ohk now with this woke realisation that I was selfish and that I was valuing people who don't really care about me and that I was simping and that I gotta get myself under control I deleted all my social media accounts except for one where o get college documents. When I got texts from her I didn't really show interest and then slowly we stopped talking all together after 2 months. And then I got rid of thinking about the first incident, all that thoughts of  embarrassment shame etc etc. Then I stated working on some goals I kept. Things were going smooth. No overthinking crap. ohk next. It's new year 2021 it's February. I had to attend college for some exams. I saw her after some long days. Now entre another wrong path. Desperation. I was so desparate, overthinking, thinking about ways the talk to her again, and then I was texting sorry to her for no reason I was saying sorry sorry sorry to her like crazy and then at the peaks of my desparation I finally said dumb crap \"stop wasting my time. you aren't even interest in me get a life go study for the exams. Don't be concentrated on me\" boi it angered her up. We argued then I realised the dumb thing I did. I made her feel bad. I broke into pieces. Now for the next dumb thing I did. I called her for the first time and cried on the phone saying I didn't mean that. I didn't say I had anxiety issues. Then she excused me. it was a small thing. I was overthinking everything. Ohk now we are back to normal but now no more simping. See by simping I don't mean the simp portrayed by the internet. I mean constantly thinking about her like valuing her a lot like placing her on a pedestal. But she never used me tho. She is a nice person. I made her feel bad coz of this anxiety issue I have. Ohk then I said \"let me just not talk again\"coz my anxiety was like \"they are only talking to you coz they realised you are a crybaby and then just want you not to cry\" but man I really cried coz I really felt like crap that day. I'm pretty innocent, dumb, but I don't really wanna hurt others. I felt like man what the hell did I just do. Ohk then after a month and a half of ignoring her I get a text again saying \"what happened\" then I blame her again saying \"you are just playing with me I'm not important to you I'm not special to you I'm some random dude\". I literally blamed her like anything. What all conclusions I drawed from overthinking I told her. I messed up big this time. Next day I was sad thinking about why I did that why am I soo dumb then I was texting her a lot of sorry which became really awkward then my overthinking was like \" bruh you made her feel bad you screwed up lot bruh you suck\" Then I stopped everything I was sad thinking about it everyday. Ohk now in June college, gotta attend. I was thinking \"ohk now all this overthinking started coz she said I was important right, now you can't find a logical reason to let go right why not just ask her directly about this and you'll get the answer and you'll stop overthinking now that youll have a reason not to overthink\" ohk then I went asked her. Another dumb move the answer is obviously no. But still I asked. She didn't say anything. I was like \" please please\" and after waiting a lot she said \"no now go away\" I was like \"yay I got the answer\" but deep down I lost it all. I lost my respect on myself and seems like she even lost respect on me. She gives me this look of disgust. I think it's because I never talked to her face to face so I didn't get to know her properly. I'm scared to talk to others man. Like think about it in this day and age who would want crap men no one right. Well it's my fault. I'm sad. I can't seem to get over it. It sucks man. I'm losing interest in doing the things I liked. Feeling disgusted. Don't know what to do now.  \nYeah that's the end folks. This is the dumbest story you'll ever read. I'm very poor at conversations. I don't know if what I typed actually got you. I suck man to the core. Anxiety, overthinking, dumbness, that's all I am. I still overthink about this incident. Thanks if you made it this far. Whomsoever read this I would request you to help me out of this, to help me grow up. I'm still a baby inside. I'm really sorry for wasting your time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p20mfy/any_help_is_appreciated/", "title": "Any help is appreciated.", "social_network": "reddit", "user": "loser_retard_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1628636921, "permalink": "/r/DecidingToBeBetter/comments/p20mfy/any_help_is_appreciated/", "nsfw": false, "first_save": 1635436465.1517186, "replies_charged": false}