{"id": "t5_2tand_t3_i8325u", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "As millennials and generation-Z, we’ve all grown up in at least one corner of the Internet, and the one I grew up in was the stan world. I admit it: throughout my teen years, I sat on the Internet debating with absolute strangers about the supposedly undeniable excellence of my favorite musicians, the unequivocal mediocrity of others, and most of all, the validity of my own opinions. I also admit that these debates got emotional, and that they could happen at any time. Any critique of some artist I liked felt like a personal attack on me that had to be defended against or even worse, avenged.  \n  \nYears later, I still find those old feelings lingering. It absolutely bothers me, for example, to see that some public figure that I adore, has been smeared. But you see, recently I’ve been trying to fight any urges to correct such wrongs. I went through a reckoning with myself in college regarding self-esteem and people-pleasing issues I’ve had all my life. Out of that reckoning came the conclusion that excessive pursuit of external validation is to be avoided at all costs, and self-validation is to be favored.  \n  \nOne day, I just made the connection: is the reason that I get pissed off or want to argue when someone for example spreads a misconception about a person or thing that I like, simply that I feel like I’ve been personally invalidated and need to regain my honor?  \n  \nWhere does one draw the line? I’ll be more specific.  \n  \nI’m a huge fan of Janet Jackson’s. Huge. Huge...huge. I once visited the family home of a friend whose mother was a huge Michael Jackson fan. She stated openly that she didn’t think Janet could sing at all and that Janet only got famous off of Michael’s notoriety. This was at a time in my life where I was gung ho in my belief that “defending my faves” was a form of unhealthy validation-seeking. I was not upset by her assertions at all. Smiled and shrugged it off.  \n  \nI’m writing this now because I’ve regressed, I feel. I’m also a huge fan of the late Aaliyah. A friend of a friend tweeted months ago that “Aaliyah is overrated because she died” and that “she could not sing; that life never sang a riff or run in her life.” Patently false.  \n  \nI ADORE Prince. Someone said “people only pretend to like Prince; They only listen to Purple Rain, the rest of his music isn’t good, and all his fans know that.”  \n  \nLast example. I respect the rules about political discussion here and I won’t violate them. Look, I am a supporter of Senator Kamala Harris. Whether or not you like her personally, and there was once a time when I did not myself, it was brought to my attention that several lies/distortions were told about her. These ideas have been viral sound bites since her campaign and will return in full force now that she is the VP nominee.  \n  \nThe above 3 examples all PISSED. ME. OFF. and I feel like this proves that I have regressed in my maturation. :( I’m not supposed to care what others think about the things I like, because I’m not supposed to care what people think about me. :(", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i8325u/how_to_deal_when_others_hate_what_you_love/", "title": "How to deal when others hate what you love", "social_network": "reddit", "user": "jjrhythmnation1814", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1597189890, "permalink": "/r/DecidingToBeBetter/comments/i8325u/how_to_deal_when_others_hate_what_you_love/", "nsfw": false, "first_save": 1635436522.6906524, "replies_charged": false}