{"id": "t5_2tand_t3_k7da3o", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Since the new year is approaching, I figured I'd create a challenge for you all!\n\nI'm already in a very similar process at the moment (I post a progress post on my profile every day if you want to check it out). The reason I say this is to say that the purpose of this post is simply to give you all some ideas on ways you can improve yourselves in 2021. The power of incremental improvement is amazing.\n\n**January: Setting a Wake-Up Time**\n\n* The four pillars of health are sleep, fitness, healthy eating, and having a good social life. Let's work on fixing your sleep first. Before focusing on a consistent sleep-time, it is key to work on waking up at the same time every day. You get to pick a time, but make sure that it is relatively early. 8 am is an excellent choice, for example.\n\n**February: Setting up a Seep Time**\n\n* Now that you are consistently waking up at the same time every day, you might have noticed that you might be tired some days. This is because your sleep time might not be consistent. 8 hours of sleep is a good target, but if you feel that it is too much or too little you can change it. Your goal here is to be in bed at the same time every night. It might help to also set a time for when you need to get ready for bed. A night routine might take time and shouldn't be rushed.\n\n**March: Performing Deep Work**\n\n* Now that your sleep is fixed, you might notice that you have plenty of extra time during the day. You will use this time to indulge in at least 1 hour of deep work per day. Deep work is defined as an activity performed in a state of distraction-free concentration that push your cognitive capabilities to their limit. Writing, studying, and coding are some examples. You can also spend your time producing your own content. The book \"Deep Work\" talks in detail about deep work, and the difference between deep work and shallow work.\n\n**April: Hitting the Gym**\n\n* Now that your sleep is fixed and you're working on your brain muscles, it's time to start working on your actual muscles. The goal here is to go to the gym 3-5 days per week and perform strength training. The book \"Bigger Leaner Stronger\" is a great book that talks about this and provides a workout routine. Also, don't forget to stretch after your workouts! We don't want you getting injured.\n\n**May: Doing Cardio**\n\n* Now that you've successfully worked on creating the habit of working on your muscles 3-5 days a week, the next goal is to add cardio into the mix. You can do this after your workouts or you can do it during your rest days. Cardio can include running, swimming, hiking or even walking. The goal is to have 2 sessions per week. HIIT is also a good example of cardio. A good idea might be to do HIIT one day and to do low intensity cardio another day.\n\n**June: Eating Healthy**\n\n* Wow, look at all your progress. You're going to bed at the same time every night, you're waking up early every day, and you're working on your brain and on your physical muscles. Now it's time to focus on what you're putting into your body. You will start eating healthy every day. Less carbs, more fruits and vegetables, no deep fried food, no unnatural foods, no unhealthy preservatives, no soft drinks, lots of protein... the list goes on. Furthermore, you are to drink at least 2 litters of water per day, as water is also a big part of nutrition. There is a lot of information online about what constitutes as healthy eating. The book mentioned above is a good example. You can still eat food that tastes good. Chipotle, for example, tastes amazing. Another example is dark chocolate. You can by all means have a couple pieces of dark chocolate with your tea. The more proper research you do, the more you'll understand what is healthy and what isn't. The goal for this month is to implement a healthy lifestyle.\n\n**July: Taking Social Risks**\n\n* The first three pillars of health have already been talked about. Now it's time to do something about your social life. Your goal here is to take 1 social \"risk\" per day. This can be something as simple as texting an old friend and asking if they would like to have a phone call to catch up. This can be something like asking a cute girl/guy if they would like to get coffee with you. This can be something like sending an email to an old professor and asking how they've been. This can be something like asking your friends if they'd like to hang out during the weekend and setting up a plan. The goal here is to get busy socially and to get in contact with more people.\n\n**August: Teeth Care**\n\n* Wow congrats! You are a healthy person now. You are working on strength training and cardio every week. You are eating healthy. You have an amazing sleep schedule. You have an awesome social life. You are performing deep work every day on projects you find interesting. Next up, it's time to work on preventing future health problems. The best way to start this is by working on your teeth. The goal here is to brush your teeth properly twice a day and to floss once per day. You can watch videos on YouTube if you'd like or you can set up an appointment with your dentist. You are to no longer half-ass your teeth care. I want you to have the cleanest set of teeth out of everyone.\n\n**September: Skin Care**\n\n* There is a great subreddit on the topic of skin care on reddit. The three pillars of a beginner routine are to have a good moisturizer, to have a good cleanser and to have a good suncream. You are to go to that subreddit and learn how to create your beginners' routine with those three products. Then you are to purchase those products and apply them every day in the manner that is set out in your routine.\n\n**October: Meditating**\n\n* Wow look at you! 9 amazing habits so far. You have transformed into a better version of yourself. But you're not done yet. Next, we will work on calming your brain by meditating every day. There are some great meditation apps, such as Headspace and Calm available. The goal is to divide the month into 4 parts. The first week, you do 5 minutes of meditation per day. The second week, 10 minutes. Third week, 15 minutes. Finally, on the last week of the month you do 20 minutes per day. After the month is over you can return back to doing at least 5 minutes per day moving forward.\n\n**November: Limiting Phone Use**\n\n* The next goal is to limit instant gratification. We live in a world where we are constantly plugged into the internet and into our smartphones. The best way to tackle this issue is by starting with what that is often most used, and most unhealthy - your smart phone. You are to set a 1 hour limit for each day (unless of course you absolutely need to use it for work or for an emergency or something). The point is to limit the use of apps such as YouTube, Instagram and things of that nature on the smartphone. You can spend your new time on things like reading or other hobbies.\n\n**December: Helping People**\n\n* Look at you! You have become a healthy individual. Now it's time to help others! You are to perform one act of \"helping\" per day. This can be something as simple as giving money to a homeless person. You could also go on subreddits that talk about depression and suicide, for example, and direct message a user who is going through a hard time. There are numerous ways we can be kind and help others. Your help and kindness must be genuine here. You goal is to take a little bit of time every day to be kind and to help someone.\n\n**Final thoughts:**\n\n* It's amazing how much progress can be made in one year simply by focusing on one habit per month and then by adding a new habit the following month. There are many other habits that I wish I could have fit into this 12-month plan, but I believe these 12 are the most important for people just starting out. There is, however, one habit that needs to be mentioned. This is the habit of taking care of your finances. During the year, when you are focusing on the 12 habits mentioned above, make sure to keep this one in mind. Make sure that you are being smart about your purchases and that you are learning about money management, and things like investing and saving. With that being said, I wish you all all the best in this journey! Remember that you don't need to use this exact plan laid out. You can make your own changes. I can't wait to see you come out the other end of 2021 as improved individuals!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k7da3o/2021_12_month_challenge/", "title": "2021 12 Month Challenge!", "social_network": "reddit", "user": "DoerThinker", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 23, "down_vote": 0, "creation": 1607194516, "permalink": "/r/DecidingToBeBetter/comments/k7da3o/2021_12_month_challenge/", "nsfw": false, "first_save": 1635435574.4434364, "replies_charged": false}