{"id": "t5_2tand_t3_mme4ny", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I guess I'll start with the basics: I'm 26 years old, a college graduate, and male (if that matters). I'm here because I want to do better but am not quite sure how to go about doing it. There was a time in my life (about three years ago), when I was killing it in my career as a freelance copywriter/translator, I had my own house--I rented, but that's at least something--and for the first time in my life, it seemed like I was going to break out of the cycle of poverty that's pretty much characterized my immediate family for as long as I can remember. \n\nI guess I should say I never really wanted to be a copywriter. I majored in English/Korean at university and had planned on going to Korea to study and then work after graduation. Long story short, my dad had multiple heart attacks, and I decided to stay with him (my parents are divorced and my siblings were living overseas) and just find work in my city (which is really small and revolves around industry). Just getting out of college, I didn't want to work a factory job, but I did for a while and eventually found I could make much more money at home just doing freelance/translation. I was happy because I got to use my degree and write, which I've always enjoyed doing. Once my dad got better, I moved out on my own and was pretty independent for the first time in my life.\n\nAnd then it all came crashing down. After writing about 2,000,000 words in half a year, I was totally burnt out on the writing, and the Korean gig I'd worked hard to create was practically useless as a money maker because the demand was smaller and/or my brand was built too much around copywriting. I started getting late on multiple orders and eventually just shut down my practice because I simply could not handle it anymore. Obviously, this was depressing, but I told myself it would be okay because I finally had enough money and my dad was well enough that I could go to Korea as originally planned. Unfortunately, my dad got cancer around this time, too, so I ended up staying at home again, and though he recovered, I've become something of a caretaker for him. I started freelancing again, but I still feel like my brain is totally fried from before and I just can't think clearly like I used to. My income has been drastically reduced, and at this point, I'd honestly come out better going to work at a factory again. It's now been five years since graduation, and I'm starting to feel like it's make or break time. I don't want to be in this position now when I'm 30 years old. For that reason, I've started to compile the necessary documents that will allow me to go overseas and teach English (not exactly my dream job, but it's better than this, and I'm a firm believer that a change of scenery helps). I was told it could be months before the visa is issued due to the COVID backlog, which is understandable, but still depressing. In the meantime, I've applied to multiple jobs here with no call back except for one that turned out to be a position in a different state, and I'm not able to simply relocate right now.\n\nSo here's where I'm at: instead of being negative about everything, I want to be positive and try and keep my options open. For now, that means continuing with the freelance and applying to jobs while I wait on my visa. I'm also engaged in a few other endeavors that aren't strictly work related (a translation competition, for instance) but that help me feel as if I'm getting back to my \"roots\" and could also open some doors for later. I know that in order to do better and be better, I simply need to manage my time better and really take the work I'm doing seriously. Despite this, I find it difficult to work for more than about two hours a day (which is obviously rock bottom income). Anything more than that is like pulling teeth. To fix it, I decided I would schedule my day in a series of two-hour Pomodoro slots, with other things interspersed into the work to keep myself from feeling the weight of endless writing. Generally, I do work, work, translation, work + translation, work, translation, work or some other combination, but I eventually end up feeling exhausted after writing about 2,000 words a day. In the past, I could write 20,000 words a day no problem. I don't want to get back to that level, but I do need to find a better way to actually get up and get to work so that at least I'm making the money I need to be making to support myself. Does anyone have any ideas? I feel the strangest mixture of hope (finally, I see some light at the end of the tunnel and a chance to make my life better) and stress (in order to do that, I still need to make money and get my house in order, which is just massively overwhelming to me for some reason). I feel so stressed about this that I can hardly move except to do some basic stuff or goof off, which only makes the stress worse. I was never like this before (always very diligent, the last one to leave work, a perfectionist, etc.). And I'm only this way about my work. I have no problem exercising every day, sticking to a no-sugar diet, keeping my room clean, etc. In these domains of my life, I feel as if I'm put together, at least to some degree, and I actually might be beach body ready this summer for the first time in my life (I was always too skinny before). But I simply cannot bring myself to focus on this work that I hate doing so much, especially knowing that the clocking is ticking on my youth (and all the goals I wanted to achieve) and with the weight of living with my dad and basically being a caretaker for him. How do I get better at this? How do I make myself do something I seriously hate doing so that I'm better off today and also better equipped for the future?\n\nTL;DR: After some early successes and massive personal setbacks, I can't bring myself to do the things in the short-term that I should do (work) to support myself now and set me up better for the future.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mme4ny/want_to_do_better_not_sure_how/", "title": "Want to Do Better, Not Sure How", "social_network": "reddit", "user": "throwaway88_22", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1617835993, "permalink": "/r/DecidingToBeBetter/comments/mme4ny/want_to_do_better_not_sure_how/", "nsfw": false, "first_save": 1635437549.2759407, "replies_charged": false}