{"id": "t5_2tand_t3_cmmxy6", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "There is a theory, or a concept, that as soon as one has a Life Goal, he (she) becomes a slave of this goal. That if one has a goal, she (he) stops living for today, and starts living for the future – and only for the future. That people with thoroughly elaborated life goals gradually become unable to relish the beauty of a moment. \n\nThat’s not true.\n\nIt really happens sometimes, but only if (when) the goal is set in the form of a dot in the future. For instance: “In 2029 I am a successful businessman. My company is in the Forbes Top-100, I have a house in Maymie and one million euro on my bank account”. On the one hand it sounds rather concrete and definite, clearly and specifically. And a lot of consultants will tell you that clear goals is the shortest way to success.\n\nOn the other hand, let’s imagine that in 2029 you have a villa in Niece, your business is number 101 in the Forbes list, and you have EUR 950.000 on your account. Technically your goal hasn’t been achieved. But you are, beyond doubt, is a successful businessman. Moreover, you may feel very happy with those results. But if you are “a slave of a goal”, you may feel desperate about the results.\n\nThe goal is not a dot in the future, it is a line. Or, as our school teachers told us many years ago, a ray, starting here and now and going forward – in infinity. It is a direction in which you would like to move.\n\nLet’s say that you realize that playing guitar (or knitting, or teaching, or healing – whatever) is a matter of your life. That you are ready to leave your position in a bank or a large state company, losing a nice salary, medical insurance and decent pension plan, in order to dedicate yourself fully to the job of your life. This is your Line (or, technically, ray). \n\nThe example is following: “I am a guitarist. I am going to commit myself to playing guitar. In 2029 it is my only occupation and the only source of income. I am a famous guitarist, I work alone, without a band. I have a lot of admirers, and promoters often invite me to play in other cities or countries”. It is completely enough for a good Life Goal. It is a direction, not a dot.\n\nBut some dots are needed, after all. Ordinary I recommend my customers to set three dots on the line – for one year, 5 years and 10 years. The first one, for a year, is as detailed and clearly defined as possible. It is necessary – otherwise you won’t stop dreaming about the goals and won’t start moving towards them. But the second and the third are soft, flexible. It is impossible to set a clear goal for 10 years and to achieve it literally. Moreover, it is highly recommended to revise your long-term goals at least once a year. \n\nThis approach to goal setting has nothing to do with becoming a slave of the goals. Nothing prevents us from enjoying the moment – every minute, every day, every week. Goals shouldn’t be rigid, they should be flexible. But, of course, if you set a goal in the beginning of a year, and did nothing within it, it is not a “flexible goalsetting”. It is laziness. Or, rather, a wrong goal. If you have a goal and don’t have motivation to achieve it – it is not a goal of your life. Forget it and start looking for a new one – as soon as possible.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cmmxy6/life_goal_is_not_a_dot_or_a_slave_of_a_goal/", "title": "Life Goal Is Not A Dot, or A Slave Of A Goal", "social_network": "reddit", "user": "sbiryulin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1565072420, "permalink": "/r/DecidingToBeBetter/comments/cmmxy6/life_goal_is_not_a_dot_or_a_slave_of_a_goal/", "nsfw": false, "first_save": 1635438290.6883237, "replies_charged": false}