{"id": "t5_2tand_t3_3kzn75", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Hey reddit! I woke up like an hour ago, it's 3 AM here, and i felt like talking a about my problems, looking for a bit of help or a piece of advice. Sorry for the approximate english, i'm not an english native speaker. :/\n\nFor years i just lived as a recluse, playing video games during hours in my dark room, shutters closed, feeling bad, avoiding social contacts or new experiences because i was too afraid of messing up. I studied in an art school, but it was hard because i was really scared of judgement and people seeing my weaknesses. So i avoided everything and when i was home i couldn't draw or do anything i wanted to, i just escaped in my video games, barely eating, barely sleeping...\n\nSo lately i started to think positively, i stopped constantly being cruel to myself, stopped blaming myself all the time for everything bad that happened in my life, because it felt like it wasn't getting me anywhere, i was just feeling miserable and it wasn't how i wanted to live and how i wanted to be. It felt great and i actually started to recover some hope, i had more energy and i could draw and play the piano again.\n\nHowever, i still spend so much time on my computer, it almost seems like i'm constantly in front of it, it feels pointless, and i want to change that, not sure how to proceed though. It's not that i feel guilty when i play video games or when i browse the internet, it rather feels like i'm borred anyway, it's not even fun, once again, i just keep doing it to avoid taking risks. Sometimes i'm excited and thrilled and i go to my drawing table to train, or i go and play the piano, but most of the time, i have energy, i don't feel tired, but i don't feel the urge to do anything... But that's weird, because i have goals, i know i want to become a good artist, i have an idea of what i want to achieve, i also want to meet nice people, build relationships, fall in love, live a real life! But waking up at 2 AM, and having to chose between drawing, music or video games doesn't satisfy me. (And maybe i'm still scared of drawing, i really don't like to mess up, though i know it's okay to do a bad drawing.) I have to replace video games by something else that makes me feel fulfilled.\n\nAs you can see, i'm a bit lost, i don't really know where to start, i'd like to draw more, to practice musical theory more, to live a real life, i'm positive i want to quit staring at my screen so much. I have a hard time making the first step, because of doubts, things like this... I really lack discipline. \n\nI'd really appreciate it if someone could advise me a bit :) thx for reading\n\n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3kzn75/21_years_old_spending_too_much_time_on_my/", "title": "21 years old, spending too much time on my computer, feels pointless, but i'm still optimistic.", "social_network": "reddit", "user": "-CYRANODEBERGERAC-", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1442282435, "permalink": "/r/DecidingToBeBetter/comments/3kzn75/21_years_old_spending_too_much_time_on_my/", "nsfw": false, "first_save": 1635437590.1495807, "replies_charged": false}