{"id": "t5_2tand_t3_apwdff", "request": ["311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "Hi guys\nIn today post i will be sharing the secret to all round rest in life. Whatever you have been going through in life, after you have through reading this post you will discover a way out of that problem. Many people in life suffer pain and sorrow when they are in problem, from there they start looking for rest in it going from one place to another but never knowing that the only way that will give them all round rest is even with them. Waiting for them to accept and say what they want. I was in such situation long time ago, looking for solution from people to people but non of them could help me to solve the problem until i discover this Secret i will show you that have given me all round rest in every area of my life.\nThe Secret to All Round Rest:\nThe First Secret to all round rest in life is found in the bible in the book of 2 Chronicles 15:12-15 which says: And they entered into a covenant to seek the Lord God of their fathers with all their heart and with all their soul. That whosoever would not seek the Lord God of Israel should be put to death, whether small or great, whether man or woman. And they sware unto God with a loud voice and with shouting and with trumpets and with cornets. And all Judah rejoiced at the oath: For they had sworn with all their heart and sought Him with their whole desire, and He was found of them and the LORD gave them rest round about.\nand Matthew 11:28 which says: Come unto me, all ye that labour and are heavy laden and i will give you rest. If you can do what this two verses says, you will have rest round about in every area of your life. \nIf you read that verses of scripture above, you will discover (1) They enter into a covenant to serve God and (2) They swear an oath to follow Him. What you need to do to first to have rest round about in life is to serve and rest on Him. Make a covenant with God to serve Him. He is your creator, He knows how you feel, He knows the way out of that situation. He is even with you when you are going through that pain and He said again in Matthew 11:28 come and i will give you rest. He is calling you to come because He want to give you rest in that situation you are going through. All you need to do now is come to Him and He will give you rest round about. \nThe second way to all round rest is doing and acting on what the word says: This is the second way to all round rest in life, by walking and living in the word. This is your new life (the new created spirit). This is what you are born with and it is another one thing that can give you all round rest in your spirit. The way to get all round rest in life in that situation when using the word is to first:\n(i). Locate the word that God said concerning that situation and write them down.\n(ii). Pray with it in faith and rest your mind on it. \n(iii). Keep confessing the word into that situation and believe what you say is what will come to pass.\n(iv). Keep reading the word day by day and rest your mind on God, knowing that He is with you and He will turn your situation around. \nAs you do this you will begin to feel joy, excitement and peace within you. The power of the word will go into action and change that situation for you. That is the secret of the rest round about.\nAs you has read in this post, just follow it and see what happen to you in the next one month.\nIf you are not born again just say this simple short prayer below. Dear friends you don't have to die in sin, someone has already pay for it and God is not counting your sin against you. Today He is telling to come and accept what He has done for you so that you can live a successful and a prosperous life. So if you want to born again say this short prayer:\n\nLord Jesus i come to you today as a sinner, i believe you died for me and on the third day you rose again for my justification. Right now i accept you as my Lord and personal. I am save and i am born again. Thank you Jesus for saving me.\n\nKeep soaring high and prospering in life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/apwdff/how_to_have_all_round_rest_in_life/", "title": "How to have all round rest in life", "social_network": "reddit", "user": "spu44", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1549995567, "permalink": "/r/DecidingToBeBetter/comments/apwdff/how_to_have_all_round_rest_in_life/", "nsfw": false, "first_save": 1635437886.5324621, "replies_charged": false}