{"id": "t5_2tand_t3_qdg6w1", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Many want to improve, many want to find peace, but nobody wants to hate their lives. What’s the point of it all if we simply *hate* the journey? Getting to the end of our goals is nice, and something to be admired, but like everything we get used to it and complacent. The journey is usually the longest, challenging, and memorable part of our goals, so we should make sure to cherish and enjoy it. Especially because many of our goals may take years to accomplish, some may never actualize, and if we hated most of that time, then it may not be worth it.\n\nI’m sure we can think of some goals that are worth it, even if we hate the process. However, the point I’m trying to make is, at least for today, try to enjoy the process. Enjoy the struggle, enjoy the journey, enjoy the process… just enjoy your life. You may be going through a tough and challenging time, but if you can focus on why you chose this in the first place, maybe you’ll find enjoyment. If not, then listen to yourself, why not? Is it simply a difficult stage in the goal? Have you been feeling this way consistently? Then consider whether you want to continue. Is the end worthwhile? What if that end doesn’t happen?\n\nWe want to minimize regrets, yet almost anything worthwhile is challenging, and part of goal setting is the risk that they may not happen. It’s hard to think of a failure as worthwhile and not being a regret. All I can offer here, at the moment, is the cliché of learning from the process. If you must hate the process, and you still end up failing, then chalk it up to learning. Growth. Like an entrepreneur who achieved a certain amount of wealth, then lost it all, it’s easier to replicate it. You know the process already, you know the steps and hurdles, the *feelings* and negative thoughts you go through, and how to navigate them.\n\nGet excited for the day. Make allowances for temporary defeat. If you’re stuck, seek help, or research, or take the day off and realign yourself, or try again, or use it as a test of your resilience, or find enjoyment while you do it anyway, or be grateful that you even had the opportunity.\n\nWe tend to over complicate things, which is quite natural in the moment. When we step back it’s quite simple, but in practice it’s quite a lot to think through. Do you like what you’re doing? If not, *why are you doing it?* Is this setback or failure temporary? Is the end worthwhile? Is it worth it even if you fail? Do you ENJOY your life while you pursue this?\n\nI’m not saying be happy at all times, but even if you’re stressed, it’s *good* stress. Not stress that is forced, or that you can’t imagine a way out of. Rather a self-imposed stress because you are chasing goals you are passionate about. That are worthwhile for the process even if you fail.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qdg6w1/are_you_enjoying_the_journey/", "title": "Are You Enjoying The Journey?", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1634906863, "permalink": "/r/DecidingToBeBetter/comments/qdg6w1/are_you_enjoying_the_journey/", "nsfw": false, "first_save": 1635436016.2275832, "replies_charged": false}