{"id": "t5_2tand_t3_ouoaa4", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "This isn't really going to be a fleshed-out post like it probably should be, but I spend too much time on Reddit and will make this short.\n\nI want to have a fashion-style. I don't want to wear dorky/mismatching clothes due to not wanting to spend the money. I'm saving money, but I feel silly.\n\nI want to be healthy. \n\n1. I don't want to keep wandering what that weird straining feeling in my calf is. \n2. I want to exercise every day.\n3. I don't want my teeth to hurt anymore. \n4. I don't want to continue living with remnants of depression and trauma. I want to know if I have ADHD or Chronic Depression, or whatever else I can tell is wrong with me but I don't know what it is exactly. I want to see what it's like to live on medications for whatever in my head is constantly holding me back in life. \n\nIn one year, I can be on my way to France, either to do a Masters or teach English. There are only two things I need to do:\n\n1. Pass an advanced French test this December.\n2. Save up as much money as possible. $15k more than I have now at least.\n\nI picked up a second job to save more.\n\nI'm signing up for extra French tutoring.\n\nI'm signing up for my local gym.  \n\n\nIt's going to be hard. I'm trying to take things one thing at a time. But there's a lot of work to do and one year's not a lot of time to do it. It may take two. I'm a bit impatient. But I want to stop spinning wheels. I've put off the health things for a long time, so I'm considering putting that off just one more year and dealing with them in France. Yet, I'm still in pain, but on the other hand doing them here in the USA it's very expensive. Do it all in one year? Maybe. It's a big project. I've never attempted this much work at once all alone as an independent adult before. \n\nBut I have to try.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ouoaa4/in_one_year_i_want_to_be_the_person_i_want_to_be/", "title": "In one year, I want to be the person I want to be, on the way to the place I want to go.", "social_network": "reddit", "user": "ceilingfanwatchparty", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 134, "down_vote": 0, "creation": 1627663558, "permalink": "/r/DecidingToBeBetter/comments/ouoaa4/in_one_year_i_want_to_be_the_person_i_want_to_be/", "nsfw": false, "first_save": 1635435072.2981665, "replies_charged": false}