{"id": "t5_2tand_t3_gvnlca", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "I decided to take action and create a blog to spread some positivity, instead of wasting all these free time at hand. Recently, encountering plenty of obstacles and confusion, the path forward looks hazy and foggy. Anxiety, fear, uncertainty, several negative emotions clouding the mind's eye. But like any cloud or storm, hoping they will pass, and learning to be the sky that holds all these clouds. Once negative emotions and thoughts weigh you down, a lot of us will just freeze and loose motivation to move forward. Being lost, it is very easy for one to say i'm feeling low, hence there is no point in moving forward in life. That is a sure shot way of falling into depression. Before you step into that, take massive action towards something you love - in my case, empowering others towards progress. When you feel low, go CREATE SOMETHING, better still if this something will help a group of people. Because once you start helping other people climb out of your rut, you will slowly learn that it is not so much about you anymore, as you exit your head, and enter the present moment. And then, you will automatically rise out of your rut. Go write a book, blog, create videos, art pieces, music for others to enjoy, take up photography, or even start creating your own start up. When you are feeling down and low, I would say is the best time to pick yourself up and find your breakthrough. When a can is filled with dirty, murky water, you flood it with pristine water until the can overflows with just clean water.\n\nDo check out the blog and please give feedback/ comments on how to improve/ topics for me to reflect upon and make new blogposts, it will be much appreciated, but go out there and create something for the world. Sometimes, you'll never know whose life you are transforming at a given point in time. Pay it forward, and keep moving forward, even when the visibility is foggy and hazy.\n\nwww.onesecondswitch.blogspot.com", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gvnlca/once_you_learn_to_surf_your_biggest_dream_will_be/", "title": "Once you learn to surf, your biggest dream will be a tsunami, learning to surf life and realised that sharing some knowledge on it along the way helps me as well, teaching and empowering others feels good, and helps you get out of your head.", "social_network": "reddit", "user": "onesecondswitch", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1591161198, "permalink": "/r/DecidingToBeBetter/comments/gvnlca/once_you_learn_to_surf_your_biggest_dream_will_be/", "nsfw": false, "first_save": 1635437629.8964937, "replies_charged": false}