{"id": "t5_2tand_t3_pdcvxu", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": "Well it’s been quite a ride. I’m around 5 months clean (with a short lapse of three days) from a crippling meth addiction that stole my soul. I’ve been trying to quit this horrible drug for over a year, and I’ve made a lot of progress. Over this past year I have been mostly clean and sober, with 5 or 6 short relapses. It’s been a battle and I had to lose almost everything to even get to this point. My ex and I are having a baby together, she found out she was pregnant literally a week after we broke up. I put her through hell in my addiction and I was the one who ended it as I couldn’t stand to hurt her anymore and i knew I was spiraling and heading towards another relapse. All the guilt and shame and self loathing just compounded until one day I couldn’t deal with it anymore and ended it, thinking to myself it’s for the best as “she will be free from you”.  I feel like a coward for dealing with the situation in this manner, but ultimately I know it was the right thing to do. I’ve probably cried every single day since that happened. Anyways, she’s such a good woman that she had given me the opportunity to be in my child’s life, assuming I stay clean and stable. The road to fatherhood for me will not be easy but I’m not going to let this fucking evil drug take anything more from me, and more importantly, I will not leave my future child with a junkie father who isn’t around. We recently spoke on the phone and I said some things about hoping one day we will all be a family etc, and she made it clear that we could never work it out. This hit me so hard, it’s been a horrible week of the deepest sadness I could ever imagine. Last night I finally came to the realization that she was right, there is no way she could ever take me back after everything I put her through. I’m still working on accepting that, and it’s painful as hell, but what’s most important is that I get myself well so that I can be the father that this little miracle baby deserves. It won’t be easy doing the co parent thing with the woman I wanted to spend the rest of my life with, but I have to let her go and be free, and i won’t let my baby suffer because of my terrible choices. Play stupid games, win stupid prizes. My baby will never see me high or have to wonder what happened to dad, I’m devoting my life to becoming the man I know I can be, the man I was before I touched meth. I’m getting the old me back🤙", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pdcvxu/loss_addiction_and_acceptance/", "title": "Loss, addiction and acceptance", "social_network": "reddit", "user": "Jolly-Pirate-6856", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 88, "down_vote": 0, "creation": 1630167886, "permalink": "/r/DecidingToBeBetter/comments/pdcvxu/loss_addiction_and_acceptance/", "nsfw": false, "first_save": 1635436296.3841052, "replies_charged": false}