{"id": "t5_2tand_t3_pdjozi", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "Ok bit of a long one, and I am hiding behind anonymity.\nLong story short, I am a single mum of 4 kids, and now helping my son raise my 4 yo granddaughter.\nWe have struggled, hard, I escaped a truly horrible marriage where I was not allowed to go outside alone (among other things including regular beatings), survived homelessness, and ill health.\nMove forward to today, I have an amazing job, my kids are all great, and I am relatively healthy.\n 3 years ago my sons relationship broke down, and the mother of my granddaughter took off, we didn’t have any idea of where she was for over a year, and because she had accused my son of domestic violence we had absolutely no rights. Basically we were the bad guys.\nThis destroyed my son, he had witnessed everything that had happened to me, and would never follow the same path.\nHe ended up addicted to drugs, went to jail, the full enchilada, another nightmare.\n18 months ago child protection contacted my son as they had removed my granddaughter from her mothers care, this was my sons turnaround, he cleaned himself up, did countless hours of counseling and parenting classes to meet child protection requirements and to make sure he was the best dad he could be, I can’t be more proud of him, but this is where the resentment comes in.\nHe still lives with me and my beautiful granddaughter, but I have slipped into the “mum” role with her.\nSome days I am so tired and I resent the time she takes, this in turn sends me into an anxiety attack.\nI gave a younger daughter that needs to fight for my attention which is absolutely not fair to her.\nSome days I just have a shower and cry. At my age I should be starting to have my own life a little bit, but I don’t feel I do. More resentment.\nI absolutely adore my granddaughter, and no one knows I feel this way, I just constantly get told what an amazing mum/Nan I am, and I feel like a fraud.\nThe thought of them moving out breaks my heart, but I know it will happen one day.\nAny advice on how to get past this?\nPlease be kind, my heart is already broken", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pdjozi/help_stop_the_resentment/", "title": "Help stop the resentment", "social_network": "reddit", "user": "Brief_Web3854", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1630191029, "permalink": "/r/DecidingToBeBetter/comments/pdjozi/help_stop_the_resentment/", "nsfw": false, "first_save": 1635435386.759825, "replies_charged": false}