{"id": "t5_2tand_t3_pfromm", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "I began the year with news that my grandma in Japan has gotten covid in the hospital and had to rush over there from the states to say my final good byes (which we couldn't really say, since she was in a coma by the time we got there). Immediately after, my mom throws away and starts changing everything inside my grandmothers home. She was my favorite person and I had such an attachment to her house, it felt like a part of my memories were being ripped out and I was losing my grandma again for a second time within a few weeks. (I posted here before she passed for some support and you guys were amazing and helped so much more than you can imagine.)   \nI've been in Japan since then I took a few months off work, which I am beyond thankful I can keep doing from overseas. I've been working on my mental health, seeing a therapist and was able to go from 2 sessions a week, to slowly getting off my medication. I'm happy that I've been able to rest up here and just unplug for a bit.   \n\n\nHowever during the 8 months here I've gained weight, made no advancements in my career, and just overall I feel like I've lost the confidence to move forward in my life. I just feel like there's going to be so much dread in the future, and that the second I leave, another relative might catch covid and die (esp after the olympics the numbers in Japan have been rising) . I just feel safer being stagnant in my grandmas house. \n\nBut I know this isn't the way to live and I'm clinging on to every ounce of excitement I have for going back to the U.S. I found a new apartment with friends in a good neighborhood, I can be somewhat social again, and independence from my family will let me focus on myself more. \n\nI don't know, This year has been rough but life keeps going on and it won't stop. I'm uncertain about what's to come but I cant keep falling behind on work and being stagnant. I think this discomfort and change will be good for me over all.   \n\n\nI just wanted to thank everyone here. I think knowing people are trying to improve themselves and seeing people working hard has been motivating even though I haven't been able to keep myself going for a while.. I never thought reddit would be such a source of support haha. 2021 has been garbage and honestly so has 2020 but I'll make the best of what's left of 2021!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pfromm/this_year_has_been_really_rough/", "title": "This year has been really rough.", "social_network": "reddit", "user": "yaujs", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 26, "down_vote": 0, "creation": 1630494615, "permalink": "/r/DecidingToBeBetter/comments/pfromm/this_year_has_been_really_rough/", "nsfw": false, "first_save": 1635435087.2520096, "replies_charged": false}