{"id": "t5_2tand_t3_pbfj9f", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1"], "text": "So I've decided to go for 6 months. \n\nNo reddit, insta, Snapchat constantly - just updates.\n\nI've changed my life around but I'm still unhappy. \n\nLost loads of weight (28lbs in 1 year) \n\nMade my savings target under 7 months. \n\nI'm still again unhappy. Which means I'm not happy with myself and I have demons still lurking and eating away at me. I still compare and over thinking. I still get angry and lash out at myself. I still self sabotage because I think I don't deserve it. Its time to set some new goals. So...\n\nLess porn -\nYou're going to stop watching or chasing porn to male you feel good. It's effecting your sleep and energy. You dont need to stop it completely, start to control it. \n\nEmotions - \nControl them and get them in line with what you want, not what other people want. Make yourself happy, you've done enough for other people. Chill, there's enough time left. \n\nMoney - \nYou've got budgeting down to a T, but now I need you to start investing. Making smarter choices and delivering on good opportunities. I also want you to stop saving so much and learn how to use money to make your life more enjoyable. Don't just buy things, learn to appreciate what memories or experiences you can create. \n\nBody - \nAwesome you've lost that weight 👏  you need to build yourself up now and put some size on. Get stronger and fitter. Start by 1 day at a time , then grow that into a maximum of 4. By the end, you will see a change. Don't eat unlimited junk  - eat more but better things. Allow yourself to enjoy as well. \n\nJob - \nRight you got a job...finally but I know its something you don't enjoy fully. There's loads of choices. Find the time to apply again and move up in your career. Make yourself happier. \n\nSelf - \nBe more you. You're awesome when you're free and you don't think of sentences to say beforehand. Gain some more confidence, learn how to say no and be present in the moment. Be more assertive and ask for what YOU want. \n\nOK update me in 6 months time...see how you get on. \n\nLater x", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pbfj9f/going_for_6_months_another_letter_to_myself/", "title": "Going for 6 months ....another letter to myself.", "social_network": "reddit", "user": "Ok_Researcher_7123", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 35, "down_vote": 0, "creation": 1629911153, "permalink": "/r/DecidingToBeBetter/comments/pbfj9f/going_for_6_months_another_letter_to_myself/", "nsfw": false, "first_save": 1635436131.7356055, "replies_charged": false}