{"id": "t5_2tand_t3_o7541j", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "TL;DR I smoked what I assume was very strong weed that was too harsh for my rookie level tolerance (I had only started smoking consistently a month before and I would smoke like two or three times a night for a few weeks) which scared me, thinking about my poor health choices, into a severe panic attack that lead to an ER visit. They found nothing wrong outside of elevated BP but now I can’t sleep well as my heart races when I try to and I’m highly aware of it, and I tend to manually breathe when the anxiety set in. I hate this feeling, but it’s enough to make me say for certain that I don’t ever want to touch weed again.\n\nTo start, I’m a 26YO male of moderately alright health, I don’t really exercise much outside of occasional strenuous activity like helping family move furniture or fixing things around the house every so often, and I have a somewhat shitty diet, so I’m a tad chubby but not overweight. I hadn’t been to a primary care doctor in years so I’ve always had worries about my health that sat in the back of my mind. Not to mention my family also has a history of high BP on both sides, with both of my grandparents on my mother’s side surviving cardiac events last year and my mother having a false alarm with bad arm pain. It’s spooked me a lot.\n\nWhich brings my to yesterday, when I had my first visit to the ER after a few nights of trying a high THC strain which resulted in mild to severe panic attacks every night. Chest pains, tremors, immense fear, the whole 9 yards. Fortunately the staff treated me with care and were quick in their examinations and found nothing wrong outside of an elevated blood pressure (throughout the night my readings ranged from 140-150/70-80 when it’s normally around the 130/80 range) and minor spikes in heart rate which they chalked up to the harsh anxiety. It left me “somewhat” relieved after so many years of not knowing, and sparked a stronger interest in my maintaining better health. I have a follow up in a week so they can establish more information but I may try to fit in a visit sooner just to ease my worries a bit.\n\nNow on to what kind of confuses me. The rest of this will be pretty long winded so bear with me as I try to explain. I’m rather inexperienced with flowers as I haven’t really been smoking for too long. I’ve only smoked consistently for about a few months on and off. I smoked once as a teen and had a bad experience which kept me away/made me apprehensive about weed for a long while up until just last year when I slowly eased my way into smoking with friends and my dad, and it became enjoyable. From then on I mainly smoked in social settings, but never on my own, until earlier this year in May. I bought a half ounce of some nice bud and fell in love with how it made me feel and I began smoking every single night right before I ate. Afterwards I would play some video games or watch movies for a few hours and go right to sleep. I was hooked on the sensation and every night I’d smoke a little more until I eventually ran out, but I needed more. \n\nWhen it came time to restock I had looked into the available strains before buying and noticed the 100%indica/high THC content of what they had available, I had no idea it would hit any different, I just wanted something to get me back to that good feel. Upon my first few hits of this new batch (Garanimals and Purple Kush) I noticed it just didn’t hit right for me. The high felt heavy and deep, as if I was wading underwater but floating and being stretched apart at the same time. I became aware of my heartbeat getting faster, my breaths felt short but I brushed it off as the response to stronger weed and my low tolerance. I kept smoking more for the next few nights thinking if I dug deeper it would build up my tolerance and I could get to that amazing high I loved so much, but all I experienced night after night was that horrible trip. It all came to a head when I decided to smoke around 3 AM. I had slept all day prior and woke up in the middle of the night and did my usual of smoking before grabbing some food. I realized I was consistently getting high on an empty stomach so I tried easing up on my intake and took about 2 small pulls just to get me going. The high was still just as bad, and felt even worse as a groggy feeling crept over me on top of the other bad feelings. My head felt tingly and my eyes had a slight pressure behind them which put me over the anxious edge again. I tried deep breathing and telling myself it was all in my head but it really didn’t help. Despite that, I just kept with the deep breathing for the duration of the high until I felt I was surfacing and foolishly took one last small pull to see if another decrease in dosage would treat me better. It didn’t. More of the same sensation which lead to more anxiety. After a few hours the bad high and anxiety didn’t feel like it was going away, and came on and off throughout the rest of the day, after only smoking in the early morning hours. My chest was tight and I felt fatigued, but I powered trough it thinking “it’ll be over soon” which is did as time went on. Afterwards I decided to do some laundry and clean a little. I would go up and down the stairs lifting baskets of clothes and begin to breathe heavy after a trip of two but I was able to regain composure after some deep breathing, but it kept coming back. Later in the evening as I was about to lay down to sleep for the slightly tight chest and anxiety feeling crept back up and was even stronger which I thought was strange given I hadn’t touched any weed for the rest of the day. Queue more anxiety, I thought “why am I still feeling like this?” and l figured I would just sleep it off. I eventually dozed off before ultimately jolting back awake feeling a bit worse, with shakes and chills and it was at that moment I decided to call 911. My mother had to handle the call as I tried to stay calm and wait for the ambulance. They arrive and say I look fine but ask if I want to take the ride just in case which I did. It was around this time that I began to relax and the horrible anxiety began to go away. I felt better for the rest of the night until I got back home and tried to sleep after taking a single low dose sleep supplement (still super cautious) to see if it would help. I managed to get about 2 hours of sleep before being woken up by the anxiety and somewhat fast, strong heartbeats which kept me up and now I’m writing this. \n\nI do apologize for the extremely long wall of text. If you’ve read this far then I thank you for hearing me out. It gives me a bit of calm as I type this out but ultimately I’m just looking for insight from my peers. I know it will pass, but how long do I have to feel like this? I what can I do to make it better? Am I actually in withdrawal? And why did I develop it after such a short time of consistent use? I look forward to your responses. I don’t want to really find definitive answers, but a little peace as I weather the storm. I’m going to try to get a bit more sleep now and see how I feel afterwards.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o7541j/deciding_to_quit_weed_after_possible_overuse/", "title": "Deciding to quit weed after possible overuse. Experiencing withdrawal symptoms now.", "social_network": "reddit", "user": "ImmatureGambino", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1624554116, "permalink": "/r/DecidingToBeBetter/comments/o7541j/deciding_to_quit_weed_after_possible_overuse/", "nsfw": false, "first_save": 1635435797.0805292, "replies_charged": false}