{"id": "t5_2tand_t3_fb3r9b", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "To be more specific, how do you get yourself motivated enough to work on skills for a better job when you have a bunch of interests and hobbies that keep pulling you away? I feel like I'm stuck in a rut career-wise for a long time and things aren't getting any better. I'm a software engineer who gets paid a lot less than average for his age and qualification(30, MS Computer Science). As a result I struggle meeting my financial goals, material desires and also feel self-conscious when meeting potential life partners or 'successful' peers. Also I feel my skills are not up to power for a better paying job. I fall short when it comes to meeting job requirements or passing coding tests/technical interviews. I realize the need for a big ramp up on skills that'll take some good amount of grinding for 2-3 months. But I've not been able to do that for almost a year. When I'm done with office hours, I can never get myself to work on this. I love watching(almost addicted) Youtube videos on topics of interest and other creative content, I adore playing a fighting video game called Tekken with too much dedication to improve, I adore driving my sports car - Camaro, I love to go hiking. You can see there's so much I like doing WAYY more than studying/working on career skills. But the thing is, this keeps me stuck in life. All those things I mentioned give me temporary joy but every other day I feel like shit when I reflect a bit on life. How do I get out of this mess? I don't know if the way I'm thinking about life is out of whack or if my intentions are in the right place. But I'm sure I need help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fb3r9b/how_to_calm_the_mind_and_do_the_boring_stuff_for/", "title": "How to calm the mind and do the boring stuff for better tomorrow?", "social_network": "reddit", "user": "Law_reppuken", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1582933320, "permalink": "/r/DecidingToBeBetter/comments/fb3r9b/how_to_calm_the_mind_and_do_the_boring_stuff_for/", "nsfw": false, "first_save": 1635435781.0598514, "replies_charged": false}