{"id": "t5_2tand_t3_gwi6xe", "request": ["5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "*Please DM me if you want more information on this*\n\nMost people treat language as a given and never give much thought to it. Or when talking about the use of language, they think about speaking and using foreign languages to communicate with people from other countries and cultures.\n\nHowever, people ignore the language and words that they use to communicate in everyday life. And this isn’t limited to the language that they use when speaking to other people but includes the self-talk and thoughts that are constantly going on in your mind.\n\nCopywriters understand the power of words and spend hours on finding the perfect word and phrases to inspire excitement in as few words as possible. They understand that the difference between well written and well thought out copy can be the difference in a campaign being a roaring success or a complete failure.\n\nAnd this mindset translates perfectly into how you think and the words you use every day. The story you tell yourself and the words you use have a huge impact on how you live your life, how happy you are and your relationships with the people around you.\n\nAny of you who are golfers have likely experienced this before with a similar example as that below.\n\nYou’re on the tee and as you look out towards the fairway you notice a bunker on the left and a water hazard on the right. You start to line up your shot and say to yourself: ‘I need to avoid the bunker and I don’t want to end up in the water.’ What happens? You hit the ball straight into the centre of the water hazard.\n\nWhat’s happened is that your brain picks something to focus on and it doesn’t recognise the difference between can’t, don’t and their positive counterparts. So if your brain hears ‘water hazard’, it has a focal point and you likely end up hitting the ball there. Any good golf pro will tell you to focus on the outcome you do want rather than the outcomes you don’t want.\n\nAnd this is the same in the rest of your life too. \n\n## Taking control of your language\n\nIf you understand that the words you use have power on the outcomes then you’ll understand that you need to pick your words and language wisely. Just using negative words can immediately impact your mood however using positive words can immediately brighten up your day.\n\nIf you’ve ever head about the benefits of keeping a gratitude journal then you’ll of seen this in action. People who write down three items they are grateful for every day are much happier and you can only imagine what the opposite would do to you. Imagine your mood if you sat down every morning and wrote down a list of things you’re unhappy about. It’ll almost definitely put you in a bad mindset and set you up for a rough day.\n\nBut this is exactly the type of thing we’re doing in our head and with our language all the time. \n\nI don’t want to get angry.\n\nI can’t lose any weight.\n\nThis isn’t the result I was looking for.\n\nRather than focusing on the negative outcomes, you need to focus on the desired outcome. \n\nWhy? Because you always want to be focusing on the outcome you want since this ensures you stay on track to achieve it and ask the right questions and do the right action in order to achieve it.\n\nI do want to be happy.\n\nGreat, what steps can you take to get there?\n\nI can lose weight!\n\nHow will you do it?\n\nThe result I was looking for was x.\n\nMaking the desired outcome clear is better than highlighting the failure.\n\nExercise:\n\nFor the next week, be aware of all the times you use words such as ‘isn’t, can’t, won’t, don’t’. Do this in all forms of communication. In conversations with others, in emails, texts and phone calls. And in your own mind as well as any journals.\n\nNow, as soon as you identify this kind of language immediately stop and think of how you can flip it around to the outcome you do want.\n\nExamples:\n\nI don’t like it when you talk to me as if I’m a child.\n\nI like it when you treat me like an adult.\n\nThis isn’t what I was expecting!\n\nI was expecting …\n\nI don’t want to get up.\n\nI do want to start my day.\n\nI can’t live in such a messy flat.\n\nI will tidy up the flat. Or. I enjoy living in a tidy environment.\n\nI know this seems really basic and simple but it works and the effects are compounded over time to bring quite extraordinary results. \n\n## Turbo-charging your mood\n\nThe next step is to go further and look at all the negative words you use and looking for positive or at least less negative alternatives.\n\nExamples of this could be during expressions of anger. You could translate ‘I’m absolutely livid’ into ‘I’m a tad disappointed’. The nuance is softening the language will have an effect on your mood and you will find yourself adapting the mood of the words you use. Obviously referring to yourself as ‘excited’ when you’re actually angry won’t make you immediately excited however substituting angry with words such as ‘disenchanted’ ‘underwhelmed’ ‘a little concerned’ ‘tinkled’ ‘bothered’ or ‘passionate’ will have a softening effect. You can also soften the intensity by adding in a word such as ‘tad’ or ‘a bit’ or ‘a smidge’.\n\n‘I’m fucking livid’ could be ‘I’m a tad disappointed’ \n\nThe former just fuels your anger and will likely boil up inside you. The latter will calm you down, will likely de-escalate what could have been a heated argument and may even make you laugh. \n\nThis doesn’t just apply to negative emotions. It’s just as powerful in amplifying good emotions. \n\nTry subbing out words such as confident to unstoppable.\n\nCurious to fascinated. Excited to ecstatic. Content to serene. Attractive to gorgeous. All right to superb. Fine to awesome. Good to over the moon. Fortunate to unbelievably blessed. Great to phenomenal. Interested to enthralled or captivated.\n\nThere are many great words out there and notching them up a level will bring the effects of good use of language to amazing results.\n\n## Get rid of ambiguity\n\nAnother common use of ‘bad’ language is to use excessive softening words to create ambiguity, uncertainty and avoidance of certain concepts or actions.\n\n‘I THINK I MIGHT go to the gym later.’\n\n‘I MIGHT get up early tomorrow.’\n\n‘I should PROBABLY spend more time with the kids’\n\n‘Let's THINK about doing that this weekend’\n\n‘MAYBE we should talk about this’\n\n‘I GUESS I could try walking to get some more exercise’\n\n‘I’ve been thinking that I MIGHT need to save more money’ \n\n‘I really SHOULD try taking a few more risks’\n\n‘Y’know, they are KINDA busy and it SORT OF makes sense to go some other time’\n\nDo you get the point?\n\nWhen communicating deadlines, decisions and desired outcomes you need to be clear, direct and concise to effectively communicate your thoughts and intentions.\n\nWhen was the last time someone successfully asked out a girl by saying: ‘I was thinking that maybe if it’s possible we could maybe go on a date sometime?’\n\nThe person is likely too confused by what your intention is to give you a yes. What would she even be agreeing to? Her answer will be: ‘Yes that could possibly be something we maybe do at some point.’ Great. You may or may not have a date at an uncertain time in the future.\n\nHow about: ‘Let’s go out on a date this Saturday?’\n\nTake control of your language and take control of the situation.\n\n## Conclusion\n\nLanguage is powerful. It can be your secret weapon and the best thing is that it’s a change you can enact instantly. Ever heard someone say: ‘Failure isn’t even in my vocabulary’. That’s because they use language to power them towards the outcomes they desire rather than wasting time on the outcomes they don’t. Our language dictates our focus. Our focus dictates our actions. Our actions dictate our success.\n\nStart employing this superpower and you will see results. \n\nDo you journal? This is a great place to use this. Look through what you’ve written and try and identify the language faults highlighted above. Have you found any? Now you can go through the exercise of translating them into positive language and see how it changes your thoughts, mood and focus.\n\n&#x200B;\n\ncheck out my site: agogeproject(dot)com", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gwi6xe/use_your_language_to_get_better/", "title": "Use your language to get better", "social_network": "reddit", "user": "AgogeProject", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1591279908, "permalink": "/r/DecidingToBeBetter/comments/gwi6xe/use_your_language_to_get_better/", "nsfw": false, "first_save": 1635436738.8012376, "replies_charged": false}