{"id": "t5_2tand_t3_ldnzvl", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "So I talked about this on some other forums when it first happened; however, I recently found r/DecidingToBeBetter and I loved the concept of a community dedicated to progression and thought I would reshare my story for any of you out there that are in my old position. So a few months back I actually lost my internship of 2 years at the small accounting firm I worked for. They said that it looked like we were going to go back into lockdown, and they weren't too hopeful about remaining open long term. This really shook me to the core as this place was where I planned to work upon graduation, and with a job market that was almost nonexistent I wasn't too optimistic about my outlook. After a few days of trying to pick up the pieces of my life, I decided to start my own business that way I wouldn't have to depend on others for my living. I joined a few subreddits about being an entrepreneur and after stalking the group for ideas I decided to go with digital marketing. I ended up buying a course I found on one of the subreddits with all my money I saved from the internship and after studying day and night for weeks I finally got my business up and running. After another few weeks of endless cold calling and prospecting, I finally landed my first customer. Fast forward to today and I just landed my second; however, none of this would have been possible without the unfortunate event of me being fired. The goal of this story is to show you all that sometimes things happen, but it's how you handle the situation that determines how you bounce back. So keep getting it, and keep improving every day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ldnzvl/helping_me_help_myself/", "title": "Helping Me, Help Myself", "social_network": "reddit", "user": "JustinManningR9Z", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1612579137, "permalink": "/r/DecidingToBeBetter/comments/ldnzvl/helping_me_help_myself/", "nsfw": false, "first_save": 1635437592.7036843, "replies_charged": false}