{"id": "t5_2tand_t3_nwf5vh", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "c67213dc-0eed-4cac-a781-9bc082742908"], "text": "I have had depression for around 4 years. During most of this time, it has been crippling. Whenever I would look for tips or advice in the deepest throes of my depression on simply how to survive, I was never met with anything I could actually do at the time. Although recommended activities like journaling, meditation, exercise, therapy, etc. are all incredibly helpful, I couldn't even get out of bed much less go for a run. That is why I'm compiling a list for those who are in a similar situation to those I was in - completely crippled and unable to do activities that require more effort than you can muster. The common theme to remember with all of these tips is that **anything is better than nothing.**\n\nfor me, one of the most embarrassing consequences of my depression was the toll it took on my hygiene. These are the things that helped:\n\n* rosewater  \n\n   * it sounds random but like many of those who are depressed, I wasn't able to wash my face any longer because I could not even get out of bed. I got acne as a result, which only made me feel worse. Something that greatly helped me was just buying a bottle of rosewater and cotton pads and putting those things by your bed. When you feel dirty and don't have the energy to wash your face, you can just scrub it with a cotton pad and some rosewater. it's very cheap and much more effective than nothing calmed my skin and helped me feel clean in really hard times. plus it smells great so it's good aromatherapy too!\n* baths  \n\n   * I'm not talking fancy bubble baths for luxury, although if that's your thing that's great too. I was unable to stand up in the shower long enough to clean myself and it took so much energy out of me every time. I started taking baths so I could sit down when cleaning myself which made it a lot more manageable and easy.\n   * if you cannot bring yourself to take a bath, invest in some deodorant, dry shampoo, and baby wipes and wipe yourself down. remember, it really is better than nothing!\n* garbage by the bed  \n\n   * keeps a small garbage can by your bed. it stops you from just living and sleeping in garbage.\n\nAdditional tip: keep non-perishable snacks (like granola bars or snack packs) by your bed too. I know that eating and food preparation is very difficult for many people so eating something is better than nothing.\n\nI really hope this helps anyone at all.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nwf5vh/hygiene_tips_for_when_youre_at_your_lowest/", "title": "Hygiene tips for when you're at your lowest", "social_network": "reddit", "user": "reddituserNootNoot", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1173, "down_vote": 0, "creation": 1623299965, "permalink": "/r/DecidingToBeBetter/comments/nwf5vh/hygiene_tips_for_when_youre_at_your_lowest/", "nsfw": false, "first_save": 1635435777.004095, "replies_charged": false}