{"id": "t5_2tand_t3_mjfcsk", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I recently discovered my health insurance covers telemedicine virtual visits with a therapist or psychiatrist. I have no idea where to start or if either is right for me. (Maybe neither? Maybe both?) I don't feel like talking to a stranger will help me a ton, but I'm terrified taking medicine will change me in some negative way or have other, negative lasting impacts. (Will getting prescribed some medicine for my mental health be on my record forever? Will I be viewed as unstable?) I've never really done any type of mental health appointments - reading some self help books is the closest I've gotten. \n\nI'm just going to type out the things that bother me the most without thinking too hard about editing my thoughts. Maybe I should take a similar approach and send emails to a few therapists and/or psychiatrists basically saying what I'm about to write below? I would appreciate any insight on the best way to reach out, or thoughts about my situation in general. \n\nIn no particular order ~\n\nI often don't feel well. Luckily, I'm able to talk to my husband and best friend about how I feel and we have great, open conversations, but other than temporarily feeling better based on their love/reassurance, it doesn't help. \n\nI don't think anyone else can tell how hard I'm struggling or how poorly I think of myself. Part of me wonders if I'm making this bigger in my head than it needs to be, and I should just keep moving forward and hope for the best...try to be normal... \"Fake it until I make it\", I guess. I can't talk to my parents / family about this because they're worse off than I am and it probably wouldn't help anyway.\n\nI don't have much energy, although I sometimes have random productive bursts of motivation to get shit done. \n\nSocial settings are *exhausting* even if they are fun tasks with friends. I am always overthinking the situation, trying to get ahead of anything stupid/weird/embarrassing I might do. Try to limit the chance I'll be in a situation I'm uncomfortable in. (The typical exception is hanging out with my husband.)\n\nI feel like it's hard for me to make genuine connections with people because the whole time I'm trying to get to know them, I'm just figuring out how to adapt my personality to mesh with theirs and saying what I need to say to have them \"like me\", or at least not think I'm dumb. (I often assume people don't want to connect with me, anyway, which is like an excuse for me to not try.) I do have a few very close friendships, and I'd consider most everyone else \"acquaintances\".\n\nI've honestly handled this isolation of the pandemic better than my peers because I prefer to be at home and have no expectations of me. (My issues have existed before the pandemic. I've never felt \"normal\" or been happy with myself.)\n\nI have a hard time getting into hobbies. I can't seem to enjoy things for what they are and only seek out things that will be \"beneficial\" in some way. I don't seem to like things just for the fun of it.\n\nI'm somehow a high performer at work, although I have been procrastinating and then panicking that my boss/coworkers will find out eventually. This seems cyclical - I'll get a lot done in a few days and then spend a month just wasting time and becoming increasingly worried about my lack of output, then repeat. Working from home for the past year has made this worse, but it was always an issue. \n\nI don't sleep well - I stay up late scrolling reddit or making lists of shit I'd do if I ever had any motivation - feels useful in the moment, but it's not. Even if I put my phone away and try to sleep, I just can't seem to turn my brain off and actually fall asleep. Reading sometimes seems to help, as I can get distracted enough to get tired and finally fall asleep. Then I sleep late in the morning even if I know I'll be rushing to get to work or wasting the \"best parts\" of the day in bed. Even if I get to sleep earlier than normal, I still don't get up on time or feel refreshed upon waking up. I'm often anxious about work the night before and morning of. Part of me also feels like I also avoid sleep because when I'm awake in bed scrolling reddit, that's \"my time\" without obligations and I don't want to give that up. (I'd say I usually fitfully sleep from 2am - 10am, although it's 4am right now as I'm typing out this draft I'm my phone to post to reddit tomorrow. My husband and I are usually in bed by midnight and he can fall right asleep.)\n\nI am overweight. (Maybe 50 - 75lbs? I'm 5'6\" and ~211lbs.) I don't want to be, and I haven't always been, but I still overeat. It's like I don't have the willpower - logically, I know that I just need to eat less to lose weight, but I've spent the past few years getting heavier and feeling worse about myself. My libido is so low right now because I feel so ugly. I worry how this impacts my husband. I can't seem to live in the moment because I need to wait to enjoy things until I'm \"back at my normal weight\". Sugary desserts are a weakness I haven't been able to kick.\n\nI'm pretty good at hiding it, but overall, I'm an anxious mess with no self confidence and nothing to look forward to, work towards, or be excited about. I want to feel better but I don't know how. \n\nUsing a throwaway for obvious reasons. I might post this to a few relevant subs, but please let me know if there's somewhere else I should post this. Thank you if you read that wall of text.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mjfcsk/i_feel_like_its_time_for_me_to_address_my_mental/", "title": "I feel like it's time for me to address my mental health. F/32/USA.", "social_network": "reddit", "user": "throwaway7977335", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1617477934, "permalink": "/r/DecidingToBeBetter/comments/mjfcsk/i_feel_like_its_time_for_me_to_address_my_mental/", "nsfw": false, "first_save": 1635435452.6490262, "replies_charged": false}