{"id": "t5_2tand_t3_q1b5ek", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Hey y’all! I hope everyone is well. I’ve struggled with some pretty rough depression over the years and it always reminds me of an ocean: it comes in waves, having high tides and low tides. On my low tide weeks, it’s fine, nearly nonexistent even. It’s fully manageable and I’m able to do everything I want to do. On high tide days are when it tends to screw everything up. I’ll get depressed and sleep all day, wake up and hate myself for doing it. I’m lucky to have a support system, but they all day “You just have to get up and do it.” And I genuinely can’t figure out how to just get up and do it when everything seems so hopeless on my high tide days. I want to get better, I just don’t know how. I’m a college student so I shouldn’t be sleeping through my classes or clubs or things, I should be enjoying this. Does anyone have tips to conquer my depressive episodes and be able to not let it control my life?\n\nedit: thank y’all, seriously. and i’m listening to everyone saying to talk to someone! it’s just that sometimes these things happen when the therapist isn’t around, haha. i felt really hopeless, like i was trying to solve a math problem that somehow everyone else knew, and you all really helped me work it out. i’m super excited to try everything recommended.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q1b5ek/i_want_to_stop_falling_into_depressive_slumps_and/", "title": "I want to stop falling into depressive slumps and learn how to manage them in a healthy way.", "social_network": "reddit", "user": "lawfullytired", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 895, "down_vote": 0, "creation": 1633370862, "permalink": "/r/DecidingToBeBetter/comments/q1b5ek/i_want_to_stop_falling_into_depressive_slumps_and/", "nsfw": false, "first_save": 1635436946.0807114, "replies_charged": false}