{"id": "t5_2tand_t3_nxv7hz", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Posting it here mostly to just get the words out somewhere. \n\nFor about the past two weeks, I've done really well on my diet and I've gotten some kind of exercise daily. I set out with the goal of losing at least 50 pounds, and I'm already down 5 or 6(doctor said this kind of weight loss can be expected at the beginning due to my previous diet and my current diet). For the first time, I feel like I'm not suffering through this diet. My body feels better than it has in a long time, I've figured out a good exercise regiment that is intense, but not so intense that I get too sore to exercise the next day(pushing too hard like that has been a problem for me), and I feel like I just have a good system now. \n\nBUT.\n\nThis is about the time in any improvement plan I set where I end up screwing it all up. Because I'm working towards better physical fitness and to prevent complications from obesity from bringing me to an early grave, but I ask myself what these things are going to do for my goals that are *truly* satisfying. That's not to say that \"not dying of obesity\" isn't a good goal, but a goal like that is more about preventing a bad thing than it is gaining a good thing, if that makes any sense. And I don't care all that much about being athletic, especially at my age(29), but I am finding that I care more than I expected to. Once I reach a certain weight, I'm going to try distance running again instead of cardio machines, because I used to really enjoy getting up and running 5-8 miles in college. \n\nThat said, I tend to fall apart because the thing that is most important to me is finding people to belong with and finding someone to be in love with. And I fall apart because I don't see how all this work is going to lead me to that. Even if I end up in great shape, I will never be traditionally good-looking. It won't make me charismatic, it won't make my personality a \"good fit\" for anyone, and so on. Basically, no one's going to love me for this, so my head gets filled with thoughts of \"no one will love you for this, so why bother?\" Instead of being a fat loser, I could be a healthy loser. It doesn't change that I'm a loser. \n\nPoint is, I really don't want to screw up on a healthier lifestyle this time. I've made a lot of screw-ups already, and any chance could be my last for all I know. So what can I *reasonably, logically* think or believe to convince myself that this self-improvement will get me closer to my real goals?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nxv7hz/i_feel_like_im_about_to_hit_that_wall_that_i/", "title": "I feel like I'm about to hit that wall that I always do...", "social_network": "reddit", "user": "NauticalFork", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1623460781, "permalink": "/r/DecidingToBeBetter/comments/nxv7hz/i_feel_like_im_about_to_hit_that_wall_that_i/", "nsfw": false, "first_save": 1635438045.7383914, "replies_charged": false}