{"id": "t5_2tand_t3_p204ui", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "4b69452a-b1e5-47af-a734-ad3c2bdce185", "feda50cc-891e-47e3-8043-7a171b4cc260", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I've been looking forward to writing this since approx. 2015-16 when I got stuck up to my neck in credit card debt and knew it was going to be a hell of a fight to climb out of it... alas here we are on August 10th 2021 and I've made it... so here it is.\n\nSome serious amount of backstory:\n\nI've always had a bit of a spending problem that started when I was 19 and got my first credit cards with a higher than 1k spending limit (I got a couple with 10-20k limit and a few more with 3-5k limit). I was able to do this because at age 16 I got a starter credit card my parents co-signed for so I could build credit... obviously a great idea for the responsible type... not so much me after I got out on my own, mid-late way through college.\n\nI was studying for a degree in the computer science field, so my rationale was \"if I get 10k into debt or whatever - I'll be making 100k (or close) hopefully right out of college so I'll just pay it off with my starting bonus nbd. And sure, I'll pay a \\*little\\* bit of interest holding onto a balance, but it'll be fine I'll be making enough to pay for this lifestyle and more in no time\".\n\nWell what do you know I end up 19-20 years old with about $14,000 of debt.. mostly from electronics, nice dinners with my girlfriend, maybe even a vacation or two. My \\~1k a month paycheck as a barista at the University coffee shop wasn't going to cut it and I started to freak out as over 1/2 of my monthly minimum payment on these cards was just interest. That wasn't even counting the Amex Platinum (How absurd is it that a 19 year old was allowed to get a Charge Card with a \\~$500 annual fee, I'm 100p sure I lied about my income lmfao) which had to have the balance paid in full each month. I truly don't know what I was thinking buying anything with literally almost ZERO income. It baffles me to this day.. I guess I was just always used to 'figuring it out' as I went along..\n\nMy dad was always deeply suspicious of me, rightly so for a kid with a massive credit line and newfound freedom. He would frequently ask \"You're not getting into debt right? How can you afford x,y,z?\". In the beginning, I would brag about the introductory offers I would get - \"My Amex gave me $600 in points after I spent 3k in the first few months!\". I always had some BS answer as to how I wasn't getting underwater.\n\nI would do everything in my power to obfuscate the truth. I believed that eventually I would be making the money to pay it down. Obviously this was wildly foolish. What was I gonna do? Carry 20k of debt the 3 more years of college before I got a job? Lmfao.\n\nWell eventually Dad found out by going to Chase Bank branch to put $100 on the account for an expense he agreed to cover. He got the teller to reveal the balance on the card, which I'm pretty sure is illegal since he's not the account holder.. but he's a charmer and I'm sure the \\`father\\` card was played. The balance was around $9,000.\n\nNext thing I know I'm sitting down with my parents reviewing all my debts. Like I said, about 14k in total at the time. They offered to bail me out to save me thousands on interest, and I would pay them back as I worked through school. It was very generous of them. They saved me and I truly did not deserve it. I eventually paid them back in full (more on that later).\n\n\\*\\* 2 years later \\*\\*\n\nI'm 21 and absolutely crushing life (by my standards). My app startup won a competition and received a 25k gift from the business school at my University. We raised an additional 70k in funding from various angel investors. I was certain this company I co-founded with my friend was going to be the next big thing... or at least something that was certain to pay me \\*some\\* amount of money in the \\*near\\* future.\n\nAs anyone knowledgable in the tech industry knows... \\~100k doesn't really buy you much at all... even when you're not taking any salary and paying other university students to write code for you. Honestly, it was mostly our partner's software that put a bullet in us. It was critical to running the business and delayed us over a year... our \"runway\" vanished. We shut almost everything down. My co-founder blew out and I pivoted the app into something that brought in a profit. It's making a few hundred a month now almost 7 years later. Woot.\n\nI DIGRESS - during this time - I thought the money was about to RAIN down on me big time. It was just a matter of months before our MVP app was working and we would raise more money to pay me a hefty salary - or someone would just buy my app and boom, I'd be retired. Very foolish.\n\nSo I started spending - because of my previous bailout, my credit was unimpacted and I was able to get several more massive credit lines (for my age and income). Bank of America: 22k, Barclays: 18k, and several Chase and Amex that totaled another 20k.\n\nI also was buying ADHD meds (that I was prescribed), without insurance for about $300 a month, in order to handle my startup and full course load. Add on more vacations, more technology, gas for my inefficient car, and the thousands started piling up - this time I \\*literally\\* had zero income. Zero.\n\nNow we're into 2016 - debt is up to the mid-20s - I graduate college and get my first job in San Diego. Since I'm a software engineer - it's about 90k a year at a small startup.\n\nAt this point.. I wish I could tell you I realized I had to dig my way out, cut expenses, and get things back on track. But - in my mind - this was the start of my money making career. My income would only go up and all I had to do was make myself comfortable - THEN - I would be able to chip away at the debt slowly. It was all about delaying the inevitable. I was in no rush and in denial of all the interest building up. I didn't care. I just made my minimum payments and the rest of my money was free to spend... That was until the minimum payments took up all my money.. then I had no choice but to continue to spend my remaining credit lines on living. I blame the ADHD meds I was on for encouraging my 'live-in-the-moment' attitude... but I was also 22/23.\n\nIn 9 months, after moving from Seattle to San Diego I added another 20k of debt on top of the other 25k... this was after also spending my $4,400 a month salary.. it was clear to me I needed to make more money if I was ever going to get out from under 45k of high interested debt at age 23....\n\nBy some insane stroke of luck I get a job in Manhattan making 145k as a Senior Software Engineer (lmfao, not even 1 year out of college, it's not because I'm a genius, clearly. The place was a joke.) managing a team of 4 engineers... so here's where things take a final turn for the worse.\n\nI take the job. Obviously. I wanted to go to NYC, but I also literally had to in order to cover my bills. I tell my mother I am in a \\*little\\* bit of debt but this job is paying so much more I need to borrow some money to move myself and all my shit to New York.... so... she agrees to loan me 15k.\n\nThe total bill is now around 60k...\n\nAt this point... I'm paying a crazy amount of interest... Yes I have enough cash to get by but... I still have not learned my lesson... I just got bailed out again.. 15k was like heroin to my very depleted body. I could pay my minimums and go out with plenty of cash in the bank. Combine with my new job, I could continue onward finding ways to get out of this hole.\n\nThe final chapter of this comes just a month later....\n\nI'm taking more adderall than ever (4x what I started at), I just turned 24, and I am in way over my head at this Sr. Software Engineering job. Mostly because my boss is a bitch who is on me every 15 minutes about bugs and I have no clue how to fix many of the issues.\n\nI'm desperate for another new job... less than 2 months in... I tell this job I'm taking the day to work from home to move things, in reality, I'm flying to San Francisco to interview for a job at Uber. Wild shit. I'm bouncing all over the country trying to find something I can handle that pays this well.\n\nI finally get really sick... and just complete lose it. I breakdown and tell my parents everything. Quit the meds cold turkey and decide I'm gonna keep this job until I get fired (which didn't happen!).\n\nI work with a debt consolidation team to negotiate with the dozen credit card companies to lower their interest rates from upwards of 23% down to 3% (in some cases, others down to 10%). And I get on a 5 year payment plan to pay everything off. With the amount I paid back to my parents, it's around $70,000. Probably close to $10,000 interest at least. I paid everyone back fully including my parents.\n\nI finished today over a year and 2 months early, from Oct 2017 to now.\n\n\\*\\* Reflections \\*\\*\n\nNow - I've started my own business - will be making \\~300k this year - and still working on reducing my spending. But in the 4 years since I started my debt program, I've paid for everything with cash. I've had a couple credit cards with a few thousand in credit. Nothing substantial. Rebuilding and saving is my goal now that I'm clear of this massive hurdle. I still have issues with spending too much, but at least this time it's all money I actually have in the bank. My next life goal is to reign it in and live closer to the ground floor of what my needs are as I continue to grow my business and income.\n\n&#x200B;\n\nHopefully you all got some entertainment from this story. I would love to hear suggestions or comments on how you were able to manage your own spending problems or what you suggest for someone in my situation moving forward. I'm building my financial future several years behind my friends and colleagues but I am committed to doing it right. Would love some advice and help!\n\n&#x200B;\n\nTL:DR; At 19 I got into 14k of debt, parents paid it off so I could avoid massive interest. I reimbursed my parents for everything. But I didn't learn my lesson, and thanks to moving, bad relationships, meds, life, I racked up another 70k of debt on that. Just finished paying it off today.\n\n\\----\n\nEdit: The point is I worked hard to pay back money I borrowed in full. I'm proud of that. And I was able to start a profitable business. Nobody ever handed me a job. Sure, when I was 23, I was put into a position that was probably above my pay grade. I had to pass many algorithm white-boarding problems and take home coding projects to get every job I've had. I've worked for several Fortune 500 companies, including Apple, as a software engineer for 5+ years and am not incompetent. Oh, I'm 27 now, turning 28 next month.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p204ui/after_5_years_i_paid_off_70000_of_credit_card/", "title": "After 5 years, I paid off $70,000+ of Credit Card Debt I got into between ages 19-23.", "social_network": "reddit", "user": "gulagula", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1110, "down_vote": 0, "creation": 1628635315, "permalink": "/r/DecidingToBeBetter/comments/p204ui/after_5_years_i_paid_off_70000_of_credit_card/", "nsfw": false, "first_save": 1635435216.7188616, "replies_charged": false}