{"id": "t5_2tand_t3_kpz5de", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I got raped by my step dad when I was sixteen and it ruined my life, alongside a few other crises that happened at the same time, but I think this is the main culprit. \n\nI lost trust in everyone, myself, and the goodness of people. I think I subconsciously thought that if one of the people that knew me best (he had been my \"father\" for over 10 years at this point) decided I was worth more to him as a sex doll than his daughter- or even a person- then I really was worthless. \n\nI don't trust myself because I got warning bells and did nothing. I chose not to protect myself because I prioritized his reputation and my family's sanity over me. \n\nI had no self esteem and let people walk all over ne. I had risky sex with strange men 40+ years older than me because I felt like I owed them if they expected it, or wanted it. I did drugs. A lot of drugs. I wasted years of my life. \n\nI am trying to do better. I have almost a year clean, I haven't had sex since my last relapse, I don't hang out with strange men just because they want me to. But some stuff still leave marks. \n\nI have a reoccuring sore near my vagina that my doctor had tested negative for everything she could think of but I'm still worried I have some kind of STD or a false negative showed up. I seem like a normal person most of the time but I can't say no to men if they're even a little bit pushy. I spent probably $150 USD on something I knew was a scam because the guy was so pushy and aggressive, and I could only say \"No\" so many times.\n       I turn into a terrified doormat if a guy gets even slightly pushy or aggressive. I still have lingering anxiety and toxic thoughts, although since this is like 5% of my original anxiety I barely count it, but I still suffer a lot from it. I still get depressed, but no longer suicidal, and not nearly as frequently or severely. \n\nI have wins and losses. It's been 3-4 years since my struggle began and I can recognize that I have made big strides. But when I try to be proud of myself it seems stupid because I still have so many problems and I still feel entrenched in my sickness sometimes and lose sight of the light at the end of the tunnel. \n\nI want my problems to come to a clean ending after the required time. I don't want them to bleed into the rest of my life forever and become something chronic I have to manage. I want to be able to say I had issues and I got over them. \n\nI used to be so charismatic, confident, and high achieving. I speak three languages and started college at 16. I have still not overcome all my mental health struggles and I have probably only resumed about 20%-30% of my previous productivity. My old personality is a speck in the distance. I have no dreams or genuinely desired goals. I force everything positive about myself. I think really terrible thoughts about other people too, and it kills me since I never used to be so horrible. I am suspicious and often wonder the worst about people. I have no spirituality. I am ashamed and embarrassed of who I am. \n\nDuring my normal life I work full time and take a few credits online but rn I am focusing on myself trying to learn a fourth language in north Africa and really push myself out of my comfort zone and grow. I go to bed at night in agony because I think about all the money I wasted on this frivolous trip and how selfish I am because I don't even care about so many of the poor people I see. I think about the fact that I'm not changing at all and it's a huge waste. I think about the time I'm wasting and how I would have already had my bachelor's if I had never gotten into this mess. I get stuck in rabbit holes of self loathing and hopelessness. \n\nI need some help and guidance because this has been going on for too long and I'm so, so tired of it.  I don't feel like I'm making real progress. I feel like everything I do is a shot in the dark. I really wish I had a parent or family member I could open up to, or just a dear friend I could spend time with and regain some clarity. I don't know what I'm doing and I feel hopeless and alone. \n\nTl;dr: I'm struggling and feel hopeless and alone. Sob story above.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kpz5de/how_to_regain_self_worth_after_getting_raped/", "title": "How to regain self worth after getting raped?", "social_network": "reddit", "user": "DontRememberMe21", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1609727582, "permalink": "/r/DecidingToBeBetter/comments/kpz5de/how_to_regain_self_worth_after_getting_raped/", "nsfw": false, "first_save": 1635437541.1448145, "replies_charged": false}