{"id": "t5_2tand_t3_qgdf9r", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I met sunshine at university during our master's degree. We  both chose to study one of the hardest and longest routes to qualification in the UK. Sunshine was born in another country and grew up initially in a single parent household relatively hand to mouth. She moved to the UK when she was 6, her parent worked very hard and is now extremely well off, remarried and has another child. Sunshines step parent is lovely and they have a good relationship. However her family moved to America when sunshine started her first degree, she has a strange relationship with her mother who seems to compensate for this with money. My background is the picture perfect childhood, very supportive and loving parents, financially I have never wanted for anything although I wouldn't class our family as rich. \n\nAlthough sunshine grew up without much she is now very wealthy. We got on very very well at uni, we clicked and she was so much fun. Particularly important as our course was so intense and hard with extremely long hours. She's a little older than me and took some more time out working instead of studying so that she could follow her husband for his career. It was really important to me to qualify as fast as possible in order to get a better salary- I've always been upfront about this. Sunshine got engaged during our final year of our master's degree. She knew my plan was to do my diploma required to qualify fully asap after masters. She was planning her wedding and chose it on a date where I was booked into a residential weekend as part of the course. I couldn't qualify without attending this weekend of lectures. Her wedding venue was a 2.5 hour drive away and my lectures were 8-8 for 3 days. I was supposed to be her bridesmaid but I had to respectfully decline as I had already paid for the course when she announced the date. She was very upset and distant with me and asked if I would consider deferring my exams. \nI said no, this was something I had been working towards for 6.5 years and I was 1 year from finishing. I'd also already paid for the course and our salaries are crap until we qualify. I have a lot of student debt and wanted to progress. \n\n\nSunshines entire wedding was extremely affluent, she had chosen bridesmaid dresses in excess of £300 each (which we were expected to pay for) a venue with a minimum 3 night stay at £280 per night. Plus hair make up hen do etc. I simply couldn't afford this as a student! This was the first issue in our relationship as I felt like she was slightly out of touch with reality and had turned a little bridezilla. Prior to this she had always been a little snobby but never to this extent. A few months after her wedding we did fall back into our normal routine and things seemed much better. \nHowever, over the last couple of years I feel like she has changed a lot whereas I'm still exactly the same person (personality wise). \n\nI had a rubbish time during covid 2020 with my employer and had to switch jobs as it had become untenable. A guy that sunshine used to work with was hired as my replacement. Sunshine has done nothing but bitch and complain about this guy for several years - I soon saw why when he joined my place of work as he was awful and I was scared for my clients as I didn't want to leave them in his hands but there was nothing I could do. Sunshine called me to chat and asked me how he was getting on. I then told her and ranted a little about how rubbish he was in terms of his attitude and she just completely 180d. she was saying I don't want any negativity I am close friends with this guy this makes me feel uncomfortable I don't know where you're coming from etc. I was so taken aback as she had brought this up and asked me. It turned into a bit of an argument over video call and I was very upset as I don't like confrontation or rowing. For me I felt like I didn't recognise the person she had become, we had always been supportive and compassionate to each other and she was so cold and detached. I distanced myself. Sunshine has recently turned to veganism, yoga etc which is absolutely fine, but she's become very very judgemental about anyone who doesn't subscribe to this. She has restricted herself from so many things even sugar and refusing to eat anything pre packaged! I do not subscribe to this lifestyle but I was very mindful to arrange lunch dates at places which would accommodate her etc. I felt like this was becoming a one way street and I was being judged and critised for just being myself- the person I have always been around her for years. My partner is a big meat eater, we love to entertain and go out for drinks, party etc when we can due to our stressful jobs but it became really difficult to include her in this.\n\nI really pulled back further during 2021 as I have been having bad health issues and was waiting for an operation this year. She only wanted to schedule calls on a Thursday after work and it was extremely awkward I felt such anxiety on Thursdays trying to come up with safe topics of conversation that it was so draining. Due to work commitments it became virtually impossible to stick to such a rigid call routine and since July we haven't spoken at all. I stopped replying as I felt like I had nothing 'safe' to say. I didn't feel like I could share my health worries with her as my best friend because she was so judgemental and cold when I tried to broach the subject.\n\nI feel awful. My parents regularly bump into her as we live relatively close by and she never asks after me so perhaps she doesn't care anymore? I feel such a loss for the friendship that we once had. My other friends have said that the relationship was toxic and said that I was trying to change myself around her to fit her needs. I agree with this to an extent as I felt so drained, but perhaps toxic is a very big word and not appropriate? I can't bear the thought of us ghosting, but I'm also so nervous to contact her to try and patch things up as there hasn't been a specific incident recently. I just stopped replying as I felt like I was being hurt and I didn't have the emotional capacity to deal with things due to my health worries.\n\nHer birthday is coming up in a few weeks. Should I send her flowers and perhaps write her a letter explaining my feelings? She is very, very extreme about covid so I doubt that she would want to meet me for coffee unless it was outdoors (we live in England it's too cold for me to do this at the moment while I'm healing from surgery) \n \nAny advice would be so much appreciated and I'm sorry for how long this is!! There's a million more things I could say.\n\nIf this should be posted in a better suited forum please let me know!\nThank you x", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgdf9r/should_i_try_and_save_this_potentially_toxic/", "title": "Should I try and save this potentially toxic relationship?", "social_network": "reddit", "user": "tillymint24", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1635274533, "permalink": "/r/DecidingToBeBetter/comments/qgdf9r/should_i_try_and_save_this_potentially_toxic/", "nsfw": false, "first_save": 1635436768.6865067, "replies_charged": false}