{"id": "t5_2tand_t3_jxahne", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "badbd7e1-4692-457a-97bc-7317bdf8e5c1", "f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "802203c7-ca80-4c23-ad08-f571694cfc55", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Dears,\n\nI would like to share with you the steps that are PROVED to cure you of PP syndrome.\n\nI believe many people are people pleasers, without realizing it.\n\nIt's a very bad strategy to be liked by people, you are basically showing them that you don't appreciate your self so why would they? \n\nI really hope that it will be beneficial for you, if you have any questions don't hesitate to ask :)\n\n&#x200B;\n\n**Steps to cure the Disease To Please**\n\n**1-** **Don’t say YES when you want to say NO**\n\na. Delay answer (buy time)\n\nb. Identify options\n\nc. Forecast options\n\nd. Select the best option\n\ne. Respond by: yes, no or alternative \n\n· Buying time\n\no *On Phone*: Interrupt the cycle of automatically saying YES...\n\n§ Can I put you on hold?\n\n§ Can I call you back later?\n\nAfter resuming the call use these phrases:\n\n\\- Let me get back to you with an answer after I check my calendar\n\n\\- I need a little time to think. I will call you back later (or tomorrow etc.)\n\n\\- I can't give you an answer right now, I will get back to you soon\n\n\\- I'm not sure if I will have time, I will let you know about it later/tomorrow.\n\no *Face to face request*: interrupt the automatic cycle (if possible)\n\n\\- Ask for a moment to make a call or go to the bathroom.  \n \n\n**2-** **The Broken Record Technique**\n\no After using the “Time buying phases” the requestor may insist.   \n Here is how to handle it:\n\n§ Empathize with the request wanting immediate answer (I understand that you need the answer now… but I have to check if I will be able)\n\n§ Repeat the Time buying phases\n\n§ Keep CALM  \n   \n **3-** **The Counteroffer**\n\no We always have 3 options: Yes, No, or give an alternative\n\no After buying time analyze the emotional, physical or financial impact of saying Yes, no or counteroffer\n\no Your interests must come first!  \n   \n **4-** **Saying No… The Sandwich Technique (Empathize – NO – Positive statement)**\n\no The script:\n\n§ The requestor asks you to do something\n\n§ You put them on Hold (buying the time) breaking the automatic cycle of saying yes.\n\n§ You return to the conversation and use the Time buying phases (to get back to him later)\n\n§ The requestor resists and asks for an immediate answer.\n\n§ You use the broken record technique by Empathizingand repeating the time buying phrases.\n\n§ You call back to say NO (firmly or sandwich tech.)\n\n§ Requestor resists and tries to put you under pressure (I need to know right now!)\n\n§ Repeat the broken tech record\n\n§ Congratulations you have successfully said NO.  \n   \n **5-** **The reverse Sandwithc technique (Empathize – Alternative – take it or leave it)**\n\no In other words the counteroffer \n\no Be careful to not use the counteroffer to avoid saying NO \n\no Your counteroffer must be upon your free will, in a take it or leave it way and under your terms.\n\n**6-** **The 10 commandments of People – Pleasing**\n\no Only if I truly want, I can fulfill others' needs.\n\no I choose and only if I want to take care of a specific group of people.\n\no I can choose if I want to listen to someone's problem and help them solve it.\n\no I can choose to whom and when to be nice.\n\no I must put myself before others… In airplanes, they tell you to help yourself by putting on the oxygen mask before you help others.\n\no I can say NO to anyone requesting something from me.\n\no I can let others down if I want to.\n\no I must always feel my emotions and never suppress them.\n\no I can choose when and whom I want to make happy.\n\no I can always express my needs and ask for help.\n\n**7-** **Rewriting the 7 deadly shoulds** \n\no People should love me! **->>** I hope other people love me for who I am rather than what I do for them. When I choose to do nice things for others, I hope they will appreciate my efforts.\n\no People should always approve of me! **->>** I know that people will not always approve of me, which is completely fine! I would like the people who I love and respect to respect me back for my values and kindness, not for my hard work to please others. The most important approval is MY OWN.\n\no People should never Rejet me! **->>** Rejection is part of growing and learning (embrace it), I won't let any criticism affect me negatively, I can choose what to take to my heart and what will be ignored by me (haters or people who are having a bad day) living up to others desires and expectations will never eliminate rejection and criticism.\n\no People should appreciate my favors! **->>** I choose to whom I will be nice and kind, and I am waiting for no return for it.\n\no People shouldn't hurt me! **->>** Being nice to people doesn't mean that people won't hurt my feeling I deserve respect, and I cant rely on being nice to avoid this… I can't control how people feel.\n\no People should never leave me! **->>** I want for people to be around me for the real me, faking or suppressing my feelings is not my desire.\n\no People should never be angry with me! **->>** I fear no conflict, anger, or confrontation. I will always face them with bravery and mindfulness.\n\n**8-** **Taking care of yourself**\n\no Unless you take better care of yourself physically and psychologically, you won't be able to take good care of the people that matter to you in life.\n\no Practice pleasurable activities twice a day!\n\n· Listen to music\n\n· Read\n\n· Watch a favorite movie\n\n· Exercise\n\n· Meditate\n\n· Go shopping\n\n· Plan a trip\n\n· Volunteer\n\n· Etc. 😊 \n\n**9-** **Talking yourself out of approval addiction.** \n\n· Identify someone who you believe doesn't like or approve of you.\n\n· Write a few paragraphs from the perspective of your formal people-pleasing mindset\n\n· Read them out loud and rate them 1-10 how much it bothers you.\n\n· Write a few paragraphs against the people-pleasing mindset. Rate the above again.\n\n· Give yourself approval every evening.\n\n1- Today I feel good about myself for doing…\n\n2- Today I approve of the way I…\n\n3- Today I am proud of myself because…\n\n· Example of rating what bothers you: Person A\n\n1- Is not giving me attention “first rating” (10/10) – “second rating” (3/10)\n\n2- Is not attracted to me (10/10) – ( 2/10)\n\n3- Is not valuing me (8/10) – (1/10)\n\n4- Is not validating me (10/10) – (1/10)\n\n· Against it:\n\n1- Is not possible to get everybody attention\n\n2- Everybody is attracted to different people (chemistry)\n\n3- It's ok if that person is not valuing or validating me… trying to be nice to gain people's approval or validation is MANIPULATIVE!\n\n4- Some people may dislike you for their own biases, prejudices, or emotional problems.\n\n· Now rate person A again \n\n**10-** **Delegate with assertiveness**\n\nYou must be assertive and appear comfortable with delegating and tasks. You are not asking the target's permission to delegate.\n\n*6 steps to delegate:*\n\n1- Make clear and specific instructions, you can offer advice on how to do the task.\n\n2- Indicate the time frame/deadline to complete the task.\n\n3- Confirm that the target understands.\n\n4- Allow the person to ask any questions, answer them clearly and respectfully.\n\n5- If there is resistance.. use the broken record technique\n\na. Empathize \n\nb. Repeat delegation\n\nc. Keep calm\n\n6- Indicate appreciation before the task is finished.\n\n**11-** **It's OK TO NOT BE NICE** \n\n· Make a list of 10 words to answer the question who am I? without using the word NICE.\n\n· Collect the same 10 words from 4 close friends\n\n· Make a list of the words to compromise my ideal self-concept\n\n· Act-as-you are your new you.\n\n**12-** **The Anger scale**\n\n· Can you recall a time when you felt some degree of anger towards your:\n\n\\- Mother\n\n\\- Father\n\n\\- Siblings\n\n\\- Co-worker\n\n· Try to recall how it started, when did you lose control and how did it end\n\n**13-** **The relaxation breathing**\n\n· Breathing (5min): - 5 sec inhaled/hold for 1sec  \n  \\- exhale slowly\n\n· Relaxation: while practicing breathing focus on your right hand (mind+eyes) and say out loud “My right hand is growing heavy and warm”\n\n· After 30-60 seconds you will feel your hand becoming heavy and warm… Shift your focus on another part of the body\n\n**14-** **What makes you “Anger Up”**\n\n· *Words:* Words that you use while being anger can worsen the situation ex. (awful, terrible, worst)\n\n1- This is the WORST thing that happened to me\n\n· *Shoulds*: Shoulds makes a demand on how you or others SHOULD behave.\n\n1- People SHOULD never reject/criticize me because of the all nice things I did for them.\n\n2- He/She SHOULD NOT treat me that way.\n\n· *Negative Labeling*: This PC/Mobile is a CHEAP piece of shit\n\n· *Exaggeration:* Making things worse than it is\n\n1- He/She is never on time!\n\n2- I will never forgive him/her for that.\n\n· *Mind Reading*: In other words assuming facts or one-sided thinking.\n\n1- When you assume facts that support your anger, without considering other explanations.\n\n**15-** **How to “Anger Down”**\n\n· *Countering words:*\n\n1- This isn’t the worst thing that’s ever happened.\n\n2- This is upsetting but not awful/Terrible/Horrible\n\n· *Countering Shoulds:*\n\n1- I wish people wouldn’t reject/criticize me, but I can benefit from it also it's up to me to take it or leave it.\n\n2- I wish He/She didn’t treat me in such a way, but I am not in control of people's actions.\n\n· *Countering Negative labeling:*\n\n1- He/She is late frequently, but not always.\n\n2- It may be difficult to forgive Him/Her but Time will make it go aways\n\n· *Countering Mind Reading:* \n\n1- Always verify, faults are never one-sided.\n\n2- People who are hurt will hurt\n\n3- Don’t take things personally\n\n**16-** **TIME OUT**\n\n· Time out is one of the most effective methods for conflict management.\n\n· The concept is to stop the conflict from escalating by physically removing yourself from the scene for a period of time > to regain control of your emotions.\n\n· Time out steps:\n\n1- Identify the cues\n\n2- Use prepared exit lines\n\n3- Deflect negative reactions with the Broken record technique.\n\n4- Leave the scene\n\n5- Use anger reduction method to cool down\n\n6- Return to the scene\n\n· *Identify the cues:* \n\no Identify the earliest signs (Increased volume, hostile language, aggressiveness)\n\no Trust your instinct to recognize anger in other people\n\no Don’t tell the person that they are too angry or losing it > it will provoke them more.\n\no By calling time out for yourself and explaining that you need to gain control of your anger you will become a proper role-model for the other person\n\n· *Exit lines:*\n\no I need some time to think this over\n\no I am starting to lose my temper and I don’t want to allow that.\n\no I need to leave for a while to get myself together, I don’t want to do/say things out of anger.\n\no I need some time to calm down can we talk later?\n\n· *Resistance:*   \n Sometimes the other party may try to use the time out exit lines against you or to provoke you for example (Don’t run away like a baby/coward)\n\no Call me whatever you want, I am not letting myself being sucked into this fight\n\no We are both angry there is no point in continuing in this conversation that we may regret it later.\n\no I am doing this out of respect for you.\n\nTime out is not a way of running away from conflict but controlling it and caring about the other party. In sports, coaches take Time Out to advise their team.\n\n· *Leave…*\n\nDon’t leave with any aggressive reaction, Like slamming the doors…\n\n· There is no point in staying to continue the discussion… me leaving is beneficial to both of us\n\n· *Apply relaxation breath exercise*\n\n· *Time In (return)*\n\n1- If you feel threatened continue by phone.\n\n2- Ask the person if they are ready to continue\n\n3- If you return thank the person for respecting the time out\n\n4- Highlit that you intend to work out the problem\n\n5- Share an experience where time out helped you to solve a problem\n\nv The DO's and DONT's in conflict resolution\n\no Dont's:\n\n§ Use exaggerated language such as “you never…” “you always…”\n\n§ Use sentences like “you make me feel stupid or you hurt my feelings”\n\n§ Make a judgment about the other person feelings “you are overreacting” “you are silly to ger upset about this”\n\no Do's: \n\n§ Assume responsibility for your feelings as reactions to His/Her behavior  \n “When you raise your voice I feel disrespected” “When you tease me I feel hurt”\n\n§ ABCD method… when you do A I feel B if you would do C instead I would feel D\n\n§ Use empathy\n\n§ Listen carefully\n\n§ Understand the other person's statement by rephrasing that. “So what are you staying is …”\n\n§ Ask for suggestions. “So if I do XYZ you feel hurt… what would you like instead…”\n\n**17-** **Stress Inoculation** \n\nLearn the Gardol shield and the coach on your shoulders\n\n· *Gardol Shield*: an old advertisement on TV about a whitening teeth paste… Someone off-camera is throwing food at a lady that is showing off her smile.  \n Instead of the food getting to her face and destroy her smile, an invisible shield appear and the food gets smashed on the shield.  \n Apply it to your daily life… Whenever someone is trying to provoke, insult, or criticize you just say “SHIELD UP” and imagine an invisible shield that only you see.  \n Watch all the insults, provocations, and criticism getting smashed on the shield.\n\n· *The shoulder coach*: Imagine that there is a coach that sits on your shoulder and he/she whisper o your ear phrases to handle conflicts\n\no Always b prepares so you won't get knocked down quickly (like in compact sports)\n\no Phrases:\n\n§ This might upset me a bit but I can handle it.\n\n§ Time out is always an option.\n\n§ I can work out a plan to deal with this problem.\n\n§ Stay flexible and calm.\n\n§ Gardol shield up\n\no When the other person confronts you in anger:\n\n§ Stay cool and relax.\n\n§ Don’t let him/her get to you.\n\n§ Stay in control.\n\n§ I won't let him/her have power over my emotions.\n\n§ I don’t need to prove that I am right.\n\no If my anger gets aroused:\n\n§ I feel getting tense. I need to focus on breathing.\n\n§ I may need to take a time out.\n\n§ I won't care in and become a PP again. I can stand up for myself.\n\n§ I need to focus on listening while being angry I can't focus on listening.\n\n§ Gardol shield up\n\no When you have resolved the conflict:\n\n§ I feel pretty good about myself, well handled\n\n§ I am getting better and more confident.\n\no If the conflict is partially resolved:\n\n§ I will get better at this.\n\n§ I feel proud that I tried\n\n§ It's from the past stop thinking about it.\n\n§ Not everything can be fixed\n\n· Inner voice coach script: practice it and read it out loud\n\no You: I need to talk to you about the money you borrow. We agreed that you will repay me in six weeks.\n\no Friend: six weeks! I thought six months! I can believe you are putting me under this pressure! I just started working!\n\no Coach: sta calm he/she is getting worked up, making you feel guilty and getting defensive\n\no Y: I understand you feel pressured… let's arrange a repayment plan that is less pressuring\n\no F: (Angry) what kind of a friend are you?! After everything I have done for you\n\no C: stay calm, he/she is getting defensive and try to make you feel guilty.\n\no Y: I understand that you are upset and that you are under financial pressure… but I am too, and I want to work something out with you.\n\no F: You don’t understand anything.\n\no C: I need Time Out. Or I will lose my temper.\n\no Y: I don’t want to get into a fight with you, I need a break. I will be back.\n\no F: Okay you are probably right.\n\no C: great job.\n\no Y: (after the time out) OK first let's agree to stay calm. We can do better than that.\n\no F: I just feel terrible about this.. you make me feel so guilty. I have other debts right now.\n\no C: don’t get defensive or apologies to take some deep breaths.\n\no Y: I understand that this convo is unpleasant, it's nothing personal let's reach a repayment agreement.\n\no F: I can't afford to pay it all at once, be patient I will try my best.\n\no C: Stay calm, don’t provoke or be sarcastic.\n\no Y: Okay let's sit down and work out a payment schedule we can do it I know that neither of us wants to argue…\n\nThe most important thing is that you practice the coach phrases as an inner voice.\n\n**18-** **Solve a Problem with a friend… not for a friend**\n\n· Prioritize the people you most want to help:\n\no Write a list of people you want to help, if you are counting on your two hands… you need to shorten the list…\n\n· Since you have been a PP, people expect you to solve their problems… you need to give them a different reaction.\n\n· When a friend asks for help with a problem:\n\no Say No, Empathize with him/her and wish the luck\n\no Buy time:\n\n§ Acknowledge and Empathize\n\n§ Make no commitment\n\n§ Promise to reconnect\n\n· The 7 steps problem-solving model (if you want to offer a structured problem-solving model)\n\no Define the problem\n\no Brainstorm all possible solutions\n\no Collect relevant info\n\no Pros and Cons\n\no Select the best alternative\n\no Implement\n\no Evaluate how the decisions are working.\n\n· Be aware of your words, one of voice, and be careful not to sound apologetic or guilty.\n\n**19-** **Correcting Faulty Assumptions.**\n\n· In the past, you have to overestimate that people would get angry with you if you say NO… Let's test the responses.\n\n· To conquer your fears, you will need the courage to test your predictions.\n\no Say no to a request, invitations\n\no Delegate a task\n\no Ask for help\n\no Ask someone to stop doing something that is bothering you\n\no Listen to someone problem without offering help/advice\n\n· Write down your prediction and then compare it with reality.\n\n· Flashcards: write down cards that will remind you in your journey of curing the disease.\n\no Say NO\n\no TIME OUT\n\no It's ok to not be nice\n\no I need my OWN approval\n\no Set limits \n\no Listen to my coach\n\no Self-respect\n\no Invisible shield\n\no NO SHOULDS\n\no Breath and relax\n\no NO GUILT.\n\n&#x200B;\n\nwish you all the best :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jxahne/steps_to_get_rid_of_the_peoplepleasing_syndrome/", "title": "Steps to get rid of the people-pleasing syndrome", "social_network": "reddit", "user": "Posty1111", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1223, "down_vote": 0, "creation": 1605817489, "permalink": "/r/DecidingToBeBetter/comments/jxahne/steps_to_get_rid_of_the_peoplepleasing_syndrome/", "nsfw": false, "first_save": 1635435448.439679, "replies_charged": false}