{"id": "t5_2tand_t3_cc5g9e", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": " \n\n1. Introduction\n\nNo matter what situation you are in there is no reason for you not achieve the status of millionaire\n\n\\-Too much debt\n\n\\-Don’t like my job\n\nBy making the right moves and steps, avoiding all the things that keep people in poverty\n\nAll you have to do is change your actions and thinking\n\n90% of this creating money\n\nIt is not just mental it’s physical actions it requires you to do and not do a lot of things.\n\n50k a year is 2 million over 40 years.\n\nThe questions that come with it is\n\nWhat will you do with it.\n\nHow will you invest it.\n\nWill you blow it\n\nWill you not pay attention to it\n\nWill you act like a victim\n\nDon’t get your advice from 50 people there’s too many cooks in the kitchen\n\n2. All Mental\n\nIt is completely 100% mental\n\nDecision is vital and it is senior to everything else.\n\nNever get your advice from a millionaire.\n\nNever  actually be a millionaire, make a decision higher than goals, because  often times we achieve less than our goals. We have to always aim  higher.\n\nIf the target is 60K. We often reach 58K. So why not set the target for higher.\n\nYour life should not be like some drama tv show.\n\nWhatever target you have always multiply it by 10X.\n\nIf you want to be a millionaire then aim to be a multi millionaire.\n\nIt’s better to fail higher than to underestimate yourself.\n\nWhen you set goals that are achievable and you could figure it out then they were too low.\n\n3. Make a list of poverty behaviours\n\nStop poverty behaviour\n\nQuit acting and talking like your broke all the time.\n\nJust getting by is another form of poverty. Just having enough is another form of poverty.\n\nYou can be a millionaire and still live in poverty because it’s mindset\n\n*Poverty Behavior List*\\- to be created on the Feb 25 2019\n\nDrugs and Alcohol\n\nOverspending\n\nWasting Weekends\n\nDependence on Government\n\nVictim Mentality\n\nNot Seeking Knowledge and Guidance\n\nShortcuts\n\nCriminal Activity\n\nStealing\n\nPeople  who are often in physical poverty often refuse to network and travel.  They make excuses about why they can’t do certain things.\n\n*Middle Class Poverty Behavior List*\\- to be created on the Feb 25 2019\n\nleasing things they can’t afford\n\nBuying a house\n\nRefusing to take opportunities\n\nStop chasing debt then paying it off.\n\nThe way you talk to yourself is a poverty behaviour\n\n*My Own Poverty Behavior List*\\- to be created Feb 26 2019\n\nSpending Money before I have it\n\nWasting money things on things I don’t need\n\nSpending or wasting my time instead of things that are productive\n\nNot saving enough\n\nAlways looking for reasons to spend money\n\nNot willing to make sacrifices and take my opportunities even though I know in the long run they are worth it.\n\n4. Work Like a Millionaire\n\nWork like a multi millionaire\n\nYou have to work then work harder.\n\nEliminate the 9-5 and start working the 5-9. It’s poverty thinking.\n\nIf i work 100 hours a week and you only work 40 then i’m 2 and half times faster than you-Elon Musk\n\n168 Hours a Week\n\n100 Hours of Work\n\nThen 47 Hours of sleep\n\nYou have 21 hours a week to manage your life.\n\nEven if you work 80 hours your still work twice as hard as the average american.\n\nWork more in the week to work less in the long run.\n\nStop listening to the wrong people\n\nTime is money.\n\nThey go out of their way to network so they can continue learning from people who succeeded\n\n5. Move from spending to investing\n\nStop spending money on stupid stuff. Don’t spend on money on things you think are gonna fix you.\n\nI rather invest 1,000 on something that can be profitable then spend 100 dollars on something pleasurable.\n\nInvest in yourself. You’ll never lose it. Don’t be afraid to invest more then spend less.\n\n6.Create Multiple Flows of Income.\n\nAverage Millionaires have more than 7 flows of income.\n\nYou need to get multiple flow. Don’t ignore your first flow for your second flow, because that’s going to hurt your first flow.\n\nFirst flow should come from your job. Never degrade or diminish that first flow. Get the flow stable and strong.\n\nThe  second flow should be a bonus from the first flow. Make sure your flows  of income are symbotic. Allow it move alongside your first flow.\n\nLearn  another skill it doesn’t mean a second job or extra hours. Learn a way  in which you can get increased profit within your first two flows.\n\nIf you can’t create passive income you will work till you die.\n\nDon’t look for more money look for opportunities\n\n7.Expand your network\n\nThe big players always seek to expand their network\n\nYour network is your net worth\n\nDon’t stay in your familiar circles.\n\nForce yourself to meet new people.\n\n8.Never lose money\n\nQuit putting your money into things where there is a risk of loss. I don’t invest in things where I lose money.\n\nWhen you invest in yourself it’s a surething.\n\nMoney that sits around will be lost\n\nInvest in your business and brand. Individuals are business. Money follows attention\n\nInvest in assets the produce income. An example would be real estate because it’s visible and physical.\n\n9.Make decisions fast\n\nMake hard decisions fast\n\nWhen it comes to money make the decisions fast.\n\nQuick getting sucked in or giving maybes.\n\nIf you don’t want to do something say no.\n\nYou can’t be everything to everyone.\n\nIf you have to make decision don’t let emotions get in the way.\n\nIt’s not a popularity contest. You aren’t trying to win friends or influence people you are trying to secure a bag.\n\n10. Never Quit\n\nNever quit or settle.\n\nThe successful don’t stop once a goal is reached.\n\nIf  you can you should. There is nothing wrong with completing your goal  and resetting don’t just think about retirement the whole way.\n\nIf you can do more, then do more.\n\nSolve one problem then go onto to the next problem.\n\nIf you quit when you win then your gonna quit when you reach a setback.\n\nDon’t quit\n\nRecalibrate\n\nInvest in a new direction\n\nGet on the other side of your money problems and you’ll reach financial freedom.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cc5g9e/grant_cardone_ten_steps_to_be_a_millionaire/", "title": "Grant Cardone \"Ten Steps to Be a Millionaire\" Summary", "social_network": "reddit", "user": "terrorist_kid", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1562901435, "permalink": "/r/DecidingToBeBetter/comments/cc5g9e/grant_cardone_ten_steps_to_be_a_millionaire/", "nsfw": false, "first_save": 1635436978.3389835, "replies_charged": false}