{"id": "t5_2tand_t3_m8p3ud", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I was an addict for more years of my life than I was sober. I used opiates to deal with the mental pain of life. I'm not going to write a sob story, but my life growing up wasn't sunshine and roses as I'm sure is the same for most people who are addicted. I was getting so far gone and pushing the pain I had gone through in life so far down and not dealing with it, that it was rotting inside of me. It was starting to make me legitimately crazy. I cared some, but not much, and not enough to get off drugs. I had tried before just to stop, but I didn't realize how much work was going to be involved, what I was in for, or where to begin. It took me three years of trying different methods like methadone, rehab, suboxone, meditation and therapy to finally get to the starting line of what I thought was the path to sobriety.\n\nWhile going through all of this it was like I was marching up a snowy mountain with a backpack on. I was tightly holding my shoulder straps, trudging through the snow uphill one step at a time. After a couple of months I would lift my head up to see I was still in the exact same place. So again, I put my head down and trudged on. For over a year it seemed like I was in the same place every time I looked up. I had learned a lot though while walking. I truly learned the meaning of patience and calmness and finally understood this is a marathon not a sprint. I learned that hope was the only thing I had in the most desperate times when I felt like just giving up and setting down in the snow, not to care anymore. In the mind of my mind, I was climbing a ladder or the steps of a pyramid. Every lesson was like an ascension of knowing who I was and what I had to do. Like going through the chakras to start at red over and over again, growing the whole time.\n\nOne day things changed a little as I felt some tension release. I didn't realize I was over the crest, just knew it was starting to get easier and I felt myself descending down the other side. Still learning in the mind of my mind lessons to take with me. I learned it is okay to just be okay with yourself. That being ashamed and the fear and anxiety that came along with it weren't going to help me on my travels, so I had to shed that baggage to get where I wanted to be. People don't look at you and see what you think of yourself. They just see what is in front of them at that moment. So, if you're doing better, that is the picture you project. They don't know the challenges you're facing in your mind and body to just make it through the day. So again, my head down I keep trudging through the snow down the side of the mountain.\n\nOne day I felt something completely different. I had accepted the snow and the mountain and without knowing where I was, I look up and there isn't any snow. I'm coming into a valley with a beautiful meadow, and I can shed some of my baggage knowing I'm in a better place. I still have my journey ahead but I'm feeling better about each step, still learning in the mind of my mind. I have this energy inside of me that wants to persevere. I want to be a good person and give off a good energy for others to realize anything is possible.\n\nFeeling light and free I walk to the edge of the meadow with my shoulders tall and straight from everything I've carried and learned to cope with. The mind of my mind gave way to me being myself and knowing who I was. I felt whole once more. As I make my way through the trees there is a beautiful little stream. I wash myself and stand up a clean person, free and ready to face the world as I had never known before. As I look around with my eyes clear, in that moment I realize, this is beautiful!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m8p3ud/being_sober_is_beautiful/", "title": "Being Sober is Beautiful", "social_network": "reddit", "user": "JMCochransmind", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1026, "down_vote": 0, "creation": 1616182442, "permalink": "/r/DecidingToBeBetter/comments/m8p3ud/being_sober_is_beautiful/", "nsfw": false, "first_save": 1635435336.471526, "replies_charged": false}