{"id": "t5_2tand_t3_92ocks", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I worked hard for what I had, harder than what seemed fair. I thought that once I got a steady job, a place to live, and some kind of job experience that maybe it would feel like I accomplished something, maybe I’d feel like I really got myself together. Instead, I found myself where most people go to graze – the cubicle farm. I was working 60 hours a week for a 40 hour a week paycheck in a job I didn’t like. The only person I had to blame was myself. It wasn’t all bad, on Friday’s we could dress business casual and the break room had free burnt coffee.\n \nI could vaguely remember a time I when felt more alive. I had played with some of the hardest most outrageous punk bands in the St. Louis music scene, I even had the pleasure of playing with many of my musical idols, early on in my life I was lucky enough to recognize the world was pliable to those who applied themselves. The world felt infinite, it was a wild, crazy, fun, experience where anything was possible.\n\nMeanwhile, back in cubicle purgatory I tried to fill my time with mindless distractions, busy work, and trying to make other people happy so I could keep living a life that made me feel miserable. Anything to help prevent myself from flipping my desk over and walking out the door. I had all the indicators of success, a good job, a wonderful family, stress, and enough debt to paralyze a cobra. Was this the American Dream?\n\nThe worst part was looking in the mirror and thinking “Who the hell have I become?”. I used to have hobbies, I used to have friends, I used to be cool! How had I let myself become another timesheet punching, coffee guzzling, sorry I’ll be late for dinner tonight chanting desk jockey? I was a wolf pretending to be a shitzu and I was becoming aware of the weak bars that made up my cage.\n\nLater, when I decided to take control of my life and define the person who I wanted to be (instead of letting life define me) I would look back and laugh. It wasn’t until I saw through the illusion of my preconceptions and limiting beliefs that I would realize I was acting like a well-behaved DOG instead of embracing the wild within.\n \n\n**1.) Domestication**\n\n*or Surrounding Yourself With Complacent Acquaintances*\n\nYou’ve probably heard this one before, you become most like the people you spend the most time with. Guess what? This is something you can actively control. Once you recognize who you are and how you can fully express this most effectively in the world you need to start surrounding yourself with people who will challenge you to raise the bar.\n\n When I decided to stop trying to fit in, but instead to be true to myself the urgency of this became even more apparent. The more I was willing to show up as who I really was, the more I would come across just the right mentor or guide at the right time. Funny how that works out.\n\n**2.) Obligations**\n\n*or Telling Yourself That You Should Be Content With What You Have and Not Recognizing Who You Are*\n\nI think mindfulness is incredibly important, I think it helps creates the space you need to begin to actualize yourself. It is important to remember that gratitude does not mean that you should have to be content with where you are in life. It is ok to want more, it is ok to have dreams and desires. Its a simple thing, acting in accordance with who you are and what your values are will make you happy, acting contradictory to these values will make you feel like crap. Of course, we can be so disillusioned that we may need a little help getting back in-line with our fullest potential. On the path to honoring yourself, you have to acknowledge your individuality and allow it to express itself in the world around you. If you are constantly at war with yourself, you will never find peace.\n\n\n**3.) Giving In**\n\n*or Choosing Comfort Over Struggle*\n\nThis last one relates to fear. Have you ever noticed that when you try to make a major change in your life you encounter some…. resistance? In coaching they have a word for this its homeostasis. It means that as you try to make focused changes in your life you are going to encounter some.. discomfort. Trust me, if there was a way around discomfort I would have found it. So here you are trying to kick off this huge goal, maybe it’s losing weight, maybe it’s smoking, maybe it’s finally taking the first steps toward your dream life and WHAM! You get knocked on your ass by sickness, car troubles, ancient aliens, and general misfortune. What happens after that? Attitude adjustment. You experienced a challenge, but you called it a failure and decided to give up. You become convinced that because it was uncomfortable that the timing was off, blame it on the Mercury Retrograde. The trouble with this is, when you settle – you suffer.\n\nAs much as I would like to take all the credit for being completely self-aware and deciding to change, I couldn’t have done it with out finding the right people to shove me through the illusion of my own fears. Awareness is only the beginning, the real fun comes with the implementation. Don’t doubt yourself, you can do this.\n\nIf you are frustrated or disappointed with any aspect of your life, ask yourself am I staying in my comfort zone to avoid discomfort or fear?\n\n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/92ocks/how_to_buy_in_to_yourself_after_being_forced_to/", "title": "How to Buy In to YOURSELF After Being Forced to Sell Out", "social_network": "reddit", "user": "Chadgunz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1532803048, "permalink": "/r/DecidingToBeBetter/comments/92ocks/how_to_buy_in_to_yourself_after_being_forced_to/", "nsfw": false, "first_save": 1635436081.0576997, "replies_charged": false}