{"id": "t5_2tand_t3_olqbvu", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "4b69452a-b1e5-47af-a734-ad3c2bdce185", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Hi! How are you?\n\nI'm Cherry. I have crohn's disease and OCD, and this past year has been extremely tough for me. I was behind in school because of my condition, incredibly stressed and ill, and struggling with personal issues.\n\nI decided months ago that I would push my limits, take care of myself to the best of my ability, and be the kind of person that I can be proud of.\n\nWith that goal in mind, I grew mindful of my diet, my exercise, my mental wellbeing, my hobbies. I began to read for pleasure and relax in ways other than using my phone.\n\nI even got a part time job at a restaurant, which I love. I feel fulfilled and happy because I know I deserve to, and you know you do too. These things are tough to accomplish, but nothing is impossible if you start small and let it become a habit.\n\nYou don't ever have to reach every single goal every day. It's enough if you only reach one. But you'll notice, that in the end, you'll have accomplished something every day, even if it's small, and that's something to be proud of.\n\nYou deserve to feel proud and fulfilled. So let's do this together. Let's study, work on our health and fitness, on our mental wellbeing and calm, on our hobbies and goals and aspirations. I'm still working on it- but it's progress. And just in case you needed to hear this, I want to put it out there.\n\nDon't ever let anything stop you- put yourself first. Now is the time to do all those things you wanted to do.\n\nExcuses will always be excuses- it's time to live life to the fullest, because tomorrow is the first day of the future life that you aspire to have.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/olqbvu/im_a_teenager_with_crohns_and_i_want_to_motivate/", "title": "I'm a teenager with crohn's, and I want to motivate and inspire you", "social_network": "reddit", "user": "-INKGHOST-", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 396, "down_vote": 0, "creation": 1626470471, "permalink": "/r/DecidingToBeBetter/comments/olqbvu/im_a_teenager_with_crohns_and_i_want_to_motivate/", "nsfw": false, "first_save": 1635435775.7720344, "replies_charged": false}