{"id": "t5_2tand_t3_hrz014", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "I went to the doctor yesterday and they asked me how my anxiety was because I seemed very stressed and anxious in the room. \nThis is the first time I’ve been inside a building with people in months. I’ve been teleworking and the most I’ve done is pick up groceries with the car pick up so I was unexpectedly nervous. I wasn’t like this before covid... right?\n\nDoc asked about how I have been coping or if I was. I said that I had been smoking more recently and kind of had a revelation in the room that since covid I have been REALLY relying on it. It’s legal where I live and I’ve been telling myself it’s like when people have a happy hour drink, I’m just smoking a bowl nbd..But a couple times a week has gone to every day to several times a day. I can feel myself getting closer to the end of the work day and my anxiety is just building waiting to clock out and relax. \nThe doctor suggested that I should see how I am with scaling back a bit/quitting for a while and now I have someone with behavioral health reaching out to discuss other coping mechanisms. Not ready to talk them yet.\n\nI don’t even know how to feel... I told my partner I think I could quit if I want to but I’m not ready... then as I said it I realized that’s probably what someone addicted would say. \n\nI’ve decided I’m not going to smoke today. \nI’ve cried twice already just trying to process and on the verge now.\nI’ve always been “you can’t get addicted to weed” type...\n \nI know that there are way worse things out there to be addicted to. I don’t want to offend anyone on that journey. \n\nI just feel like I’m ashamed that I have a problem. \nI’m not even sure if I want to stop smoking completely. I love it so much... I just don’t like how dependent I am on it. \n\nTLDR: not going to smoke today but getting anxiety about it", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hrz014/doctor_recommended_i_quit_smoking_weed_for/", "title": "Doctor recommended I quit smoking weed for anxiety and I’m getting anxiety about it", "social_network": "reddit", "user": "RAThrowaway356", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 747, "down_vote": 0, "creation": 1594856962, "permalink": "/r/DecidingToBeBetter/comments/hrz014/doctor_recommended_i_quit_smoking_weed_for/", "nsfw": false, "first_save": 1635438067.4712868, "replies_charged": false}