{"id": "t5_2tand_t3_gh256b", "request": ["b1a66ef4-3e71-4d03-875c-961dbcef2285", "cbd1933a-caaa-464d-8e4c-373318982c62"], "text": "Movies, TV commercials and Social Media “stars” present us society’s values, ideal lifestyles, what true happiness is, and what happy moments are, how success is luck and how life is made of these moments and you should enjoy the happy ones as much as you can, because happiness doesn’t exist for anyone, not even for those that make every effort to convince you of it.\n\nThey are marketers looking for hype, exploring their teenager followers and their parent’s money, and behind them are brands selling products. You see, their “moments” are always around products, power (achieved by consuming) and money (to consume). And happiness doesn’t have anything to do with that.\n\n\nDopamine does.\n\n\nDopamine is the neurotransmitter responsible for antecipation of euphoria and the euphoric state itself. The problem is that dopamine is not only addictive, but you need to get ever higher stimulation doses to get the same high.\n\n\nAnd guess what?\n\n\nThere are some clever people making profit out of exacly that! Social media consumption spykes dopamine way high, as well as videogames, pornography, junk food, sugar and sweets.\n\n\nAlright, you probably heard that already, but why does it matter? Here’s the problem:\n\n\nSpending too much time in social media platforms can be really harmful to willpower, and arguably mental health.\n\n\nI believe in that based on my own experience with facebook and instagram. Both platforms drain my self confidence and general mental wellbeing.\n\n\nBut the worst part that not many people are aware is that these habits rewire the brain, affecting daily decisions directly.\n\n\nHow so?\n\n\nYou can wire your brain two ways:\n\n\nInstant Gratification or Delayed Gratification (Short-Term Rewards and Long-Term rewards).\n\n\nBy exposing your brain to pornography, social media, videogames, hyper-palatable sweets, etc. all day long, you are rewiring it to crave this fast-reward mechanism, conditioning it to this neurological pathway to cause a rush, a high of euphoria.\n\n\nThis conditioning makes it extremely unomfortable for your brain to choose things that aren’t instantly rewarding, dispite the fact that you know that they’ll be in the long term.\n\n\nYou choose what you judge to be best for you, but with a brain that is conditioned to dopamine stimuly will tend to choose dopamine everytime, and will avoid long term efforts at any costs. “Will tend to choose” means you’ll experience physical pain trying to read a book when your videogame is ready for launch.\n\n\nThat’s when it destroys your life, and where you loose control of your own freedom of choice, for years. I’ve been there.\n\n\nI’ve lived the biggest part of my life seeking these empty, false, forged experiences, that are essentially non-authorized control over my body and mind. And the worst part is that I believed in it, devoted all my efforts for achieving the twist lifestyle and the ‘happy moments’. But not anymore.I don’t like to imagine what to waste my whole life in that state would be like, and consider myself extremely lucky to be able to break out of that mindset. \nMaybe I change my mind later, but to continue to live like that is for me, perhaps even worse than death itself.\n\n\nThank you for reading! Stay safe\n\n\n[edit] Next sunday I'll post a solution I'm writing to adress this problem, stay tuned!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gh256b/an_essay_on_anxiety_and_our_inability_to_act/", "title": "An essay on Anxiety and our Inability to Act", "social_network": "reddit", "user": "DrRotger", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1589119791, "permalink": "/r/DecidingToBeBetter/comments/gh256b/an_essay_on_anxiety_and_our_inability_to_act/", "nsfw": false, "first_save": 1635436382.914381, "replies_charged": false}