{"id": "t5_2tand_t3_l4vmeo", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I tried various productivity apps with some success but I stopped using each of them eventually because I felt they didnt stand up to my expectations.\n\nMost of them are predicated on pretty detailed long-term planning and creating macro plan - yearly for example and then dividing it into smaller, more detailed plans like monthly and weekly eventually stopping at Daily.\n\nWhile it might be great for people working on \"serious\" projects like planning their studies might benefit from that but the nature of my goals is different and in my opinion this Type of planning hinders my progress.\n\nYou See i have problems reconciling my busy work schedule, romantic relationship and finding free Time to develop my hobbies. Moreover I want to work on my free Time quality - usually I Just rest and do nothing. \n\nYou See, my goals are of different nature: they are not So predictable when it comes to possibilities and outcomes at a given moment. Its more beneficial for me to concentrate on the process instead. I Will show it on examples.\n\n\nOne of the areas i want to improve in is relationship with my dog - be it caring about her health, teaching New tricks or taking for AN amazing walk. Every day i want to devote some time to make my dogs Day amazing.\n\n\nDeadlines and concrete, measurable goals wouldnt work here. I cannot make monthly goal of teaching a given tricks as it not only depends on my efforts but also on my dog. It would hinder my motivation if i didnt achieve my goal despite efforts. I would rather concentrate on putting effort itself. Also if my Daily goal is to train for 15 minutes but my dog is ill then i would rather care for my dog in a different way f.e. By going to vet instead of forcing training. There could be more example but you get the idea - i Just need to be flexible. \n\n\nAnother area i want to improve in is my writing. I write and translate articles as well as study different topics by Reading books and articles. Likewise i dont See myself as AN article factory. I cant predict how many articles i must write and what are they about. My sample goal would be to do something for my article writing each Day - like Reading a chapter from the book or writing 3 paragraphs of the article. It depends on the specific situation and cant be predicted on macro level. \n\n\n\nSo the General character of the app should be like this: more concentrated on improving in various areas every Day taking into consideration that these goals might be situation-based and changing quickly. Longer term planning should be included (like write this article until the end of the month) but the whole system shouldnt be predicated on Such macro planning and it should be optional - included “Just in case” its needed. \n\nIt could also serve me as a Journal of sorts where i could track things like mood possible or Note events alongside what i have improved on in my selected areas. This paragraph might seem short but it cant be overstated. \n\nAre there any apps that could be helpful in my specific situation?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l4vmeo/any_app_that_is_not_predicated_on_strict/", "title": "Any app that is not predicated on strict goal-setting and long term planning but is more \"here and now\" oriented and based on improving in selected areas every Day.", "social_network": "reddit", "user": "jqwifbqpvzfjaxocc", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1611603569, "permalink": "/r/DecidingToBeBetter/comments/l4vmeo/any_app_that_is_not_predicated_on_strict/", "nsfw": false, "first_save": 1635435475.4225318, "replies_charged": false}