{"id": "t5_2tand_t3_kr9ao0", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Sorry for the extremely difficult to answer question but this has been bugging me for years at this stage and anything I've done isn't changing things.\n\nI'm extremely blessed in my life, I have a wonderful wife that challenges me and an exhausting daughter that I'm a little worried will become the future dictator of the planet but also amazed by her. I have loving parents who did their best, I am good at social interactions, have a number of friends (though don't see them much and need to develop closer ties), I have created solid savings so our family are safe financially, I have a stable job and I'm toward the top of my field, though this purpose thing has me questioning if I need to make changes to my career choice or chosen domain. I've volunteered, donated what seemed like large sums of money to me\n\nIn most realms of my life, I at least know what to do i.e. exercise, I might fail to do it but I know what is needed, same with nutrition, improving my relationships, mediation etc\n\nThe one thing that troubles me is that I have no sense of purpose, I feel like I've everything except this and I've been trying to figure things out on this front for years or even just reframe this so it causes me less turmoil and anxiety. I've read a ton of books on the subject and it just feels like the answers are so vague and unclear. There's not even any tangible things you can do it seems other than try everything and see what lights your spark\n\nThere's no way I'm the only person on this planet that has been or is in this position so I'm curious if anyone else has found success in changing this, even if it's just a mental shift.\n\nI'm not unhappy, perhaps slightly discontent, I feel like our life is very busy, I'm trying to stop loads of spinning plates from dropping but I don't FEEL a strong why for it all. Family is easy but work just seems to be for money and I feel like I need it to be more. Hobbies, volunteering etc don't seem to fill this void. Worth mentioning I have tried 3 therapists at this point, had nice chats but haven't found it useful.\n\nMain suggestions from the therapists are to try and relax, create time and things will magically come in to place. Again, this doesn't feel right to me and the framing hasn't helped relax/accept", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kr9ao0/how_do_you_find_or_create_a_sense_of_purpose_in/", "title": "How do you find or create a sense of purpose in your life?", "social_network": "reddit", "user": "FIthrowitaway9", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1609885020, "permalink": "/r/DecidingToBeBetter/comments/kr9ao0/how_do_you_find_or_create_a_sense_of_purpose_in/", "nsfw": false, "first_save": 1635435589.0858176, "replies_charged": false}