{"id": "t5_2tand_t3_kv6dkw", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "*My decision to be better:* **stop** all that envy and greed, and **start** appreciating what I've got.\n\nThese days it's very easy to feel bad about yourself. Just join a social media site and have a look - you'll soon find that you are not having the holidays you deserve, the body you're working for, the photogenic family you love, the stuff you need to make you happy.\n\nBut I've always been an olympic-level envious person. I really can't see someone else have something without wanting it. Don't invite me to your lovely house, don't talk to me about your lovely job, don't eat ice cream in front of me.\n\nAt least, that's how I used to be.\n\nNot too long ago I came to a sudden realisation - I have so much wealth, it's just not financial.\n\nI have time to read, I have great weather where I live (that was a deliberate choice), I have two daughters that I can make laugh any time I want.\n\nNo, I can't afford going to a Michelin-star restaurant, but I can order a meal in a cuisine from virtually anywhere in the world.\n\nNo, I can't afford a decent car, but cycling to work is healthier and more energizing anyway.\n\nMy self-improvement journey has led me to find on a daily basis what 'riches' I do own, cultivating ability to feel wonder for things others take for granted. \n\nThere are so many things that are available for us for free, or for very cheap, that we simply ignore or don't pay enough attention to, because of our race towards that 'new shiny thing'.\n\n**What makes YOU rich?**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kv6dkw/how_to_not_be_rich_my_decision_to_be_better/", "title": "How to (not) be RICH 💸 - my decision to be better", "social_network": "reddit", "user": "saarshai", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1610383404, "permalink": "/r/DecidingToBeBetter/comments/kv6dkw/how_to_not_be_rich_my_decision_to_be_better/", "nsfw": false, "first_save": 1635437013.3038785, "replies_charged": false}