{"id": "t5_2tand_t3_fbt0cr", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "My biggest issue is I have limited social skills due to a pretty isolated life during my 20’s after I left a retail job, I just didn’t interact with people I hadn’t known for years so don’t make small talk well. With people you’ve known for years there is always something I found to ask “how’s your gran” etc if I needed a topic.\n\nThe result is if I meet new people I tend to keep quiet or am blunt, to the point which makes people uncomfortable. I’d say I’m at the point I’m borderline socially anxious, as if I’m forced to talk to people for something other then work I’ll beat myself up for hours or days afterwards that I came off as weird, boring, annoying, big headed etc etc.\n\nI want to stop beating myself up, I want to feel able to talk to people and leave a neutral, if not positive impression afterwards. \n\nCan anyone recommend books or videos which covers making small talk with strangers, or at least coping with the need to kick yourself in the arse after every little interaction??\n\nI’ve tried Dale Carnghes how to make friends book and didn’t find it very helpful.\n\nEdit : just wanted to say a big thank you to everyone who’s offered their advice on this!!! When I posted I was hoping for a couple people to give up their time to offer some advice, so I’m totally blown away by the number of people who’ve offered some advice. Thank you so much!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fbt0cr/any_books_people_can_recommend_for_just_improving/", "title": "Any books people can recommend for just improving social skills so I can talk to people and not beat myself up about it’s for days after.", "social_network": "reddit", "user": "Drakan7", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 535, "down_vote": 0, "creation": 1583063367, "permalink": "/r/DecidingToBeBetter/comments/fbt0cr/any_books_people_can_recommend_for_just_improving/", "nsfw": false, "first_save": 1635438200.59966, "replies_charged": false}