{"id": "t5_2tand_t3_au1oe1", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Hi throwaway account here as I'm a bit embarrassed by how I'm struggling with life at the moment.\n\nFor the past while (can't quite put a finger on when or why it started) I have felt like I've lost control of all aspects of my life. \n\n* Housework is never done beyond laundry so that I have clean clothes\n* I rarely make dinner and rely on my partner to cook or have takeaway or unhealthy ready meals/ oven meals\n* I am eating a lot of junk food through comfort and boredom eating and it's become a habit for me - in the evening I expect to have some chocolate/ice cream etc\n* I'm not exercising as much as I'd like including walking my dog which makes me feel awful\n* I'm not taking care of myself as much as I should, just do minimum required effort for hygiene and grooming\n* Feeling tired, wanting to sleep in for longer in the mornings and also napping during the late afternoon\n* I feel so guilty for not getting things done so I don't really relax anymore through hobbies like reading, crafts etc and end up defaulting to social media or tv which isn't helpful\n* I'm not budgeting well or keeping track of things that need done whereas in the past I was always on top of this\n* If something isn't written down I will forget about it, if I swipe away a notification I will forget to respond\n* I am never early to anything anymore, I will leave it as long as possible until I can just about make it when leaving the house, frequently I will run late and just move work around to make it fit my lateness (have ability to work somewhat flexibly) \n* I frequently let people down by promising them to have something done by a certain time or reply to them soon but then miss those \"deadlines\"\n* I'm not doing the best I can do at work and sometimes feel that I'm not very good at my work\n\n&#x200B;\n\nI know this probably reads as being depressed but I have had depression in the past and this doesn't feel the same, or maybe I'm just kidding myself? I don't feel sad or indifferent about my life, I have quite a lot of passion for different things and want to do better but really struggling with energy levels and motivation. I get fired up and excited thinking about getting home from work or the weekend but once that comes I am tired and can't follow through on my plans. I feel like I have a huge hurdle to overcome and I don't know how to start making improvements or have a balance in my life. \n\n&#x200B;\n\nLast year was hugely stressful for me for several different reasons but it seemed to keep me going as there was no choice but to just keep moving and keep my head above, now that things have settled down I seem to have lost all motivation and feel like I've become really complacent which makes me feel really guilty. And also guilt about how this is a first world problem as I have a house, good partner, decent health considering my lifestyle and while we aren't well off by any stretch of the imagination we live happily within our means. But I do worry about  wasting my time living a sub standard life and not feeling totally fulfilled and content.\n\n&#x200B;\n\nApologies for the rambling but I guess I'm looking for help on how to start making improvements with motivation and energy facing everyday life when it gets too much. And maybe some advice on better tools for keeping track of things, accountability etc. Or even reassurance that other people find everyday tasks difficult to balance every now and then as sometimes it appears everyone else you know has their life all figured out and can do it all.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/au1oe1/struggling_with_energy_and_motivation_wanting_to/", "title": "Struggling with energy and motivation, wanting to have a more productive life", "social_network": "reddit", "user": "VariousAnybody6", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1550965248, "permalink": "/r/DecidingToBeBetter/comments/au1oe1/struggling_with_energy_and_motivation_wanting_to/", "nsfw": false, "first_save": 1635436078.1647766, "replies_charged": false}