{"id": "t5_2tand_t3_3ze8fc", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I know very little about this sub-reddit so bear with me.... The following is a letter to myself. It's the first time I've written my problems down.\n\nI want to describe what I want to change: Deep inside, I know all of the cigarettes, adderall, drinking, lack of exercise and pot smoking are wrecking havoc on my ability to be the person I want to be. Physically, and mentally. I have also been procrastinating work that will cost me thousands of dollars in revenue and possibly the progress of my career. I want to be someone that has pride, is precise, and confident in what he does. The exact opposite is true... in fact, I'm doing half a week worth of work all tonight. In this state. \n\nI had been in an abusive relationship for 2 years. It feels like the thoughts surrounding it have taken over half my consciousness. I get into crippling bouts of anxiety and depression when I think about it. I can't stop thinking about the hurt we've caused each other. A small part of me believes we'll make it work together again someday that never goes away.\n\nAfter writing this, I know I'm going to watch porn, take a shower, and then finish the work I NEED to do and present it. When I'm done, I will dedicate the rest of tomorrow (Monday) into taking real steps to move away from all of these nasty habits and stop riding this insane, repetitive, metaphorical  racetrack loop that never ends. If I don't, I might lose my life.\n\nIf anyone has gone through what I'm going through and found a way out of it... I'd really like some help. Some guidance or suggestions on how to proceed. If it can really help me, I will definitely send reddit currency on your way. I'm very desperate.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3ze8fc/im_paranoid_insecure_full_of_bad_habits_and/", "title": "I'm paranoid, insecure, full of bad habits, and feeling and probably acting like an insane person. I want to start beneficial progress that's scientifically backed.", "social_network": "reddit", "user": "mikansan", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 27, "down_vote": 0, "creation": 1451902171, "permalink": "/r/DecidingToBeBetter/comments/3ze8fc/im_paranoid_insecure_full_of_bad_habits_and/", "nsfw": false, "first_save": 1635435442.764423, "replies_charged": false}