{"id": "t5_2tand_t3_q5yua4", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "If you want to read my previous post [here it is.](https://www.reddit.com/r/DecidingToBeBetter/comments/px3pjw/24_soon_to_be_25_and_i_feel_completely_lost/?utm_source=share&utm_medium=web2x&context=3)\n\nI've struggled with sort of procrastinating life. I have a job that pays fine, I live with my parents at 24 years old, and I really have no career path in front of me. Tbh even if I made $100,000 per year I would probably still live with my parents as of right now since the economy is so unstable, so living with my parents is that big of a deal. \n\nBut I've decided to take action. I've decided that instead of endlessly pondering careers, I'm going to take action. If you read my last post, you know that I do have a degree in Psychology. I decided that I'm going to lay out two paths in front of me:\n\n1. Starting today, I enrolled in a Computer Science program at my local Junior College and for now I am going to work on skills to potentially become a software engineer or programmer.\n2. I will be applying for my masters degree, in an unrelated field to Programming (School Psychology), I work as a substitute right now and I enjoy working in schools but I do not want to become a teacher. I have worked with resource teachers and Psychologist before and I enjoy it.\n\nI am doing these two things with one goal in mind: to be a different place 1 year from now than I am right now. By October 2022, at the age of 25, I want to be in a place making more money and doing something that has a future for me. \n\nI took a lot of time to think about this because I did not want to set goals that were overly ambitious and I wanted to be sure that they were obtainable. The reason I am actively working towards computer programming is because it's something I know I enjoy and I know I can obtain. I am passively working towards School Psychology because it is something I know I would enjoy and can obtain. Both of these careers are very different, but both are promising and rewarding. I am not using either one as a \"back-up\" but rather I am just casting a wider net.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5yua4/today_i_am_deciding_to_be_better/", "title": "Today I am deciding to be better", "social_network": "reddit", "user": "iwillgeta168", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1633967495, "permalink": "/r/DecidingToBeBetter/comments/q5yua4/today_i_am_deciding_to_be_better/", "nsfw": false, "first_save": 1635438211.2167466, "replies_charged": false}