{"id": "t5_2tand_t3_hoh0nw", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I used to think I was a victim of life. Everything bad happened to me. My dad died right before my 5th birthday. My mom was full of unresolved things and super angry for most of my childhood. People left me always, by death and by choice since I was young. Being adopted has its own abandonment issues even though I was very fortunate and had a blessed upbringing that i never would’ve had. My second dad died 6 days before my 29th birthday last year. I can go on and on. \n\nAfter living in a victim mindset and being miserable for most of my life through constant self-sabotaging, cheating, and lying, I finally understood that I had to change what I did and how I did it. I could no longer hold onto old stories. I could choose to grow from my experiences and choose another way to live. And it was all up to me. \n\nAlthough digging deep into my past experiences, healing old hurts, fixing old belief patterns, and changing habitual behaviors that were toxic hasn’t always been easy- it’s always been worth it. I finally can have compassion for my past even though I did some things I know were terrible. Hurt people hurt people. Unaware people cause a lot of damage. \n\nI am now aware and I can forgive myself for not knowing better in the past but striving to learn each day and move forward. I can take steps each day that fill me up instead of tearing me (and others) down. \n\nI know I can’t control everything but I can control what I do and how I do it as long as I am aware of my intentions and take action that serves my highest good. \n\nMy life is entirely different than it once was. I’m no longer depressed or so anxious I can’t leave the house. I’m no longer paralyzed by fear. I’m not in toxic relationships because I no longer invite those experiences. My life is mine. \n\nI wanted to share this with anyone who might feel lost or that life hasn’t gone your way. You have so much power over your experience. We can’t control what happens but we can control how we respond, and through that we truly can transform what we encounter. I am manifesting really beautiful things and it’s not because I’m “lucky” but because I’m putting in the work and learning each day. \n\nI heard this quote from a class I’m taking “I use my memories but I don’t let them use me.” I resonated so much with it because it put into words how I’ve been living recently. I’m not attaching to the things that have happened or the things I’ve done, but bringing them forward to change how I respond in the present moment. It’s a beautiful thing and I know everyone is capable of doing it. \n\nSending you all love.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hoh0nw/i_finally_feel_like_i_am_the_creator_of_my/", "title": "I finally feel like I am the creator of my experience. And you can be the creator of yours too.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 50, "down_vote": 0, "creation": 1594349133, "permalink": "/r/DecidingToBeBetter/comments/hoh0nw/i_finally_feel_like_i_am_the_creator_of_my/", "nsfw": false, "first_save": 1635436634.7229311, "replies_charged": false}