{"id": "t5_2tand_t3_pcyyap", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db", "e234981c-b061-4d83-8134-70d441847f74", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "TW: pet death + possible neglect, SA, DA\n\nThis story, I didn't know where else to post it, but it has been on my mind lately and coincidentally, my Facebook memories informed me that 9 years ago today, I put down my childhood dog. This is a very vulnerable post, but it's also a post about reflection and progress. Here is my story. \n\nMy childhood dog was not originally my dog. She was my babysitters dog who I instantly connected to. I was in elementary school when I met her. She was already about 4 years old. Her name was Rudy. She was a corgi shepherd mix and looked like a keg on stubby legs. I would spend all my hours with her. Until, we were told that she had bit a neighbors kid and she would be put down if they couldn't rehome her. My grandparents don't like dogs, but I begged and pleaded and they gave in. Let me tell you that Rudy had never once in my years knowing her had ever bit ANYBODY including children since her home was full of them. Rudy came home with us as I crested the line into middle school. \n\nBy all intents and purposes, Rudy was the perfect dog. She was low maintenance and was happy for her personal \"bedroom\" in the garage with access to the yard. Sometimes, we would let her come inside during heavy storms which were rare. She was an outside dog who loved hunting rats, drowning gophers in our pool, and hanging out with my grandfather when he gardened or worked on the cars. Once, she crawled under the car to be next to grandpa and we had to jack the car up because her sausage body got stuck. \n\nWhen I got into high school, things turned turbulent due to my mother abandoning me, my first suicide attempt, medical and psychological neglect, and multiple undiagnosed disorders. 2010 came and it was a traumatic year where my fiance and grandfather were both murdered and I became addicted to drugs. Rudy, unfortunately, suffered the most, I think. She lost both myself and my grandfather in one go. By this time, she was already a senior. \n\nI hate how little time I spent with her. How many times I had to cut out her dew claws from her paw pads because nobody trimmed them. I hate how little interaction she got. I hate that she was right outside and I was too fucked up to care. \n\n9 years ago put me at 19 years old. I remember that day like it was yesterday. I went outside and there was blood EVERYWHERE. Not just spots but giant pools. Rudy was bleeding but I didn't know why. I forced my grandmother awake and we drove her to the vet. That day, they told me that that keg belly? Was actually a giant tumor. Probably cancerous. Due to her extremely old age and the severity of the case, they told me that there wasn't anything that they could do. That I could bring her home for everyone to say goodbye. I refused. I said I wouldn't allow her to hurt any more. I chose to euthanize my girl that day. I was 19 years old but had never gone through euthanasia. At first, I said I couldn't be there for it. But, she had nobody else and.. I couldn't leave her again. So, I stayed. I held her and kissed her and told her how much I loved her and how sorry I was. When she was gone, I slid to the floor and I screamed and sobbed and didn't know how to handle it. I walked out and my grandma asked where she was. I said in heaven. That was the first time I saw my grandmother show any emotion towards Rudy. She cried with me.\n\n8 years ago, I went through a breakup that changed my life. It propelled me into going through the process of getting myself medicated and properly diagnosed and helped for my mental illnesses. I started therapy, medications, seeing specialists. I worked hard. Most of the time, I didn't think I'd make it. I took the gene sight test to see what medications would work with me. I found out that every antidepressant in all 3 categories that they use would not help. It didn't stop me from trying though. I have tried every SSRI, SSNI, triglycic, and atypical out there. I found out I have an extremely complicated set of mental illnesses and am considered both therapy and med resistant. I had extreme allergic reactions to mood stabilizers and antipsychotics. In 8 years, my chart shows that I have been considered truly stable for 4 months (not together). But..\n\nIn November of 2018, something happened that changed my life (TDLR - rape/sodomy, assault, and murder attempt)  and in December of that year, a service dog was brought up. 12/12/18, I adopted Odin. This is where everything changed.\n\nBy February of 2019, my manic episode caused me to have a full mental breakdown and psychotic episode. I lost everything. Friends, my job, my mind. But, I had Odin. And when I tell you that this dog is treated better than most people are, I'm not lying.\n\nHe never misses a 6 month check up, refill on flea/tick and heartworm preventative. He's never lapsed on his vaccines. I learned how to groom and Dremel his nails. I learned how to massage him.. He is exercised, intellectually challenged, and trained every day. I built him his own custom bed. I make gourmet treats and cakes for his birthdays and achievements. He has more friends than I do and gets more presents and cards than I do. Between my now physical disabilities and my psychiatric ones, I would always tell myself that I couldn't die until I knew someone would take him when I passed that would love him like I do. That's a really high bar to set, but if you met this dog, you'd think it would be impossible not to find someone. I do have two different people who I have selected in that event. \n\nSo, as I sit here and think about all the things that have happened to me in the last decade. In the last 3 years. I can only hope that.. Rudy can forgive me for not being the owner that I should have been to her. I hope she knows she was loved. I hope she knows that she changed my life.\n\nI hope that the changes I've made are enough.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pcyyap/today_is_9_years_since_i_had_to_put_my_childhood/", "title": "Today is 9 years since I had to put my childhood dog down. 3 years ago in December, I got my own dog. I hope that my old dog forgives me for being a bad dog owner then.", "social_network": "reddit", "user": "ohhoneyno_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1630107899, "permalink": "/r/DecidingToBeBetter/comments/pcyyap/today_is_9_years_since_i_had_to_put_my_childhood/", "nsfw": false, "first_save": 1635437159.037596, "replies_charged": false}