{"id": "t5_2tand_t3_lwu3cj", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924", "883794f3-030f-4844-8950-6e28281dfa3f", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8", "f48bf32c-05af-4e9d-b00f-8b45a75af78f", "73f5fcd2-0821-49d5-9185-6c084ed10d0f", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": ">It´s actually quite ironic.\n\nBinge-drinking, doing drugs and raving with your friends doesn´t seem like something that would make you a better person. But as time has gone by since that experience, I´ve actually realized that that experience was the starting point of a total personality makeover for me. Let me explain.\n\nIt was the summer of 2019. The weather was absolutely perfect and we were having “the yearly trip”, a yearly mini-vacation that me and my buddies take to catch up with each other. We were camping on the festival grounds to be surrounded by 24/7 partying and to be fully immersed in the festival experience and the vibe was a solid 9.7 out of 10. But things were about to get worse.\n\nIt was day 2 of the festival and we were ready to see Swedish House Mafia with the companionship of a little chemical substance. One of my more experienced buddies had taken it upon himself to do the drug prepping ahead of the festival, so he had already carefully measured the correct amount of MDMA in to small digestible bags and we ingested them around 1.5 hours before the concert and we were all ready to go.\n\n# Bliss at the festival\n\nThe walk from the camp to the festival takes around 45 mins and that is just enough time for the drugs to start kicking in. Upon festival entrance, we were feeling the bliss and we were ready for the concerts to start playing. One of the first things we did was to stand in a long line to get some sweet Smirnoff Ice and cider, before we headed towards one of the scenes to wait for the first act. Thats when things start to happen.\n\nA very serious looking guy comes over to us and in a very weirdly way starts looking at us deep in our eyes and asks *“wheres the beef at, boys?”*, to which my buddy starts answering in a friendly way back. The whole thing seemed so off that the first thought to enter my mind was “this guy must be an undercover cop trying to see if we have taken any drugs” — so I jolted out of there.\n\nI walked away fast and looked back at them multiple times as I was walking, to see if anything was happening. And in my mind, the situation looked serious. I started roaming around the festival thinking “we´re fucking caught, we´re fucking caught”, in desperate paranoia and frantically calling my girlfriend to tell her the news. When all of a sudden one of my friends call me. “Shit, now the cops are getting my buddies to call me to get me back”, I think. He asks me “Where are you? The show is starting!” Damn, I was just being paranoid. There are no cops after us. I take a deep breath in knowing that everything is fine, for now.\n\n# Over the fences we go\n\nFast forward a few hours, we´re back at the camp after watching some great concerts and having a great time. I was happily relaxed on a come-down from the drugs and we gathered around a Soundboks speaker, listening to trippy music and enjoying the moment. One of my buddies suggest that before we call it a night, we all go to the parking lot and smoke a joint. Sounds like a brilliant idea, but it wasn´t allowed to go there at night, so we had to jump the fences to actually get to the parking lot. And that was completely problem-free on the way over there, since the guards are not paying attention on who is “sneaking out”, only on who is “sneaking in”.\n\nAfter passing the joint around a few times, allowing me to get a good 6–7 drags out of it, we are ready to sneak back in to the camp. But this is where we need to be smart, we need to sneak back in without any guards seeing us. And that can be a bit tricky in a dark camp, where the only thing thats lit up is the fences. But we figure out a plan where we wait in the bushes to observe where the roaming guards are walking, and then strike in a “blind spot” where the guards have just passed, allowing us a few minutes to jump the fences. Here we go.\n\n# Severely reduced senses from all the substances\n\nAfter drinking all day, doing a good amount of MDMA and now with weed in our systems. Our senses were severely handicapped. I remember not being able to think straight at all, and just following along with what the group did. Suddenly, we were jumping the fence! And while I was climbing over, I hear a “HEY!!! STOP THAT RIGHT NOW!!” which causes me to panick and jump back and run straight back to the parking lot again. While I am running, I can hear somebody is running behind me and I immediately know that this is a security guard that is out to catch me.\n\nI run as fast as I can! Out in to a farm field, becoming soaking wet in the process because I was knee deep in whatever the farm is farming. But I can't stop, I can still hear the guard chasing me. So I go in to full survival mode and I run faster than I have ever done, in what feels like warp-mode speed that results in me shaking off the security guard and ending up alone in a tree. I wait in the tree for around 15 mins before thinking its safe again.\n\nI start walking back and the plan is to pretend that I am a lost festival-goer, that doesn´t know how to get to the camp. I have the whole conversation planned out in my head in case I get seen. While walking back to the camp, I bump into two of my buddies who are also hiding. I tell them how I ran into a field because a guard was chasing me and how I ended up hiding in a tree. They laugh and tell me that they didn´t know we were being chased. We? What do you mean we?\n\nTurns out we were all running together. And the security guard that was chasing me? That was just one of my buddies running behind me. So it turns out that so far, I have been tricked twice by my paranoia into thinking that someone was after me. Thats not like me. I usually am a little paranoid when doing stuff, but never as much as this. And that was just the beginning.\n\n# Post-festival (Hello, Anxiety!)\n\nWhen I return back home after the festival, that paranoid feeling is still there. I´m overthinking and freaking out about everything in life. I have multiple panic attacks every day. I fear I´m becoming one of those people that looses their mind from doing drugs. I see myself becoming a poster boy for not doing MDMA: “A friend of a friend of mine once did this drug at a festival and became insane”. Days and then weeks went by, without the anxiety stopping. That´s when I knew I had to do something.\n\nI started researching what I was experiencing. And turns out I was most likely lacking the happy-chemical serotonin in my brain after all that alcohol, drugs and anxiousness. When you´re lacking serotonin, you get anxious. This is what happens when you´re depressed, either chemically, from bad choices or just from living a boring life: Your brain is lacking the happy chemicals, and there are ways and techniques to get your body to produce the, So I figured I had to get my body to start producing them again, and thats when I made a challenge to myself.\n\n# For 90 days, I would only do stuff that was good for my mental health.\n\nNo alcohol. A lot of water. Start to meditate. Exercising. Healthy diet. Journalling. No junk food. Focused work. Being around people I love. Fixing my finances. When I first started planning the challenge, it seemed like too many things to implement at once. Thats why I created a system for maximum chance of succeeding.\n\nI would implement one healthy habit a week. On week 1, I would stop drinking. On week 2, I would start tracking my water intake. On week 3, I would start meditating. So after 90 days, I would have completely changed who I am as a person. And thats exactly what happened, let me tell you how.\n\nThe me before the festival was out of shape. With crippling anxiety all the time. Drinking way too much. Not eating healthy. Finances not in order. Having trouble sleeping. Irritable and not very likable. I was a mess. And my self-image suffered extremely because of it. To like or love yourself, you need to be a person you respect. But thats not me after the challenge.\n\n# The 90-day challenge changed me forever\n\nThe me after the challenge is in shape. The anxiety has melted away. I am in control of my drinking(I rarely drink now). I eat very healthy(I still enjoy myself). My finances are very much in order(6-month cash reserve). I have rejuvinating sleep(wake up feeling refreshed every day). I´m rarely irritated and I feel that people like me 10 times more because of my high-energy being.\n\nI´ve completely transformed from being semi-disgusted with myself into a person I genuinely look up to. In only 90 days. And it didn´t feel like much work, because of the system I used. **If you´re not happy with where you are in life, I want you to consider doing a 90-day challenge as well. One new healthy habit a week, and I promise you that you will walk out on the other side of it as a completely new person.**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lwu3cj/how_a_mdmainfused_festival_experience_catapulted/", "title": "How A MDMA-Infused Festival Experience Catapulted Me Into Physical, Mental & Financial Well-Being", "social_network": "reddit", "user": "Gunhoo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 80, "down_vote": 0, "creation": 1614778780, "permalink": "/r/DecidingToBeBetter/comments/lwu3cj/how_a_mdmainfused_festival_experience_catapulted/", "nsfw": false, "first_save": 1635435619.3036473, "replies_charged": false}