{"id": "t5_2tand_t3_qevgo0", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "The last few weeks I've been trying to \"get my life together\". I know that life isn't perfect and I can't be perfect either but man.... this is hard. I quit my 9-5 office job after being mistreated by the company for 3 years. I haven't had a job since this past August. I've been spending this time taking care of myself and mental health. My mom also passed away last year and I've also been trying to heal from that. I have a lot of stress and a lot of anxiety that I am working through currently. \n\nLately I've been finding myself going on all of the girls' instagrams, tik toks, etc who I used to go to high school with. It's been 6 years since I graduated high school and it just seems like everyone else is doing so much better. They look beautiful, they workout, have lost weight, go out all the time. Basically everything that I'm not and I hate that I'm comparing myself to them. \n\nI had a bad experience my last two years in high school and ever since then I've maybe kept 2 friends (that I never see). I have a boyfriend who I've been with for 5 years and our relationship is great. I just feel like I'm missing something.. \n\nI want to workout, I want to be healthy, I want to make friends and hang out with them regularly, I want to go to different places. I want to have fun again. I feel stuck right now. I haven't done anything in the last 6 years. The thing is is that I've let my anxiety take over my life to the point where I don't go out alone because im scared, the gym scares me, people even scare me. How can I start to let go and start taking control of my life? I don't know where to start and I'd like to not be motivated by the comparison of myself and these other girls. I guess im just venting but any advice is very much appreciated ...", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qevgo0/comparing_myself_and_my_life_to_others_feeling/", "title": "Comparing myself and my life to others... Feeling pretty down about it.", "social_network": "reddit", "user": "lolllnic", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1635092580, "permalink": "/r/DecidingToBeBetter/comments/qevgo0/comparing_myself_and_my_life_to_others_feeling/", "nsfw": false, "first_save": 1635435343.8564057, "replies_charged": false}