{"id": "t5_2tand_t3_83nsul", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "**1. Build your self esteem**\n\nSelf-esteem is an indispensable component of a positive attitude. Why? Because positivity is based on a productive outlook towards life, where as low self-esteem will cause you to constantly criticize yourself, which is totally the opposite of what we’re trying to do here, that’s why you have to build a strong sense of self-esteem first, so you can be happy and comfortable with yourself. This will help you a great deal in developing a positive perspective.\nAnother reason why you need to grow your self esteem is that you’ll encounter a lot of challenges and difficulties on your way to building positivity. Having a fragile self-esteem will make it almost impossible for you to go on, because you’ll be too eager to blame yourself instead of doing the opposite.\n\nTo Do : read the six pillars of self-esteem.\n\n**2. Stop being a victim**\n\nOne of the reasons people adopt a negative attitude is because they always see themselves as a victim of their circumstances. While some aspects of life are out of your control, a large portion can be changed by your actions and decisions, so stop blaming life, and start taking responsibility for your actions.\nLet’s take a real life example : let’s say you were a regular college student, then got a 9 to 5 job. But the thing is you’re not quite happy with the outcome, so you start blaming the economy, your boss, maybe the college you were in…etc. The list is endless, but the fact is that it was your decision that caused you to work on a that job. The whole scenario would have changed if you decided to do something different with your life, by taking a different decision, so how can you blame the situation that you’re in, when you were the one who chose it in the first place?\nDon’t get me wrong, I’m not saying that you’re responsible for every single thing that’s happening, but the fact is you’re responsible for a large part of the situation that you’re living right now.\nTo sum it up, you have to stop looking for someone to blame, instead take control of your life, and work to improve it.​\n\nTo Do : stop complaining.\n\n**3. Find an objective that you want to achieve**\n\nThis is as true for positivity, as it is true for success in general. You need to have a goal, something to strive for, to fight for, something that you really want to achieve. This will help you because having some kind of target will generate willpower, which in it’s turn, will help you to stay on track, because once you decide that you want to attain a certain objective, and you stick with it, it’s really hard to give it up.\n\nTo Do : find a purpose.\n\n**4. Find some inspiration**\n\nIn order to gain long lasting positive outlook, you’ll need more than willpower and conscious effort alone, that’s where inspiration comes in. Inspiration means feeling something that your words can’t really describe, but you feel like you can do absolutely anything you want, and no one can stop you.\nIf you want to gain inspiration, success stories are an excellent way to do so. There are so many examples of people who challenged the world around them, and eventually managed to succeed against all odds.\nRead as many success stories as you can, you’ll start to notice something common between all of those achievers, it’s that they weren’t blaming anyone, they decided to take action instead, because constantly criticizing never solved anything, but also because they knew that the way they think can change the outcome that they get.\nEven fiction can work as a source of inspiration. Having someone that you can look up to will help you to be more positive, that’s the idea\n\nTo Do : Read success stories\n\n**5. Stay away from negative influences**\n\nWhether it’s some place where you feel uncomfortable, or people that are too depressed, make sure you stay away from these negative factors, because trying to become positive under these situations is an uphill battle really.\nThe next thing you should watch out for is surprisingly watching the news everyday, because news have been related with feeling negativity, because of the constant flow of negative information that’s broadcasted.\nThe main idea is to distance yourself from anything that makes you feel depressed and helpless.\n\nTo Do : Eliminate any negative influences in your life\n\n**6. Recognize the difference between realistic and pessimistic**\n\nWhen first trying to become more positive, you’ll encounter a lot of resistance from nearly everything and everyone, we warned you earlier. However, a lot of people will try to convince you to be more ‘realistic’, when in fact, it’s just an excuse to justify their inaction.\nYou should avoid falling in this trap at all cost. Here’s the difference between realistic and negative : realistic is based on what people think they can achieve, what seems reasonable. Negative means thinking that you can’t do something that’s realistic, in other words realistic, a realistic attitude offers more possibilities than a negative one, yet it shuts a lot of possibilities that are still attainable.\nThe problem is that a lot of people tell you to be realistic, when they really want you to be pessimistic, simply because they don’t realize their true potential, and that’s not wishful thinking, it’s a proven fact from thousands of success stories around the world. What most people don’t realize, is that this ‘realistic’ attitude isn’t based on what we can do, it’s based on what has been done before by others. So being realistic isn’t much helpful. I mean, what’s the point of doing what millions of people did before you? On the flip side, being positive is closer to reality, because it focuses on what you can do, instead of focusing on what seems ‘reasonable’ or ‘easy’. Bottom line, being positive allows you to reach your full potential, whereas being ‘realistic’ imposes self-limiting beliefs.\n\nTo Do : Don’t confuse being ‘realistic’ with being ‘pessimistic’\n\n**7. Start focusing on why you can**\n\nWe all tend to see the dark side of life, and while there’s one for sure, there’s also a positive one. We all have this big mental barrier that always stops us from seeing the good side of the situation, but at the same time we’re glad to complain about all the things that we don’t like. The really common misconsception here is that when you try to think of some reason why you can do something, it seems so far out of reach, it feels like you’re making stuff up, like all the ‘positive’ thinking is just an illusion, where in fact it isn’t. People always percieve being positive with wishful thinking, the difference is that a positive person knows what’s in his favor and what’s not, where wishful thinking is just plain imagination, there’s nor action involved.\nYou have to start thinking of all the reasons that make you capable of coping with life. Start saying I can do this because……I’m smart, I’m resourceful, I’m confident….etc. The thing is, you have a lot of qualities. Seriously, I’m not saying that just to make you feel better. You may not see them because maybe you’re always critizing yourself, maybe people always put you down or anything like that. The lesson to learn is this : you have to change the way you see the world, start evaluating what can help you, what are your strengths, what are your advantages, these are all reasons why you actually can achieve what you want in life, so go for it.\n\nTo do : look for the things in your favor\n\nThat’s it for positivity, I hope this helps you to dramatically change the way you think and approach life.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/83nsul/7_ways_to_develop_a_positive_attitude/", "title": "7 Ways To Develop A Positive Attitude", "social_network": "reddit", "user": "rafikGk21", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 200, "down_vote": 0, "creation": 1520786456, "permalink": "/r/DecidingToBeBetter/comments/83nsul/7_ways_to_develop_a_positive_attitude/", "nsfw": false, "first_save": 1635436534.668162, "replies_charged": false}