{"id": "t5_2tand_t3_qg29t7", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I know I've got a problem. I was always stopped by parents like don't go there, don't do that or that... I was pretty rude as a kid. Now, I run some businesses, focus on my career almost 100% when I'm 27 years old and I want to be financially free soon. I think my problem with life decisions is from me being financially smart. I build businesses, invest money, read about the economy, etc. I love that and have no problem with that aspect.\n\nI don't have any problems with making decisions on a business, career. I can have a job, be fired, no problem, I know that I will find a solution in any situation like that. I'm 100% safe and calm about career-related stuff.\n\n**The problem is** \\- I can't make life decisions. I have got a girlfriend for 4 years and I didn't propose to her. So, I've made a perspective to do this until the end of the year and told her about that. She is happy, but this is still very hard for me. I was buying the first glasses for a year. I decided to rebuild my teeth and buy braces in around 2 years... Ok, that was very expensive.\n\nSecond and the most actual. I always wanted a dog. The problem is I am renting a flat with my GF. I've made a mistake and go to a breeder to see dogs and I fell in love with one of them. My rational mind says \"don't get this dog until you have your own house/flat\" but it's very hard... My GF tells me I'm not decided on everything, I feel bad, etc. but I know I do the right thing. Her friends have everything - house, children but because they got that from their parents. I don't have that kind of support and have to do money on my own.\n\nOn the other hand, I know that if I do these things I will do what needs to be done. \n\nHow to work on that? I piss me off and I sometimes feel like a pussy... I know that I do the right things but I see these spontaneous people who don't care about money, place to live, future, etc. and I also feel like something is missing.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qg29t7/how_do_make_important_life_decisions_easier_ive/", "title": "How do make important life decisions easier? I've got a big problem with that and I feel that something is missing in my life.", "social_network": "reddit", "user": "iamzamek", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1635238820, "permalink": "/r/DecidingToBeBetter/comments/qg29t7/how_do_make_important_life_decisions_easier_ive/", "nsfw": false, "first_save": 1635435769.2280824, "replies_charged": false}