{"id": "t5_2tand_t3_nm725z", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "I'm 21. I had a really rough patch going into college. Dropped out after 1st year and didn't tell my parents. They think I'm about to finish my bachelor's but I stopped to help them with their lives. Mum has health issues and dad does too so I spend most of my time helping them. Covid stopped my shifts at work so my savings are mostly gone too. \n\nI'm at a crossroads. I need to start my life up again. I need to get help and I know I will. I have an amazing, supportive girlfriend and I need to be the mad she deserves. I need to get money again. I want to complete a bachelor's in psychology and a master's in teaching so that I can teach at a high school level. That's my dream. \n\nI need to ask tho: is this possible? Can I restart my adult life at 21? And how can I go about these changes? I need that push to get me going. I also have ADHD so staying on track is hard for me and I'm very impulsive. \n\nI know I need to do this but I just need to figure out how. I love you guys so much. Even if you can't help, I need you all to know that you're going great. You are on a path of self improvement and you are doing so well. Never ever stop because some day you will look back and thank yourself for sticking to your path. \n\nI love you all ❤️ stay blessed.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nm725z/i_need_to_get_my_life_back_on_track_i_dropped_out/", "title": "I need to get my life back on track. I dropped out of college, lost most of my savings and now need to start everything again.", "social_network": "reddit", "user": "no_koalification", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1622120880, "permalink": "/r/DecidingToBeBetter/comments/nm725z/i_need_to_get_my_life_back_on_track_i_dropped_out/", "nsfw": false, "first_save": 1635435554.8757584, "replies_charged": false}