{"id": "t5_2tand_t3_miiszu", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "March 14th, 2013\t\tAge: 24 years old.\n\"300 million years ago when everyone was a sponge I was still an asshole.\"  \n\nThis post popped up on my facebook timeline a couple of weeks ago and I must admit.... it still made me laugh.  The statement itself made me laugh and then I began to think about the gravity of the statement from the mindset I was experiencing at the time. \n\nI truly, honestly, 100% believed at this point in time that I was an asshole.  I was going through an extremely rough patch in my life, had just gotten out of a 4 year relationship w/ an awesome girl that had a young son that I'd been a part of his life for the bulk of his existence and I was really struggling with who or what exactly I was as a man on this earth.  During this patch of my life I started to let the outside noise from people that didn't even know me to cause a negative self perspective that i allowed to become my actual identity.  Not only did I think I was an asshole..... I embraced it.  I took it on to the point that I took pride in it.  I constantly remained open, honest, and kept my integrity however if there was something that needed to be said I did not sugar coat it, was often abrasive, and took to a negative attitude about it.  The truth of the matter was..... being an asshole made me feel comfortable.  I did not need to manage my emotions, I didn't have to put up with things I didn't want to put up with, and I was able to learn one HUGE EXTREMELY VALUABLE LESSON.  For the first time in my life I was starting to allow myself to become exactly who I wanted to be regardless of what other people thought about it.  Sure my tact and method was skewed BUT I began to take ownership and pride of EXACTLY who I was and what my beliefs were.  During this time of reflection I went on to figure out that me being an \"asshole\" was just my shield or safety net.  When I was uncomfortable, vulnerable, or feeling exposed I would throw the asshole shield in front of me and I could hide away from my emotions and shut everyone out.  It was my defense mechanism.  \n\nMarch 13, 2021     Age: 31 years old. \n\nOver the years (specifically in the last two). I started to understand that me being an \"asshole\" was actually one of my greatest strengths...... however in the past I did not understand that being an \"asshole\" meant that I was incapable of lying to anyone.  My number 1 rule in life is that no matter how badly it harms me or how much it would help me I will not lie to someone.  Take this back to 2013 and my truths were abrasive, harsh, jagged, and often hurtful.  This simply was because I was not quite a man yet (or what I classify as a man on a maturity scale).  My greatest gift was used with spite, anger, and harsh realities.  What I was lacking was tact on the presentation of the truths that I brought out.  When I was 23 years old I only really cared about myself, my emotions, my vulnerabilities, etc.  At 31 I now understand that all of the insecurities, inferiorities, and self doubt that I feel EVERYONE ELSE ALSO FEELS.  In my opinion the number 1 thing that people crave in life is simply VALIDATION & FEELING LIKE THEY MATTER.  So what does this have to do with being an asshole???  Well the asshole part only really becomes reality when you do not adequately take into account the feelings that the other party you are interacting with craves the most.  1. Feeling Validated. 2. Feeling like they matter.  If you empathize with the person you are having a disagreement with or try to think about the things going on in the interaction from the other persons point of view from an emotional level you are then able to share with that person the harsh truths in a non demeaning or destructive manner.  We have all heard the sayings \"It's not what you say... it's how you say it\" and \"treat others how you want to be treated.\"  Now extrapolate both of these statements into an interaction when you have something that needs to be said to someone else that may be perceived as unpleasant.  Or possibly a situation where anger arises and you're prone to snap out of anger.  How does the situation change when you make the statements in a manner that makes the other person feel validated, important, and feel like they matter.  Would this soften the blow and diffuse the situation taking it from a situation that if handled improperly would crush a relationship and instead turn it into a situation that strengthens your relationship & builds a level of trust out of the interaction?  \n\nIn 2021 I now understand many of the complexities about me that make me me.  The things that make me valuable to others and a leader for other people.  I now understand that the things that triggered the \"asshole\" in me are the things that are my greatest asset.  I will not lie to anyone, I will not manipulate people for my own personal gain, I will give more and more to an individual even to the point that it is damaging to me, I will always do what I deem to be right in every situation in life.  And I also understand that the one thing people crave is validation & acceptance.  But you have to be able to accept yourself for who you are.... both strengths and weaknesses prior to being able to actually show validation and lead people by letting them know that you truly, madly, deeply care about them.  I have gone through the journey of self acceptance for years and am truly now not afraid to just be me with everyone that I interact with! \n\nI often tell young men that I work with that \"no one ever tells you that at 35 years old you're still the same crazy little scumbag that you were at 18.  The only difference is that you now have years & experience behind you that give you the tools to handle situations better than you did at 18.\"  \n\nI'm not the same person that I was in 2013 or prior.  To any of those that I may have hurt during that time I would like to offer a sincere apology.  There are people that I was close with at that time that I have been unable to apologize to for years.  So for those of you that may see this.  I'm sorry, I was wrong, and I hope you can forgive me.  We all change over time..... the key to this matter is are you changing for the better or for worse???", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/miiszu/personal_mentality_shift_self_value_over_time/", "title": "Personal Mentality Shift & Self Value Over Time", "social_network": "reddit", "user": "theflabbydaddy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1617364487, "permalink": "/r/DecidingToBeBetter/comments/miiszu/personal_mentality_shift_self_value_over_time/", "nsfw": false, "first_save": 1635436882.4270246, "replies_charged": false}