{"id": "t5_2tand_t3_p8pygx", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "A lot has changed in the last 2 months and it’s wild how much different my life is now. I used to have a messy room, I’d smoke weed all day everyday, eat one meal a day and would sleep between 4 and 7am and wake up around 2-5pm. I never went out and pretty much just spent my life behind a screen, drinking fizzy drinks, eating chocolate instead of real food and I was miserable. I had a job I hated, I was in a relationship where I wasnt happy(the trust was gone and it was destroying my mental health). \n\n\nI decided enough was enough, I ended the relationship I was in which hit me hard, I was fucked for weeks. A couple of months later I moved away from home to my dads, he got me a job in his business as an E-commerce manager. I eat 3/4 meals a day, I don’t snack on chocolate and crisps anymore and i pretty much only drink juice with the occasional fizzy drink. I don’t smoke weed, my room is spotless and I wake up at 9/10am each day and sleep about 1/2am. I even managed to stop biting my nails so much. I still don’t go out too much because I only really know my work friends, but we go out of a weekend and we’re planning to do more stuff together. \n\n\nI feel fucking amazing, I stepped out of my comfort zone by moving and I feel like I can finally begin my life. I’m 20 and I wasted the last 5 years being miserable, I’m not going to waste my life anymore.\n\n\nEdit: Yes, after a million different comments correcting me I’m aware it’s 180, as you can tell I’ve improved mentally and physically but I’ve lost my brain along the way. I appreciate all the kinds words it means a lot to me ❤️", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p8pygx/i_pretty_much_done_a_360_on_my_life_and_i_feel/", "title": "I pretty much done a 360 on my life and I feel great", "social_network": "reddit", "user": "icannotbebothered7", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 641, "down_vote": 0, "creation": 1629545974, "permalink": "/r/DecidingToBeBetter/comments/p8pygx/i_pretty_much_done_a_360_on_my_life_and_i_feel/", "nsfw": false, "first_save": 1635435971.3687353, "replies_charged": false}