{"id": "t5_2tand_t3_2nxtw2", "request": ["311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": " (My first article in a newly launched magazine.) \n\n“We Become What We Think About”\n\nBY: JOHN FERRARA\n\nI have heard those words that have left an impact on me and changed the way I view my life; “we become what we think about.”  Wanting to take control of my life, I started looking for the answers of how it was possible to prosper and to grow, not only in the business world, but as a person.  How is it possible to live in abundance?  How can someone turn dreams into realities?  Along my journey, I have come across some of the most inspiring sources: books, authors, speakers, modern day philosophers, entrepreneurs and success gurus.  Here is what I found! Even though they all have diverse views and opinions, there is there is one common trend that they all unanimously agree upon; “we become what we think about.”  \n\nSuccess begins in the mind of the individual.  The way you think determines your outcome.  Quite simply, if you think positive thoughts, you will achieve positive results.  If you think negative thoughts, you will reap negative results.  So how is it that we become what we think about?  It all begins in the subconscious mind.  Within our subconscious mind lies the true potential of our personal power.  Our subconscious mind holds the key to unlock the future we have always dreamed of.  William James said, “The greatest revolution of our generation is the discovery that human beings, by changing the inner attitudes of their minds, can change the outer aspects of their lives.”  \n\nIn the recording “The Strangest Secret”, Earl Nightingale gives the example of our minds being very similar to fertile land.  The land does not care what you plant; it leaves the choice up to you. If you have two seeds; one corn, one deadly poison, and plant the seeds, water them and care for them equally- what will happen? The land will return what is planted.  It will return poison just the same as it will return the corn.  Our minds, although much more complex, work the same way.  Whatever seed you plant in your mind, your mind will return to you.\n\nStart by making a conscious decision for what it is you want.  Plant your ideas, dreams and wishes, deep within your subconscious mind.  Take care of and support them.  Think these thoughts so often that they become a part of your subconscious mind.  Once your subconscious mind learns what it is you want, without even consciously thinking about it, it will guide you towards your desires. Every great idea or achievement started in the mind of its creator.  But, it is our subconscious mind that controls 95% of our thoughts and actions in our daily lives.  It is these actions that affect our outcome in life. Begin at once!  There is no better time than now! Plant that seed!  It's your duty to make it grow into the physical reality of something that started out as only a thought.\n\nSubscribe to my YouTube channel: youtube.com/thesuccessmessenger", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/2nxtw2/we_become_what_we_think_about/", "title": "\"We Become What We Think About\"", "social_network": "reddit", "user": "SuccessMessenger", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 109, "down_vote": 0, "creation": 1417441993, "permalink": "/r/DecidingToBeBetter/comments/2nxtw2/we_become_what_we_think_about/", "nsfw": false, "first_save": 1635437888.1385574, "replies_charged": false}