{"id": "t5_2tand_t3_cmc1u2", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "do i love my self will all this get better?\nI feel like so fucking much is wrong with mw that i need to read 50 books just to get a lil better.. i feel like nothing is gonna be enough.. i feel like im nothing or ever will be.. i have no personality and no one likes or loves me i have no one close.\n\nI feel like the weight of a mountain is above my shoulders.. its easier to fail harder to succeed.\n\nEarlier i nearly had a breakdown nearly ended up beating my self up, i thought too much, i hate my self for a lot a lot of reasons, idk which one is the biggest..\nIm lazy. I feel like i cant fix any problems i have bc they are hard.. how do i know im not an idiot? No one is helpin me or being by my side, im alone. I feel destroyed. \nI feel like my life is wasted, that i aint special. Im only 18 and i dont have a clue about what to do. Idk who oe what i am, idk who am supposed to be, im lost.\nI have no one i have nothing..im doing nothing to change my life... im just tryin hard not to be depressed and i do a lot of thinking.. I have a childrens brain, i feel like a man baby.. im not takin responsibility for my self or anyone.\n\nI always get the doubt of \"doing nothing about any of it\" and \"ignore it\" some advices say to fix all of this it takes 3-4 years. But wont that be boring af of just reading books ? Im kinda lost on how to self improve. I think thats my biggest problem right?? I feel like i need a new thing in my life. Like a hobby. But i live in a boring town. Only hobby is soccer here.\n\nAnd now im optimistic, why my moods changing so fast?? What do i do ? I need yourguys help.\n\nWhat do i do to make people like me/value me/give me attention? What do i do when i have no personality? Or friendz? People always ignore me and i try to chase them everytime, i try so hard to impress and try to make ppl like me, they ignore me. It makes me feel unimportant.\nNo one likes me/loves me/no banter with anyone, never had a best friend or GF. Im pretty sure its my personality that is boring ppl. Im like girls \"text buddies\" online which proves nothin. They just feel bad for me, No one puts any effort into me, no one takes me seriously.\n\nI always think about what to say next to impress people, idk who i am, who i should be, all i know is im just a boring dull r/niceguys\n\nIdk how to make friends and i run out of things to talk about in convos, my convos are always boring ppl, i say this bc when i text girls they just ignore the fuck outta me, idk what to say to people, i always say 3 sentences and i get replied with one 1 word, I dont have my own opinions, idk how to create them, i have no thoughts or creative ideas, i have no imagination i have a small brain. \n\nI use textin girls or porn to get attention and fill the hole inside me but to be likeable it should be opposite right? but i also like how everyone has a unique personality and i dont, last part i hate about my self\n\nI think everyone got girls and they are amazing/unique...i compare my self to stars in movies, i wish i was any person in world. Am i that fucking low/bad?\n\nBut i feel like im a boring person/im introverted/shy/boring-ordinary life/conversialist/not charismatic/im passive aggreasive/i have a boring life/no selfesteem/i aint wise/im too generic/no confidence/im uncreative/im needy and desperate/im dull and bland/no knowledge/not cool//no skills/no qualities/no job/no sense of humour/i have no creativity or imagination/i have no ideas or orginal opinions or jokes/not funny/not likeable/not friendly/not charismatic/i dont have a sharp minded or good thinking one/not witty/ not charming/not fun/not intelligent or smart/im not mysterious im very predictable/im not a genius\n\nim rude sometimes arrogant and ignorant im egotistical.. i make boring dull uncreative rude and egotistical jokes.\n\nI have no life, no job, no passions or no talents or real hobbies, or confidence or self esteem or a role model or little addictive things to spend my time with..\n\nIs it okay if i just ignore everything i posted and just be happy? Focus on being happy? Those things happened to you guys right? What do i do? I really could use some advice..", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cmc1u2/what_do_i_do_with_my_lifeself_when_i_got_no/", "title": "What do i do with my life/self ? when i got no personality or friends or qualities ? Im compeletly alone and rock bottom. I feel invisible/stupid everyday.", "social_network": "reddit", "user": "hamacule55", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1565017256, "permalink": "/r/DecidingToBeBetter/comments/cmc1u2/what_do_i_do_with_my_lifeself_when_i_got_no/", "nsfw": false, "first_save": 1635435833.151893, "replies_charged": false}