{"id": "t5_2tand_t3_i10za1", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "There's something to Nike's 'just do it' slogan that hit me yesterday while I was putting off exercising literally the entire day.. for the second day in a row.  I had shirked on my previous day as well , and regularly exercising is new to me.\n\nBut it's very important - it's my healthy replacement for smoking and drinking and has helped me get past the harder times over the past couple weeks while I've ended both.  It also is aiding in building my confidence.\n\nAnyway, around 10pm last night I thought \"Tomorrow, I can either feel good about my evening based on doing what I intended, or the opposite for not.  Do yourself a favor, don't think about it, just begin\".  So I did, and went till I was done.  And I feel really good about it.  I wonder if I would have gone running this morning if I hadn't 'just done it' (worked out) last night.  I'm grateful to my last-night-self for pushing the momentum.\n\nI feel good.  I feel great.  I'm still technically in the 21 day withdrawal period of nicotine and I barely even notice it and drinking doesn't come to mind unless it's specifically triggered by something.  \n\nI'm thinking about quitting weed when I hit my 3 weeks of cig/nicotine free on Tuesday, but don't feel some huge pressure/obligation.. just think it might make my life a little better if i can push through the initial discomfort.  Maybe not but I'm excited to whole-heartedly experiment.  See what I do best with.\n\nThat's the end of my rant.. Hope you all are having a great evening/night/morning/afternoon and are continuing to be better!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i10za1/rant_getting_going_when_lacking_natural_motivation/", "title": "Rant - getting going when lacking natural motivation", "social_network": "reddit", "user": "luciferforyou", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1596168837, "permalink": "/r/DecidingToBeBetter/comments/i10za1/rant_getting_going_when_lacking_natural_motivation/", "nsfw": false, "first_save": 1635436528.3191798, "replies_charged": false}