{"id": "t5_2tand_t3_mpqpoj", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "***Background:***\n\nI have BPD from childhood trauma (undiagnosed until recently) and never realized that all my life, while i felt like i was a victim, that i was actually emotionally and verbally abusing people that i would literally die for the whole time and crossing extreme lines, truly believing that they were in the wrong, when it was me.\n\nI've changed and grown so much doing CBT on my own since January this year and now I don't even feel like i have depression anymore and feel more in control of my thoughts and more mature with a high self worth as opposed to having no self worth before. I feel so happy with who I am. But...\n\n***skip background:***\n\nHow do i stop dwelling on the past, beating myself up, feeling sorry for myself, hating who i was and everything that i did and instead remain optimistic, positive, enjoy things i love, and focus on the future without feeling guilty & coming off like i don't regret anything? i feel like if i really do allow myself to heal and move on, i'm leaving the ones i hurt behind, like a hit and run. I've apologized a billion times, cried so much and begged for forgiveness, and I was understandably not granted forgiveness. I feel like I truly don't deserve to move on from the damage i've done. Sure, my current self deserves happiness, but my past self doesn't, and if I just let go of that past and move on so \"easily\", I'm letting my past self get away with what they did, while the people I love remain hurt and have to live with painful memories. It's not fair. For anyone.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mpqpoj/how_can_i_forgive_myself_without_feeling_guilty/", "title": "How can I forgive myself, without feeling guilty?", "social_network": "reddit", "user": "madlyinloveGxM", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1618272157, "permalink": "/r/DecidingToBeBetter/comments/mpqpoj/how_can_i_forgive_myself_without_feeling_guilty/", "nsfw": false, "first_save": 1635436992.1025147, "replies_charged": false}