{"id": "t5_2tand_t3_ppqbm3", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "By \"intelligence,\" I don't mean knowledge. Obviously I can learn new information, and skills to a lesser extent. I could do puzzles to get better at those, practice a bunch of IQ tests to increase my IQ, read to understand new ways of thinking about things, but I'm not talking about any of those. All of those would just be training my brain to do certain things better rather than making it \"more powerful.\" They all fall under \"nurture\" and they all address the symptoms, not the cause. I wouldn't really be any smarter by doing any of those.\n\nThere are some people that were lucky and are really smart (in the natural way). You know, the natural prodigy types. Some become famous; there's quite a few historical figures known for how smart they were. Or even if they're not particularly successful, there are some people that just see more than the rest of us do. When faced with a problem, even a day-to-day one, they find good solutions very easily. These things just come easier to them because they have the intelligence I'm talking about. Whether they're a famous mathematician or a grocery store clerk, some people are very smart.\n\nThen there's the average person. Not brilliant, but gets by reasonably well. People solve problems, they bring a certain level of competence to the table. They manage the challenges of day-to-day life. You get the idea.\n\nAnd then there are people like me. I have a hard time with basically everything. If you take a look at my \"nurture\" factors, it's clear that they're not what's limiting me. I don't have the natural, innate intelligence that most people have. It gets really frustrating.\n\nI'll mention that I'm measuring intelligence based on what works and what doesn't. Everyone has their own ways of thinking about things but some are just more effective. Keeping environmental factors and effort constant, a more intelligent brain would succeed (with whatever they try to do) more than a less intelligent one.\n\nIs there *any chance* that I could fix this? It probably wouldn't involve practice because that wouldn't make me \"genetically\" smarter. I understand that it's a long shot as I'm essentially asking if I can alter the structure of my brain, but I just wanted to see if there was *any possible way* that I'm missing. It doesn't even have to be doable today, just scientifically *possible*. Even if there's any chance that someday, medical and scientific advancements will allow us to treat stupidity like any other disease. Can this be fixed? Or are we stuck with what we have? I really hope it's not the latter.\n\nI'll mention that I don't really care about results or compensating with effort, I just care about the raw intelligence for the sake of having it (obviously the better outcomes that being smart results in are a nice bonus, but are not the main goal). And it's *very* important to me. There's no way I could be okay with being stupid even if I had absolutely everything else. So the idea of trying to alter the way my brain naturally is may seem implausible, but I'm desperate, so I want to know if there's *any possible way* I could be smart someday.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ppqbm3/is_there_any_way_to_increase_intelligence/", "title": "Is There Any Way to Increase Intelligence?", "social_network": "reddit", "user": "HardstuckBronzeRank", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1631841319, "permalink": "/r/DecidingToBeBetter/comments/ppqbm3/is_there_any_way_to_increase_intelligence/", "nsfw": false, "first_save": 1635435072.6820354, "replies_charged": false}