{"id": "t5_2tand_t3_qe2ebh", "request": ["1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "This was a year that could have definitely destroyed me. \n\nIf it weren’t for all the lessons I’ve learned in the past and all the bad things I’ve gone through to build me to where I am today, who knows how I would’ve handled things.\n\nIn the beginning of this year, I went through a divorce. I couldn’t afford the house we had so I was forced to move out quickly. I also hadn’t worked in 5 years because I was a stay at home mom to our 2 kids…\n\nYet I found a small apartment and job all within a week. \n\nI had formed a new relationship and things were going well. Within the summer though, my daughter received her official autism diagnosis, which was fine, but difficult as a parent. Although their dad is in the picture, I am the one doing mostly everything for them. He didn’t even attend the diagnosis meeting.\n\nI spent most of this year in a deep depression where I hid and refused to make the changes I know I needed to make. I felt sorry for myself and often cried in self pity.\n\nFast forward to this month, and my mom dies suddenly from septic shock. But also, my boyfriend leaves me a few days later. \n\nWhile I’m still struggling with the grieving process of losing my mom, I’m really proud of how I’m handling everything else. \n\nInstead of shutting down and feeling sorry for myself, I decided to take action and build myself up. I’ve been busy for 2 weeks straight, going out with friends, meeting people, and living life how I want to. If anything, my moms passing made me realize how short life is. She was only 48 and let depression steal most of her life. I want to turn mine around and be the best version of myself for my kids. \n\nI’ve started new healthy routines and got a gym membership. I write daily affirmations and practice meditation. I’m cooking and trying new recipes with my dad. I make my bed every morning. I see my family often. I play with my kids more. And I oddly feel at peace and happy. I’m proud of myself.\n\nI could have let this year destroy me. But I decided to support me instead. ❤️", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qe2ebh/im_proud_of_myself/", "title": "I’m proud of myself.", "social_network": "reddit", "user": "violetxstar", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 53, "down_vote": 0, "creation": 1634985133, "permalink": "/r/DecidingToBeBetter/comments/qe2ebh/im_proud_of_myself/", "nsfw": false, "first_save": 1635437091.126713, "replies_charged": false}