{"id": "t5_2tand_t3_kcidgs", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "In 2016 I was diagnosed with Luekemia. 8 months later I was done with chemotherapy and in remission. However, concerningly, I never seemed to recover mentally.\n\n\n\nI have gained weight. I can't stick with a job. Even friends in depression help discords have told me \"I'm very, very mentally ill.\" This, again, coming from people who they themselves struggle with severe depression. I'm unstable and I've been this way my entire life, but more so these last 4 years. I am also a victim of childhood abuse and I've been told that this will have an effect on things.\n\n\n\nI get in these very optimistic, motivated moods to change things - I'll schedule appointments with therapists, and sometimes even stick with them for many appointments. I'll go on diets. I'll get a job. But then 2 weeks later I've quit. I don't know why. I guess sometimes its anxiety, but it feels like executive dysfunction, and I have no idea how to fix this because I've legitimately tried so, so, so many things. And things like jobs, doctors - they aren't so patient to just let me continue after ghosting them for multiple days/appointments.\n\n\n\nI'm desperate for help. I'm tired of living a life like this. Please help me, point me in the right direction, something, please. I don't want to be this way for the rest of my life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kcidgs/after_4_years_of_stagnating_and_repeating_a_cycle/", "title": "After 4 years of stagnating and repeating a cycle of \"motivation > genuine effort > burnout > apathy\", I need help.", "social_network": "reddit", "user": "CitrusMillie", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1607892256, "permalink": "/r/DecidingToBeBetter/comments/kcidgs/after_4_years_of_stagnating_and_repeating_a_cycle/", "nsfw": false, "first_save": 1635437611.342173, "replies_charged": false}