{"id": "t5_2tand_t3_puyjsx", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "I'm 23 years old, living at home, and working remotely. I have social anxiety, and currently in therapy for it. I improved a lot in college since I get a lot more comfortable with people when I'm forced to be around them, not sure if others are the same. So it went back down in the toilet during the pandemic. I've been here for almost 2 years now, I can't remember the last time I had plans. I have one good friend from college who lives several state away. I just sit at home and hang out with my parents (who I love dearly and I'm very grateful to spend time with them). But the reality is I'm too scared to leave. \n\nI daydream every single day about what it would be like to move to a brand new city and to meet new people. It consumes hours of my day fantasizing about this - meeting a great group of friends, finding a loving boyfriend,  having a kick-ass career, and a beautiful apartment. I feel at peace when fantasizing about it, but when it comes to actually taking steps to try to make it a reality, I freeze from terror. \n\nAn example being that I had 2 job interviews this week - 1 with a Chicago company and one with an NYC company. I did bad with both of them because I can never fucking get myself to stay calm with interviews, and not to mention I think I almost self-sabotaged .... when I thought about the hypothetical of getting a job offer next month and then packing up and moving, I got nauseous from how terrified I was of the thought. It's like I'm trapped in a prison- there's a part of me that's begging to get out and finally have fun, but there's an even stronger side that's able to hold that part back.\n\nI really don't want to let that side win anymore ... I'm tired of sitting around daydreaming. I'm in a great time in my life - I'm young, single, pretty, have a pretty good personality and sense of humor, and I'm an empathetic, overall good person. I want to start treating myself like it and to start living my life the way I deserve to, and to stop allowing my social anxiety to win every single fucking battle. \n\n&#x200B;\n\nOh and P.S. - this is *not* solely about living with my parents - there is absolutely nothing wrong with that. This is about the fact that for me personally, there's not really a reason for me to be living with them anymore and I *want* to move out, but am using living with them almost as an excuse not to do the one thing I know will help my social anxiety the most in the longterm.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/puyjsx/i_want_to_stop_living_in_a_fantasy_world_and/", "title": "I want to stop living in a fantasy world, and start actually taking action to improve my life.", "social_network": "reddit", "user": "drpepperzerodrinker", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1632539787, "permalink": "/r/DecidingToBeBetter/comments/puyjsx/i_want_to_stop_living_in_a_fantasy_world_and/", "nsfw": false, "first_save": 1635435351.6133022, "replies_charged": false}