{"id": "t5_2tand_t3_q7cnj0", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I feel disheartened, bummed, upset, frustrated, etc. (any negative emotion you can possibly think of).\n\nI did so well on my practice tests and that's why I decided to go ahead and take it.\n\nI've had such a tough journey in school. I failed a year and had to repeat it. Every summer, I had to fly back and retake exams. It sucked.\n\nI graduated medical school 2 years ago and had been using that time to take my board exams. The first part I passed, but barely (this was in January). Then I got extremely distracted/consumed by a potential relationship that did not work out. I was devastated and it had taken me months to move past it, tbh. During that time I was studying for this most recent exam. I had taken it on October 1st feeling confident. I will say that the night before I was feeling anxious and had trouble sleeping. But I felt okay when I took the actual test.\n\nIt sucks because a lot of these programs that I plan on applying to, they place emphasis on exam scores.\n\nI'm frustrated because after a difficult year, I was hoping for some relief. I didn't want to study anymore. I was hoping I'd be done with that for a while and I could focus on my job applications and getting good letters of recommendation for an externship that I've been participating in since I finished. I had one more English test that I'm required to take and I already paid for it and scheduled it for next month. I have scheduled a trip to see my friends in Canada just to get a way for a bit later this month (tbh I don't think I want to forgo that. I'd like to get out of here for a bit).\n\nI don't know what I'm going to tell my parents. I feel like I've let them down so many times. But I don't want to give up on my dreams for a medical residency. My end goal is still to become a child psychiatrist. I want this badly. I'm just frustrated though that, once again, there is another bump in the road.\n\nI'm sorry, sisters. I needed to vent all of my emotions out. Everyone else is moving on and progressing in their life. Another girl I know has already gotten so many interviews for medical residency already. I feel like I've taken a step back.\n\nThere have been so many success stories on this subreddit...I was really hoping to post mine on here about overcoming failure (many), and, starting my training in a medical residency (on my way to becoming a psychiatrist).", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q7cnj0/i_just_found_out_that_i_failed_my_board_exam_this/", "title": "I just found out that I failed my board exam this morning. I feel incredibly disheartened and frustrated.", "social_network": "reddit", "user": "futurehero622", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 59, "down_vote": 0, "creation": 1634136153, "permalink": "/r/DecidingToBeBetter/comments/q7cnj0/i_just_found_out_that_i_failed_my_board_exam_this/", "nsfw": false, "first_save": 1635437370.2262747, "replies_charged": false}