{"id": "t5_2tand_t3_82olyu", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Hi guys, \n\nI see many posts from people battling anxiety and depression and going around in closed circles of mental and emotional pain. As a person who was severely depressed at a certain point of my life, I thought I’d write a post about the one thing that made a huge difference in the journey of healing my anxiety and depression. \n\nI was trying to find out where depression stems from before it starts to take over my body, mind, and heart. At the beginning of my depression I used to have a lot of swinging modes from sadness, to happiness (which wasn’t pure happiness either!). Sometimes the speed with which these modes change drove me insane (literally). I would be having an amazing time with a friend, a family member, or even by myself, then the next thing i know is that i’m feeling depressed. \n\nBecause I’m an intellectually open person, i was willing to consider all sorts of possibilities and explanations for these swinging modes. I started experimenting with some ways to monitor my mind and my emotions to arrive at the reason for these modes. I so much wanted to find out where depression comes from. \n\nThen one day I was having a good time with a friend when she started telling me about how worried she was for the future of her children if her husband didn’t get the position in that big corporation. It suddenly grabbed my attention that it all starts from thoughts. I started to recall the times when i experienced these swinging modes, and I noticed that the one thing that shifted my mode was a thought. When a certain thought took the center stage of my mind, the result is either happiness or depression. \n\nMostly these thoughts were either about the past or the future. When I think about something not very pleasant that happened tome in the past, I automatically feel depressed because I feel like I have no power to change it. When I become worried about how something would turn out to be in the future I again get into the depression mode. \n\n \nAt first I dismissed this explanation, but when I put it to practice, it proved to be very effective in stimulating or shifting my depression emotions. The speed with which these thoughts were taking over my mind was absolutely fascinating and scary at the same time. I could be be doing ok one minute and the next I want to crawl back in my bed, and it’s all because of a thought! \n\nAt first I tried to track my thoughts, and of course it didn’t work out because I’m having a gazillion thought every minute. So I decided to go the other way around and start with the end in mind. My emotions became the compass that directed my thoughts, not the other way around. I decided what I want to feel, and started having thoughts that generated this feeling for me. \n\nEmotions and thoughts are two major powers that shaped my experience with depression and anxiety. Taking inventory of my life started by leading my emotions and thoughts instead of having them lead me. \n\nThis is not the only thing I did to get my life back, but it was a great place to start. \n\nHope you find this of value. Feel free to ask any questions, happy to help anytime. \n\n \n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/82olyu/the_1_thing_that_made_a_big_difference_in/", "title": "The 1 thing that made a big difference in shifting my life", "social_network": "reddit", "user": "Monamoursi", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 24, "down_vote": 0, "creation": 1520432650, "permalink": "/r/DecidingToBeBetter/comments/82olyu/the_1_thing_that_made_a_big_difference_in/", "nsfw": false, "first_save": 1635437707.5511298, "replies_charged": false}