{"id": "t5_2tand_t3_dfzu2k", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "Yesterday I had a spectacular day. I ran an old friend of mine who mentioned I had become really charismatic in the few years since high school. I didn’t know how to take that but to say thank you. Since then I’ve been reflecting on not only how I’ve become more charismatic but the benefits I have received from it. \n\nI’ll make a separate post about habits I try to do daily for anyone who’s interested. \n\nFirst before anything else it’s best to set a goal; in this case to become more charismatic.\n\nTo do that here are my rules - all are great, and you can put them in whatever order you want, but I personally put them in the order of what I needed to work on the most to the least.\n\n1. Self confidence\n\nI have a lot of phrases I try and repeat to myself to help me remember but there’s no phrase more powerful than “no matter what I’ll be okay.” Repeat it 10 times daily.\n\n2. Honesty\n\nThe one I still struggle with the most and yet it’s probably the most important trait. Here’s a phrase to repeat 10 times daily “honest conflict is better than dishonest harmony, so tell the truth always, what something made me feel, and what my experiences have been in my own life.”\n\n3. Self-Respect\n\nAgain 10 times daily “I only need myself”\n\n4. Kindness\n\nThere’s a lot I can say, but the simplest phrase is “everyone’s doing their best, don’t judge their struggles or their choices because I’d make the same choice in their shoes.” 10x daily.\n\n5. Good mood -\n\nBefore I leave I have a ritual to put me in a good and likeable mood do this for 300 seconds\n\n1. Smile, hold a fake smile as big and wide as possible with teeth apart\n\n2. Widen feet, make your base a triangle and take up space like you’re about to sumo Deadlift\n\n3. Raise head like you’re looking to the charisma gods\n\n4. Open your arms to t pose but raise your palms to the ceeling with your hands open\n\nThis will get you in a good mood boost testosterone and drop stress (cortisol) all backed by science\n\nAlso a tip chew gum, it reduces anxiety\n\n6. Body language\n\nAnytime you get stressed take a second and breathe into your belly hold it. Close your eyes, open your palms up and attack the problem with a smile.\n\nSome of the benefits I’ve noticed so far \n\n1. People invite me to hangout all of the time\n\n2. People buy me things mostly food\n\n3. People compliment me and it boosts my esteem\n\n4. My co-workers and bosses treat me well \n\n5. People expect me to lead which is something I still need to work on.\n\n6. I’ve gotten hired for a new and better job I declined\n\n7. A lot of girls seem to be super interested in me, I still need to work on my confidence to ask them out.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dfzu2k/the_power_of_charisma/", "title": "The power of charisma", "social_network": "reddit", "user": "Meloxian", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 20, "down_vote": 0, "creation": 1570722054, "permalink": "/r/DecidingToBeBetter/comments/dfzu2k/the_power_of_charisma/", "nsfw": false, "first_save": 1635437133.7570837, "replies_charged": false}