{"id": "t5_2tand_t3_kbdjgl", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "I've always been a black sheep of the family, I was never good in school like my brothers, I chose a 'wrong' field to study in college, I was always rebellious - never succumbed to the messed up ideologies that my family has. \n\nIn my family my grandma is the 'Don Corleone' of the family, she's always had control over everyone, always knew all the issues anyone had and anything bad that ever happened, she'd sweep it under the rug and pretend like we're a perfect family without any problems. She always saw me is as danger, as someone who would ruin her 'harmonious' life because I saw all of her doing being fake and call her out on it all the time.\n\nThroughout the years I realized that she's always going to hate me and appreciate my siblings, cousins more than me so I decided to repair myself and the emotional damage she caused. I've been going to therapy for a third year now, I've made a lot of progress, forgave a lot of things, accepted my family ...\n\nBut tonight, I was hanging out with one of my cousins who is some years younger than me and we were discussing about our grandma and how she has her favorites in the family ... and she acknowledged that I've been mistreated by her since I exist and asked me how I feel about it. It was such a shock to me that I nearly started crying (another trauma I have is that I can't cry in front of other people) and it felt like some pain from the past just cut open again.\n\nSince I got home I haven't stopped crying, I get flashbacks from all the times I've been called stupid, ugly, worthless, useless, heartless, how no one is ever gonna love me, I will never achieve anything and I know I'm not any of those things now but it still hurts ... how can a family member, A GRANDMOTHER who is supposed to be baking you cookies and call you beautiful do all of that to a kid? \n\nOf course our relationship has gotten better over the years and all ... but now that I think about it I think sometimes she still sees me as a rebellious 12 year old who wouldn't do her homework and would skip school to hang out with her friends instead and I KNOW that I should just focus about what I think about myself and how I appreciate myself. I have friends who support me and love me for who I am ... but is it wrong to admit that I crave for some praise from my grandma?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kbdjgl/the_first_time_a_family_member_asked_me_how_i/", "title": "the first time a family member asked me how I feel after being mistreated for so many years", "social_network": "reddit", "user": "manana6", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1607727929, "permalink": "/r/DecidingToBeBetter/comments/kbdjgl/the_first_time_a_family_member_asked_me_how_i/", "nsfw": false, "first_save": 1635437126.764057, "replies_charged": false}