{"id": "t5_2tand_t3_puzfgi", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "I'm fed up of being the doormat, of having low self-esteem, confidence issues, trust issues etc. I'm also mad that I don't dress up as much as before because of the amount of harassment I get from strangers. This lockdown has made me realise that I'm a cool human being. I'm smart, talented (if I put my mind to it lol), funny, and brilliant.\n\nUnfortunately I'm surrounded by people who puts me down, whether it be my brother who would often make fun of my intelligence (I admit, I'm a slow learner but I'm really trying my best!) because I'm not in STEM, my mom who body-shames me, and of course the mistake I made from befriending 'normal' people who turned out to be sketchy. 2020 was probably THE year all this took a toll on me with consistent breakdowns, isolation and the addition of sketchy men who stalked me.\n\nBut 2021 and the unending lockdowns in my country gave me the opportunity to spend a bit more on myself instead of being an ATM machine for my mom. I'm starting to tell my brother off whenever he makes fun of me, I'm reading again whether it be books or even world news to keep myself updated. I'm gaining that confidence that I used to have and I'm starting to love life little by little.\n\nMy next task is to get healthy! I'm aiming to at least go for morning walks or morning runs to start my day and also eat better. And once I've done some research, I'll be getting professional help too because of a few trauma I have that's sort of holding me back. I'm very excited either way!!!\n\nI wish everyone here all the best!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/puzfgi/im_beginning_to_realise_my_selfworth/", "title": "I'm beginning to realise my self-worth", "social_network": "reddit", "user": "Empress_Garlic_Bae", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 53, "down_vote": 0, "creation": 1632543341, "permalink": "/r/DecidingToBeBetter/comments/puzfgi/im_beginning_to_realise_my_selfworth/", "nsfw": false, "first_save": 1635436778.8092728, "replies_charged": false}