{"id": "t5_2tand_t3_kjcg04", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "\nHi folks, this is just to share a few things outside of the classic:\n\n [Play sports, avoid alcohol and drugs]\n\n --- 1 / Abstinence\n\n I have already made a topic on it, so no need to re-detail here, those who are interested will read it, and if not you just have to type Nofap / Semen Retention on Google, do your research right to left on articles  and / or interesting videos on the subject to understand the power of the trick.\n\n --- 2 / Meditation And Opening Of The Chakras\n\n By opening your chakras, you will increase your vibration, activate new senses and mental capacities.\n\n Personally, I meditate lying down with my hands resting on my thighs, the sitting position with the legs crossed, it hurts me and I don't feel anything while meditating like that, it's up to you to see the position that suits you best.\n\n - Go to a quiet room, without TV / radio or anything else in ambient noise\n\n - Make sure you are not disturbed during the meditation\n\n - Choose your position, take a good helmet, turn off all lights, be in total darkness\n\n - Get under the blanket or put on a blindfold (or anything else that at least covers your eyes)\n\n - Wait until it is dark before you start\n\n - Breathe in and out very slowly\n\n - Do not put too much sound, the goal is to relax the body and mind\n\n - Go to the toilet to evacuate if necessary just before, to be quiet during the listening\n\n - Clothing level, be as light as possible, shorts, t-shirt, it will be more comfortable\n\n - During all the music, do not move and keep your eyes closed all along\n\n Not too long nor too short, 30 minutes, the music is pleasant, even if afterwards it's up to you to choose from all the Chakras Music available on Youtube.\n\n (If you choose another one, take one of at least 30 minutes, to have time to immerse yourself in the meditative state, which is not possible with shorter music)\n\n Once you have opened your chakras after the 1st finished listening, you can come back to them the day you have a headache or a physical pain somewhere, it will make the pain go away / reduce a lot since it realigns them.\n\n See it as a natural medicine, it's not music to listen to every day (I tried to see) the more you listen, the less you feel its effects.\n\n For meditation, it can be done alone anytime during the day and anywhere in the place (even if it is better in a quiet place of course), with or without music in the ears, there are full  of possible positions, there I was detailing a bit for the opening of the Chakras, which can also be opened with Kundalini Yoga and other techniques, there are plenty of paths.\n\n Meditating without adding any goals other than meditation itself every day is a very good thing too, it calms the body and the mind, and it is even more effective when you feel weak physically and mentally, it  There is only positive in there.\n\n The opening of the Chakras has been something very powerful, I have never felt anything so strong until today in comparison ... I have not detailed their opening on purpose, so that you can feel things  by yourselves and not that you \"force\" yourself to feel the same things as me by concentrating on them unconsciously, I prefer not, moreover, during the meditation to open them, you must be 100% focused and not distracted by  other parasitic thoughts, stand still like a corpse, and throw yourself empty-headed.\n\n The Chakras, to put it simply, are energy centers that we have on different parts of the body and which open thanks to precise frequencies, after that you will not be the same person, you will be more than  a physical body that experiences a physical reality limited to the five senses.\n\n We've all read this expression right to left:\n\n We are more than just our physical bodies\n\n With the Chakras (and I imagine there are plenty of other examples too) you will quickly understand the meaning of this sentence.\n\n --- 3 / Hertzian Frequencies\n\n So the frequencies, there are plenty, I'll just tell you about the one I tried for a few months, the famous 432Hz:\n\n - Either you convert all your music file on the frequency with Audacity\n\n - Either you directly download a 432 Player\n\n (the downside is that the pitch is a bit lower but at least you drag your music and can listen to it directly, compared to the 1st method with Audacity or you will have to convert first, the same music will sound different in  depending on the method, so test both I recommend)\n\n You will see the difference when listening, the instruments sound more pure and deep, the music will sound more inside your head and resonant, less outside you and more aggressive in its sound, you will feel vibrations  at the level of the Third Eye and sometimes also to other parts of the body.\n\n On the other hand, open your Chakras first (since there is the 3rd eye included) before making it vibrate with 432hz then.\n\n You will feel a little better during and after listening, the effects are a lot on soft and slow music, less on those which are more charged and rhythmic but it happens anyway, and there is no need to meditate  at the same time to feel all of that, so that's perfect.\n\n Meditating on 432 Hz is very pleasant so also test, if I talk to you about electricity and hot energy in terms of sensations, light and waves of different colors that you will see when you close your eyes, does it heat you?  :angel:\n\n Again on 432Hz, my 3rd eye vibrated more when the music had Indian / Asian instruments, organ, synths and bass (real and synthetic).\n\n For the Third Eye, since I activated mine, I have premonitions almost all the time and I see energy fields, in the time of the Egyptians, they called it The All-Seeing Spiritual Eye, that  makes you think, believe it or not.\n\n --- 4 / Go to bed early to wake up early\n\n It's a stupid thing you'll tell me, but I noticed that when I got up early in the morning (I tested the alarm clock at 6 a.m.), I was more energetic straight out of bed, whereas  when I got up later, I was softer, with this impression of fog in my eyes, the first steps out of bed slow and hesitant ...\n\n I think it has to do with the natural Morning-Day-Night cycle that has been respected, we align ourselves with the time when the day breaks, we are awake from start to finish, that's why  also that when you get up at 3:00 p.m. to 4:00 p.m. for X or Y reasons, you feel bad, your stomach swarms, a headache easily, you want to stay in bed all day and do nothing because you wake up  in the middle of the day, when life / nature has already started since the morning, question of syncro.\n\n What is certain is that there is an early morning energy that floats in the air until the sun comes up, as soon as it rose I felt a little less energetic,  so there is something with the early morning.\n\n --- 5 / The 3-day fast and the immune system\n\n All stupid too, try it, just drink your liter and a half of water but do not eat anything, after the 3 days, when you go to eat again you will feel better inside, the organs will have rested and it feels good.  good.\n\n --- 6 / The \"magic potion\" smoothie\n\n Orange - Banana - Lemon - Ginger - Garlic - Chia Seeds - Oatmeal - Carrot - Almonds - Honey\n\n Drink this every day to be full of energy!\n\n --- 7 / Les Ondes Delta before sleeping\n\n Listen to delta waves just before going to sleep, you will yawn while listening, because it calms the mind and prepares it for the very low frequencies our brain enters while we sleep, ideal when you can't.  to fall asleep and even in normal times, do this every night, you will see the difference.\n\n Alpha: d) State of mild relaxation\n Theta: d) Deep meditation\n Delta: d) Promotes sleep and falling asleep\n\n --- 8 / Mouthwash with coconut oil to clean the teeth and the entire inside of the mouth\n\n It is a mouthwash + toothpaste both 100% natural, my teeth are white, shiny, clean, less sensitive to cold and heat, when I run my tongue everywhere in my mouth or my teeth, everything is smooth  and cleaned, the few cavities that I had in the back teeth go away little by little, only positive, test that and throw away your chemical toothpastes!\n\n\n\n --- 9 / The light of the moon ... but not only ...\n\n After a meditation in the evening, go out, stare at the moon when it is full, stand up, do not move, arms glued to your body, easier to stay upright as a pole, keep your eyes wide open, but without ending up squinting no  plus look at what's going on around you (continuing to stare at the moon obviously) and feel that light.\n\n You can tilt your head back a bit, it helps keep your eyes open, and blinking isn't a problem after all, as long as you do it really fast, like lightning.\n\n --- 10 / Expose yourself to the sun as long as possible as soon as it is present\n\n It is obvious captain but worth remembering all the same, naked or with as little clothing as possible, to absorb this vital light for all forms of life on Earth.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kjcg04/self_improvement_the_ultimate_guide/", "title": "Self Improvement : The Ultimate Guide", "social_network": "reddit", "user": "BothConstruction6099", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1608801761, "permalink": "/r/DecidingToBeBetter/comments/kjcg04/self_improvement_the_ultimate_guide/", "nsfw": false, "first_save": 1635437676.3795853, "replies_charged": false}