{"id": "t5_2tand_t3_m3gj7m", "request": ["eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I hit that milestone, & things were looking up, so I kept going. \n\nLast year, not long after I hit 39, I found myself in a similar,  but worse, situation as I had been when I first made that promise to myself. \n\nMy life as I had known it had ended, my husband was leaving me & I had nothing going for me.  I was extremely codependent,  hadn't had a job in about a decade, no self esteem or self confidence, & nothing to fall back on. \n\nI planned to kill myself.  I had no hopes for the future,no hope of things getting better for me, nothing.\nI had actually looked up ways to kill myself with the least amount of pain possible.  I had it all planned out.\nBut I have a cat.  That almost wasn't enough. \n\nA couple days later, after learning a lot about what codependency does to a person & how fucked up i am from childhood, I started thinking maybe I could get better.   Maybe life could go on.\nI arranged for a friend to take me to the psych ward on the Monday I was planning to off myself.  In the meantime, I still had a few days, so I got my application in for my security license (I had been in the middle of getting it when covid hit).  I figured it would take a few weeks & that way it could be processed while I was getting help. \n\nThe weekend passed.  I did a lot more research,  learning a lot more about myself & how to work on my problems.  Monday came & my security license had already been processed.  I could get a job.\nI decided that I was no longer a danger to myself, so I cancelled my trip to the psych ward & instead applied to be a security guard. \n\nAfter a few weeks at a location wasn't a fan of, in August of last year they put me at the location I'm still working at.  It took me about 2 weeks to get used to the job, & now I'm thriving in it.  Most of the people I work with love me, they make comments about how I'm their favourite guard, & how they can't imagine the workplace without me.  I laugh & joke, & at first I was just faking it, but now I'm making it. I'm genuinely happy, I love the job, & I don't think I've ever been this satisfied or comfortable with my life. \n\nI turn 40 today.  In the last year, I've survived a comple life upheaval,  I've paid off a $10,000 credit card, I've found a job I can not only handle but excel at, I've started living my life for me, I've improved my mental health, & I'm optimistic about my future \n\nI still have a long way to go.  My ex & i bought a house in January 2020 & he's not planning on moving out until September, we avoid each other.  I'm worried about not being able to handle things on my own, like all the bills, but as long as my job keeps up, I won't have any problems.  I still get down occasionally,  I'd like to have someone to share things with, but i don't feel like I need someone else to take care of me. \n\nI hate hearing \"things will get better\", because it always just feels like insincere bullshit. \n\nBut my life is proof that things CAN get better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m3gj7m/i_told_myself_that_if_my_life_didnt_improve_by/", "title": "I told myself that if my life didn't improve by the time I hit 30, I'd kill myself.", "social_network": "reddit", "user": "ThePunkHippie", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2838, "down_vote": 0, "creation": 1615552056, "permalink": "/r/DecidingToBeBetter/comments/m3gj7m/i_told_myself_that_if_my_life_didnt_improve_by/", "nsfw": false, "first_save": 1635437493.7361002, "replies_charged": false}