{"id": "t5_2tand_t3_em9ulq", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I’ve been starting to make decisions based on the idea of regret. It sounds kind of cynical, and I don’t really like regret in general because I think it’s a waste of valuable inner-peace and headspace, but I do think there is something to learn from it. \n\nI have never, not even once, regretted going to a yoga class. No matter how sore I am after, no matter how much it’s a struggle to get through it, there’s always an upside. I feel accomplished knowing I’m doing something for myself that helps my physical body, quiets my mind, and is aligned with my spiritual practices. \n\nI’ve never regretted taking the time to write - whether that be journaling, something to share, or parts of a book i am working on. Taking a look back at what I’ve written always makes me smile. Seeing the words that were stuck in my head or in my heart on a page or on a screen helps me a lot. Knowing I’m accomplishing something that I think is part of my greater purpose helps propel me forward. \n\nI’ve never regretted getting up earlier to make celery juice because it helps me. I’ve never regretted eating a healthy breakfast, meal prepping for the day, drinking enough water, etc. These things give me so much energy. I’ve never been upset that I’ve had “too much energy”. \n\nI think you get the point now. I’ve spent so much of my time in regret because I haven’t done these things. And I know i would be in a very different place if I’ve consistently kept up with them from the time I started the rituals of doing them. I feel like I could be way more successful had I just done them when i didn’t feel like it but knew it was best to follow through anyway. I’m not mad at myself, and I do think theres divine timing, and I had to learn a lot of lessons, but I also know there’s a lot more I could be doing that helps me feel good and a lot less i could be doing that’s self-sabotaging or counterproductive. \n\nUsing the question: will I regret doing this or not doing this more? has been monumentally helpful recently. I’ve followed this before and was moving along life very smoothly. And then I forgot and fell back into old habitual patterns of doing the bare minimum and wondering why I was so miserable. In life, we experience both ups and downs, ebbs and flows, and we don’t have to beat ourselves up for it. Having compassion and love for who we are, who we were, and who we could be is of utmost important. But pushing ourselves to be better is also how we progress and grow. And I find asking this question and taking action based on the answer is pushing me into new levels and higher territories. \n\nSending you all love and hope you have a great day. Go get em!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/em9ulq/using_regret_to_your_advantage/", "title": "Using regret to your advantage", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 29, "down_vote": 0, "creation": 1578577613, "permalink": "/r/DecidingToBeBetter/comments/em9ulq/using_regret_to_your_advantage/", "nsfw": false, "first_save": 1635435135.2364273, "replies_charged": false}