{"id": "t5_2tand_t3_k1yfa5", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Hey folks, I have avoidant personality disorder and I’ve been in therapy for it for nearly a decade. We (me and my therapists) didn’t always know I was avoidant because I mask a lot and have a whole bunch of half-baked coping mechanisms. That means I have whole narratives—people are untrustworthy, will use me if I’m not careful, want to get close to me for ulterior motives, and generally don’t like me—that I actually *believe* and that hold strong after nearly three decades of life despite my hard work. It took me a while to realize I had this fundamental lack of trust in others and lack self worth, because I’ve been “doing the work” for so long and meeting people and making friends. \n\nBut lately I realize I am only connecting with people who don’t scare tf out of me, which is 0.01% of people, and that’s not cool because 99.9% of human beings are not untrustworthy and do not hate me. I’m doing all the things to make friends, and even have friends who I trust and am loyal too, but am lacking SECURITY in who I am. I blame myself for every single thing that happens in social settings that’s even the least bit awkward or unpleasant. If I have conflict with someone I don’t already trust—and trust takes SO LONG for me to build in the first place—then it’s almost guaranteed that won’t blossom into a friendship. I don’t even know how to have a conflict with a loved one if it isn’t calm. I feel like a monster just for BEING angry at someone, even if my anger is understandable, and I don’t have enough trust or confidence in myself to hear someone’s criticism of me and be able to say “yes that’s true” or “no that’s not true.” If someone is mean to me or criticizes me my intuition is to believe they’re right and I deserve to be punished. \n\nI had a lot of rough experiences that led me to this point. I was sexually and physically abused by my sister’s dad until I was 9 and I know one result of that can be an incredible amount of self shaming and blaming in adulthood. I was raised by a single mother of three who was discriminated against, broke, busy, young, a lot of stress factors that she of course took out on her kids. I grew up really fast and just didn’t connect with my peers at school, and eventually was socially ostracized. My childhood was quite isolated and I didn’t start actually connecting with folks until adulthood. \n\nI’m gonna be honest, I’m exhausted. I’m annoyed I have these avoidant habits after so much work trying to figure out what’s wrong with me and fix it. But I have made so much progress and I am staying optimistic. I was just having a fantasy about yelling at someone who ridiculed me over the course of six weeks. I was their supervisor for a training and they were outright disrespectful to me and went out of their way to get other people to be mean to me too. I asked myself, why am I still thinking about this after three years, why am I still so angry at this person and how they treated me? If I don’t think I deserve to be disrespected, and I can identify moments where that person was full of shit, then why can’t I say to myself, “What they did hurt my feelings but I don’t deserve to be treated that way” and move on? When someone is wrong and everyone thinks they’re right, why am I not satisfied by knowing myself they are wrong? \n\nI am so so so so so so tired of feeling inadequate and being so concerned with what other people think of me. I want people to feel how they feel about me and I don’t want to care. I want to be mistreated by someone and not let that lead to withdrawing, or self blame, or lashing out. I want to think “they mistreated me because of them, not because I deserve it.”\n\nDoes anyone have any advice?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k1yfa5/i_want_to_hear_a_criticism_that_doesnt_apply_to/", "title": "I want to hear a criticism that doesn’t apply to me and remain unhurt", "social_network": "reddit", "user": "voteYESonpropxw2", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1606471065, "permalink": "/r/DecidingToBeBetter/comments/k1yfa5/i_want_to_hear_a_criticism_that_doesnt_apply_to/", "nsfw": false, "first_save": 1635437603.9662073, "replies_charged": false}