{"id": "t5_2tand_t3_ogqzbq", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I used to be someone that had a racing mind 24/7. I was always busy mentally, always tired and always anxious. \n\nMy friend had been telling me for years to try meditation but I never even considered it. I thought it was something people did when they had too much time and money on their hands (of which I FELT I had none).\n\nOne day after hearing about meditation in a YouTube talk, I decided to try it out. My idea of mediation was to silence my mind and not think anything. It was incredibly difficult. I didn’t have much success doing it either. So I reached back to my friend and asked advice. What he told me was a game changer. Meditation isn’t about quieting the mind but about observing the mind. Pay attention to what you’re thinking and let the thought pass (don’t hold onto it or associate with it) - just like a cloud in the sky. \n\nI tried it and that’s when everything changed. I realised all of the negative and self limiting thoughts that were floating through my mind without me even noticing. Once I started noticing, they started quieting (as I let them pass away without attaching myself to them), and my life started improving exponentially. \n\nThis message won’t be for everybody but hoping anyone out that is currently living how I was, sees this and overcomes this battle.\n\nPs this isn’t a one time thing, it’s a constant practice and habit. Just like daily showers clean the body, daily meditation cleans the mind!\n\nAll the best", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ogqzbq/how_i_got_my_anxiety_and_overthinking_under/", "title": "How I got my anxiety and overthinking under control", "social_network": "reddit", "user": "BlackPlato", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 82, "down_vote": 0, "creation": 1625817752, "permalink": "/r/DecidingToBeBetter/comments/ogqzbq/how_i_got_my_anxiety_and_overthinking_under/", "nsfw": false, "first_save": 1635435769.6323333, "replies_charged": false}