{"id": "t5_2tand_t3_ft1gpf", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "I've noticed lately that I have adopted this self defeating behavior of finding the motivation to want to simply \"change\" my life in this way or that way. This is good but when I finally sit down to assess what I can do, I don't know how to break down whatever change I want into something I can do today and right now. Maybe the goals are too big or broad but I always end up doing essentially this. Going online -- asking for help -- realizing nobody can really help me unless the know the inner workings of my brain -- then turning to social media/video games out of frustration.\n\nI've attempted to use to-do lists and calendars but I can't get traction with them because one of the following always happens. I don't keep up with it, I don't know what to write down, or I write down too much and do none of it. It feels like extra noise outside of what I need to accomplish. I have started maintaining a written journal of sorts. I believe the fact that it is handwritten is why I still maintain it despite it not directly impacting changes.\n\nThey don't all end like this. One time the frustration got so bad that I finally pushed myself to be consistent enough to lose 60lbs. But when it comes to physical appearance and health, it's very straightforward. It's simply food intake/physical activity. Inputs and outputs. But the pen is always mightier than the sword. How can I make my ideas flourish? I'm begging for a sort of \"reset\" on life. Reading has become a great inspiration to me in recent months so if there are any recommendations for what I can read that could help me with these issues.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ft1gpf/im_stuck_in_a_loop_of_being_motivated_to_do/", "title": "I'm stuck in a loop of being motivated to do something but not knowing what to do", "social_network": "reddit", "user": "DKSigh51", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1585753593, "permalink": "/r/DecidingToBeBetter/comments/ft1gpf/im_stuck_in_a_loop_of_being_motivated_to_do/", "nsfw": false, "first_save": 1635436550.3004525, "replies_charged": false}