{"id": "t5_2tand_t3_hwdmlf", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "TL:DR - I kicked goals like a champ going from drug abuse to morbid obesity to fit healthy and killing it in life.... to regress at first hardship and gain the weight back and hate life... now I'm deciding to be better. \n‐------------------------------------\n\n\n\nDon't even know how I got to where I am right now, or even why I feel the need to post here... maybe i just need to get it out.\n\nI have a somewhat lengthy history of drug abuse and mental health issues. With that being said I have worked on my self,  became a happier person and kicked my bad habits... but not all was right. \n\nInstead of drugs to deal, I more or less ate my emotions. \nFrom late 2014 to late 2018 I went from 90kg skinny to a 156kg behemoth. It was then I decided enough was enough. \nWent to the gym and worked out...but never properly handled my eating. Not until the start of 2019 when I went next level and lost the weight. \n\nI went from 140kg to 110kg within 4 months but with good muscle ....and I felt amazing. \n\nWell it all turned pretty quickly when a Slight trauma happenned where a coworker was mentally ill and had it out for me that dragged out for some time. Long story that there's no point going into but I fell complacent. Lost sight of my goals and ambition. Up until late march this year I gained a lot of weight back and felt like I lost my drive. \n\nAnd then, right at the start of my countries coronavirus lockdown my girlfriend broke up with me. I took it hard. Spiralled into a low key depression because I couldn't see my mates to deal with the break up and instead of getting out there and exploring my hobbies, I was locked up at home to dwell on my thoughts. \n\nAnd now queue emotional eating again..., I've gotten to 150kg give or take. Undid all the hard work that I had put in. \n\nWell i suppose this post is about me saying enough is enough. I've got people i could talk to but it feels like they don't understand.... and maybe its more i just needed to get it all in writing. ... but its done. \n\nI know how to do it. I know how to lose the weight and become better... for whatever reason i keep putting it off and wallowing in self pity. \n\nEven though I'm still in lockdowns where I am and things won't be the same for a while... but its decided. Had enough of tbis shit. And I'm deciding to be better. (Yes, that was deliberate 😜)\n\nLove yo faces, thanks for reading the stupidly long rambling post with bad formatting due to phone.. but i needed to get this off my chest.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hwdmlf/starting_again/", "title": "Starting again", "social_network": "reddit", "user": "elboyarino", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1595501770, "permalink": "/r/DecidingToBeBetter/comments/hwdmlf/starting_again/", "nsfw": false, "first_save": 1635436054.5808492, "replies_charged": false}