{"id": "t5_2tand_t3_nwst48", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "For my entire life, I've been in a cocoon of my own making. My mom was neglectful and had an unstable mood (loving one moment, wrathful another). My older brother was an asshole to me. My classmates outed me as weird. I had no one to trust. So I developed this \"lone wolf\" persona and detached myself from everyone early into childhood, refusing intimacy. This continued into high school, even when people were kinder to me. I didn't want anyone to care about me, out of a chronic fear that those closest to me would soon discover my inner brokenness, so I pushed them all away.\n\nBut it's gotten far worse during the pandemic. I'm so devoid of human contact that I feel like I'm regressing to a wild animal. Before, I could expect at least small talk, to practice wearing the face of a normal person (when inside, I'm nothing but an empty husk). It also served as a vital distraction. This past year has laid bare all of the things I buried into my subconscious, things I can't ignore any longer. And as much as I desire intimacy all along, as much as I want to be there for someone else, and for someone else to be there for me, I feel like I can't in a clear conscience.\n\nI don't have a clear conscience. What I did a few years ago may be unforgivable. It's consumed my entire being. There isn't a day that elapses where I don't think about it, not a thing I can do without it ringing a bell, not a laugh I can have without thinking how much I don't deserve that, how in a righteous world I would be beaten into a bloody pulp. Not an ounce of enjoyment without thinking how disgusting it is that you can dare have a bit of optimism when you should be dead in a ditch. It's paralyzed me more than anything else. How can I get a new hobby if I'll always be poison? How can I set goals/move forward in life when you shouldn't even be alive? If I improve myself, how do I know I'm not just a masquerading wolf in sheep's clothing? Is redemption even possible?\n\nAnd most of all, how can I make friends if, once they find out about my past, I'll disappoint them? It seems my lifelong obsession with brokenness has come true. I am broken. The moment they find out, even if I act on my best behavior, I'll break their heart. And I don't want to break their hearts. But I know if I exist it's already an insult to people who have suffered. \n\nI don't want to die. But I can't live like this. Every moment, almost every day has become dedicated to this thing, to this original sin of mine. I can't shake off the feeling with a thousand showers. But then again, what right do I have? I made someone suffer, and they're probably suffering more than I am. So what can I do? I'm at an impasse. My brain wants intimacy, but I know I shouldn't have intimacy because I'll just destroy whatever I touch. I can try pursuing a career (I'm 19 and still undecided), but the future feels bleak and meaningless without human connection. What's the point? To just be an office drone for the rest of my life, always on the run and trying on a new disguise? That's no way to live at all. I don't know. I need to find a solution. But I can't undo what I've done.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nwst48/i_want_to_move_forward_and_rebuild_human_contact/", "title": "I want to move forward and rebuild human contact, but I'm not sure if it's ethical", "social_network": "reddit", "user": "contrite_creep", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1623344887, "permalink": "/r/DecidingToBeBetter/comments/nwst48/i_want_to_move_forward_and_rebuild_human_contact/", "nsfw": false, "first_save": 1635437509.4997804, "replies_charged": false}