{"id": "t5_2tand_t3_fyw1h1", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I am a 29 yo male (5'9'', 68 kg) with an almost sedentary life. It has been ages since I last played or exercised. I have been a lurker in this sub for almost a year. But seeing the complexity of RR, I neither had the courage or motivation to start doing it. Moreover, I knew I would drop out if I have to do something for only 3 days a week rather than making it a daily habit.\n\nNow, my status is that I have very poor core strength. My abdomen with fat feels like a soft balloon of some sort. I know this because I cannot sit or stand even for 2 minutes continuously without hunching over. The hunch is almost at the middle of the spine. I always prefer to lie down or sit with a backrest for support. When standing I need to rest my weight on one leg. While sitting I place my weight on armrest if present. I also have very thin arms with almost no muscle definition. In a nutshell, walking to the grocery store also feels like a hectic deal for me for this weakness. I have a homecooked food diet.\n\nComing to exercises I can/can't do (with proper form).\n\nPullups - 0Dips - 0Pushups - 4Rows(inclined) - 5Squats/Lunges - Surprisingly 25 (If I want, even more)Planks - 60 sec\n\nI want help. I want a daily routine without complete burnout that I can do 7 days a week at a fixed time that will ingrain a habit of exercising in me.\n\nI have created a draft for the same. I want advice and suggestions on this.\n\n**Warmup** \\-\n\nDeep Squat Stretch\n\nWrist Mobility\n\n**Strength** \\- (x 2)\n\nLunges - 10 each\n\nPushups - 4\n\nLying Leg Raises - 8\n\nRows - 4\n\n**Cool Down** \\-\n\nWindmills - 10 each\n\nDeadhang/Scapular Pull (Alternate) - 10 sec\n\nThanks in advance.\n\nYou can share your own experience too. As an act of motivating me.\n\nThis post was removed from r/bodyweighfitness . I hope this subreddit doesn't remove it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fyw1h1/advice_for_creating_a_daily_exercise_habit_for_a/", "title": "Advice for creating a daily exercise habit for a complete beginner with minimal strength", "social_network": "reddit", "user": "dsengupta16", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1586577638, "permalink": "/r/DecidingToBeBetter/comments/fyw1h1/advice_for_creating_a_daily_exercise_habit_for_a/", "nsfw": false, "first_save": 1635438274.3630147, "replies_charged": false}