{"id": "t5_2tand_t3_ov1eti", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Today I had dinner with my fiance and for the first time, I didn't finish a single thing I ordered. I asked the server to give us take out boxes and instead of picking from the leftovers on the way home, I immediately gave everything to my dogs.   \n\n\nIt has been three weeks since I last overate or purged. I feel like a brand new person!   \nIn these three weeks I have already lost 4lbs too, without any crazy diet schemes or starving! \n\n&#x200B;\n\nI feel tremendously happier and better. I'm so excited to kick my old habits out, and I never want to go back. This has been the best change in my life. \n\nI'm so tired of feeling ashamed of myself and self loathing. My binge eating was so severe I had people notice how quickly and often I would lose and gain weight. I was absolutely mortified and angry with myself. It got really bad at one point I had to quit my job and didn't find work for 5 months.   \n I knew what I was doing made me terribly sick every time. But, I would still end up ordering entire family meals and sitting down to eat them alone and purge just to do it again a few hours later, multiple days a week. \n\nEnough was enough, I can't say what clicked for me, but I'm so much happier though. I no longer find joy from junk food. Instead I find that in my workouts now. They're hard and some days I want to quit, but I know I feel better every time I'm done with them. There is nothing better than the satisfaction of doing something good for myself and food can never replace that kind of pleasure.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ov1eti/im_so_damn_proud_of_myself_i_finally_am_kicking/", "title": "I'm so damn proud of myself. I finally am kicking my binge eating habits to the curb and becoming healthier.", "social_network": "reddit", "user": "cosmicboba", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 32, "down_vote": 0, "creation": 1627708815, "permalink": "/r/DecidingToBeBetter/comments/ov1eti/im_so_damn_proud_of_myself_i_finally_am_kicking/", "nsfw": false, "first_save": 1635436827.9616623, "replies_charged": false}