{"id": "t5_2tand_t3_o36ii2", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Hey,\n\nIntro: I'm a 24-year-old man from Brampton (a suburb of Toronto, Canada), I live with my parents, I fucked up my life, & I need help rebuilding.\n\nMy life: Diagnosed with autism at 3 years old, I underwent extensive therapy of all kinds to go from severe autism to mild autism (Asperger's). I was always one of the smartest kids in my school growing up, and I developed talents in piano (certified teacher in my country) & taekwondo (black belt). However, my parents were super-overprotective, so combined with my lack of social skills & packed extracurricular/therapy schedule, I never really got to make friends/hang out with other kids around the neighbourhood. This culminated in brutal 7th grade bullying, where I nearly got expelled after trying to defend myself multiple times from my bullies yet being labeled as the aggressor. After spending months crying to my parents every day, I attempted to become an \"alpha male\" PUA in high school. While I remain a virgin to this day, this gave me the confidence to play football, become valedictorian, & get accepted to a finance program at a top university where I eventually got my B.Comm. in finance. After graduating, I got a job as an A/P clerk, only to quit that job just over a year later because it was a contract job where they just kept extending my contract & never gave me a permanent role or a raise. Immediately after quitting that job, I finished up my piano teaching certificate. I haven't been able to find a job since (not even basic jobs will hire me), & quarantine has caused my mental health & capacity to work to completely collapse. I attempted suicide 4 times during the winter of 2021, & even the mention of my province's government, let alone the words \"lockdown\" or \"quarantine\", sends me into a blind rage.\n\nI'm skinny (5'11\", 165 lbs.), I have no friends, no girls, no job, no prospects for a job or a girlfriend, overprotective parents who still treat me like a 13-year-old (mainly because of lockdowns), I'm unpopular on social media, & I live in the most oppressively locked down city in the world, where if you gather over 10 people for any reason other than a politically accepted one (e.g. BLM, memorial for hate crime victims popular with the mainstream media's causes), you get arrested, charged, & fined by police. All gyms are closed, so working out is out of the question unless I can do impromptu bodyweight stuff (which may not produce the same result). And this shows no signs of ending. I fucking hate masks, social distancing, anything to do with this \"new normal\" bullshit. It's not going away where I'm at. They just keep extending lockdown indefinitely; I have a feeling it's gonna be like this forever. It's literally impossible to get paid anything close to a fair wage (the only jobs listed for salaries at 6 figures, which is required to live in my city, are those in upper management/executive roles, & those take at least 10 years to get because seniority). I have tremendous anxiety & am scared of literally anything & everything (which is why I haven't moved out yet). I stay up until 3 AM almost every night playing video games & reading fanfictions of \"The Loud House\", I pace for hours on end whenever I have anxiety, & I masturbate 5 times a day on average. My confidence is completely shattered, & I can't focus on work for more than 10 minutes at a time. I wish I could flee, but I've been hearing landlords in my city won't let other people visit your apartment (sucks if you wanna get laid), & if I tried to escape my country I would have to submit to a fraudulent PCR saliva test which would almost inevitably diagnose me as COVID-positive even if I don't have it, forcing me & my family to quarantine until god-knows-when. Then I would have to quarantine on arrival for 10 days. And even if I came back, I would have to stay in a quarantine hotel (a literal prison) for 14 days. I haven't been vaccinated yet because I feel like they won't give us our rights back even if we get vaccinated, & I don't feel like it'll have any benefit to me as it won't stop me from catching or spreading the virus; they'll declare some bullshit variant to keep us locked down, like they've been doing (Delta, Indian, British, South African... I could go fucking on & on). After the shit that I've seen from my government (and other world governments) over the past 15 months, I also bought into the belief that the vaccines are a massive depopulation scheme because it's honestly believable at this point. I've been hearing even if you get a vaccine, they won't let you fly because you develop blood clots at higher altitude & the vaccines are an excuse to implement a \"Great Reset\" (proven by the fact that institutional investors are buying up massive tracts of land in the States at absurdly high prices, pricing individual homebuyers out of the market).\n\nFortunately, I don't drink or smoke, I'm not fat (you can see outlines of abs sometimes on my body), I'm debt-free, I have some savings, & if I have a plan that I'm confident will help me succeed, I go all-out. I play sports outside 2-3 hours every day. I just don't feel like there's any action I can take that will help me succeed in this new, oppressive world. Help me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o36ii2/24m_i_need_serious_help/", "title": "(24M) - I need serious help", "social_network": "reddit", "user": "bossplayaintraining", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1624071115, "permalink": "/r/DecidingToBeBetter/comments/o36ii2/24m_i_need_serious_help/", "nsfw": false, "first_save": 1635436618.0035849, "replies_charged": false}