{"id": "t5_2tand_t3_mwmigk", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Yep, you heard that right. I deleted Tik Tok.\n\nPretty much the only reason I even had Tik Tok in the first place was to connect with my friends. Especially during quarantine I was on the app for hours looking at all my friends going to the gym and parties while I was stuck at home wth nothing to do, instead of using that time and energy for more productive things. And then I wonder why I don't have a car, haven't had a job, or have many friends in general. I don't know, *because I wasted what would have been productive energy on a useless app?*\n\nNot to mention the app has become more and more toxic recently with the recent political developments that everyone has known about. The comments sections have evolved to the likes of Twitter arguments. It's that bad. Why can't people on both sides just shut their phone off and take some deep breaths?\n\nNow the app has almost no original content. Just the same old crap over and over again. I see the same fucking 60 second \"movies\" which are really just badly animated pieces of shit. Also there's a lot of fake content on the app. Not to mention the same old videos of shoe wrappers and super sticky tape and things that stick to walls and stuff with the same exact music. Garbage in, garbage out.\n\nAnd please don't even get me started on the constang notifications. \"user is live! Watch now!\" \"Hi! CEO_OF_REJECTION_99 user just posted a new video.\" \"UsEr Is LiVe WatCh NoW!!!!111\" Okay, cool, I don't care. Now please stop.\n\nAt this point I didn't need the app anymore. It is a boring waste of time that does nothing but feed the same old meaningless garbage to my brain and then sends me annoying notifications for no reason. I had nothing to contribute to it and it didn't contribute to my life.\n\nSo, I removed it. Now I'll save that time and energy for actually interacting with people in real life instead of scrolling through some random app. Instead of feeding myself garbage, I'll feed myself useful knowledge. It's time for me to actually do more productive things. I'm surprised it's been literally a full week without having the app since mid-2019. I hope I can go without it for longer.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mwmigk/i_deleted_tik_tok/", "title": "I deleted Tik Tok", "social_network": "reddit", "user": "CEO_Of_Rejection_99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1619149323, "permalink": "/r/DecidingToBeBetter/comments/mwmigk/i_deleted_tik_tok/", "nsfw": false, "first_save": 1635437526.0922768, "replies_charged": false}