{"id": "t5_2tand_t3_j4vpo4", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Hard work always pays out in the end.\n\nFor many people, hard work is embedded into our personal culture, with work ethic being a badge of honor, passed down from the past generations.\n\nNo-one formally taught me the value of hard work, it’s just something I grew to both enjoy and appreciate throughout my various careers.\n\nThe old system seems to be dying. Wake up early. Stay up late. 9-5. First one in last one out. The emerging generations aren’t buying into this ‘old school’ way of doing things anymore.\n\nIt seems that today, more people are interested in developing a healthy work life balance (and an alignment with their beliefs) than what they are climbing the corporate ladder.\n\nI often read about people being more motivated by freedom, time flexibility, and making an input into society, than ‘professional advancement’ - which I’m sure means different things to different people.\n\nSometimes, we work hard and fail. Sometimes we come in second, sometimes we come in last. However, there is no doubt that hard work always pay off in the end.\n\nAdverts on social media are full of tag lines such as “build a $10K a week business from your kitchen.”\n\nWhat the adverts don’t always mention tell you is that building anything good or sustainable in life requires many years of hard work, investment, blood, sweat, tears and rejection.\n\nThere is no replacement for hard work, whether mentally, technologically or physically. and nothing beats persistence. Not giving up is in itself a path to personal growth and achievement.\n\nNever go for the easy option. Some people make a lot of money selling the easy option. Other people \nwaist a lot of money trying to buy an easy option.\n\n“There are always two choices. Two paths to take. One is easy. And its only reward is that it’s easy.” - A Wise Man\n\nWhat is easy is rarely excellent.\n\nNever settle for the easy option when there’s always a better, more worthwhile option available - even if it is walking hand in hand with hard work.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j4vpo4/what_is_easy_is_rarely_excellent/", "title": "What is easy is rarely excellent!", "social_network": "reddit", "user": "kainramsay", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1601800797, "permalink": "/r/DecidingToBeBetter/comments/j4vpo4/what_is_easy_is_rarely_excellent/", "nsfw": false, "first_save": 1635437988.3861482, "replies_charged": false}