{"id": "t5_2tand_t3_m2s19o", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Yesterday evening I probably hit the lowest point in my entire life. Logically I conclude that, but emotionally, that comes later when this will wear off finally. When the fear, righteous self hatred, anger and rage at myself\n\nI’ve known meth is the grim reaper, and it drains the life from anyone who gets severely addicted to it. I knew how dangerous that substance was from reading about it second hand and from hearing the horror stories about a few of my relatives that nearly destroyed themselves with that evil but I still smoked it.\n\nMy mom raised me to know better than to do something so self destructive. But I still did it.\n\nIt isn’t the fear of being addicted (yet), but rather me knowing my word from here on out is even more worthless than before. I broke one of my most important promises of not doing hard drugs, yet I still did it.\n\nWhat the fuck do I do? I feel like there’s no turning back from what happened, and that my life will become even worse than before. I’ve also read the comedown are the closest I’ll ever be to suicide, given how powerful it is. No human being is made to experience that level of artificial pleasure.\n\nI fucking hate myself, and don’t deserve anything more. The only thing I hope for is the meth to cause complications that will put me out of my continuous misery. Why couldn’t I have been a good person? What actually was stopping me from living a good life? Why did I do something so self destructive? Because I don’t deserve to fucking live.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m2s19o/i_smoked_meth_for_the_first_time/", "title": "I smoked meth for the first time", "social_network": "reddit", "user": "screwedpoochbigtime", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1615474678, "permalink": "/r/DecidingToBeBetter/comments/m2s19o/i_smoked_meth_for_the_first_time/", "nsfw": false, "first_save": 1635437761.6596463, "replies_charged": false}