{"id": "t5_2tand_t3_9p9h57", "request": ["9ad14901-6d2f-44f9-8b16-48a4f40b66ab"], "text": "I remember seeing the great Tappan Zee bridge support beams for the first time, rising into the sky like posts designed to touch the clouds. I was 7 years old, and on the way to New York from Ohio, to see family. My mom was from New York, so we went often during summers and some Christmases. The bridge was so *long.* I looked as far as I could to try to glimpse the other side, but I couldn’t even see that far. I was in awe that we were going to just travel over the sharp blue expanse of water below, with all of the other cars right next to us. How was the bridge strong enough for one car, let alone all of the others? I was mesmerized by this brilliant white structure.\n\nNot only was it beautiful, but it was strong, and safe. It didn’t care about the seemingly miles-long drop from it’s support. It’s only mission was to guide the passing cars, trucks, buses, and vans to other side safely, so we could see our family. Staring wide-eyed at the water below, the other vehicles around our own, and the otherworldly giant-ness of the bridge’s structural supports, my seven-year-old heart fluttered wildly, excited by my awe. I was in love.\n\nWhy do bridges exist? Well, the reason bridges exist is quite simple. They connect one point to another, desired point, over an obstacle that may be in the way. Sometimes they go over water, other times, across valleys. Regardless of the obstacle, they provide a solution to it that didn’t exist...until it’s formation.\n\nOur lives are full of these bridges. Every day we wake up and reach for the alarm clock, we begin construction on the bridge of our lives, which will take us from where we are currently, to where we want to end up. As we get up, get dressed, and get going, how we spend our time will determine the effectiveness of the structural engineering, design, and direction of our life bridges.\n\nIf we are even properly building one at all.\n\nMany times in life we are so busy, we forget to work on our life structure. Maybe we’re caught up building bridges for our company, our loved ones, or our children, and we neglect our own. Sometimes we are busy with construction, but we don’t realize that we are building bridges that lead to nowhere. We start building in the middle of the river or ocean, determined to connect a structure to our goals in one day. We work hard, make progress, and then look back at our hard work. We decide it can’t take us to where we want to go. The ocean is too *big* to cross, we say to ourselves. We need to build faster, we declare. \n\nWe stare at the other, bigger, taller and more beautiful bridges around us that others have built. We wonder how they’ve *done* it all. We look up to see their shiny vehicles drive past as they make their way to someplace important. Their lives are made.  We’re not close enough to see the calluses on their hands from their years of labor and hard work, the calluses on their brain. The mental toughness that came from trying to come up with new ways to build more smartly, more accurately. More directly. They don’t show us their broken hard hats, from when they made wrong decisions and their bridges collapsed.\n\nSometimes we lay in bed, fantasizing about the jewel-encrusted bridge we want to build that will take us to our goals. If we only had the time, we say. If we had a bit more money, we could pay better attention to creating an even more mesmerizing design. We forget that bridges don’t have to be beautiful. They can be simple. We don’t need to buy popular designs. We have all the tools we need. Yet we don’t trust the fabric of our life to build the trusses, which will bear the weight tension of our bridges. We lack confidence in ourselves.\n\nWhat we need is a plan of action, a method of design and construction, that will lead us to where we want to ultimately be. Perhaps we want to be on a family vacation in Hawai’i a year from now. Maybe we want to meet the man or woman of our dreams, so we can work next to them, together. We fantasize about building a bridge to a bank account that has boatloads of our money in it, that we can pull out at our leisure. We have ideas, passions, goals, dreams, and aspirations.\n\nThey all need a way to a path to get to get there.\n\nBy following four important decision-steps, you will be able to more quickly accurately and efficiently create the bridge of your life without further procrastination, analysis paralysis, or intimidation. I call the steps the “4 W’s of a Wonderful Bridge.” I promise that if you take 5 minutes to carefully consider these steps, you will be amazed at how quickly you will be on track for making these necessary changes in your life that you will be forever thankful for. We all have this *one* life live. Let’s get to where we want to go!\n\n1. We’ll start at the beginning, with the first W: WHERE?\n\nThe most important decision to make when building a bridge is simple. You must decide *where* the bridge is going. What two points is it connecting? Once we make this decision, it is then easier to start the design process, and keep moving. Remember- those who chase their dreams are the most likely to catch them. In this case, we are building a pathway to these same dreams. If we build a path for them, we can travel it to claim our rewards.\n\nRight now, I want you think about one thing that you want, one thing would make you feel wonderfully good. Maybe it is something to have done, a destination to have visited, a thing to be seen, or simply the act of an experience. What is it? A million dollars? Two more kids? Starting your own business, created around your passions? Leaving the job you’ve disliked for the past several years? Whatever it is- I want you to imagine what it would feel like to accomplish that one thing. Now...how does that success feel? Experience the shining *joy* of the moment. Where does that tension get relieved in your body? How would you walk, knowing you reached that destination? What would you say-what words would you use? Have fun with it. Pick 2 events that are of ultimate importance to you, and then move on.\n\n2. WHEN?\n\nThink about when you want to achieve these goals. Maybe you won’t reach it within the next 10 years. Maybe it’s only 5, or one year away based on your calculations. That’s fine. Just start somewhere.This step is completely necessary for two reasons. Here’s why.\n\n1. Timelines increase your chances of success. Until you add the stick (time for achievement) to your carrot (ultimate destination), you won’t be fully compelled to take action. You won’t begin the building process, but will neglect it before you even start. Don’t leave it at the thought stage. Take it step further. How long do you imagine it will take? Chances are, you believe it would take longer than it actually would take if you were to start. Here’s how I know- because you haven’t started *yet*. No one fails to start what they know they can finish.\n2. Ideas are like diamonds. They come from pressure. A goal with a time stamp attached is beneficial to your success. Example: Imagine the person you love most in this world. Maybe it’s your child, wife, husband or brother. It could be your puppy, your celebrity crush, or your grandparent. Pick one. Now, imagine that this person is taken away from you for a year, and you weren’t allowed to see them until you increased your income by a factor of two. I guarantee you that you would work extra hours, watch less Walking Dead episodes, and spend more time focusing. Let’s up the ante. If you were given the same scenario, but were demanded a 5X increase in income, the results would be even more extreme. You would undoubtedly sell your TV for extra income and less drag, read more books, research more options, utilize more help from others, and spend less time gossipping about coworkers. Your will would provide a *way.* \n\n3. WHY?\n\nThis element is crucial to your success. Knowing where you want to go is important. Understanding the timeline of your game plan is a must. Comprehending they “why” behind your goals will allow you to make sure your bridge is oriented in the proper direction the first time. You want your bridge to be straight, initially. As you begin construction, you may have to build around obstacles, but you need to know the direction you’re headed for. \n\nSo why do you even want this bridge in the first place? This may be closely tied to your “what” stage, but it is not the same. Dig deep into the emotional side of your plan. Who are you doing this for? Ask yourself why. Chances are, there are other people involved. Perhaps-many people. Understand that “the whole is greater than the sum of its parts”. What you are designing may be part of something larger than yourself. Your goal will allow for not only expression of yourself, but of those close to you. This is the cement of your structure. It keeps all the other parts together, ensuring they hold true. It’s the cohesive element. Make sure there’s plenty of it, and that it *sticks*.\n\n4. WARRANTIZE\n\nWhy the weird word? Let me explain. The odds are significant that you have purchased an item before that was covered by a warranty. The purpose of the warranty is to provide remedial repair needed on the equipment, usually within a given amount of time. So if your car is under 10,000 miles, you can get a free repair if something goes wrong with the transmission, for example. There are many types of warranties, but yours must be broad, and simple. \n\nYour warranty must be this: Every day I will move forward on building the bridge of my life. Every day I will add to this construction. In the real world, bridges must be inspected every 3 years. That’s a lot of inspections, once you consider all of the bridges in the U.S. Yours are no different. You have to constantly critique, examine, and question your structures. Bad weather may cause damage. Freak accidents can drop supports. Deaths, job losses, and divorces come at bad times, and they cause structural damage. \n\nThe damages must be fixed.There are going to be times when you don’t want to work on your bridge. Maybe the weather is too nice outside. Sometimes the weather is too nasty. Sometimes the work feels like it’s going to slowly, and ideas of abandonment begin to pile up. These are the most *important* moments when you need to work, anyway. Remember- no amount of neglect of your dreams will lead you to them. Properly said, every step in the right direction is a step that counts. Keep going. Remember your warranty to yourself- and allow you to continue to make progress. Above all remember the words of Confucius, who said “it does not matter how slowly you go so long as you do not stop.”\n\nHappy building!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9p9h57/start_building_your_dream_life_in_5_minutes/", "title": "Start Building Your Dream Life in 5 Minutes!", "social_network": "reddit", "user": "strwberyiscreem", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1539870869, "permalink": "/r/DecidingToBeBetter/comments/9p9h57/start_building_your_dream_life_in_5_minutes/", "nsfw": false, "first_save": 1635435314.4412007, "replies_charged": false}