{"id": "t5_2tand_t3_pelafd", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I’ve been putting putting in serious work off for way too long and it’s come to a time where my relationship is in danger. I’ll try to explain everything the best I can, but I really need help and advice.\n\nWe’re both guys in a long distance relationship, he’s 22 and I’m turning 22 soon. I’m a very pragmatic person and I think once I realize certain objective truths, it’s hard for me to put a positive subjective spin on them and change the way I see them. Or if it is subjective, I tend to put myself down and feel insecure.\n\nI think my boyfriend objectively lives a more comfortable life, doesn’t have to think about certain things I have to think about, has a well functioning family, hasn’t experienced bullying like I did and such. These are just objective truths, and it is hard for me to ignore them. The problem is, when I start comparing them, he can’t do anything about it, and it makes him feel like he’s a burden to me. I want to stop so badly, but my mind just keeps going back to comparing.\n\nAnd then there are other things which are more subjective, such as looks and personality and talents and such, but I end up comparing us there as well. The thing is, I realize that some of the things I feel insecure about, he finds beautiful (such as me being visibly hairy (objectively not too too much, but more compared to the average guy in my country)), but it’s hard to believe him when I stand out. And I think I’ve always had to let him know I need reassurance, without him actually helping me see those things through words. He has through drawings here and there, but I think I’ve been trying to uplift him more about the things he feels insecure about than he has done for mine. And he’s not even that insecure about such things, I just tried to show him that different isn’t bad (which ironically I haven’t been able to do for myself).\n\nI want to change and stop with this pattern of thinking. Do you have any advice on what I should do? I’ll answer literally any additional questions you have, I just want to change for him and save our relationship.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pelafd/how_do_i_stop_comparing_myself_to_my_boyfriend/", "title": "How do I stop comparing myself to my boyfriend?", "social_network": "reddit", "user": "digitalkids", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1630340036, "permalink": "/r/DecidingToBeBetter/comments/pelafd/how_do_i_stop_comparing_myself_to_my_boyfriend/", "nsfw": false, "first_save": 1635435371.466063, "replies_charged": false}