{"id": "t5_2tand_t3_m5g9ky", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "A month ago I thought it would be impossible to quit these addictions.\n\nThey plagued me for years, and sapped my life energy and motivation. \n\nI am happy to say now that I'm content with where I'm at in life, I still have a lot of struggles, but the state of mind I've acquired from quitting has proven to be crucial in handling tough situations.\n\nSome of you may remember the post from a month ago, I also tried quitting porn, but relapsed a few times. I'm back on track now however and I'm at a little over a week without any stimuli in that regard as well.\n\nSome tips I've picked up on during this period of quitting are \n\n- Identify yourself as sober already \n\n- Reward yourself for sobriety (start saving that money you're spending on smoking, it's really motivating!)\n\n- Accept that we're all human (We all struggle with addictions, temptations, slumps, etc. Don't be too hard on yourself if you relapse, because nobody is perfect and the fact that you're trying to make a difference means the world.) \n\n- DONT GO COLD TURKEY (I did this and the amount of stress I endured quitting was catastrophically harsh, instead taper off and look into the compound effect, small changes have big long term results)\n\nThis last tip contradicts my first one, and I'd only recommend going cold turkey if you're fully ready. It's a lot tougher than tapering off would be, and will result in a lot of pain and hardship. But it is still an option. \n\n\n\nGoodluck to everyone who's journeying to improve themselves, I believe in you!\n\nNeedless to say, I feel better than before. :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m5g9ky/today_marks_one_month_without_nicotine_or_weed/", "title": "Today marks one month without nicotine or weed.", "social_network": "reddit", "user": "yuhman457", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1452, "down_vote": 0, "creation": 1615797705, "permalink": "/r/DecidingToBeBetter/comments/m5g9ky/today_marks_one_month_without_nicotine_or_weed/", "nsfw": false, "first_save": 1635437467.3624554, "replies_charged": false}