{"id": "t5_2tand_t3_lpmfe0", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48", "67305ca4-ce30-4c37-9a02-05d70fe958db", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "  \n\nThere is a very powerful process - which most people enjoy doing - which leads to great self-insight and paves the way to answering Who am I?\n\nAs well as being an enlightening thing to do, it has practical benefit in our daily lives. Once we know who and what we are, it becomes natural to apply this insight in our everyday lives.\n\nThis exercise is the first step in answering this fundamental question. \n\nWorking your way through this exercise will get you to the starting line:\n\n1) From the list of values below, write down the ones that appeal to you. \n\nAccomplishment, Good will, Quality over quantity, Abundance, Goodness\n\nQuantity over quality, Accountability, Gratitude, Reciprocity, Accuracy\n\nHard work, Recognition, Achievement, Harmony, Regularity, Adventure\n\nHealing, Relaxation, Approval, Holistic Living, Reliability, Autonomy\n\nHonesty, Resourcefulness, Balance, Honour, Respect, Beauty, Improvement\n\nResponsibility, Challenge, Independence, Responsiveness, Change, Individuality\n\nResults, Clarity, Initiative, Romance, Cleanliness, Inner peace, Rule of Law, Collaboration\n\nInnovation, Sacrifice, Commitment, Integrity, Safety, Communication, Intelligence\n\nSatisfying others, Community, Intensity, Security, Compassion, Intimacy, Self-awareness\n\nCompetence, Intuition, Self-confidence, Competition, Joy, Self-esteem, Concern for others\n\nJustice, Self-expression, Confidence, Knowledge, Self-improvement, Connection, Leadership\n\nSelf-love, Conservation, Learning, Self-mastery, Love, Self-reliance, Cooperation, Loyalty\n\nSelf-trust, Coordination, Meaning, Sensuality, Creativity, Merit, Service, Credibility, Moderation\n\nSimplicity, Decisiveness, Modesty, Sincerity, Democracy, Money, Skill, Determination, Nature\n\nSolitude, Discipline, Nurturing, Speed, Discovery, Obedience, Spirituality, Diversity\n\nOpen-mindedness, Stability, Education, Openness, Standardization, Efficiency, Optimism\n\nStatus, Environment, Patriotism, Straightforwardness, Equality, Peace, Strength, Excellence\n\nPerfection, Success, Exploration, Perseverance, Systemization, Fairness, Persistence, Teamwork\n\nFaith, Personal Growth, Timeliness, Faithfulness, Personal health, Tolerance, Family, Pleasure\n\nTradition, Flair, Power, Flexibility, Practicality, Trust, Forgiveness, Preservation\n\nTrustworthiness, Freedom, Privacy, Truth, Friendship, Problem solving, Unity, Frugality\n\nProfessionalism, Variety, Fulfilment, Progress, Vitality, Fun, Prosperity, Wealth, Generosity\n\nPunctuality, Wisdom, Genuineness, Purpose\n\n2) It is quite likely some of the values on your list are essentially the same: keep the one you prefer and score the others out.\n\n3) Circle the values you identify most closely with. Add any other important values to the list.\n\n4) Create your initial list of values, including all those you have circled to give a list of between 15 and 20 values.\n\n5) Now prioritise this list: compare the first and second values on your list, place a mark beside which is most important to you. Now compare the first and third values, again placing a mark beside which is most important to you. Continue comparing the first value in the list with all the others, each time placing a mark beside the value which is most important to you. Now move down to the second value in the list, comparing it to the third on your list, marking which is most important to you. Work your way through the whole list in this manner. When you’re done, count up the marks beside each value. Re-write your values list, starting with your highest value, including your 10-12 most important values.\n\n6) Now, for each of your values, consider what this actually means to you: write down 3-5 factors for each value. E.g. for health, this may mean: being physically able to do what you want to do, being free from illness, having a good physique and having good mental health. The details only matter to you.\n\n7) And now – again for each of your values – write down 3-5 things which you would be doing on a daily / weekly basis to attain or retain each value. e.g. for health: regular cardio activity, regular resistance training, healthy diet, regular meditation, moderate alcohol consumption.\n\n8) Now identify 5-6 negative values: things you most definitely do not want in your life e.g. poverty, abuse, rejection, unemployment ect. Just as you did for your positive values, write down what each of these negative values means to you and what you would need to happen for you to be experiencing each of those negative values.\n\n9) Take as much time as you need to reflect: how has this exercise made you feel? / make as many changes as you like to make it just right for you.\n\n10) So now that you have invested this effort in yourself, take some time out several times a week to reflect on the extent to which you are living according to your values and experiencing your negative values: for each value – consider the extent to which each of the factors are in place in your life, the extent to which you have been living according to what this value means to you, what this tells you about yourself and what you shall do over the next few days to live according to your values.\n\nBeliefs\n\nSo now that you have had a first pass at your values, now consider some of your beliefs. \n\nFor each of your values, make a note of some beliefs you have which relate to each value. So, if for example, one of your values is ‘Justice’, make a note of a few things you believe about justice.\n\nNow do this for each of your values.\n\nOnce you’re happy that your notes are a reasonable reflection of this set of beliefs, you can then start to develop these beliefs by asking:\n\nWhat is the evidence for this belief – and against it?\n\nAm I basing this belief in facts or feelings?\n\nIs this belief really black and white – or is it more interesting than that?\n\nCould I be misrepresenting the evidence?\n\nWhat assumptions am I making?\n\nMight other people have other interpretations of the same situation – what are they?\n\nAm I looking at all the evidence or just what supports my thoughts?\n\nCould my thoughts be an exaggeration of what is true?\n\nAm I having this thought out of habit, or do the facts support it?\n\nDid someone pass this thought or belief on to me – if so, are they a reliable source?\n\nIs my thought a likely scenario, or is it the worst-case scenario?\n\nWe all form a set of beliefs in our childhoods: generally, they are formed rationally and serve us well at the time. However, time moves on and things change. As we become adults, our childhood beliefs serve us less well – and the resultant behaviours may be incongruent with the situation we are in. This leads to the conclusion that one of the things it means to grow up, is to develop out of our childhood beliefs and adopt a new set of beliefs that will serve us better as adults. This progression follows a broad pattern of developing from dependence as children to independence as young adults to interdependence as mature adults. \n\nBeliefs which no longer serve us well – or indeed which serve to act against our current best interests – can be thought of as Limiting Beliefs. They frequently act as roadblocks in our personal development. Most of us will carry some of these childhood beliefs with us in to adulthood. Most of them will impede our performance as high functioning adults. Many adults benefit from contemplating this list, recognising any that apply to them and working on growing out of them.\n\nThe general list is:\n\nI need everyone I Know to approve of me. \n\nI must avoid being disliked from any source.\n\nTo be a valuable person I must succeed in everything I do.\n\nIt is not OK for me to make mistakes. If I do, I am bad.\n\nPeople should strive to ensure I am happy. Always!\n\nPeople who do not make me happy should be punished.\n\nThings must work out the way I want them to work out.\n\nMy emotions are illnesses that I’m powerless to control.\n\nI can feel happy in life without contributing back in some way.\n\nEveryone needs to rely on someone stronger than themselves.\n\nEvents in my past are the root of my attitude & behaviour today.\n\nMy future outcomes will be the same as my past outcomes.\n\nI shouldn’t have to feel sadness, discomfort and pain.\n\nSomeone, somewhere, should take responsibility for me.\n\nBeyond these, people may have their own specific limiting beliefs which are often versions of I’m not good enough / I’m not worthy / I’m not smart enough / I’m unattractive / Change is bad / conflict is bad / the world is a scary place / people are mean ect. \n\nDeveloping these beliefs by asking the questions above can be a useful starting point: stress ‘starting point’! – our beliefs are developing all the time (do you have the same beliefs about Santa Claus today that you had when you were seven years old?).\n\nSo, given that our beliefs are developing all the time, is it not better that we take control of these things we call beliefs and use this process of change for our benefit rather than our detriment?\n\nThere is no right or wrong answer to this question – it is simply a matter of personal choice.\n\nOK, so you have just spent hours identifying and evaluating your beliefs. But what, actually, are beliefs?\n\nBeliefs are shortcuts we can use to save us the trouble of re-evaluating common sets of circumstances. As an example, I believe that the other cars approaching the junction will stop when they see a red light at the junction: so that I may cross safely when ‘my’ light is green. If I didn’t believe this, driving across town would be a very taxing experience as I’d have to re-evaluate at every set of lights.\n\nBeliefs are just thoughts – they’re neither right nor wrong. They just are what they are. Their only reality is that which we choose to give them.\n\nIn our everyday lives, we tend to address beliefs through one of two paradigms (1) the Debate paradigm – where two opposing views are expressed with the intention of one view being deemed superior to the other and (2) the Discuss paradigm – where differing views are explored free from vested interest with the aim of furthering the understanding of all parties. \n\nBeliefs are just thoughts – they’re neither right nor wrong. They just are what they are. Their only reality is that which we choose to give them.\n\nAt a personal level, there is a third paradigm which may be more resourceful – asking to what extent, or otherwise, does this belief serve me? And if it does not serve me well, how would my life be improved by developing this belief in to something more resourceful?... and what can I do now to take that first step in growing in to this more resourceful belief?\n\n‘’The mind is its own place\n\nAnd in itself\n\nCan make a heaven of hell\n\nAnd a hell of heaven’’\n\nJohn Milton 1608-1674, English Poet & Polemicist.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lpmfe0/what_is_your_reaction_to_this/", "title": "What is your reaction to this?", "social_network": "reddit", "user": "EERMA", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1613995407, "permalink": "/r/DecidingToBeBetter/comments/lpmfe0/what_is_your_reaction_to_this/", "nsfw": false, "first_save": 1635437127.178475, "replies_charged": false}