{"id": "t5_2tand_t3_oq3jg7", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "5d0f6d96-af53-4a9d-aba2-c5967c631e40", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "When you’re looking at things to improve, you’re looking at aspects within yourself or situation that are inadequate. This naturally brings with it feelings of discontent and hostility. First, because you’re not where you want to be, and second, to change it you need to live in this dissatisfaction and work to get out of it or ignore it and not change.\n\n\nWithin this discontent there are things we can change, and things we can’t. We can’t change the fact we’re going to die. We can’t change certain health problems. We can’t change what socioeconomic status and where in the genetic lottery we were placed. So, I’ll recommend the stoic approach to these situations where you don’t dwell on things you can’t change. And if you can’t seem to help it, do so with compassion and understanding – but don’t dwell there for too long.\n\n\nOkay, so to improve any aspect of your life you have to come to the realization that you don’t like where you’re at now (you can still like how far you’ve come and be grateful). It’s easy to apply this to *your self*. I am inadequate for being unconfident, I am an idiot for not being rich – if only I had invested in those stocks. I want to be more productive, but I’m a lazy piece of shit. \n\n\nThis won’t do anyone good. \n\n\nWhat’s needed is self-care, confidence in yourself, and sense of purpose. Confidence being the belief *in yourself* that you can accomplish and change things that are within your control. By deciding to improve you will naturally keep banging up against your own negative thoughts. This is before we even mention the negativity that comes from some of our social circles, media - all things external to us. \n\n\nYou need a strong sense of self-confidence, self-care, and sense of purpose to have any persisting and meaningful change for yourself. It’s requires a conscious balancing because you don’t want to just shut out all negative thoughts. Some could save you a lot of trouble and time, or show you chinks in your armor that could be fixed and improved. However, most of the time they are counterproductive. \n\n\nSelf-care, self-confidence, and a sense of purpose develop differently and would turn this post into a book. However, even though they are for yourself, I just want to remind people that they don’t necessarily need to be developed alone. Talking to a therapist can do you wonders, even if you are psychologically sound. The stigma is harmful that only those who are not neurotypical can find it beneficial. I see it as having a teammate whose sole focus is your improvement. Many people you talk to are doing so because it’ll benefit themselves. A therapist is too, they’re getting paid monetarily, however, besides that their goal is to help you mentally and psychologically. Having good friends and support systems also achieve this end. Talking about goals and then the problems you’re running into have a way of shrinking when you talk about them to people who are genuinely trying to see you reach your goals. \n\n\nTo recap, anytime you think of things that can be improved in your life, negative thoughts will be right there. Reason being that the very act of improving shows you where you are and where you want to be, a discrepancy, which means there’s something missing, inadequate, or lacking. To overcome this you need to plan and act. On the way, you will encounter negativity (if not from yourself than externally) and you might attribute these negative aspects to your *self*. A way to overcome this efficiently, and for long periods of time, is to have a strong sense of self-care, confidence, and sense of purpose. These can be developed for the most part but will take compassion and a willingness to make allowances for yourself. Not attributing every failure to your self, but treating them like a strategist or general who can take a birds eye view and separate your well-being from the failures you run into. \n\n\nIn a healthy manner, love yourself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oq3jg7/you_cant_overcome_innerconflict_without/", "title": "You Can't Overcome Inner-Conflict Without Self-Compassion", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 42, "down_vote": 0, "creation": 1627050532, "permalink": "/r/DecidingToBeBetter/comments/oq3jg7/you_cant_overcome_innerconflict_without/", "nsfw": false, "first_save": 1635435260.4737256, "replies_charged": false}