{"id": "t5_2tand_t3_q9pljp", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I hope this is the right subreddit for this, sorry if it isn’t. \n\nFor my whole life, I feel like I’ve only ever did activities because I felt like I was better at them compared to others, and I liked that feeling of being superior. My parents, teachers, and also my classmates fuelled my ego too much. However, I don’t feel like I worked hard to get to there, and this might be pretentious to say, but I used to be pretty smart and good at a lot of things (for a kid, and compared to the other kids I knew at least). That held true until it didn’t. Other people started surpassing me with actual hard work, so I just quit all my extracurricular classes and stopped trying in school because there was no point unless I was the best. I’m 15 now, I have no extracurricular activities, my only hobby is media consumption, and I am extremely lazy. When my alarm goes off in the morning, I stay in bed until I really can’t anymore, because then I’ll be late. When I come home after school, I don’t do my homework, or anything productive for that matter and instead play games for several hours. I find school to be extremely boring as well, it is difficult to pay attention and I often find myself lost in a daydream more often than not. I’m not sure if I’ve ever studied for more than 10 minutes, but my grades are somehow not terrible so that is not a big concern of mine (for now). I know I have a lot of time to turn things around, but the problem is, I’m not sure how. \n\nFor one, I want to stop being so lazy, but all the advice I’ve come across online, well, I was too lazy to do it. I know this sounds like I just don’t want to change, which may be true, but in that case, how do I start wanting to change?\n\nI also want to find something I genuinely enjoy doing, but if I’m not immediately perfect at it (which I’m never, obviously) then I just stop. The few hobbies that I’ve managed to keep up for more than a week got dropped because I got bored, and trying to keep it up despite that just made me not look forward to the passage of time, as the set time I had told myself to do the “hobby” was approaching. I know this sounds really stupid, since it’s pretty much the product of my own unwillingness and laziness, but I need advice. Am I missing something, and is continuing with my aforementioned strategy the way to go? I know that’s how you build up a skill, but that’s not what I’m looking for at the moment, or is developing a hobby still the same?\n\nSorry if this post is long btw", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9pljp/how_to_start_enjoying_things/", "title": "how to start enjoying things?", "social_network": "reddit", "user": "cheesebleach666", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1634436366, "permalink": "/r/DecidingToBeBetter/comments/q9pljp/how_to_start_enjoying_things/", "nsfw": false, "first_save": 1635438203.956286, "replies_charged": false}