{"id": "t5_2tand_t3_b9cqhb", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "When I was 11 I stopped going to school and as a result, I didn't get any qualifications. My mental health was just a total mess, helped along by unfortunate life happenings (one such being the death of my abusive father when I was 13). I didn't want to be alive at all for a large portion of my childhood/teen years. As I got older I was using an array of bad coping mechanisms - alcohol, drugs, self harm, sex, etc.   \n\n\nFor several years I was in and out of the mental health services. None of it really helped.  \n\n\nThen, I had my daughter. And I decided to just - **be better.**  \n\n\nThe years she was a baby and toddler I put so much work into building myself up; to putting myself back together.   \n\n\nWhen she started school full time in September (2018) I started (UK) college. It was so incredibly daunting. The fear of failure hung over me early in the process of applying, however, as the course has gone on, it's lessened. But doing this has proved that I *am* capable of being in education. I *am* capable of coping. I *am* capable of handling the bad days and still making it in and putting the work in. I'm 'only' doing an English GCSE this year, but I'm predicted to get an 8 (A\\*) or above.  \n\n\nI've already been accepted to do my Maths GCSE in the next academic year. However, there was an ember within me wanting to go to University. It's now a raging fire. I want to get there. So I spoke to the careers office at my college and they've advised me to do an Access to Higher Education course alongside my Maths in September. So getting on that course is the next step, which should be a doddle. It's just terrifying for me too. It's a massive step up in time commitment (which I know Uni will be too) and it will also be my first course in which I'll need a student loan for - also terrifying.   \n\n\nI keep on doing the things I need to do for positive progress but I am just utterly terrified all of the time. Every time I take a step forwards that's bigger than the last, that fear of failure grows back again. The 'what ifs' try nudging their way into my head. It's like with every bit of progress I make the stakes intensify. I have more to lose.  \n\n\nHowever, every time I think back to where I was and how far I've come, it spurs me on all the more. My determination grows.   \n\n\nSo yeah, just here to say I am terrified, but I am trying, and I plan on doing so relentlessly until I achieve my goals. No matter how long that may take, no matter the obstacles. I'll keep trying to kick fear's butt to the curb.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/b9cqhb/life_is_terrifying_but_i_keep_pushing_forwards/", "title": "Life is terrifying, but I keep pushing forwards.", "social_network": "reddit", "user": "jellybeanmusic94", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 508, "down_vote": 0, "creation": 1554384668, "permalink": "/r/DecidingToBeBetter/comments/b9cqhb/life_is_terrifying_but_i_keep_pushing_forwards/", "nsfw": false, "first_save": 1635437026.3642697, "replies_charged": false}