{"id": "t5_2tand_t3_56qkxj", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "Okay here I go,  this is a it’s  a story that I haven’t told just anybody only family and therapists and group therapy people so like 8 people tops. When I was 14 I had found out some very horrible things about my father molesting my big sister and I and to make things worse my brother bubba and I were fighting to the point of broken bones and bloodshed and I couldn’t live with myself any longer. I tried to commit suicide and with being unsuccessful I was put in the hospital and things just got worse from there, I ran away at 15 but came back 2 weeks later staying with friends which can only last so long I came back to live with my mom and brothers to fall back into drugs and alcohol that my mother gladly supported being an addict herself. I found a friend who was willing to \"take me away\" so I left with him but when I left I didn’t know I had fallen into the hands of the devil he raped me and beat me until I had almost died the next thing I knew I woke up in the hospital 2 months later from being in a coma to find no one by my side no family no friends I had nothing no bag no school I.D nothing to tell anyone who I was. I was a Jane Doe to the hospital and to police, when I woke up I had very little memory of what happened had to learn to walk again talk again and eventually came to remember my mom and told the police her name she found me and brought me back home to the same hell hole I left. But what I had come to realize was not what most people would expect. When I woke up I felt like a new person I felt like the person I was had died and I came back as someone else, I know it sounds crazy but its true I felt like all I had experienced all that I had felt before I woke up in the hospital was a dream and now i am a better person and can actually look above my actual body and see me (old me) leaving walking away then me (this new person) had walked into my lifeless body then waking up in the hospital. And what gets even crazier about this story is ever since then I have had people stop me on the street saying that I’m and angle sent from heaven and people see white around me glowing of a angle like state, spiritual things I know nothing about. I had a elderly lady walk up to me as I was crying in a store my ex boyfriend had just told me I was worthless and she put her hand on me and i quote \"You are the most beautiful human being in the world because there is no one like you and no one can come close to you, you are one of a kind I may not know you but I do know that your special and you were born to do great things don't let anyone tell you your worthless because you are irreplaceable you are an angle sent from God\" I swear on this, I actually posted this on my facebook when It happened so I have the quote from then. Another incident happened this little girl had actually walked up to me at a bus stop and told me she had a dream about me talking to her in her sleep with wings speaking to her of her grandpa that had just passed before she herself even knew he had passed and I had never meet this little girl in my whole life her mom had told me not to lissten but she took me by surprize and couldn't help but soak it in just like the rest, things like that keep happening ever since I had that experience with death. I don’t know if I am an angle but for some reason I don’t doubt that I could be.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/56qkxj/i_just_want_to_tell_my_story/", "title": "I just want to tell my story.", "social_network": "reddit", "user": "brearosemcm", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1476078418, "permalink": "/r/DecidingToBeBetter/comments/56qkxj/i_just_want_to_tell_my_story/", "nsfw": false, "first_save": 1635437190.2485502, "replies_charged": false}