{"id": "t5_2tand_t3_f0jhrz", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Most of my problems only exist because I create them. I'm so privileged the stars are within reach if I stop tainting my rocket fuel.\n\nWhy do I create my own problems? I know when some behaviours are to be made. When I need to drink water, when I need to get back sleep, what food I should eat and how much I can indulge before it starts affecting my mental clarity.\n\nI want to be confident that I sustain the patterns that will lead me towards my self-fulfilment. Work consistently, regardless of my mental state going in. That's the hardest part besides making the time into my schedule, it's actually taking it when it's there. Forget about the uncertainty, just do whatever I set out because it's my best guess as to what needs to come next.\n\nI know what structure pays off after time. I have applied parts of it in moments of my life. I, today, decide to submit to the structures that solidify my ability to feel fulfilled. Structures that are resilient to whatever happens and that only exist to make my life more meaningful. \n\nEvery day, bit by bit, I ensure the bare minimum: good sleep (so good nighttime routines), quenching thirst, some contemplative practice, and some time to check in with my task list and habit tracker. That's it, in terms of what I \"force\" or \"discipline\" myself to do. I am there to love myself, so everything I do I love doing. No need to see my desires as \"have to\"s or \"should\"s, I'm sick of creating difficulty just because I think something is hard. I'm creating determination by thinking I'm doing something.\n\nThanks for being part of this space. It helps to feel understood and supported.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/f0jhrz/i_dont_want_to_be_my_own_enemy_anymore/", "title": "I don't want to be my own enemy anymore.", "social_network": "reddit", "user": "WoodenFlute", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1581120647, "permalink": "/r/DecidingToBeBetter/comments/f0jhrz/i_dont_want_to_be_my_own_enemy_anymore/", "nsfw": false, "first_save": 1635437862.2239895, "replies_charged": false}