{"id": "t5_2tand_t3_bhmli7", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Hi guys, first post here! I don't generally post on reddit but i'm really hoping/wanting to share some of thoughts with people! Here are some of the things that i'd love to share with others, and I hope you share your perspectives too as i'd love to learn from others!\n\n&#x200B;\n\n1. **Authenticity -** Be aware of your intentions and what it is that you are trying to achieve. Whether you have an abrasive personality or pleasant to be around, integrity through authenticity is an admirable character.\n2. **Humility** \\- Confidence comes from a place of knowing what your capable of and being comfortable with your shortcomings (but still has a drive to improve) while arrogance is used to mask insecurities and fear. Understanding whether you are coming from a place of confidence or fear helps a person remain authentic and humble. Respect can be earned in many ways, but respect earned through an authentic sense of character is a merit that no one can take away from you. The only way for you to lose that respect is if you throw away your sense of authenticity and humility.\n3. **Confident and mindful of others** \\- A person must learn what aspects in life are worth competing for.  Competition can bring a lot of positive changes but a person should know where to draw the line. Some people can become over competitive to the point that even trivial matters becomes a competition. Relationships, friendships, materialistic possessions, these are some of the trivial things that people would compete for as it can give an illusion of 'status symbol', but at what cost?\n4. **Self Sacrifice** \\- Working for other people’s best intention does not mean expecting anything in return, and it does not mean that *\"they owe you one\"* either. By working for other peoples best intention you can show that you genuinely care for others and that your intentions are authentic, it allows others to connect with you and gives them a sense of safety or peace of mind that you are someone that can be trusted. By doing so, it shows others that you are a confident person who knows what their capabilities are. They know that you do not have to compete to make a name for yourself, they simply know that you are a person of character and integrity.\n\n*From:* [*https://narratives.me/narratives/how-to-become-a-likeable-person*](https://narratives.me/narratives/how-to-become-a-likeable-person)\n\n*P.S: Apologies for the self promotion, I'm just in the mood for sharing things atm.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bhmli7/four_simple_traits_of_a_likeable_person/", "title": "Four simple traits of a likeable person.", "social_network": "reddit", "user": "Narratives-", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1556287195, "permalink": "/r/DecidingToBeBetter/comments/bhmli7/four_simple_traits_of_a_likeable_person/", "nsfw": false, "first_save": 1635437719.3776283, "replies_charged": false}