{"id": "t5_2tand_t3_mzvufe", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": " If you were looking for a sign to follow through on your new year’s goal to exercise more, this is it! If you are finding that difficult, here are 10 tips to help you get started.   \n \n\n1. You don’t have to do your daily exercise in 1 go; you can spread it out throughout the day, such as 10 minutes in the morning, mid-day, and night.\n2. Find a gym buddy because a workout partner always helps in boosting your motivation and following through on targets.\n3. Transform your daily walks to be brisker. Say, you are walking to the grocery store; imagine you are late and speed it up a little.\n4. Thinking about having a meal; it is better to work out before eating! Go for a quick run before lunch.\n5. Allow technology to support your initiative. Getting a pedometer, an Apple Watch, or any device where you can track your progress could be helpful.\n6. Finding no time to work out? A great way to make time is to cut back on screen time and use that free space for your workout.\n7. Convert resting hours into a mini workout opportunity. For instance, pull up your desk to do your work standing, or do mini pull-ups while watching TV.\n8. Look into fitness classes in your local gym or find a nearby studio if you think the structure would help keep you going.\n9. Clear a daily time for your scheduled physical activity and add that to your calendar.\n10. Give yourself prizes for completing short-term goals!  \nr/Insumo", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mzvufe/easy_exercise_habit_tips_for_wellbeing_and/", "title": "Easy Exercise Habit Tips for Wellbeing and Positivity", "social_network": "reddit", "user": "InsumoApp", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1619550029, "permalink": "/r/DecidingToBeBetter/comments/mzvufe/easy_exercise_habit_tips_for_wellbeing_and/", "nsfw": false, "first_save": 1635436273.3669171, "replies_charged": false}