{"id": "t5_2tand_t3_mn7f3x", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Lack of ambition is causing me immense mental and financial (which leads to more mental) stress, and my inability to help myself means I never get out of the rut.\n\nI'm an EFL (English as a Foreign Language) teacher from the US, living abroad.  For the past 3 years, I've slowly forgotten how to prepare effective lessons for my students.  It's pretty uncommon for me to feel satisfied with my classes - whether it's teaching vocabulary to children, book-based lessons to teens, or conversation classes to adults.  More often than not, I feel like I'm wasting the time of my students.\n\nMore about me:  I have an extremely difficult time focusing.  I'll sit down to prepare a lesson and end up getting distracted by something until I have barely enough time left to prepare...and then I'm in full-on panic mode, trying to sprint my way to completing a lesson and getting out the door before I'm late for classes.  All the rushing leads to absolutely terrible lessons.  The students generally give positive feedback - I'm sure 99% of the positivity is from the fact that I'm a nice guy and try to encourage a fun atmosphere in the classroom.  Obviously, I would like 99% positive feedback due to how much the students have learned from my lessons.\n\n* I'm perpetually broke (several hundred dollars in debt to one of my friends, actually), and it feels terrible.\n\n* I'm sick of feeling terrible, so I should get more classes to get more money.\n\n* I don't look for more classes because I feel like my lessons are garbage.\n\n* I should improve my lesson planning, so I feel better about my lessons.\n\n* I try to research better lesson planning, but end up hitting paywalled teaching sites or YT videos that seem to be focusing on everything but the type of lessons I usually teach.\n\n* Get frustrated that my research turned up nothing, feel terrible.\n\n* Play video games, listen to podcasts, watch unimportant YT videos.\n\n* Repeat.\n\nWhat the hell is wrong with me?  Despite feeling terrible about my lessons and my life for ~2 years now, why isn't that enough motivation for me to push past my frustration and continue researching?\n\nI'm fortunate enough to still have a place to sleep and a few bucks each week to eat, but I feel like I can see rock bottom from here.  Is my brain waiting for me to hit the real rock bottom before it fixes itself?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mn7f3x/is_there_any_way_to_fix_the_lack_of_ambition_and/", "title": "Is there any way to fix the lack of ambition and inability to help myself?", "social_network": "reddit", "user": "Nowheretoturn48", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1617934728, "permalink": "/r/DecidingToBeBetter/comments/mn7f3x/is_there_any_way_to_fix_the_lack_of_ambition_and/", "nsfw": false, "first_save": 1635436625.409088, "replies_charged": false}