{"id": "t5_2tand_t3_mwcqd3", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707", "e234981c-b061-4d83-8134-70d441847f74", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "After a long list of difficult life events (losing my mother due to cancer, my family of origin falling apart,  my relationship ending and losing my job) I got stuck, it became to much for me to handle.\n\nI have been jobless and frustrated with myself and the world for 7.5 months. Surely, to be fair to myself, I have had better days and I have also been a positive person for myself and others in this time. But on the whole, I was stuck.\n\nSince a few weeks I have started getting my life under control.\n\nHowever, I have not moved up steadily, I am still moving forward in a chaotic way and I depend a lot on the motivation that I have on a day, and when it's not there I see myself slacking off a lot.\n\nThis is what I decide to change now. And I know how I will do it.\n\n1. I will work for 2 full hours every day to move my life forward and take care of myself. I will schedule these hours. Activities included are: organizing my home, exercising, cooking, meditating, journaling, selling stuff that I don't use, organizing my finances, planning, reflecting, etc. If I do these two hours, I mark it off as a \"fine day\" in my habit tracker. That, to me, is all I ask. Two hours may not seem like much, and the challenge here is not whether or not I pull this off on a particular day, but the challenge is to do this *consistently* for many days, weeks and months. That would really be a breakthrough.\n2. I allow myself to do more on a day. 4 hours of work is a \"good day\", 6 hours of work is a \"very good day\", 8 hours of work is an \"excellent day\" and 10+ hours of work is a \"awesome day\".\n3. However, there is one more condition to getting to giving my day a positive rating. I also ask of myself to schedule two hours of free time every day, and I make it an art to enjoy life as much as I can. If, for example, I have worked for 10 hours, but I have not relaxed at all, then I will add \"don't forget to take breaks and enjoy life\" to my rating. So, I am tracking two things: productive time, and relaxation time. And both are equally important.\n4. I will schedule the tasks that I have to do every day/week/month/etc. Over time, more and more of my life will be scheduled. For example, once every week I want to clean my floor. Every day I want to do my dishes. Every week I want to do my administration and finances. Every quarter I want to defrost my freezer. The goal of this system is to increase the quality of my life and to make my life easier to manage.\n\nThis is enough to start. My system will improve over time. It's evening now, but I will start improving my life *today*. Not tomorrow. No more of that excuse. Now is the time to get going! :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mwcqd3/i_will_start_getting_better_now_this_is_how_i/", "title": "I will start getting better now! This is how I will do it.", "social_network": "reddit", "user": "Jastrus", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1619119960, "permalink": "/r/DecidingToBeBetter/comments/mwcqd3/i_will_start_getting_better_now_this_is_how_i/", "nsfw": false, "first_save": 1635436543.7250757, "replies_charged": false}