{"id": "t5_2tand_t3_krce9d", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "This is a shock to me because after a decade of depression, I had turned into a fat slob for so long that I thought I'd amount to nothing in my life. My parents told me that I was no good, and growing up without friends just pushed me into a corner in my room where I just ate sh** and watched TV all day.\n\nCut to 2017 and I had enough of my own pity party. I cut out all my junk food and went full on keto. Lost 88lbs. Made a new friend, lost several. Didn't care. Picked up my writing habit again, came up with a story idea, been turning it into a novel ever since. But a tragic loss around 2019 made me spiral back to my old habits.\n\nThanks to my fears, I didnt go back to junk food, my worst enemy. I gained weight and became lethargic again, but I didnt hit rock bottom and balloon back up to 300lbs. I decided to make smaller changes instead of big leaps, and forgave myself for missing the gym, for not writing for a year, for losing hope for a bit.\n\nWhich is why I'm so proud of myself for sticking to taking my vitamins, brushing my teeth twice daily and writing whenever I can during the day. These small things would slip away because I considered mouth pleasure and sleeping all day to be more important than my own hygiene and health. I made p**n and tv shows my priority before writing. Its never too late because all it takes is making small changes and showing up everyday. Once it becomes so mundane that you HAVE to do it else you feel weird, you're a champ.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/krce9d/since_december_ive_been_writing_daily_brushing/", "title": "Since December I've been writing daily, brushing twice a day and taking regular vitamins.", "social_network": "reddit", "user": "OfficialShree", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1693, "down_vote": 0, "creation": 1609894389, "permalink": "/r/DecidingToBeBetter/comments/krce9d/since_december_ive_been_writing_daily_brushing/", "nsfw": false, "first_save": 1635437736.9967437, "replies_charged": false}