{"id": "t5_2tand_t3_qey4t7", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "c67213dc-0eed-4cac-a781-9bc082742908", "4b69452a-b1e5-47af-a734-ad3c2bdce185", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "The party wasn't my jam but that's okay, just going was a step I think. I drank some wine, first time in around a year and a half, and tried socializing as best I could.\n\nFor reference I'm a 30 year old male, and this party was mostly girls in their early 20s that all had boyfriends.\n\nThe reason I think this was good for me is I've been in denial of my loneliness for a couple years now. Drowning it out with easy dopamine rushes. But man I really do feel very alone. I don't know how to let new people in my life, I lack interest in the effort required to maintain new friendships. I think it's good I finally see this how it is and can try to figure out a way to fix or change it\n\nI really wish there were easier ways to make friends then through social media though. I'm god awful at text communication, have had zero luck with dating apps or even just keeping conversation with friends on discord. \n\nKnowing this I started volunteering but they bailed on me first chance they had (stopped telling me the next date, responding to my emails etc) perhaps this was a bullet dodged \n\nAnyway this post is all over the place I just needed a place to sort my thoughts. Thanks for reading. Things will work themselves out I'm sure, I'm just glad that I actually convinced myself to go to the party even if the end result feels rather negative", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qey4t7/i_went_out_of_my_comfort_zone_to_a_party/", "title": "I went out of my comfort zone to a party yesterday, where I only knew one person and it made me realize how lonely I am", "social_network": "reddit", "user": "solcarbine", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 23, "down_vote": 0, "creation": 1635100509, "permalink": "/r/DecidingToBeBetter/comments/qey4t7/i_went_out_of_my_comfort_zone_to_a_party/", "nsfw": false, "first_save": 1635435932.1411436, "replies_charged": false}