{"id": "t5_2tand_t3_n28f0x", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "I am 25, slightly over weight, mildly social and in a rut so deep i cannot escape it. The worst thing i have everything i need to escape. I am well educated, i have a bachelors in engineering as half an Msc in Engineering. I come from a family with money. I am trying to set up a business. I used to be social, even now i still have 4 or 5 friends i can call any day and they will pick up the phone to listen to me.\n\nYet i feel so frigging anxious all the time i don't know what to do. I cannot focus on any task and its seriously affecting my life. I have started seeing a therapist but i don't see an improvement in that regards.\n\nMy biggest problem i cannot decide where life is taking me. I have been a firm believer in having a plan and right now, there is no plan. I dont know what i am doing. I am starting businesses all over the place, committing to things and then backing out, doing a million things and spending my time in front of Netflix. I am constantly angry and on edge. My faith has taken a severe blow. I cannot seem to relax at all. \n\nToday I had my first meeting with a mentor i picked up, a man at the pinnacle of his career in a prestigious company who took the time off to spend an hour with me to guide me and i felt so lost in front of him.\n\nI had no idea what businesses i am doing, or where my life was going. I felt ashamed sitting in front of him. How do you know where you want to go? OR where you can go? How do you let go of this anger inside you at the universe and forgive yourself?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n28f0x/i_dont_know_how_to_overcome_this/", "title": "I dont know how to overcome this procrastination/depression thing and it is killing me.", "social_network": "reddit", "user": "sexyshawarma", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1619833240, "permalink": "/r/DecidingToBeBetter/comments/n28f0x/i_dont_know_how_to_overcome_this/", "nsfw": false, "first_save": 1635438054.4432333, "replies_charged": false}