{"id": "t5_2tand_t3_ku16tc", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Hi everyone! Just wanted to share 30 daily habits! Hope these give you some ideas!\n\nEdit: I understand this list can be overwhelming but please treat these as suggestions only! Not all of these habits can be done all at once so it's good to focus on a few at a time. I'm only working on adding 2-3 new habits every month personally.\n\n \n\n* **1) Prepare for the next day.**  \nThink of 3-5 things you will need for the next day and put them all in one place.\n* **2) Declutter your workspace.**  \nSpend 5-10 minutes decluttering your workspace. Put away things you don't need for the day. Try to limit to no more than 5 items on your desk.\n* **3) Try the one-tab challenge.**  \nLimiting to one tab saves time in finding what we need. We can be distracted when we have multiple tabs open. If that's too hard, you can start off with two tabs first.\n* **4) Do a shower meditation.**  \nFirst, get in the shower and let the warm water run all over your body. Second, visualize all the worries, stress and anxieties upon you. Third, visualize the water and soap scrubbing all of those off. Fourth, picture all the negative feelings going down the drain. Lastly, acknowledge you are clean and free from it all.\n* **5) Listen to an encouraging podcast or videos.**  \nTry finding podcasts or videos that are positive or encouraging. There's plenty on YouTube!\n* **6) Eat healthier and drink lots of fluids.**  \nTry eating 2-3 vegetables per day. If this is too hard, then you can set 2-3 green foods per week for now. Drink at least 8 glasses of water per day or start with 3 glasses and increase from there.\n* **7) Create a vision board.**  \nPlace images of all your goals and aspirations either on a physical wall or digitally. Seeing all your goals in place in front of you can be meaningful and motivating.\n* **8) Stretch different parts of your body.**  \nSearch on YouTube to see which areas of your body to stretch and do this for at least 10 minutes a day. But don’t overexert yourself.\n* **9) Take a class.**  \nTake a local or online class about something you always wanted to learn. Consider a class in a new language, new skill, or new hobby.\n* **10) Remove habits in the bedroom.**  \nTruthfully, I'm working on this right now. I love to watch TV on my bed at night. But we should reserve the bedroom a place just for sleep rather than for entertainment.\n* **11) Use the 5 by 5 rule.**  \nThe rule is “If it’s not gonna matter in 5 years, don’t spend more than 5 minutes upset about it.” Don’t let unnecessary things upset you and just focus on the positives.\n* **12) Journal or write 30 minutes a day.**  \nReflect on the day. Get all your deepest thoughts either on paper or electronically. This helps with focus and becoming a better thinker and person.\n* **13) Track your tasks.**  \nKeep a to-do list and calendar to track what you’re working on. Reflect on what you're spending your most time on. Is it on entertainment or your most valuable tasks?\n* **14) Set 3-4 daily priorities.**  \nEliminate the non-essential tasks and limit your priorities to 3-4. Make sure you know what you want to achieve every single day, week, and year.\n* **15) Do a full body work out and strength training 3 times a week.**  \nStrength training protects your bone health, muscle mass, keeps you lean, increases energy levels, and prevents injuries. That’s why it is ideal to do strength training 3 times a week. There are also plenty of work out videos on YouTube.\n* **16) Take a break from technology.**  \nConsider taking a break from social media or anything else with technology. You're likely to feel more refreshed, energized and you're able to give your eyes a break.\n* **17) Read 60 minutes a day.**  \nReading is important for your cognition and make you a better thinker and writer. Even if you don’t like to read, try to learn to do it everyday and eventually you will come to love it.\n* **18) Sleep 7-8 hours at night.**  \nThis is another habit I often neglect. But I end up paying for the consequences. Don’t ever sacrifice your sleep. Always make sure you get enough of it. Most people need 7-8 hours of sleep.\n* **19) Practice kindness and love.**  \nRealize you have an unlimited resource of love and give it to others everyday. Try to practice small acts of kindness and don't keep score. Leave a genuine compliment for someone. Leave a positive review. Write heartfelt letters. Make a playlist for someone.\n* **20) Save 30% of your income.**  \n2020 taught us that we need to be smarter with our finances. If you can’t save 30%, then try 10%. Save money by cutting out the little things you spend on everyday or weekly.\n* **21) Smile.**  \nStudies have shown that people who genuinely smile more are happier. When we slouch or frown, we show unhappiness and those cues run with us. I sometimes call up positive friends or watch a comedy show to smile more.\n* **22) Have a healthy breakfast.**  \n31 million Americans skip breakfast everyday. Make time for breakfast by waking up earlier and have a breakfast filled with lots of fiber and protein.\n* **23) Cook more.**  \nYou can save money and eat healthier by cooking more. You're able to control what goes into the food you consume.\n* **24) Walk 10,000 steps everyday.**  \nTry parking further or taking stairs to get more steps in. Walk alone or with someone else. You can enjoy health benefits, enjoy your surroundings or enjoy a good conversation.\n* **25) Keep learning.**  \nEducate yourself and learn something new everyday. Learn a new skill, language, or other. Learn from a course, audiobook, blog post, video tutorial from YouTube, TedTalks or other.\n* **26) Become an early riser.**  \nEarly mornings can be the most productive hours while the world is asleep. If you’re not a morning person, you can try setting back the clock 15 minutes every week until you reach 2 hours before your usual wake up time.\n* **27) Network with others.**  \nDon’t just focus on putting your name out there. Find ways to help and add value to others. Keep helping others without expecting anything in return.\n* **28) Confront your fears.**  \nDo something that makes you uncomfortable everyday. I compiled a list of activities I wish to do to step out of my comfort zone.\n* **29) Take action with the 15 minute rule.**  \nBeat procrastination by setting a timer on your phone for 15 minutes. During those 15 minutes, commit to doing what you were putting off. This builds momentum and encourages you to keep going.\n* **30) Make time for yourself.**  \nDo one small thing you love everyday. It could be listening to your favorite song, driving along your favorite road, watching a movie, or anything else. The key is to reserve time for yourself.\n\nWhich of these daily habits do you have or wish to add? Feel free to add more to the list! :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ku16tc/30_best_daily_habits/", "title": "30 Best Daily Habits", "social_network": "reddit", "user": "improvewithsoo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 307, "down_vote": 0, "creation": 1610231873, "permalink": "/r/DecidingToBeBetter/comments/ku16tc/30_best_daily_habits/", "nsfw": false, "first_save": 1635437236.4287016, "replies_charged": false}