{"id": "t5_2tand_t3_qelpzg", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "I overdosed on Thursday and it really kicked my ass into gear. I thought I was going to die and I was like \"no, not now, please I'm so young..\"\n\n My mother died when I was 16 in front of me naked of a gruesome overdose and I have a bunch of other trauma, and my brain is simply not wired right. I became extremely depressed and have such bad PTSD I have been doing literally nothing between the ages of 20-now. Save for February 2020-August 2020 when I was actually holding down a job, having a social life, enjoying life for once. But after an extremely traumatic event, I spent my entire 21st year blacking out on alcohol and laying in bed staring at walls. I'd do Oxycodone, Xanax, Soma, and Adderall and I'd literally just stare at my phone. No reading, sometimes I'd go to the gym. But I've spent more time on the internet than you would believe possible. I wasted a lot of my youth doing this. I'm unemployed and might be for a while because of my multiple mental illnesses. I'd hang out with some friends, and my surviving family, and go to the gym sometimes, but this was mostly it.\n\nAnyway. I turned my ringer on and I'm not going to escape in YouTube and Reddit and pornography anymore I am GOING to make a change. I'm going to start forcing myself to go to the gym and only use my phone for music. I'm going to start meditating, eating healthy, taking daily walks around my lake, playing the guitar, doing yoga, asking my dad what I can do.\n\nThe question is, how do I do this? I have no clue what to do at all. The only good thing is I'm 60 credit hours into my University. But I got academically dismissed because I messed up when I tried to drop the classes and they all became Fs. I petitioned but may not be able to return, but I could transfer to a community college and get my GPA back up to transfer back, or just graduate from there.\n\nI still don't know what soul searching is. How do I learn what I want to do with my life? I don't want to lead an accidental life. I love writing, so much. I don't want to bounce from job to job like I have in the past. \n\nThank you. Very lost. I don't enjoy life but if I make changes I may, just no clue what to do. I've OD'd before twice, intentionally however. This is one was unintentional (Phenibut OD), and it has made me clean my trash heap neckbeard nest. What's next? \n\nMy mother was a doctor. I can't let her down. I have to do this for her and for my dad. He deserves to be proud of me. And I have to stop drinking alcohol. I'm replacing it with Kratom, I was anxious earlier, but this red strain leveled me out. But that can only be a crutch for so long. \n\nI used to be hopeless, but I've been inspired by people I don't even know. Big Herc, a prison YouTuber, lost 10 years of his life after robbing a bank. He came back and has a positive outlook, writes books, and grew a business from the ground up. John Frusciante arguably wasted his youth more than I - between the ages of 21-27, he trapped himself in his home, shooting crack and heroin, painting and playing guitar. He checked into a rehab and a year later wrote \"Californication\", \"By The Way\" and \"Stadium Arcadium\", re-introducing the band to superstardom. He also returned late 2019, and just announced their 2022 global stadium tour. \n\nThat time is gone, I will never get it back. I need to use it more wisely. I just don't know how. It is difficult with anhedonia (inability to feel pleasure), depression, and anxiety.\n\nThank you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qelpzg/i_am_22_and_wasted_much_of_my_youth_what_should_i/", "title": "I am 22, and wasted much of my youth. What should I do?", "social_network": "reddit", "user": "adsfawefzrf", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 289, "down_vote": 0, "creation": 1635053204, "permalink": "/r/DecidingToBeBetter/comments/qelpzg/i_am_22_and_wasted_much_of_my_youth_what_should_i/", "nsfw": false, "first_save": 1635436937.0796354, "replies_charged": false}