{"id": "t5_2tand_t3_p967xa", "request": ["18281d65-fa68-4991-a4a1-8f37346818f3", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "Me and my husband have quit nicotine. I quit drinking and kicked all social media. I started exercising daily. He started working on his hobbies more. For the last couple of months, we are really chugging along in making our lives better. \n\nThere's one more thing I need to kick. Reddit. That's the last one. \n\nI have been on reddit 10 years (since I was in high school!!!!) and immediately fell in love with it. It helped me change the way I see some things and helped me become a better and more understanding person. As I get older, I find myself \"going a different way\" than before with this site. I used to just kind of mold my opinions around what I read on here, but I don't seem to do that anymore and I feel more and more out of place the more time goes on. \n\nI check it way too often and I don't think it's good for my mental health to stay here as much as I do. I waste a lot of time and often I just kind of close the app feeling a sense of concern for the world. It doesn't make me happy anymore and wastes too much valuable time.\n\nI honestly think quitting reddit will be a harder habit to break than quitting smoking/vaping and I picked up the smoking habit earlier than I picked up the reddit habit. I wish they had Reddit Replacement Therapy Patches at CVS! \n\nI think I'm going to uninstall the app tomorrow for half the day and see how it goes. Uninstall at 8am - 8pm. Browse at night only until I'm ready to pull the plug for good. Wish me luck!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p967xa/theres_one_more_vice_to_get_rid_of_reddit/", "title": "There's one more vice to get rid of... Reddit.", "social_network": "reddit", "user": "Trix_Rabbit", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 673, "down_vote": 0, "creation": 1629607390, "permalink": "/r/DecidingToBeBetter/comments/p967xa/theres_one_more_vice_to_get_rid_of_reddit/", "nsfw": false, "first_save": 1635437109.601963, "replies_charged": false}