{"id": "t5_2tand_t3_p1t7n3", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "18281d65-fa68-4991-a4a1-8f37346818f3", "883794f3-030f-4844-8950-6e28281dfa3f", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I've heard and seen this many times.\n\nPeople who simply refuse to accept where they are and are willing to fight tooth and nail to get it. Doesn't matter what it ay be - life itself is a competition to them and they HAVE to win. It's remarkable, their thirst for success and passion to fight.\n\nThese people rarely need motivation because the fight itself is motivation enough.\n\nI WANT THAT.\n\nI hate that I am so apathetic in life. I'm not lazy, I just *don't care* because I don't want anything. Like even right now, if you asked me to visualize what I REALLY want out of life, no way I could give you a clear answer. There's stuff I absolutely hate doing, but there isn't anything I LIKE.\n\nThings I would die for, things I just NEED to have - Nothing. None.\n\nI am so APATHETIC in life. Nothing fazes me. My classmates said they think I am calm in the face of stress, the truth is I'm not fully in tune with it at all. I'm just... there. Idgad.\n\n*Oh No! My realtionship is imploding!* \\- Hmm. Wahtever. Not the end of the world is it? Other fish.\n\n*Oh no! I'm failing this class!-* Well, you're not dying are you? So fuck it, man.\n\n*You lost that race!*\\- Whatever, still not dead. Who cares? It's one race.\n\n*You won first place!!!*\\- Hmm. Ok, fine. Good. What do you want me to do?\n\nIt's so frustrating, I don't care. I don't want anything and I'm not afraid of failure. I don't FEEL anything. It's like I'm stonewalling *MYSELF*!!! And then I'll have these moments of sudden clarity, like now, where I realize I'm so fucked.\n\nI'm doing meditation, I'm making sure I practice whatever skill everyday, I eat healthy, I'm working out and losing weight, but I just can't seem to commit to anything big because life just seems like too much work and NOTHING IS WORTH IT BECAUSE I DON'T CARE FOR ANYTHING!\n\nsorry, i'm very frustrated, please help. i'm despearte . I wanr to feel how it is to want to win.\n\n&#x200B;\n\nEdit: I wish things were as simple as in comic books. *I want to be a Hero! I must avenge my family! Uncle Ben!* \n\nOh and incase anyone was wondering, Yes. I absolutely did lead a cushy life. But I want to change!!! I'm doing to Daily Tasks, but how can I convince the player to hand over my controls to someone else.? Someone more enthusiastic about life.\n\nAll I'm doing is chasing the next high and running from responsibility ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p1t7n3/i_want_to_be_restless/", "title": "I want to be restless.", "social_network": "reddit", "user": "PanacottaCat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 264, "down_vote": 0, "creation": 1628614325, "permalink": "/r/DecidingToBeBetter/comments/p1t7n3/i_want_to_be_restless/", "nsfw": false, "first_save": 1635435773.5259616, "replies_charged": false}