{"id": "t5_2tand_t3_o38xx0", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "[**\\[ADVICE\\] \"Importance of Purpose in Life\" How I transformed my life from a big failure to a disciplined music producer out of nowhere**](https://www.reddit.com/r/getdisciplined/comments/o38wtq/advice_importance_of_purpose_in_life_how_i/)\n\nHey guys. Don't mind my grammar mistakes, I am getting better at it. Anyways let's start,\n\n2 Years ago my life took a major downturn when I 'failed' in 11th Standard (high school). It was depressing at that time. My respect amongst people degraded, people thought I'm going to be a average wager just like 80% of the majority. My relatives even gave me the advice to stop study and get a job which may provide me like $80-$150 per month. My confidence levels dipped, I became more anxious in public and was scared to meet my 'girl' friends (only 1 lol). Also I was an Introvert too (I still am). The only \\*good\\* thing that happened was that my homie also failed so I kind of got a company.\n\nBtw by 'fail' I meant, I was not allowed to enter the next and the final standard of High Schools in India, 12th Standard. Afterwards there's college.\n\nSo now, my family decided to let me go in an OPEN SCHOOl. Basically in these kind of schools, you just have to go classes like twice a week on Sat & Sun. So I loved it because I hated social interactions completely. It was like blessing in disguise.\n\nNow fast forward to November 2019. As expected once again I f\\*\\*ed up my studies, didn't paid attention and now a HUGE backlog of syllabus is terrifying me. I decided to get serious now. It's now or never situation because passing '12th standard' is a MUST for any BIG future endeavors in India.\n\nI stopped all of my social media, games and limited my phone intake COMPLETELY! I installed multiple app blockers in phone and they really helped me up. By the time March 2020 came (exam month), I was more focused, I was even exercising almost daily and fast forward to June 2020, I passed with 70% score. I guess it's not an great score but an great upturn from like 33% in 11th.\n\nSo basically, a phonecall from my teacher in 2019 November started all this 'get disciplined' thing. But the story is not over.\n\nMidway thru the period March 2020 - January 2021. I slipped once again. Not completely but I definitely slipped off my Radar. Lockdown was imposed in March + excitement of exams being over, I installed all social medias and the usual story. I was consuming Twitter for more than 6 hours average until November 2020. But I never stopped trying. Amidst this all I was constantly 'TRYING' to improve. Writing Journals everyday, reading books, reading great content etc etc. But still the majority me was hooked to the social media shit.\n\nNow begins the ultimate transformation:\n\nBy now:\n\n\\- I got 70% in 12th\n\n\\- I left an major engineering examination because I realized it's not my thing. (Major major leap)\n\n\\- I decided to pursue something else. My parents got me a great PC rig for the same too but again I wasn't invested in it. I wasted my time.\n\n\\- I can say I wasted April to January. Like complete waste If I see from Career POV. Anyways continuation:\n\nNow fast forward to January 2021. As you know, every new year, you start with HIGH ambitions and goals. I did the same. It was fine. I was little disciplined with almost zero social media addiction. Now India won an Cricket series against Australia (It was huge contest) on 19th January iirc. I was overjoyed. I had installed FL Studio (music production software) just for fun because it was available on piracy site. Never had any intention to produce music at all. But I had a thought to create an remix of this video in FL Studio ([https://www.youtube.com/watch?v=wNG0W45iCHI](https://www.youtube.com/watch?v=wNG0W45iCHI)). And BOOM! I found it so interesting I can't even describe. Like it opened door to a new life for me. Here's the remixed track (VOLUME WARNING [https://drive.google.com/file/d/19jJaexfAc\\_yZuzjzOgsL9xNgRjeS1bkw/view?usp=sharing](https://drive.google.com/file/d/19jJaexfAc_yZuzjzOgsL9xNgRjeS1bkw/view?usp=sharing)) LOL.\n\nEver since that day, Life's been helluva ride.\n\nNow that I've found my purpose of life (to be the best music producer) things look so streamlined and organized. MUSIC Led me to learn\n\n\\- Photoshop / Photo editing skills\n\n\\- Premier Pro / Davinci / Video Editing skills\n\nIt was only possible because of music otherwise I had tried to learn both of these in past for a million times yet I got bored and gave up and now it's just feels so exciting.\n\nNow,\n\n\\- I wake early, go to bed early\n\n\\- I speak/chat with confidence with girls and seniors\n\n\\- Daily working out, getting in shape. Was 78 in January 2020 and now I'm 63.\n\n\\- Constantly learning new and new stuff to improve my craft. Focusing with extreme attention.\n\n\\- Completely healthy diet. I don't consume fast foods at all now and my daily intake of oils now is ZERO. Huge leap for me.\n\n\\- I still am an Introvert but I am getting better but I love being a Introvert. That's a different story in itself lol.\n\nYou see the power of Purpose. It's crazy. A failure guy like me now tame twitter addiction like a badass. Twitter is unblocked yet I don't even open it unless I have to promote my music. Let me tell you a night before my 11th Final exam in 2019, I was using Twitter and trying my best to get some Likes & RTs.\n\nSo the conclusion is,\n\n\\- Find your purpose. Just TRY out things in which you even have 1% interest. You're in a for long long journey. Just don't give up and continue hustling every damn single day.\n\n\\- Clear your outside and inner circle asap. Messy shit? NAH\n\nThat's it. I hope you're not puzzled by my juggled transformation story lol. This is my first ever post I believe in which I've written by heart.\n\nBtw now that you know my first ever track, you can see my progress in music here (latest video: [https://www.youtube.com/watch?v=kzdTcg-ugr8](https://www.youtube.com/watch?v=kzdTcg-ugr8))\n\nThank you for reading till here. I wish you all the best.\n\n\\- Suraj", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o38xx0/importance_of_purpose_in_life_how_i_transformed/", "title": "\"Importance of Purpose in Life\" How I transformed my life from a big failure to a disciplined music producer out of nowhere", "social_network": "reddit", "user": "insane_suraj", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1624080101, "permalink": "/r/DecidingToBeBetter/comments/o38xx0/importance_of_purpose_in_life_how_i_transformed/", "nsfw": false, "first_save": 1635435569.7361522, "replies_charged": false}