{"id": "t5_2tand_t3_p35mko", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "The purpose of this post is to tell my story and see if anyone else had a similar experience.\n\nA little about me, I’m a 25 year old guy, living in the US. Currently doing hybrid home/office work\n\nI never had intense anxiety or depression, I’d have minor normal anxiety, you know like trying new things or new places but never major. Some times I’d have the blues or whatever it’s called but I’d entertain myself\n\nI used to be a heavy weed smoker then slowly cut down to quitting about a two years ago but maybe a year after I quit I started slowly smoking on occasions then moved over to smoking a 1:1 CBD:THC every night for relaxation purposes and sometimes I’d over do it and go a whole week of smoking the 1:1 every hour or so of every day that week then I’d cut back to nights only. \n\nNow I am familiar with panic attacks from being too high, I’ve had those a few times on edibles but haven’t had them since I quit heavy weed smoking, until one time I smoked too much 1:1 that I had a panic attack on it and after more than a year of not having panic attacks it was really scary since I forgot what it felt like. That made me quit 1:1\n\nFast forward a few months I discover delta 8 which sounded like heaven, thc without the anxiety, so I introduced that into my nightly routine\n \nI was also vaping (juul) and taking ashwaghanda along side D8\n\nWhat I didn’t know about D8 it is that you build tolerance to it pretty quick, so one time I ended up smoking too much and had a panic attack and decided to cold Turkey, so it did but didn’t have very intense withdrawals which I’m guessing is because I had nicotine and ashwaghanda to help\n\nMe not knowing the consequences, went and quit nicotine and ashwaghanda both cold turkey as well a few days after quitting D8\n\nFirst couple of days were fine, I think I kept myself busy or just didn’t think about it but then I was working on something with a friend and all of a sudden I had a major panic attack and ended up going to urgent care because I thought I was dying\n\nThe following week was just hell, constant anxiety/depression, had another 2 panic attacks and just been in lack of better words not normal\n\nThis is now week 4? And I’m getting better, thank god no panic attacks since the last two I had in the 2nd week, I had a few depressive days and anxiety is still there\n\nI developed some kind of fear of having anxiety/panic attacks that I’m tryina get over\n\nNow I don’t know what happened, did I fry my serotonin/dopamine receptors or just need my body to get back to homeostasis?\n\nKeep in mind I quit weed/nicotine/ashwaghanda before several times over the years but I never had things like this happen to me, only different factor I can think of this time was the delta 8, however, I also didn’t quit all cold Turkey and always had something to rely on or was busy\n\nSorry for the really long post but I had to just let it all out and thanks for reading", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p35mko/quit_nicotine_and_thc_cold_turkey/", "title": "Quit nicotine and thc cold Turkey", "social_network": "reddit", "user": "wale5", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1628792411, "permalink": "/r/DecidingToBeBetter/comments/p35mko/quit_nicotine_and_thc_cold_turkey/", "nsfw": false, "first_save": 1635437158.6468625, "replies_charged": false}