{"id": "t5_2tand_t3_l2n40i", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "I've been meaning to put some recent thoughts to paper, on way to optimise our personal and collective human experiences (particularly in regards to health). And have finally got round to it! I work with psychologists and neuroscientists, and find thinking about how our brain is wired so fascinating! I hope you get some value from my thoughts....\n\nFirst, an important reminder. Each of us is simply a mass of chemicals (99% oxygen, carbon, hydrogen, nitrogen, calcium, and phosphorus), going about our days on a very nice rock 🌎, flying quickly through space. We sometimes tell ourselves that we're intelligent enough that we should be fully in control of ourselves (including our physical and mental health)....but really we're operated by millions of chemical and biological reactions, which have been trained and honed through evolution over hundreds of thousands of years. When you put that into the perspective of the modern world, our bodies and brains were not setup for this environment. So, the best we can do, is understand more about these automatic reactions within us, and what we can do consciously to help.\n\nIt's this combination of understanding, followed by conscious intentions and actions, which gives us a little more control. The enemy of good health, in the modern environment, is 'autopilot'. If we leave our body to its own devices, then our inbuilt instincts will have us resting as much as possible (to conserve energy for hunting) and eating the highest energy foods, particularly sweet and salty foods (to develop a fat layer for winter survival).\n\nSo, where can we go from here? Here are my top suggestions (developed over a decade):\n\n* Seek to understand more about your body and brain. This could involve signing up to a newsletter, listening to podcasts etc. It's genuinely exciting that science is discovering more each day (particularly in neuroscience)\n* In order to avoid 'auto pilot', try to set an intention for each day (e.g. today I will listen to my body more, and be kind to myself). Plan check-ins with yourself regularly through the day - is your body feeling stiff before lunch, and you need to stretch it? Is your brain feeling overwhelmed in the afternoon, so a breathing exercise might help? Are you feeling anxious in the evening and looking for a distraction, like a drink or late evening snack? Is there a different way you could respond to that feeling - maybe a walk or playing some music? Checkins increase our awareness, so that we can consciously decide which actions to respond with.\n* And in case we slip into auto pilot for a while (which we all do!), let's make sure that our internal belief system is pointing in the right direction. The widely adopted psychological theory, Theory of Planned Behaviour (Ajzen, 1991), suggests that what we internally believe about ourselves is a significant driver in our actions. For example, if we tell ourselves 'I am a healthy person who enjoys eating fresh foods and going for walks' then we're more likely to do these behaviours without thinking. And by the way we can change our internal beliefs through methods as simple as repeating mantras - the 'fake it til you make it' approach has genuine scientific merits.\n\nLife is so much more fun when we feel good about, and on to,p of our mental and physical health, I've experienced this personally, having really let me health slip earlier in my career. But now I aim to support others in this. I work at a company called Holly Health, where we're trying to make it much easier for anyone in the world to go through this transition - building behaviours and understanding their body and mind. Of course feel free to check us out if interested (you can google us).\n\nI have a tonne more thoughts which I hope can be helpful, so will try to post more soon :D", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l2n40i/understanding_our_evolutionary_context_in_the/", "title": "Understanding our evolutionary context in the modern world (our brains were not built for this!!)", "social_network": "reddit", "user": "graceg222", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1611319940, "permalink": "/r/DecidingToBeBetter/comments/l2n40i/understanding_our_evolutionary_context_in_the/", "nsfw": false, "first_save": 1635437241.5605695, "replies_charged": false}