{"id": "t5_2tand_t3_iz7raj", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "\nI used to believe that if I couldn’t do something perfectly, it meant I just shouldn’t do it at all. As you can imagine, this mindset kept me from doing A LOT. \n\nI’ve been pretty hard on myself lately. Old beliefs that I’m not good enough & old guilt over hurtful things I’ve done in my past have been boiling to the surface. I used to think that healing & progress should be a straight upward path. I had this idea in my head that I should be improving immediately and when I didn’t see that progress quickly enough, i’d give up. I now know that progress isn’t a straight line - it’s a spiral with different points along the way. I learned this analogy in a healing session a few weeks ago and it really resonated. I truly know in my core that once something is brought into our awareness we are forever changed - we don’t “revert back”. Once awareness comes along, we have the option to align our actions with our awareness or not. \n\nSometimes my actions and words are aligned with my awareness and sometimes they’re not. When they aren’t aligned, it is my responsibility to see where I am holding myself back and what belief is there that causes me to self-sabotage or continue toxic patterns that I am aware of but not changing. \n\nThis has been a tough week mentally & physically. I’ve been feeling anxious & my heart has felt like it’s locked in a box that’s way too small to fit it and it’s been beating too fast for it’s own good. I’ve pinned it down to a few things: the collective heavy energy of the world, the seasonal transition into fall, and this guilt/shame arising as I dig deep into my own healing journey. I’ve been working on being kind by talking nicely to myself, watching funny things, eating well, staying hydrated, moving intentionally, and meditating. I’ve written in my journal more than usual. I’m taking the steps that I never took before because I’m fully aware of how harsh my energy is towards myself when I’m “not good enough” which is the epitome of beating someone when they’re down ~ that someone just happens to be me. \n\nLike the title says, a few weeks ago I missed a day of meditating. I was on a streak for 185 days in a row which was my longest one so far. Psychologically I was harsh on myself when I discovered I missed a day, saying I was a failure instead of applauding my own commitment. I realized that I always do this - instead of celebrating my accomplishments, I internally beat myself for not being good enough because I wasn’t perfect. I’ve understood so many times that I do this but this time was a much deeper understanding. My awareness has grown to another level even though it’s a similar situation and realization presenting itself. \n\nBeing able to see that I do this, I was also able to counteract what action I usually take out of a toxic mindset. Every single time I stopped a long streak of meditating, I would stop meditating for months. It was this underlying belief & habitual behavior that if I can’t do it “perfectly”- there’s no point in doing it at all. I can see so clearly how this belief has manifested into years of inaction ~ years of being too afraid to fail that I didn’t even try. This time, however, even though I was upset at myself (work in progress guys) I just decided to get back into it. I didn’t stop my meditation practice, I actually revamped it and have recommitted to myself to take this time for me each day. And I’m not doing it because “I have to”, I’m doing it because I can feel a difference in my entire energy when I don’t. \n\nThe things I’m struggling with internally are hard & I am allowing myself to be ok with all my emotions (even the ones that feel not ok) but also using tools that I have to help support my overall well-being. I’m on day 16 now, and it feels even better than that day 185 because I know what a big deal it is that I just started right back up again instead of taking a few month hiatus bc I was so disappointed in the fact I ruined a streak that literally doesn’t matter at all. It’s not important that I do something all the time because life happens. It is important though, that if I stop- I always start back up again & make today the day I continue a healthy practice. \n\nThis felt like a big win & I thought I’d share with y’all. I hope that this can be a reminder to you that even if you don’t do it perfectly because let’s face it ~ we’re human and we’ll never do anything perfectly, you will commit to yourself enough to start back up with doing the things that are good for you because you deserve it. \n\n~\n\nTL;DR \n\nmissed a day of meditating and “ruined” my 185 streak. instead of giving up like I used to I just started right back up again and feel great because the old me would’ve spent months not meditating out of guilt/shame that I didn’t do something perfectly. \n\nI hope that this can be a reminder to you that even if you don’t do it perfectly because let’s face it ~ we’re human and we’ll never do anything perfectly, you will commit to yourself enough to start right back up with doing the things that are good for you because you deserve it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iz7raj/i_missed_meditating_for_a_day_and_instead_of/", "title": "I missed meditating for a day and instead of reverting back to old self-sabotaging habits & giving it up for a few months, I just started back up again. I am super proud because I know this is healing & growth.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3307, "down_vote": 0, "creation": 1600987968, "permalink": "/r/DecidingToBeBetter/comments/iz7raj/i_missed_meditating_for_a_day_and_instead_of/", "nsfw": false, "first_save": 1635437934.9670348, "replies_charged": false}