{"id": "t5_2tand_t3_2yt02j", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I feel stuck and complacent. At times I think I am 41 now I should just shut up, stay where I am, and just become a cog in the machine and wait until I can hopefully exit in 20 some years.\n\nLife is good. I can't really complain about it. I am in a job that allows me to take care of a family, have two cars, and a small home. Both my wife and I work. This is the \"American Dream\".\n\nI feel very unsatisfied professionally, I suppose. I've been in I.T. for over 20 years now and I've not gotten beyond working on helpdesks. I got a chance to move over into Networking, but that ended horribly and now I am totally mentally blocked from trying to further my knowledge there. I hate it and I've tried to overcome it, but I just get frustrated and quit.\n\nMy job is low key, easy, and not a challenge at all. I feel like I come in and look at Reddit and play games for 8 hours a day and get paid for it. Seems stellar doesn't it, but it is life sucking. I try to use the down time I have to study up on other things, programming, networking, security, stuff like that, but I just feel like it will just lead me no where. It's a fairly safe job, but as it continues to grow there is a chance that another business that is bigger will swoop in and buy us out. That might be what the president and those people want in the end.\n\nWe have an Amazon Call Center where I live and I see that they are taking applications for desktop support people. I went ahead and threw them my resume. If I get an interview, I can at least see if it's any better, but then I feel I am just doing a \"grass is greener\" look. Work is work wherever you go. There are some variations, but for the most part it will be the same thing no matter where you go, at least in IT.\n\nI beat myself up sometimes that 20 years ago I should have stuck with psychology, my first college major. I would have completed that degree and moved into psychiatry and \"made something of benefit to the world of myself\". I could be helping people and actually changing the world in some way. I doubt what I do now does anything, but make the guys at the top richer. I've been told to go back to school and follow that dream. Right. With the money I make, I can't afford it. I could get loans, yes, but now with an 11 year old daughter, I need to start thinking of getting her educated.\n\nI find myself resenting my brother in law's good fortune. He calls and invites us on trips, Las Vegas, California, Hawaii. And we just can't afford to go. My wife's mom and dad are retired and travel the world. He has this big million dollar home and monster truck and I have a single floor, seven room shack and a 10 year old Toyota. I feel like we are viewed as the \"poor side of the family\" because we cannot pick up and go to these places or afford all these expensive things. A $4000 plane ticket is much better put in a savings account for my daughter's education right now than my trying to capture a failed opportunity or sun myself on the beaches of Hawaii.\n\nI hate feeling this complacency and this feeling like I have failed, but I don't know what to do, so I just go back to being a cog. \n\nHow can I decide to be better?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/2yt02j/stuck_and_complacent/", "title": "Stuck and complacent...", "social_network": "reddit", "user": "VaccusMonastica", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1426175820, "permalink": "/r/DecidingToBeBetter/comments/2yt02j/stuck_and_complacent/", "nsfw": false, "first_save": 1635436028.1476257, "replies_charged": false}