{"id": "t5_2tand_t3_o4u4b9", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Hey, i feel like my life is spiralling out of control. Everyday i feel like absolute trash. I am dying inside. I always say i am going to change for the better tommorrow but yet i fail to do so over and over and over again. I procrastinate and i feel like shit. I want to study i want to do my work, i want to learn how to play the piano but i end up spending countless hours scrolling social media, lazing around and playing games. I fucking hate it. At the end of the day i always feel like shit and i cant stop myself. I do not know whars wrong with me. It also doesnt help that i think there is something wrong with me. I lost my dad a little less than 2 years ago and that is getting to me now. I also recently went through a break up 2 months ago and i feel really tired of all this shit. I want to open up and just tell someone but i dont know who to ask for help. I dont want to tell the counsellers or teachers in my school as i dont really feel comfortable sharing my problems. My family is also very sensitve about this dad situation and i cant really open up with them as they would just break down. I dont usually share my problems with my friends and some of them have their issues too. I usually am the happy and cheerful one who brings the vibe to my friend group and i dont wanna break the vibe and all with my own personal problems. I really just need some advice on what to do. If no one really bothers its fine too, thats how i have been going for the past few weeks anyways. But if anyone would be kind enough to read and give me some advice, i would really appreciate it. I just wanted ti get things off my chest anonymously on reddit. Thanks.\n\nTldr : i feel like my life is spiralling out of control because of my procrastination and personal problems. Would like some advice, if no one bothers its alright too. Just wanted to rant. Thanks :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o4u4b9/my_life_is_spiralling_out_of_control/", "title": "My life is spiralling out of control", "social_network": "reddit", "user": "sutanoz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1624279008, "permalink": "/r/DecidingToBeBetter/comments/o4u4b9/my_life_is_spiralling_out_of_control/", "nsfw": false, "first_save": 1635435857.1771553, "replies_charged": false}