{"id": "t5_2tand_t3_of6vxh", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "I am 22. I am gainfully employed at a job which fits my talents and, on paper, my passions as well. I don't think there is any alternative career which would better suit me yet I often struggle to appreciate the problems the job entails due to completely internal distractions.\n\nThe same applies to my partner. I have not had any other serious partners during my adult life. I have seen this partner for the past four years and, save the occasional bicker, our attitudes and outlooks on life were mostly compatible.\n\nI broke up with this partner seemingly abruptly 3 days ago. She had begun the work of searching for a new lease as our current expires within the next few weeks. I found myself dragging my feet and, after reading into it, realized it was due to an uncertainty in my willingness to participate in the relationship long-term. Like I've said, my partner and I get along great despite some problems that plague many relationships (sharing chores, allocation of time, etc) that we probably could have worked through.\n\nI broke up with my partner for a number of reasons:\n\n* I had never experienced being a single adult and felt it was vital to have a point of reference in order to assert that being with her was what was best for me.\n* She wants to have kids by the age of 30 and I am not sure that is something that I necessarily want out of life. I told her time-and-time again that I could not promise I would ever want to marry or have kids: she would respond by telling me she definitely wanted those things but would reevaluate our relationship as time continued to pass.\n* I found myself struggling with hard-to-phrase existential dread and having some expectation of her being able to resolve or at least speak to these issues. For example, I struggle to grasp the limit of my life's time and have anxiety about whether or not I am best using this time.\n* part of me wonders if there is a partner out there I could connect with more deeply, who could understand me in ways that I couldn't obtain through communication with this partner.\n\nEven now, I have a hard time declaring that these are the definite reasons I broke up with her. Overall, I just felt uncertainty, and an over-reliance on her emotionally that wasn't necessarily being fulfilled as I (perhaps unfairly) expected.\n\nI guess I just want confirmation that my feelings are rationale, and have been experienced before. I want to know what I need to provide myself in order to one day be comfortable committing to this or another partner long-term.\n\nFor the time being, my only concrete plans are to rent separately from her s.t. I am forced to spend time alone and seek out friends (current and future) to help pass my time. I am not sure where I should venture in order to determine what exact issues plague me internally and how to move forward in coming to terms with these issues.\n\nFor what it's worth, I am currently in a somewhat anxious state but honestly probably not much worse than when I was in the relationship. I constantly worry about things like \"did I make the right decision\", \"am I currently wasting my time with my actions\"... and I am upset at the thought of no longer being able to share in this woman's presence, engage with her, give and receive physical affection, etc.\n\nNot sure what I'm looking to get out of this post but, I know in some way I need to become \"better\" than I currently am. Because if I lived the rest of my life with the same thoughts and sentiments that I currently hold, I would not be able to die happily.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/of6vxh/at_22yearsold_i_feel_like_an_adult_with_no/", "title": "At 22-years-old, I feel like an adult with no concrete objectives in life. I broke up with my partner of 3 years because I can't focus on another human without confidence in what will satisfy me.", "social_network": "reddit", "user": "weird_emotions", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 175, "down_vote": 0, "creation": 1625614455, "permalink": "/r/DecidingToBeBetter/comments/of6vxh/at_22yearsold_i_feel_like_an_adult_with_no/", "nsfw": false, "first_save": 1635436703.130497, "replies_charged": false}