{"id": "t5_2tand_t3_exlctr", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "Last week my little sister accidentally broke her tablet, merely the latest in a long string of broken/lost tablets or phones she's had over the years. Since my sister's so accident prone my parents refuse to fix her tablet or buy her yet another device, but so she doesn't die of boredom she's come running to me to use my phone or laptop to entertain herself. Since she's broken/lost her devices so often, she knows the passwords to my phone and laptop from the past times I've let her use them. Whenever she's broken/lost something before I've always tried to be the cool older sister and let her use my stuff until our parents inevitably get her another device, but this time I've finally gotten tired of it. \n\nEarlier tonight when I went to her room to retrieve my phone for the night, I asked her if she's going to keep using my phone and laptop like this everyday until her tablet's fixed/replaced. She smiled, chuckled, and said \"Yeah probably\" and that flicked a switch in my head that I need to finally cut off her access to my stuff. They way she said that made me realize she *expects* me to just give her my devices. She knows that whenever her wifi is cut off and my parents are punishing her for breaking yet another device, she can turn to me to always bail her out. It's gotten so bad she no longer even asks me if she can use my stuff, I just wake up in the morning to see her already on my laptop or phone, like she has a right to use my hard earned devices whenever she's bored. Just now I went through my phone settings and reset my password to something obscure she'll *never* guess, and I got out of bed and did the same to my laptop. I didn't write the passwords down anywhere so there's no chance she'll ever find out what they are. \n\nShe's gonna be fucking pissed when she wakes up in the morning and finds out but I don't care. I'm sick of her always treating me like a backup.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/exlctr/i_changed_the_passwords_on_all_of_my_devices_so/", "title": "I changed the passwords on all of my devices so my little sister will stop taking advantage of me", "social_network": "reddit", "user": "ThroughMyOwnEyes", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1580631214, "permalink": "/r/DecidingToBeBetter/comments/exlctr/i_changed_the_passwords_on_all_of_my_devices_so/", "nsfw": false, "first_save": 1635435133.2720666, "replies_charged": false}