{"id": "t5_2tand_t3_m292z7", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Edit: The deed was done at 02:48 last night\n\nLong story short: I'm a 22 yo dude, engineering student. I struggle with impulse control and self-regulation to the point where it's ruining my life.\n\nFor example, I was never able to regulate League of Legends, so I had to uninstall it. Nor could stay off my smartphone, so I got rid of it. Instead I have an old nokia-ish phone. And now, I'm not able to regulate my use of the internet: YouTube, Anime, Porn, I can't control it. On all those things, I easily pull of 16 hours a day. It has taken over my life.\n\nI'm not eating properly. I've fallen really far behind with my studies. I'm 4 weeks behind in 3 subjects, and 6 weeks in the fourth, yet I'm somehow managing to do the obligatory work, thanks to lectures being recorded. I feel horrible about myself. Yet I cannot do anything about it. I've tried and tried and tried, but nothing has worked.\n\nTherefore, tonight will be the end of my laptop. I've bought two cans of pringles to snack on. I've tidied my room. Watered my plants. Made my bed properly, arranging my four pillows in a neat fashion. I've turned on some lights to create an atmosphere. A white one, an orange on, and a light chain I made a little while back.\n\nI've cleaned my desk and have a glass of water ready. I'm my morning robe, 6th floor view, at 22:05 at night. It's a little bit warm, so I've turned down the heat a little. The preparations are ready, feels like a ritualistic cleansing of my room.\n\nMy PC would turn 4 years old this Easter. More or less at the end of its lifespan, the screen hinge is a little bit broken so it won't close, but other than that it's fine. I'm gonna take out the battery and snap it in two at the hinge- That's how it'll go. Would love to show you a photo, but I ain't got a smartphone so most likely not happening. For those wondering, it cost me 830 USD to buy + 320 USD to buy a new battery, for a total of 1150 USD.\n\nThere are stationary computers on campus, so I can watch lectures there. So although it sounds harsh, I'll manage just fine. I'll find a way to make things work, the same way I did when I threw my phone away. I'm also going to see the doctor tomorrow, wanna get checked for ADD/ADHD (it runs in the family, would explain my struggles with impulse control and problems with structuring myself).\n\nThe time is 22:20. I've cracked open the first Pringles can. It's sweet paprika. The other one is sour cream and onion. I'm gonna have my last internet run on my PC. Watch some YouTube, maybe some anime or manga. Probably attack on titan, been saving up a few episodes there. I'll update you tomorrow after the deed is done.\n\nCheers to a brighter future.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m292z7/gonna_break_my_laptop_tonight/", "title": "Gonna break my laptop tonight", "social_network": "reddit", "user": "Starter_OTGG", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1615411549, "permalink": "/r/DecidingToBeBetter/comments/m292z7/gonna_break_my_laptop_tonight/", "nsfw": false, "first_save": 1635435875.6920567, "replies_charged": false}