{"id": "t5_2tand_t3_q0h5k3", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "When I was 18 my exfiance introduced me to a couple of her friends, at that point in time I was just getting to know her so I didn’t know she was addicted to it ( she smoked weed and I was joining the military so I wasn’t smoking at the time). Earlier that same year before I met her I was kidnapped and was struggling with that trauma trying to find a way to escape by drinking and cutting. One night a couple months before I went to basic she asked if I wanted to try some and my motto then was “I’ll try anything once” (this phrase had broken me down into a full blown drug addict) which began my spiral out of control into a drug filled life. I went through basic and was discharged (not drug related) and was sent home. All I ever wanted in life was to be in the army and that was stripped away from me. When I got home I was overly depressed still suffering from the ptsd of my kidnapping now added on losing what I worked my whole life to get to. The day I got back my ex fiancé took me to her friends house. $1,300 in drugs later I died. I had a heart attack. I was off 23 different drugs that night and lost myself. Fast forward a year and some change and my exfiance and I were 2 full blown crackheads. You couldn’t tell by looking at us we had jobs were stable social and had animals we cared for but beneath all that was a heavy coke addiction. We were doing an 8ball up to a quarter a day. Every day. That’s not including my previous lean, acid, ecstasy, weed, perk, Xanax, oxy, cutting addiction which cost so much I resorted to scamming and fiending. I had a front of $3,500 with one of my dealers because of all the substances. Fast forward another year and I’m rushing my exfiance to the er. She had an incredible pain in her stomach andthought she was dying. Turns out she did so much coke it melted her stomach lining. We went to the doctor almost every week for half a year plunging us into medical debt. The following year our relationship got really shaky, she went behind my back and became an escort. She had been secretly selling pictures behind my back for years but this was to much for me. I’m a loyal person and this broke me down after all the pain and bs we went through. When I found out she started doing suicide attempts to try and make me pity her. We broke up may of this year because of that. Since then I’ve been in 2 extremely toxic drug involved relationships which have plunged me deeper into my addiction. I’ve been so lucky recently because I found the girl of my dreams who wants to help me get clean. I’m a hard headed person though and coke is a hard thing to admit you’re addicted to because you can go a day or 2 without it but then the withdrawals take over and you go running back. I’ve been able to quit every other drug I’ve ever been addicted to with little effort but I could never seem to be able to escape coke. I have been doing 1-2 grams a day recently which is a slight improvement from years ago but last night showed me the true long term heavy use effects of coke. I went out doordashing to earn some money so I could by my girlfriend some cute things that she wants. But on my second order at around 2 am I accidentally locked myself out of my truck. If you know me you know that NEVER happens I’m very conscious of my vehicle and my belongings. I was so high that I was confused and didn’t see a way to get in. That also isn’t like me because I like challenges but I just shut down unable to do anything but cry. High, alone, scared and in the middle of a cold night. Embarrassed and in the middle of nowhere. I ended up breaking into my truck with the help of a random guy who was about to head to work praise god he was there. I used those hours in the cold realizing that I was going to be stuck if I didn’t change and I never wanted to be put in that situation again. It reminded me a lot of the night I was kidnapped. On that night I had smoked too much weed (I don’t consider weed a drug because it’s used medically to help aid a fair amount of issues) so high alone and scared I was taken to the middle of nowhere. I’ve died 13 times in 4 years. I refuse to ever be controlled by the past or a substance again. Today I’m taking my life back. If you have any questions or want to quit with me just message me or leave a comment.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q0h5k3/today_im_quitting_cocaine/", "title": "Today I’m quitting cocaine.", "social_network": "reddit", "user": "Serious_Try9100", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1841, "down_vote": 0, "creation": 1633265587, "permalink": "/r/DecidingToBeBetter/comments/q0h5k3/today_im_quitting_cocaine/", "nsfw": false, "first_save": 1635436924.8548234, "replies_charged": false}