{"id": "t5_2tand_t3_ng2sz0", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I have 20 years old. Studying pedagogy. Month and half ago I got my heart broken by a girl i used to live with, and wanted to spend a rest of my life with. We even go to same college. Until the day before yesteday, I really missed her, wanted her back, and though about her all the time. I just got my mindset back and I am now looking at things different way. I am happy that she happened to me. Now I want to focus on some things:\n\n-First: I WANNA WORKOUT:\nI want to get bulky, since I am slim. Need to get 15 kg to have perfect body (on my height). I even got Power Ressistance bands, and I can  homeworkout in my room in dorm. Also I don't drink or smoke weed for 6 months. I even quit cigarettes, and now smoke electric cigarette with some fruit oil without nicotine, for 3 days. \n\n-Second: I NEED TO FIND A JOB:\nShe started working. I should too. I can't live under my parents wings anymore. First, because they send me money rarely, and I don't know how to save money. Second, I got a car, and now I need to work for licence. And third, I need to get new clothes, since I love to dress up well, and love to combine outfits. \n\n-Third: I NEED TO PAY MORE ATTENTION TO COLLEGE:\n I am really out of tempo, and shape for college due to her, and some medical problems. I don't wanna quit it. But I need to follow lessons and be on excersises, even if it is online. Soon we will have exam period. I plan to give 5 exams and if I do, I am on budget, and till the end I just give exams left.\n \n-Fourth: I GOT SOME MEDICAL PROBLEMS:\nI have some man problems and I wanna take care of it as soon as possible.\n\n-Fifth: I WANNA CHASE DREAMS AND FINISH GOALS:\nI am writing a book and direction for romantic movie (also it is autobiography), also I write texts for songs. And I even made songs in FL studio. So If anybody's interested in helping me, or in collaborating, write me. \n\n\nNow I need to organise and prioritise stuff and then go and get it all. Maybe after I do it all, I get new girlfriend or she comes back. I will keep you updated on my progress. Thank you!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ng2sz0/its_time_to_change_some_stuff/", "title": "It's time to change some stuff", "social_network": "reddit", "user": "CyberXydra11", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1621422290, "permalink": "/r/DecidingToBeBetter/comments/ng2sz0/its_time_to_change_some_stuff/", "nsfw": false, "first_save": 1635437998.2242854, "replies_charged": false}