{"id": "t5_2tand_t3_ps10z6", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": " Hi again, \n\nIt’s been 90ish days since I deleted my 200GB porn collection and as per request here is my update and for those who missed it, here’s the original [Post](https://www.reddit.com/r/DecidingToBeBetter/comments/o4dvrf/deleted_my_200gb_porn_folder_leftunfollowed/?sort=new):\n\nI didn’t go into too much quantifiable detail on my porn habits in the original post, so let me outline where I started.\n\nBefore making the post, I found myself watch far too much porn, each session would last sometimes an hour and I would often find myself on page 40 or so on a website in my attempt to find a video to fit my ever-growing standards. This led to me wasting a huge amount of time and getting in different media of porn such as gaming which only further increased the time wasted. In each week I would say I spent around 15 hours consuming porn which in turn lead me to gather a huge collection of 200GB.\n\nUpdate:\n\nI didn’t really have a plan, I didn’t know if I wanted to go completely porn free, or FAP free or just aim to reduce the amount. \n\nI started out strong, not watching Porn or Fapping for 22 Days. This was more of a personal challenge to see how far I could go and how I felt and wow was it tough. I found myself \"accidentally\" finding porn which maybe should have ended my streak but I was quite flexible on myself. During this time I had so much pent up sexual energy which my partner loved. Annoyingly, I broke after a random Instagram post of someone I missed when unfollowing that kind of content. I was proud I made it this far but obviously disappointed.\n\nAfter that failure, I relapsed a couple more times. Instead of trying the same thing, I took a user’s recommendation of Gonewildaudio as an alternative, I managed to use it for a week, but it seemed to make it worse and when I relapsed this time it was much worse. The content there is quite non-vanilla (or at least what I was attracted to) and was a gateway for me.\n\nI spent the next 2 weeks fighting with myself, breaking every other day, sometimes twice in the same day. I felt like couldn’t help relapsing, I would just find myself watching it, somehow. so I targeted the time wasted. I started limiting myself for 15min each session which helped massively knowing I could, but it wastes a whole hour or two and stuck to mostly vanilla stuff.\n\nIt pretty much stayed like that until I took some advice on my original post seriously. I relapsed because I was bored and put myself in that situation. For the last month, I joined a gym and actively try and spend more time with my friends and partner; this doesn’t put me in the environment which I could. \n\nThese combinations of life changes have really reduced my 15 hours a week to about 1. I don’t save anything and It’s a lovely feeling when people used my PC and I'm not worried of them finding the collections. I’m not too sure how I feel about that 1 hour a week, I’ve read on how dangerous porn is to our brain and I still regret it after, but I’m split between trying to cut it out together or allowing that 1 hour to keep it at bay. It's still a mission for me to resist, I could easily fall back into old ways. It's not the success story I wanted but I'm certainly in a better place than I was.\n\nThanks again for all the lovely comments on my previous post, they did really help. It gave me insights into other people journeys and how porn can negatively affect people/relationships. Just be mindful of your online habits and make sure you don’t lose yourself.  \n \n\nOnce again apologies if this is poorly written, hopefully, it's clear enough; Dyspraxia is a bitch.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ps10z6/3_month_update_deleted_my_200gb_porn_folder/", "title": "3 month Update: Deleted my 200GB+ porn folder", "social_network": "reddit", "user": "Doxer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1632163471, "permalink": "/r/DecidingToBeBetter/comments/ps10z6/3_month_update_deleted_my_200gb_porn_folder/", "nsfw": true, "first_save": 1635437501.1564748, "replies_charged": false}