{"id": "t5_2tand_t3_pwcz5t", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "\nJust a bit of background info on me: \n\nI’m starting to take a proactive approach to bettering my life and my mental health. I was diagnosed adhd at 9 and again at 29. Since I started taking Ritalin early this year, my life has mostly changed for the better. I still have some things I need to work on. My anxiety and stress management haven’t decreased at all. \n\nI started going back to school, I ditched my low paying  receptionist job and got a job in my field of study. The people at the new gig know I’m a student and that I have *some* previous relevant experience. \n\nMost people are working from due to covid (which is cool). My role is newly created and I’m the first in the seat. I was given access to all the company docs and files and was told to have a look through and to get to know all the products. Everything is scattered all over the place haphazardly and mixed with old and new documents. It’s a nightmare. I’m on my second week as a coordinator and I still don’t know what I’m supposed to be doing or how I’m supposed to be doing it. I feel a bit put off by not having any training lined up except for some of the random meetings with other departments that were mostly scheduled haphazardly also. Which I had to mostly reschedule. I know I’m hired as a coordinator, but I’m new to the industry in which I’m working in and of course, new to the company. Since I’m the first and only person in this role, they have two more openings for the same role in different locations, but I don’t see them advertised anywhere. Which makes me even more weary that I’m just the guinea pig on a 90 day trial. \n\nI have no idea how to navigate this situation. A perfect example of why I’m here. I get stressed so easily. I’m awkward in the work place. I clearly lack confidence. \n\nI’m looking for some kind of resource for some kind of stress management/job coach thing. I have no idea where to start. I’ve always been easily intimidated and self conscious, especially at work. I can’t help but feel like the dumbest person in the room or the last person last person to get the punchline. Even a sub Reddit suited for this kind of stuff.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pwcz5t/help_with_workplace_stress_and_job_issues/", "title": "Help with workplace stress and job issues.", "social_network": "reddit", "user": "0900990", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1632732151, "permalink": "/r/DecidingToBeBetter/comments/pwcz5t/help_with_workplace_stress_and_job_issues/", "nsfw": false, "first_save": 1635436451.8436413, "replies_charged": false}