{"id": "t5_2tand_t3_dpc7ll", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Today I realized I need to be more assertive to have my boundaries more respected. This is something that I'm pretty good with in most contexts, but I realized I have difficulty with it in very close relationships.\n\nI have very little difficulty at work for example saying \"no, I can't do that,\" to requests since mentally I know it's just work and the person won't be offended. I don't mind telling colleagues if I already have a full plate, or if a task is really not something aligned with my job role.\n\nIn my personal life, I have a lot more difficulty with this, however. I always worry about hurting someone's feelings by flat out saying \"no\" to something. I realized that growing up, my parents never really taught me how to set boundaries and say no to things, and they also didn't always respect my attempts to do so.\n\nThe most difficult time for me is saying no when my reason is finances. There's some things I just don't want to spend money on because to me the experience just doesn't seem worth it. For example: I don't want to spend vacation money on something like a scuba diving course because I honestly don't want to learn to scuba dive and that money could get a lot of really nice restaurant meals, or a couple more nights at a hotel, etc, and swimming without a scuba tank is FREE, and I already enjoy it a lot! I feel similarly about learning to surf. Yet I have a lot of difficulty saying a flat \"no\" when my boyfriend tries to get me to participate in these activities. I say \"no\" in a soft, gentle way that tends to invite my boyfriend (or others if it's a different situation) to try to convince me instead of just leaving me alone and going to do the activity on their own.\n\nMaybe I'd change my mind about things like this if I had unlimited money? But honestly maybe not as well. I get A LOT of joy out of just lazing around with a book swimming a little, and relaxing. I don't need or want to constantly be DOING THINGS.\n\nThis is a bit of a mess, but I just want to learn to say, \"no, I don't want to do the expensive thing,\" or \"no, this is my time to relax,\" in a way that it's respected.\n\nI'm going to work on being aware of it. The next time someone tries to convince me to do something I've said a soft \"no\" to, I'll come back with a firmer \"no\" and tell them I don't want to be convinced.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dpc7ll/working_on_assertiveness_and_getting_my/", "title": "Working on assertiveness and getting my boundaries respected", "social_network": "reddit", "user": "inalotofemotions", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1572466811, "permalink": "/r/DecidingToBeBetter/comments/dpc7ll/working_on_assertiveness_and_getting_my/", "nsfw": false, "first_save": 1635438294.4737098, "replies_charged": false}