{"id": "t5_2tand_t3_ns3b6j", "request": ["eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Nobody talks about how hard it is to not jump into relationships when you know you should be focusing on yourself. I'm (26F) in the beginning stages of being in what is probably the most motivational time of my life. After suffering from severe mental health issues, going through recent traumatic grieving, and starting the divorce process after 10 months of separation, this is actually the most optimistic I've ever felt about life. If I could make it through all this really tough sh*t, I know I'm strong enough to build the life that I want for myself. So I'm at the beginning stages of that. I've been sticking with a 20:4 IF program, eating healthy foods that won't mess with my MTHFR gene mutation, I make myself do some sort of outdoor activity at least once a day, I've stuck to a daily activity regime, I've even been consistently completing my daily morning and evening ADLs, have been working on building my finances, and I finally started my own business in order to pursue my passion. But holy fudge, it is *so hard* to not jump into a relationship. Nobody talks about this. I know that it's not what I should do and that I would regret it shortly afterwards. But no matter how many times I seem to remind myself of this, I can't help wishing I could just fast forward through all of this and start sharing my life with somebody. \n\nAny advice or stories about your own Relationship Detox would be so greatly appreciated!! 🙏", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ns3b6j/i_need_a_relationship_detox/", "title": "I need a Relationship Detox", "social_network": "reddit", "user": "ALife_InRevision", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 127, "down_vote": 0, "creation": 1622807695, "permalink": "/r/DecidingToBeBetter/comments/ns3b6j/i_need_a_relationship_detox/", "nsfw": false, "first_save": 1635437492.9552345, "replies_charged": false}