{"id": "t5_2tand_t3_m857xq", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "This doesn't guarantee complete happiness but it's a goal im working towards again.\n\nIt's a lot to process. I'm halting any controlled substance use. Reason. I feel so gross for smoking weed since I was 15 day in - day out.\nI'll be close to 30 soon.\n\nI'm creating little achievements a long the way.\nDrinking less soft drinks and more water. \nI'm eating less junk food, and I'm deciding to take back my life, my mental health..\n\nI'm not unhealthy by any means but my lifestyle. If I keep it up over time thats what it'll lead to.\n\nI'm trying to not slip into a slump of depression where there's no return. While focusing on things that actually matter to me. Family, work, friends.\n\nIn the mean time I'm using a phone that cannot hold a charge. Tomorrow I plan to buy myself some beautiful flowers and get a new phone.\nI wont be installing any social media apps.\n\nI want to do more things that require me to check my phone less.\nFor what it's worth I think men should be able to get flowers too. I can't stress this enough.\nBe polite to one another, inspire people, and find yourself lost in something you actually love.\n\nOver this past summer when i stayed in a pysch ward, making it my 3rd overall visit. They had wall entirely made of quotes that the patients wrote up there. It was a blackboard and all of it was written in chalk.\n\nThe one quote that stuck with me was \"life is like a glow stick. You have break before you can shine\".\n\nAnd the quote that I chose to write up there was \"Your life is limitless. You're worth more than you could believe. All you have to do is dream, and all you have to do is want to fulfill that dream, and have the strength to fulfill that dream\".", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m857xq/one_thing_at_a_time_deciding_to_better_edition/", "title": "One thing at a time deciding to better edition", "social_network": "reddit", "user": "CovertxChris", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1616114578, "permalink": "/r/DecidingToBeBetter/comments/m857xq/one_thing_at_a_time_deciding_to_better_edition/", "nsfw": false, "first_save": 1635438251.5644538, "replies_charged": false}