{"id": "t5_2tand_t3_po4faq", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "f39f6441-79a5-42c9-8dca-c8455143a12a", "c67213dc-0eed-4cac-a781-9bc082742908", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "f48bf32c-05af-4e9d-b00f-8b45a75af78f", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "I've been lingering on this subreddit reading your guys's progress, and I've been waiting for the right step in my life to finally get my thoughts together to write a post here.\n\nThe last two years has been some of the hardest mental and physical growth I've ever had to overcome. I'm sure a lot of you have felt that the isolation that comes with this pandemic, has forced a lot of us to look inwardly and look deeply at how we are failing ourselves. Depression is an easy pit to sink deeper and deeper into, after all it's something that we're used to. But what's even harder is finally taking the steps to climb up out of that hole.\n\nI am 29 years old, and in just the last year I have made a personal pursuit to seek as many doctors as I can to finally diagnose all the ales me. I had suspected that there was several issues I was dealing with, but I never had anything documented on paper to show. As of today I now know that I have three recognized disabilities: ASD, Fibromyalgia, & (C)PTSD (The United States doesn't recognize CPTSD, but will categorize it as PTSD). My psychiatrist also diagnosed me as OCD, but it's my opinion that OCD is something that just comes with ASD, it's just a part of my spectrum, so I don't see it as something separate. But it is recognized as a disorder as well. There are still a few diagnoses I would like to finally have on paper, but these are some of the harder ones to finally get a doctor to take you seriously: POTS, endometriosis, interstitial cystitis, & IBS.\n\nMy point in bringing these up is to share with you how much my perspective has changed now that I can prove to both my employers and doctors that I'm not overly sensitive, or making it up or \"Munchausen's\". There's nothing more invalidating than having people tell you that nothing is wrong with you, or even worse yet, that you should be on medication.\n\nThe truth is, ***my mental distress was stemming from my environment***. Both of my parents were physically and mentally abusive. They are both narcissists. And I didn't realize how much damage they had inflicted upon me, until I was able to remove myself from their lives. I also had been living with very toxic roommates, at the time, and when I was finding my voice and standing up for myself, my roommates were angry about me getting upset when I refuse to endure abusive behavior. Yes, I am struggling to find my voice, and I'm struggling with just how to do it appropriately. I've been going to therapy regularly for the last 8 months, and I feel that it has done me a lot of good. My therapist is amazing and she helps me validate my feelings and decisions.\n\nI'm writing this post for you all today because I want to take a moment to express how critically important it is to advocate for yourself. A lot of us want to blame ourselves, and have a mental dialogue that is toxic to our well-being, because we're always saying \"something's wrong with me\". When my psychiatrist suggested I start taking medication, I was extremely upset, because I expressed to her that I would be losing my insurance, and could not safely start medication knowing that I would not be able to pay for it once I lost my insurance. She gave me the runaround, I had a few visits with her, and every time she suggested a different medication. A medication for bipolar disorder, a medication for schizophrenia, and lastly a medication for PTSD. I told her explicitly about what had happened to my brother, and that I strongly felt that my environment was causing my depression, and that I would be okay once I removed myself from this environment. Of course, she gets paid when her clients are dependent on medication. But in my case, I was well aware that even if I were to go on medication, it wouldn't change my environment. My environment is what was depressing me.\n\nI refused medication, but instead took a macro dose of psilocybin mushrooms, which forced me to look inwardly, and also gave me the courage to finally stand up. I beat myself up mentally almost every day and struggled to apply for jobs. I would go job searching, find something that looked somewhat appropriate for me, start feeling out the application process, only to find that this company's practices very well would cause me mental distress. Just simply the act of applying for a job was extremely distressing. But somehow by the fate of the Universe, She gave me an opportunity at a job I never dreamed I would have.\n\nI was laying in bed crying, distraught and fearful that I would never find a fulfilling job, and something told me to get up and check the job listing. When I looked at the job listings, a fresh new job had been posted not even an hour ago. It was ***the dream job***; self-motivated independent work that had limited customer & employee interaction. I could listen to my own music for the entirety of my shift, and would no longer have to be subjected to the nauseating Muzac that plays in every retail store.\n\nThis job paid more than handsomely, and was the income I needed to help me move and secure a different place to live. So with the combined help of a fulfilling job, and now the change of an environment, I am now able to stabilize and settle in and start healing the past traumas that I had never been able to take time to deal with.\n\nMy hope in sharing this with you is that it may help motivate you to not just look and blame yourself, but to be kind to yourself, and know that you deserve better. You deserve a change of environment that suits you. There's nothing wrong with you, if it is your environment that causes you distress. If you know you've got a good head on your shoulders, but somehow chaos always finds its way to tear down your spirit, find the courage to tell yourself that you are worthy of better things. \n\nMany of us who've suffered traumas tend to be giving people. We like to distract ourselves by helping others, because we are fueled by seeing others' happiness. At some point we need to turn that kindness inwardly, and start taking the time to build ourselves up. It's hard. It's extremely hard. \n\nYes, it's lame, but I am going to admit that this mentality did come from the anime Gurren Lagann. \"Don't believe in yourself! Believe in me, who believes in you!\" All the fans laugh at this silly moment, but when you finally understand what it means, it's one of the most powerful messages you can tell yourself. But I've found that if others are capable of seeing the beauty in what makes me, me, then even if I don't know how to tell myself that, that I can at least believe in what others see in me. So believe it. Believe what they say when they give you genuine compliments. Believe what they say in their body language when you are capable of cheering them up and bringing them out of their depression. Believe what they say, and know that you've had it inside yourself all along, you just need to be kind towards yourself. You just need to believe in yourself and that you are capable, and that you deserve a stable environment that acknowledges your needs.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/po4faq/the_most_important_thing_to_understand_is_that/", "title": "The most important thing to understand, is that you ***must*** take care of yourself.", "social_network": "reddit", "user": "Kiwi-Fox3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 554, "down_vote": 0, "creation": 1631631456, "permalink": "/r/DecidingToBeBetter/comments/po4faq/the_most_important_thing_to_understand_is_that/", "nsfw": false, "first_save": 1635435341.5063584, "replies_charged": false}