{"id": "t5_2tand_t3_pt8bz1", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "883794f3-030f-4844-8950-6e28281dfa3f", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "This is long winded and I appreciate anyone who reads this today. \n\nFor years I have been coasting with no routines or schedules of any kind. No calendars. No budgets. Loosely defined goals. \n\nAt some point I just decided maybe this is who I am…and I’ve cultivated an entire world for myself around this lifestyle.\n\nI have reached a point where I have achieved a balance of free time, money, and flexibility. Sounds great, until I think about all that I am leaving on the table by living this way. I am talented at what I do and have the capacity to exceed beyond those around me. \n\nMy chronic resistance to structure of any kind is absolutely holding me back from being the best version of myself. \n\nI am self-employed in a client focused industry. I do not maintain a calendar of any kind. At best, I make daily lists and I rarely even stick to the list (aside from my client appointments).\n\nI do not manage myself well in windows of time when I do attempt to create structure. It just never sticks. I feel I have very little self-discipline. It makes me feel like a weak person. \n\nI set goals quarterly with my brokerage, and am totally off track and mismanaging myself by the first week. \n\nI have no idea what money comes out of my account and when. Finances in general are so touchy for me to this day having grown up in a generationally poor family, and I am extremely resistant to budgeting and the like as well. \n\nEven discussing finances makes me uncomfortable. I have been bleeding out money all year because of this. By June I had already blown through an average persons salary which feels shameful considering how poor my extended family is :( they would be ashamed if they knew. The contrast between us is growing daily. I feel I can’t share my success with them fully because it is too much and nobody else in my family is doing well.\n\nI was a teen mom 13 years ago. I was in such a low level survival mode for so much of my life that I never considered planning for my future. I have never understood anything other than survival. \n\nPlanning my life with intention and structure feels like learning another language and culture. \n\nI feel like a broke girl pretending to Success. I know there is so much more for me, but I have settled into this space out of sheer exhaustion after fighting upstream to get here for over a decade.\n\nTL;DR\n\nWinged it to moderate success after growing up in poverty, not sure how to manage/organize myself and create success by design.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pt8bz1/i_have_lived_a_relatively_formless_life_for/", "title": "I have lived a relatively formless life for decades & am chronically resistant to routines/schedules", "social_network": "reddit", "user": "atomickitty11", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 90, "down_vote": 0, "creation": 1632319792, "permalink": "/r/DecidingToBeBetter/comments/pt8bz1/i_have_lived_a_relatively_formless_life_for/", "nsfw": false, "first_save": 1635435219.112019, "replies_charged": false}