{"id": "t5_2tand_t3_k3i8n4", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I've been looking for something like this for a while, and I've noticed that a lot of \"starter guides\" around the internet start with the assumption that the person reading them can run short distances, lift a standard gym weight bar without any weights on it (45lbs), or do a pushup. I can do none of those things, and I'm looking for a **real** starter guide (or just general tips), for someone starting from the bottom. \n\nI'm currently losing weight (and I have r/loseit for that) but I'm much more interested in cardio and general functional strength, and my starting point is significantly lower than most of the people these guides are written for. \n\nI've never been fit per se, but I've always been just fit enough to get by. In high school I was pretty good at Dance Dance Revolution despite repeatedly failing gym class, in college I was part of a LARP group that met on weekends (it's like a combination of tag and dodgeball, but with costumes), and my last real job involved a lot of walking. I was also living in an area where it was easy to walk from my home to the shops downtown (about a mile). \n\nAbout a year and a half ago I moved to a new city where I couldn't go on walks anymore because it's unsafe, and got a desk job. Then the pandemic hit and since then I've been stuck in my apartment for months. I didn't really understand how bad it was until last night when I was playing Nintendo fitness boxing class with my wife and our friends, and I could only get 6 minutes into a 10 minute \"workout\" before I got winded and had to sit down. Everyone in the room was winded and tired after doing it, but I was the only one who couldn't finish the workout. \n\n---\n\nI'm starting at a point where I can lift about 9lbs without straining, and I can walk about the distance of 500 yards without stopping to rest. If I try hard enough I can lift a maximum of about 35lbs, but it's quite painful and I need to rest for a long while after I do so. \n\n**My goals are to be able to lift 25lbs with relative ease, and to walk two miles without stopping to rest. I'd also like to give beginners' yoga a try because I've heard it's helpful for people who have pain doing other types of exercise. I think those are reasonable goals.** \n\nI have a bunch of Amazon gift cards I can use to get equipment, books, shoes, or whatever else y'all think I might need. Any and all help/tips/etc would be appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k3i8n4/im_looking_for_an_absolute_beginners_guide_to/", "title": "I'm looking for an absolute beginner's guide to getting more fit. Starting from zero.", "social_network": "reddit", "user": "Repulsive-Divide", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1606686970, "permalink": "/r/DecidingToBeBetter/comments/k3i8n4/im_looking_for_an_absolute_beginners_guide_to/", "nsfw": false, "first_save": 1635436883.2459705, "replies_charged": false}