{"id": "t5_2tand_t3_dkfwkb", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I’ll start off with reasons why my fear started. When I was 15 my parents never really talked to me about jobs, they never talked to me about my goals or careers I wanted to have. But one day they decided to force me to get ready and go apply for McDonalds. I have no idea why but they were mean about it to me. They just said I need to grow up and drove me their, forced me to write that I get paid $9.00hr. I had the manager laugh in my face and tell me most people don’t make that there. That kind of left me scarred. \n\nI applied for the same McD’s and got the job. It sucked because everyone from my high school went their and I’m a shy person so I’m easy to pick on. Well the girls in school would come to McD’s and make fun of me while I was working. I was going through major depression at the time and my parents fighting/almost getting a divorce and them fighting with me. My grade we’re all F’s.\n\nSo I quit that job even though I was loving the money. I didn’t get another job until I was 19. That job wasn’t bad but my manager sucked. She basically left 16 year olds in charge and they had more power than me who was 19 at the time. I did everything right and she gave credit to everyone else. And then my third job was at my uncles. He was the most horrible boss, great uncle but terrible boss. I would get hourly lectures about how terrible I was if I did something wrong, if I was sick (legitimately sick) he would threaten to fire me if I didn’t come in. He wouldn’t pay me half the time. \n\nAnd my fourth job that lasted me 3 days, my anxiety was high af because I had to wake up at 4am to go to it which didn’t even pay me what they said they would and I told them I wanted night shifts. \n\nNow I’m not here to complain about any of these jobs or sound like a privileged kid but I’m trying to get some advice on how I can overcome my fear of getting a job. I don’t want to hear that it’s apart of life because I know it is, I know everyone goes through crap jobs but this isn’t about crap jobs it’s about anxiety, depression, and fear taking over me getting a job. \n\nI’m absolutely terrified, I can’t even go online and look at jobs without having a panic attack. One reason is I really don’t want to see anyone I know from high school. I never want to see or talk to anyone. I’ll start shaking and my voice cracks, fear flushed over my whole body. Number 2 is I’m struggling bad with my depression, it drains me to even go to the grocery store. The third is my parents put a fear in me to actually go out and do stuff because they would always say I’m lazy and my mom told someone she knows I’m not going to get into college because I’m too stupid. They would tell me I have no work ethic and say I’m irresponsible. And last it’s a little one but I don’t like the environment of any work place in my town, everyone is fake nobody’s their to make genuine connections and they all end up bullying me. \n\nI don’t know what to do, I want to run into bed and just watch YouTube until I fall asleep because my fear is so bad. What do I do??", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dkfwkb/help_im_terrified_to_get_a_job_im_almost_21_i/", "title": "[Help] I’m terrified to get a job, I’m almost 21. I don’t know what to do.", "social_network": "reddit", "user": "whataboutit35", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1571552180, "permalink": "/r/DecidingToBeBetter/comments/dkfwkb/help_im_terrified_to_get_a_job_im_almost_21_i/", "nsfw": false, "first_save": 1635437855.5641837, "replies_charged": false}