{"id": "t5_2tand_t3_ndr77r", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "I’ve been lurking on this sub for a while, but this is my first time posting. I don’t know if I’m looking for encouragement or motivation, or just someone to tell me I’m not a huge fuck up. \n\nI went to a kid-friendly party yesterday that my sister and parents were also at. I drank a few too many beers. I thought I was in control the whole time, but this morning my mom told me I was hammered drunk and my son (3) was very upset. I didn’t recall events unfolding that way. I thought he was having a great time playing with all the other kids and I was having fun with the adults. Nobody expressed any concerns yesterday to me. In fact, my mom was laughing and drinking with me, talking about how tipsy she was feeling. My son and I stayed the night (as did other moms/kids) as I was obviously not fit to drive home. \n\nI want to clarify that I don’t ever drink more than 2 drinks when my son is around. I don’t even have alcohol in my home. Yesterday was an exception. I’m not sure why I went so hard, and I’m not proud of it. The thought of my son needing/wanting me and me being too drunk to be there for him makes me physically ill. I’ve been crying for hours now thinking about it. \n\nI have called the party host and apologized profusely, and my sister. They are being very forgiving. I just need to spend lots of quality time with my son now and show him how much I love him. It breaks my heart to think he might not know that now. \n\nMy mom had expressed “concern about my drinking” so I told her I would stop if it makes her feel better. She told me it’s not that simple, but I really think it is. I only drink every other weekend, when my son is with his dad. \n\nI know I need to be better. I need to make healthier decisions for my body so that my son never has to worry about me. I’m just so lost on where to even begin. Any advice, empathy, or just reassurance would be so appreciated right now. I’m tired of crying and feeling this unbearable guilt and shame.\n\nEdit: 2 typos", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ndr77r/i_want_to_crawl_into_a_hole_i_need_to_be_better/", "title": "I want to crawl into a hole. I need to be better.", "social_network": "reddit", "user": "sweetfeet810", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 46, "down_vote": 0, "creation": 1621180264, "permalink": "/r/DecidingToBeBetter/comments/ndr77r/i_want_to_crawl_into_a_hole_i_need_to_be_better/", "nsfw": false, "first_save": 1635436463.9188082, "replies_charged": false}