{"id": "t5_2tand_t3_qbk0cb", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "The last few weeks I've been so aware of a downward spiral that I'm currently in and today I decided to do something about it. I'm behind in college, my house was disgusting, hadn't washed any clothes in almost 3 weeks. Today I did a wash, cleaned my room, bathroom kitchen and sitting room ! \n\nI'm normally a really positive and happy guy, but about 3 times a year I get really depressed and this can last for anywhere from a week to months. My thoughts, anxieties and worries overwhelm me and the only way I get through a day without breaking down is to smoke weed literally all day every day. I'm spending about 150 euro a week on weed which is ridiculous. I always manage to get sober and say itll be different when I go back but it never is.\n\n Regardless, I'm taking a break from weed for as long as I think is necessary. Even tho I'm sober now I'm still feeling overwhelmed by how much work I have to do for college. I work 3/4 days a week because it's the only way I'll afford rent. Ive missed some sessions in the gym in the last week but normally I'd go somewhere between 4 and 6 days a week so I'm going to try and really stick to that. Ended one of my only relationships a couple months ago and I feel like those emotions are re-surfacing. \n\nI feel so stretched thin trying put out fires in every aspect of my life, and I just don't feel comfortable talking about these issues with anyone. My friends are all great, but I know depending who I told I'd get one of 2 answers. First one being they'd really want to help but don't know how to handle the situation and I'd make them uncomfortable. Or on the flip side, certain friends would make a big deal out of it and try to \"fix\" me. The reality is I'm just experiencing life, this is one of bad times. But I know the good times will come around again, it's just really difficult trying to get there at the minute. \n\nThis rant seems really incoherent reading it back sorry for that :/ but yeah if anyone can offer some advice on how to go about catching up with college or tips on trying to improve my mental health I'd really appreciate it. I hadn't meditated in almost 2 months but I  started back doing it last night. I'm thinking of maybe drawing something after work tonight instead of smoking but idk. Thanks so much !", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qbk0cb/today_is_the_first_day_of_trying_to_sort_my_life/", "title": "Today is the first day of trying to sort my life out. Any advice or kind words?", "social_network": "reddit", "user": "PadraicG", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1634674794, "permalink": "/r/DecidingToBeBetter/comments/qbk0cb/today_is_the_first_day_of_trying_to_sort_my_life/", "nsfw": false, "first_save": 1635435979.4604275, "replies_charged": false}