{"id": "t5_2tand_t3_7c5306", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Hello internet strangers, I figure crying to an ocean of listeners would be better than whining to a goldfish in a bowl, so hear me out, and sprinkle your fish food of wise words and good advice. \n\nI suffer from anxiety, and anxiety's best friend, depression, who comes along every now and then. For the last 20 something years or so, I also suffered the affliction of being an unaware, manipulative, angry child who was addicted to love and relationships. \n\nThis year, after a traumatic breakup, I had a revelation and decided I couldn't live the way I did anymore. Since then I've been spring cleaning my life and trying to love myself more, be more aware of myself and my thoughts, and take responsibility for myself and my feelings, all while learning to be alone, keeping it real and finding peace within myself. Lord knows it's been a struggle. \n\nI realise that a large part of this stems from an inferiority complex that has developed from childhood and from being bullied, and I compensate through a lot of unhealthy fantasies and daydreams in which I am far better and cooler than I actually am. In my thoughts, I am unconditionally loved by the man of my dreams, terribly clever, irresistibly beautiful and charming, with an unrealistic and endless list of talents. Of course in real life I'm only about 10% of the me that I am in my head, and coming back to reality is like smacking into the cold hard concrete pavement. \n\nThis has also resulted in me winning the ADD olympics because I can't hold my focus for more than 5 minutes before everything starts falling apart. Also has resulted in me not really achieving much in my life because why should I do that when I can have everything great already happen in my head, without having to lift a finger? I do have a professional degree and a steady job, but nothing as spectacular and magical as what goes on in my head. \n\n I try to stay in the present and focus on that but it's a struggle. The thoughts and daydreams are so addictive, and so intrinsically linked to my low self esteem. They feed on each other like an ugly cycle of angry piranhas. \n\nSo, Reddit. I know Rome wasn't built in a day, and I'm not expecting a miracle cure. I know progress is made in tiny steps, over countless good and bad days. But I want to know if you might have any good practices and tips to help me out. What do you do to stop yourself into falling back into old comforting habits and addictions? Are there any good exercises to practice? Any good books to read? Any advice is appreciated! ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/7c5306/struggling_with_an_inferiority_complex_and/", "title": "Struggling with an inferiority complex and compensating through unhealthy daydreams, and I don't know what to do. Help?", "social_network": "reddit", "user": "chichichimichangas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 123, "down_vote": 0, "creation": 1510359034, "permalink": "/r/DecidingToBeBetter/comments/7c5306/struggling_with_an_inferiority_complex_and/", "nsfw": false, "first_save": 1635435829.5375597, "replies_charged": false}