{"id": "t5_2tand_t3_gfea2i", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "When I first learned about boundaries I was really floored. “I can say no?” was one of my first thoughts. I never knew that was a thing. If I did say no, it was backed up with a huge reasoning why, a justification so someone else would fully understand why I was saying no. And it always involved an “I’m sorry.” \n\nI realized my constant proclamations of “I’m sorry” took me out of my power. I wasn’t sorry for doing what was best for me but I was ashamed of admitting that. I had an overwhelming guilt associated with looking after myself due to a lot of reasons that were all based in old beliefs. I let everyone else think that they were the priority and that doing what worked for me even if it was inconvenient or not good for someone else needed justification or was something I should be sorry for. It’s not. \n\nBoundaries seem complex but they’re not. When I first learned about them, I decided to set them. And then i broke them, over and over and over again. I still do sometimes but now I’m aware of it almost immediately.  It does take effort to undo years worth of toxic habits but ultimately, it is a choice if you are aware enough to set boundaries in the first place and are committed to them. \n\nI used to get frustrated because “people were crossing my boundaries,” but it’s not their job to uphold or respect them, it’s mine. I am the only one with power here. I can voice them to another person but they don’t have to go along with them.\n\nRealizing this has kept me accountable for my own life and got me out of a victim mindset and into an empowered one. Keeping my boundaries has helped me in so many ways. Any uncomfortable feelings that arose from initially setting them has gone away and I am left with a peace I didn’t know before. And once you set one, and uphold it, it gets easier to set more in a healthy way. \n\nIt’s not about closing yourself down, but protecting your own energy and needs. It’s about saying yes to what fuels you and no to what drains you. And it’s super possible, as long as you hold yourself accountable for them.\n\n\n__ \n\nEdit: it has been helpfully pointed out there are times where this doesn’t apply such as violations of physical boundaries. You are not to blame if this happens to you and this does not apply to those circumstances.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gfea2i/setting_boundaries_and_keeping_them_is_your/", "title": "Setting boundaries and keeping them is your responsibility. No one can overstep your boundary except you.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1588882616, "permalink": "/r/DecidingToBeBetter/comments/gfea2i/setting_boundaries_and_keeping_them_is_your/", "nsfw": false, "first_save": 1635436455.5213044, "replies_charged": false}