{"id": "t5_2tand_t3_ldvqpn", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I have already written that strategic thinking doesn’t start with goals and plans. It starts with a deep analysis of the current situation. We need two points – A and B – to make a route to a successful and happy future. Let’s start with a simple but very efficient tool to analyze the situation. It’s called 5 “whys.”\n\nThe tool originates from the Japanese philosophy of “lean production”, but it is quite applicable for almost any situation. Let’s imagine an entrepreneur by the name of John. When John launched his startup, he dreamt about a business empire. But he still has not more than eight employees and doesn’t earn enough to feel safe.\n\nWhy?\n\nBecause his business needs investments to develop and expand, but John hasn’t invested. Why hasn’t he invested? Because his company didn’t make enough profit, but John was afraid of borrowing money from banks or investors. But why was he afraid of doing it? Because John didn’t believe in his business himself. Why did he start this particular business? Because at that time, he was sure that it would be more comfortable. Why did he choose an easy way but not the right one? Because he had always done this way. Why did he always do this way? Because it is a part of his personality.\n\nNow it seems that we have the core problem of John’s unsuccessfulness. If our imaginary John was honest with himself, he understands that it doesn’t make any sense to solve his managerial tools. Psychological problems can’t be fixed with economic means.\n\nIn this particular case, we needed 6 “whys” to get to the real source of the problem. Sometimes we need less, sometimes more. The name of the method, “5 Whys”, doesn’t indicate that exactly five steps are necessary to get the truth. The only strict rule is that one should keep asking “why” until it’s done.\n\nFinding a “core problem”, as Eliyahu Goldratt called it, is critically essential for choosing a solution. Your homework for this week is to select any undesirable thing in your life (such as – not having enough money, bad relationships at work, etc.) and try to find it. \n\nTo be continued. Stay tuned.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ldvqpn/about_5_whys/", "title": "About 5 “WHYS.”", "social_network": "reddit", "user": "sbiryulin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1612609903, "permalink": "/r/DecidingToBeBetter/comments/ldvqpn/about_5_whys/", "nsfw": false, "first_save": 1635437562.5002363, "replies_charged": false}