{"id": "t5_2tand_t3_oojna9", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "I’m tired\n\nof hating myself\n\nof trying to improve but always ending up in the same spot\n\nof disappointing myself\n\nof being stuck\n\nI want to change—no, I NEED to change. It’s going to be a long process and it’s going to be painful. I know I will stumble throughout my journey, but I want to better myself.\n\nMaybe no one will see this, but everyday from now on I will update this thread about my betterment journey. Reddit doesn’t let you update posts (I think) so I’ll have to post in the comments. Please feel free to comment and update your own progress to hold yourself accountable!!\n\nMy goals:\n1. to actually make things\n2. to learn outside of school\n3. to look better\n4. to do well in school\n5. to nourish and advance my body\n6. to maintain and make more genuine connections with people\n7. to establish anchors\n\nLETS DO THIS!!!\n\nDAY 1 - July 20, 2021: Today, I took my journal and wrote down things I had been avoiding/procrastinating on and I started checking off that list one by one. It felt good. In some sense day 1 is always the easiest bc you start full of energy and motivation. I know this will dwindle over time but I hope to remind myself that it feels good to face shit head on and deal with your life.\n\nDAY 2 - July 21, 2021: I'm actually writing this on day 3 bc I passed out yesterday night lol this Is already getting off to a great start. Anyways, this day was okay. I took a phone call that I was dreaded but I didn't even end up being bad. Procrastinated a lot more than I wanted but managed to get some work done. Also had an important convo with my mom.\n\nDAY 3 - July 22, 2021: Just like day 3, I’m writing this on day 4, I find myself wanting to update my day at night but then forgetting to and being too tired. Anyways, day 3 wasn’t my best work; had to have a tough convo in the morning and I didn’t really start my day until 2 PM… yikes. I also attempted an easy Leetcode question and felt pretty fucking stupid when I couldn’t solve it. Besides that I took wayyyyy longer on my tasks that I should have and so I’m a bit behind schedule on an application I need to fill out ASAP :/\n\nDAY 4 - July 23, 2021: I’m writing this is the morning instead of the night. I think it might be better to set my intentions for today. It’s 9:16 rn so a bit late of a start but for today I really want to grind on my application. I really want to seriously try out the Pomodoro (not sure how to spell) method today to see if it will improve my productivity. Also worked out this morning so I’m proud of myself for that!! :)\n\nDAY 5 - July 24, 2021: Yesterday’s pomodoro went okay, didn’t get enough that day but I think it’s bc I spend way too much daydreaming and not in deep focus. Today I want to try Pomodoro with no daydreaming, deep focus and just chilling out in the breaks with my own thoughts instead of  going on my phone/YouTube. But the main thing I want to try out today is no daydreaming.\n\nDAY 6 - July 25, 2021: I mostly succeeded in not daydreaming yesterday but it was quite difficult at night bc my will power had really been depleted and idk if it actually helped my productivity bc I was so busy trying to distract myself that I think I think my productivity was maybe more or less the same? Or maybe a little better? Might try it again today especially bc I’m SOOOO behind on work. I really need to hand in my application and do my assignment due today and I still haven’t prepared for uni at all omg…. I need to try to actually work hard today\n\nDAY 7 - July 26, 2021: Damn. What a day. Couldn’t finish this really big assignment due last night bc I just couldn’t and couldn’t get this one function omg. So I wanted to hand it in 12 hrs late so only 10% would go off. Failed miserably. Freaked out and was super stressed. Ate like absolute shit today, didn’t exercise and didn’t do anything productive besides the assignment really. Anyway, emergency called my sister to give me help on that function, she really led me on the right path and I was able to figure it out—super grateful for that. After figuring out that function, I realized that basically all my other functions were wrong lmao fml 🤦‍♀️. But I absolutely grinded on it after dinner and just handed it in. I’m super proud of myself for pulling through and just relived. But ofc it kind of sucks that the highest I can get now is 70% which I most likely won’t even get bc I’ll get other points off. Also kind of sad about the whole day I basically kind of missed today. Tmr I want to hit the ground running strong again(!!).\n\n💫 Week 0-1 Reflection:\n\n🌱What I did well: I’ve woken up at around 6:30 everyday. Yeah I lie in my bed for a hot minute until I get out but I’ve gotten out of bed before 7 I think everyday. Besides yesterday I think I also worked out every single day which has been a personal best for me. I’ve also been consistent with updating this thread. My skin has looked so much better than it did the last couple of month, trying to be patient and let my hyper pigmentation slowly heal🎉\n\n🛣What I need to improve on: Oof… a lot. Basically everything lol\n\n💭Overall thoughts: Not much has changed from last week. I guess that’s to be expected bc it’s only been one week but I feel I really need to step up my efficiency/productivity, I feel like I meed to get a lot more done than I do.\n\n💗Goals for next week:\n1. be more vulnerable in this thread: looking back at this week I realized that there were low moments I didn’t really share -&amp;gt; 🎯 share one high moment and one low moment everyday\n2. get better wardrobe + appearance: I’m moving to a different climate soon and I’m really not prepared wardrobe wise also haven’t got a hairdresser app yet -&amp;gt; 🎯 book 3 hairdresser apps and buy basic wardrobe \n3. get back on track with side-projects: my side projects really took a hit this week bc I was preoccupied with my app. -&amp;gt; 🎯 I want to dedicate 2-3 for each side project this week (so 4-6 days total)\n\nDAY 8 - July 27, 2021: Fuck it’s almost August omg!!! I really need to work on the goals I set out for myself. I want to try to be more efficient today. I think I’ll use google calendar for this. Also personal challenge: go for an evening run today.\n\nDAY 9 - July 28, 2021: Yesterday was def not my best work but this morning has been worse. Yesterday I didn’t get a lot done and I was super tired for some reason. But I stayed up way later than I should which caused me to wake up at 7:45 today and then procrastinate the whole morning.\nLow moment from yesterday: breaking out :/ it no where near as bad as it used to be but still sucks bc I thought it was getting better and it is but breakouts make me question\nHigh moment from yesterday: had a good convo with a friend\nDid I accomplish my person goal of running in the evening? No :( I called me friend instead. Also didn’t workout this morning so yeahhhh but I WILL GO ON A RUN THIS EVENING!!!\nFor today I want to finish all the shit I didn’t do yesterday and make progress in my side projects.\n\nDAY 10 - July 29, 2021: Went on a run yesterday 🎉 Days seem like such a blur nowadays... but I spend the vast majority of the day looking for hairdresser on found one... super productive, I know :/\nLow moment from yesterday: my low productivity levels I NEED to spend more time on my side projects (!!!) this is something I will try to work on today.\nHigh moment from yesterday: DEF the run, I was so refreshing and energizing, I felt great after, definitely will do again\n\nDAY 11 - July 30, 2021: I had a lot of low moments todays. Mustered up the courage to go to the hairdresser today and she recommended a treatment for my hair and even offered an appointment for it tomorrow, I confidently said yes and was happy with my decision. Looked up the treatment after I got home and it had a high percentage of a cancer-causing ingredient. I canceled my appointment and felt bad and awkward about it. I still want to get extensions but...idk. I was got my class select today for the university I'm going to in the Fall and I was more than disappointed. I also procrastinated the whole day by watching gymnastic videos.\n\nDAY 12 - July 31, 2021: it’s 2:00 am rn fml. Didn’t do basically anything productive today.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oojna9/day_1_of_changing_my_life/", "title": "Day 1 of changing my life", "social_network": "reddit", "user": "sage_green_29", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1626845443, "permalink": "/r/DecidingToBeBetter/comments/oojna9/day_1_of_changing_my_life/", "nsfw": false, "first_save": 1635435100.3288827, "replies_charged": false}