{"id": "t5_2tand_t3_3fi18z", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "(from my [blog](http://selfimprovementguy.com/about-me))\n\n**Four months ago I took my desk and chair out of my workspace and replaced them with a cupboard that doubles as a standing desk. I now do most of my work standing up, and the effects of this one change have been remarkable! Here's how it all came about...**\n\nAs part of my daily Self-Improvement I listen to podcasts, particularly when walking my dog or driving. One of my podcast subscriptions is Jeff Sanders' \"5am Miracle\". Jeff broadcasts weekly and usually talks a lot about the benefits of rising early, but on one occasion he was telling listeners about changing to using a standing desk in his office. He was very enthusiastic about it and recommended it highly.\n\nAs someone who has had quite a few back problems, I didn't think I would be suited to working in a standing position for long periods of time. But like any good Self-Improver, I'm always looking for ways to experiment with my life and work, so I decided to give it a try anyway.\n\n**Try before you buy!**\n\nRather than commit to any expense, I started by just moving my chair away from my desk and making a small pile of box files on it. I got some simple guidelines from a quick internet search (desk height to be roughly level with your elbows when standing) and adjusted the pile accordingly. I moved my computer work from my desktop PC to a laptop (this was easy because I use Dropbox) and balanced the laptop on my new temporary \"standing desk\".\n\nAfter working this way for a week I was confident enough to move to the next stage, so I reconfigured the shelving around my desk to allow my main PC monitor to face me at standing height. I then \"upgraded\" my standing desk by adding a flat piece of wood  and strengthening the supports. Moving back to my main PC gave me an even clearer idea of what it would be like to work in a permanently standing position.\n\n**Taking the plunge**\n\nAfter another two to three weeks, including experimenting with small height adjustments, I was totally convinced. I  bought a large storage cupboard from Ikea that is exactly the right height for me to work on. It's also perfect for storing away all the loose files and items that had been strewn on and around my desk and shelves. Now my work area looks like [**THIS.**](http://selfimprovementguy.com/wp-content/uploads/2015/07/640x360xstanding-desk-640x360.jpg.pagespeed.ic.n_6OK7Vl1K.webp)\n\nI'm delighted with my new standing \"desk\". I stand at it to work on most of the tasks in my Morning Ritual (see my post about early mornings) and for pretty much all of my admin and computer-based tasks throughout the day. Standing to work for at least three hours at a time is no problem whatsoever.\n\n**Why use a standing desk?**\n\nThere seem to be are several significant benefits to using a standing desk, including:\n\n* Standing is good for your posture, whereas sitting for long periods of time is associated with a range of body-related difficulties such as joint pain, reduced circulation, poor breathing technique and indigestion. Being upright helps me to move around more easily and get plenty of air into my lungs\n\n* Working in a standing position reportedly burns at least 150 extra calories per hour compared to sitting! As a seriously overweight man making steady inroads into my weight (more on my weight loss soon) I will take any extra help I can get! And at my size, it's probably considerably more than 150 calories, too.\n\n* The improved breathing and circulation you get from standing improves your levels of concentration, focus and productivity. Since moving to a standing position, I can confidently state that I have been able to work harder for longer and my productivity has improved significantly as a result. Self-Improvement indeed!\n\n* When you want to fetch something from elsewhere in the room or building, you don't have to haul yourself out of a chair every time. I have noticed that I am much less likely to put off going to get something I need, because it is usually only a few steps away and I'm on my feet already anyway!\n\n\n**Are there any problems?**\n\nI have been every pleasantly surprised to discover that the one big challenge I envisaged - back pain - has not arisen at all. My body quickly and naturally adjusted to working in a standing position. As a heavy man with poor posture this was quite a surprise. So don't assume this will be a problem for you: give it a go anyway.\n\nSome further internet research revealed that there are many benefits cited for standing desks but very little downside. The only significant concern seems to be a possible increase in the chances of developing varicose veins from standing too still for too long. I try to counter this by making sure I move around quite a bit. In fact, I'm shifting my weight from foot to foot even as I write this at my standing desk! It's an easy habit to get into and keeps your leg circulation going (a bit like you need to do on a long flight).\n\nOf course, standing desks as part of mainstream office furniture are a rather new idea, so it is impossible to say just yet whether there will be other challenges and problems in the future if they become more popular. But the immediate Self-Improvement benefits seem clear, and for me at least, well worth taking the risk.\n\n**What about my workplace?**\n\nI work from home, so I have no issues with employers or other co-workers. If you work for someone else they might take some convincing, but if you work at a desk for part or all of your day, your employer might well be forward-thinking enough to consider upgrading you to a standing desk. You can get adjustable desks that move from a standing to sitting height - some even have electric motors so you can switch at the touch of a button! Do some research, make a short report showing your findings and they might be more amenable than you think.\n\nIf not, see if you can move any of your work to a conveniently-sized cupboard top, or depending on the nature of your work, perhaps you can do some of your tasks standing or walking around anyway?\n\n**What do you think? Have you tried a standing desk? Do you already use one? Are you thinking of giving it a try? Let me know - it would great to hear your ideas and experiences.**\n\noriginal (and a [free ebook](http://selfimprovementguy.com/self-improvement-club/)) posted at [selfimprovementguy.com](http://selfimprovementguy.com/self-improvement-why-you-should-switch-to-a-standing-desk/) ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3fi18z/selfimprovement_why_you_might_switch_to_a/", "title": "Self-Improvement: Why You Might Switch To A Standing Desk", "social_network": "reddit", "user": "djhendra", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1438515311, "permalink": "/r/DecidingToBeBetter/comments/3fi18z/selfimprovement_why_you_might_switch_to_a/", "nsfw": false, "first_save": 1635436214.5309339, "replies_charged": false}