{"id": "t5_2tand_t3_q7zws3", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I just wanted to share a big win that I didn’t see coming. \n\nTrigger warning ⚠️: eating disorder\n\nI’ve been seeing a nutritionist since 2017. At one point she said if my eating didn’t improve I would need to join an eating disorder program to mechanically eat better. \n\nI would lose my appetite a lot due to past trauma and anxiety. On top of that I was struggling a lot with body image and always wanting to be skinnier skinnier skinnier. I am fairly petite so this was delusional. I would take adderall through a chunk of my 20’s and lied to a psychiatrist that I had attention issues. I wanted them to give me adderall so I could take it and be super focused and lose weight. \n\nTrust me adderall does more  harm than good if you don’t truly need it . Whenever it would wear off I became angry, irritable, brain fried, and restless. I finally stopped adderall after 5 years of abusing it. I have not taken it since 2018.\n\nI spent most of my adolescence and 20’s obsessed with being a certain size. It consumed a lot of my thoughts and behaviors. At a certain point I was restricting like crazy: no carbs and no sugar. I’d run like 5-10 miles a day because 1-2 was never enough. I lifted in the gym at night and stayed there way longer than needed. \n\nIn 2017 I finally decided to ask for a nutritionist because I couldn’t physically eat lunch due to ptsd. Through seeing her over the years I have learned to enjoy food, welcome a variety of food, I have not checked the scale in 3 years, and I set limits on exercise.\n\nI share all this because I’m someone who’s still goes to therapy 3 times a week, has anxiety, depression, and ptsd. I NEVER thought on a phone call yesterday a professional would tell me I show all the signs of recovery. It feels damn good .\n\nWhatever you are going through, you can make progress! The human mind is miraculous !\n\nI hope you celebrate the wins in your life because I bet if you look back 3 years ago you’ve progressed in so many ways! \nHere cheering you on fellow humans and thanks for reading my story ☀️", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q7zws3/recovery_from_an_eating_disorder/", "title": "Recovery from an eating disorder", "social_network": "reddit", "user": "voicesnotvictims", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1634218725, "permalink": "/r/DecidingToBeBetter/comments/q7zws3/recovery_from_an_eating_disorder/", "nsfw": true, "first_save": 1635435856.0572612, "replies_charged": false}