{"id": "t5_2tand_t3_acuurv", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "Every morning I wake up and read. I read books, and I read on my phone. I read about anything and everything, save for fiction/novels. I just like learning and thinking and reflecting.\n\nMost mornings, I get up, grab my coffee, get on the couch, and immediately something enters my mind that I want to read more about. Sometimes it’s practical stuff like DIY home projects (I love me a good project, especially home organization!) and other times I’ll read about psychology or politics or spirituality or culture...literally anything that pops into my head or mind that I feel like reading about.\n\nI also love to read posts on Reddit and respond with my experiences/insights and try to help people.\n\nIf I have nothing I “have” to do that day, this could go on for hours...like maybe 8am to noon, longest.\n\nUsually after 3-4 hours of doing this, I finally get tired of reading and will get up to do something, either a chore at home or a project, like drawing or working on music or organizing something. Rarely, I might think of something I want to go out and buy, and I’ll get dressed and leave the house. (Obviously, I’m describing a typical weekend.)\n\nThe problem is that I have a family. My daughter will eventually get up and want me for something. My husband will get up and want to come out in the living room to watch TV, which disrupts the silence. (I get up before everyone in the house just so I can read and drink my coffee and perhaps write privately.) \n\nAnd when I get disrupted, it makes me feel grouchy and irritable. At least, in my mind. I don’t usually respond to my family with any irritably, but I’m sure my response is “distanced.” Like my energy is to just listen quietly, while inside I’m hoping they’ll leave me alone again soon. I don’t think I’m very engaged with them because I just want to be left alone again to read.\n\nThis isn’t a 100% thing. This is more like 80% of the time. I CAN put down my phone or book, take a deep breath, let go of what I’m reading, and start to engage in the real world. But the problem is that it just doesn’t...excite me? I always just wish I could have kept doing what I was doing.\n\nIt can affect my work as well. On weekdays after taking my daughter to school, my husband has usually also gone to work and I’m alone again. I work at home, remotely, so I can technically start working whenever I want. My goal is 9am, but if I’m alone and engrossed in my reading and writing I might not start work until 10 or 11, which reduces the number of hours I have available to get work done.\n\nToday, for example, (Saturday) would be a great day to take my daughter to my parents’ and visit with them. My dad invited me to help him and his Boy Scout troop build derby cars.\n\nBut I don’t want to stop doing my things—reading, or my house chores, or my independent hobbies.\n\nIt often feels like my need for alone time can’t be satiated lately, I guess is what I’m getting at.\n\nI feel this urge to just let go of all the independent stuff I want to be engrossed in, forget it all, and engage in the world around me. I feel like my constant drive and desire to do independent stuff is impacting my relationships, or at least it could. I have anxiety when I can’t get the freedom to work on those projects at my leisure, especially since my life around those hours I’m doing those projects is really so, so busy.\n\nIt can also affect my marriage. My husband loves to get up and get out of the house, especially on sunny days. Oftentimes he’ll want to go to breakfast or brunch with me, which means I have to get up and get dressed (or at least decently presentable, not looking like I just woke up), and stop doing what I’m doing. I know he can tell that I’m doing it because I feel like I should, not because the prospect of having brunch with him, out, seems pleasing to me. But I do it, because I know it will be fun once I’m out, and it’ll get me out of my head...but nevertheless, the cycle starts again the next day. Knowing that putting my things down and leaving the house will ultimately be pleasurable and is also “good for me” isn’t usually enough motivation for me to want to change this habit. \n\nHas anyone here had any experience that’s similar? Pushing people away to work on independent hobbies and feeling guilty about it, not taking much joy in “external” activities with family/friends because you’d rather be alone reading or creating, etc?\n\nI’m thinking it might help me to either set a schedule or to just let go of some things I want to do and hope I find time for them more “naturally.”\n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/acuurv/i_never_want_to_do_anything_and_i_feel_guilty/", "title": "I never want to do anything, and I feel guilty about it. I’m not depressed—I just prefer staying home and reading or doing projects rather than getting dressed to go do anything. The guilt robs me of joy. Experiences? Insights? Thoughts?", "social_network": "reddit", "user": "franticshouting", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1546700798, "permalink": "/r/DecidingToBeBetter/comments/acuurv/i_never_want_to_do_anything_and_i_feel_guilty/", "nsfw": false, "first_save": 1635437327.2682018, "replies_charged": false}