{"id": "t5_2tand_t3_qagje4", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I fell in love with a guy in my 20s and we had some amazing memories together. Bonded over shared life values, hard work ethics and travel. We traveled to so many cities together, and he didn’t want to be a relationship with me saying he wanted to pursue his dream and will move away. A year later, he starts flirting with me again, and this started a rift between me and my boyfriend at the time. Flash forward, I wondered if things would work out between us, I’m single again and while he initiated being intimate with me, he doesn’t want anything long term with me. Once again, he has a dream and he thinks he will move again. This happening again doesn’t make things any easier for me to mend my once again broken heart. I did get a chance to tell him about the things he did that frustrated me while I’ve been recently spending time with him, and I felt lighter emotionally and I felt proud for standing up for my needs and feelings. It’s been really hard. I am in a tough emotional state right now: struggling with low self esteem, trauma, memories of being emotionally abused, fear of being taken advantage of, feeling lost with what career decision to take next, my “biological clock” ticking, fear that people don’t really like me and will abandon me or give me the silent treatment. I started working out again and it’s been a tremendous help! I feel stronger every time I work out! I was able to get through the day without feeling like I have to curl up in bed and it hurts to think about the man you want grow old but he doesn’t share that vision, it hurts a lot. Ultimately, my goal is get physically stronger and figure out the rest of my life while doing volunteer work. If you have any experience or advice to share that will help me solve some of the challenges and move on to building a brighter life, I will appreciate it!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qagje4/heart_broken_and_moving_on_day_by_day/", "title": "Heart broken and moving on day by day", "social_network": "reddit", "user": "heyapc", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1634536445, "permalink": "/r/DecidingToBeBetter/comments/qagje4/heart_broken_and_moving_on_day_by_day/", "nsfw": false, "first_save": 1635435126.4358654, "replies_charged": false}