{"id": "t5_2tand_t3_majxxd", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Recently the last few years my wife and I collectively been earning $180k + per year.... We literally earn that type of money the hard old fashion way, we work for it!\n\nI was active duty working a minimum of 12hr shifts but I'm salary so it sucked and my wife is a supervisor at the post office  working a minimum of 10 hr shifts but still hourly.\n\nI joined the military when I was 18  back in 2006 and been thru the ringer throughout the years. I fell into a rare situation where I transferred to the guard from active duty to go Active Guard, the bah was literally 4X higher (San Francisco) \n\nWell fast forward to 2008 my lady( wife) got pregnant with my oldest child, and I was force to work active guard for almost 18 months with basically no pay. My first unit was shutdown because of change of missions and my gaining united couldn't receive members from my old unit because we fell into inactive status even though we were still working.\n\nLuckily for me I was young with no kids at the time and lived in the hood. Everytime I went to work my house got broken into. ( 9 times to be exact) But rent for a 2 bd in Sacramento in 2012 was only $495.\nFunny story my place was so empty by the 4th burglary they started leaving more items then what I had in my house. I came up on a fresh screwdriver!\n\nBut after the military not paying me but kept forcing me to work I stopped depending upon my military income. It's shame really! Around 2010 they finally paid me for half of 2008 and all of 2009 but robbed me of my rank (They did some shady behind the scenes and deleted my 2+yrs of active duty. But I got that time back 5yrs later) and I recieved half of what I should have.\n\nEver since then I been on my finance hype. That moment taught me how to budget and how to save.\nI plan for almost every contingency that I can think of. Since 2010 I have not spent my military money except for daycare when I worked and for fuel traveling to my base.\n\nIt taught me that even though you may be doing great today tomorrow could be worst! \n\nSince 2016 I have separated from the military but managed to save up a decent amount of money for a rainy day. ( 10yrs worth of bills ) Enough money that my interest pays my mortgage. Since then I learned that most ppl live outside of their means and want more then what they afford.\n\nBeing financially aware now and in a better financial situation I been trying to help my family and friends succeed and be financially independent and aware.\n\nBut now I'm realizing that they don't want my advice, they just want my money. If I'm not loaning them money or giving them money they don't care! \n\nIts going to be hard but I'm cutting off all my friends and family financially. I'm done trying to help ppl when I put in my time and earned my financial position!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/majxxd/im_going_to_stop_giving_financial_advice_and_help/", "title": "I'm going to stop giving financial advice and help to friends and family!", "social_network": "reddit", "user": "ChillnwRip", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1616407650, "permalink": "/r/DecidingToBeBetter/comments/majxxd/im_going_to_stop_giving_financial_advice_and_help/", "nsfw": false, "first_save": 1635437997.8112016, "replies_charged": false}