{"id": "t5_2tand_t3_pvbeqp", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I'm the only guy in my nuclear family 2 sisters and one single mom. I'm also gay and kinda closeted but thats besides the point. Right now I feel like shit Idk what to do.  I was trying to express my feelings, tired of all the shit I was carrying. I was resenting shit they said to me when they treated me like trash. I woke up, didnt even say hi, cracked some eggs and I spilled a little bit of white egg on the counter  and  then my sister goes and says \"I wont clean that\" and I said \"You never clean anything anyway, I've cleaned up all these days\" and then she kept pushing my buttons and called me \"unbearable\" that hit me hard cause she called me that the other day UNFAIRLY and I had forgiven her. Then my mom  was like \"see why I don't want to see them again?\" to my older sister... and then she came back while I was raging and showed me something she bought for me, and was acting so indifferent I rejected that because I felt disrespected, she saw I was hurting, didn't care and pretended I was ok enough to accept a gift from her. Then she got mad at me, then my other sister got mad at me. Then I exploded emotionally, I ran to my room crying loud and slammed the door. I was so tired of their indifference. i was tired of feeling invalidated and judged unfairly. I dont even feel sorry. I tried to go out of my room and told them I was sorry. But they still didnt care. I have no one to talk to. I don't know whats worse, stay inside of my room for the rest of the day ruminating about what happened or go out and humilliate myself with those teary eyes and feeling like shit. I already  feel like shit because of a ton of issues I have besides that anyway.I really feel trapped I wanna die. I cant stop thinking about grabbing a knife and start stabbing myself to death", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pvbeqp/i_just_exploded_emotionally_at_my_mother_and/", "title": "I just exploded (emotionally) at my mother and sisters", "social_network": "reddit", "user": "Admirable-District-9", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 43, "down_vote": 0, "creation": 1632590744, "permalink": "/r/DecidingToBeBetter/comments/pvbeqp/i_just_exploded_emotionally_at_my_mother_and/", "nsfw": false, "first_save": 1635436824.2188282, "replies_charged": false}