{"id": "t5_2tand_t3_qdq6ug", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I’m not sure what this is… but I’m feeling so lost and my soul is crying out for me to take action but my ego keeps me at a standstill. \n\nI have been having a hard time lately in regards to my connections with others. I don’t know what it is but I feel so frustrated and outside myself. I don’t want to talk to anyone. I don’t want to separate myself from them either. I even feel a bit too dependent on my therapist and our weekly sessions… they’re all that keeps me going and from falling apart because I know she’ll be there for me next week. \n\nI don’t want to have to feel like I need anyone, or that I even need to be absolutely dependent upon them. \n\nI guess deep down I really do want people to know about me, to care and to love me. Not everyone can (this I know already) but it’s frustrating to even need that from one person…. \n\nOn top of that, I’m not on talking terms with my dad. I have little skills I’ve developed. I don’t know what or where to go next. This all feels so overwhelmingly scary. \n\nI want to go away and just be my own person, learn who she is, but I’m afraid if I do that then I’ll come back to worse off connections , or even worse — no one at all. It pains me because I gotta go my own way and I don’t wanna be hurtful or disloyal to others but I don’t wanna keep compromising myself either.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qdq6ug/can_anyone_please_help_me_make_sense_of_this/", "title": "Can anyone please help me make sense of this?", "social_network": "reddit", "user": "norweigan-wallflower", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1634936494, "permalink": "/r/DecidingToBeBetter/comments/qdq6ug/can_anyone_please_help_me_make_sense_of_this/", "nsfw": false, "first_save": 1635438204.7338312, "replies_charged": false}