{"id": "t5_2tand_t3_jo95vk", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Hey guys and gals!\n\nA friend of mine and I had a discussion the other day about “No Nut November”. We concluded that, while it is a good exercise for self control, relapsing at the end kind of takes away a lot of the possible long lasting benefit.\n\nWith that being said, I created “New Skill November”\n\nMy friends and I have taken up this challenge to improve at something completely from scratch. There are a few rules so I’ll get right into it :)\n\nRules-\nThe skill has to be realistic. If your “skill” is to bench press 315lbs but you can only do 135lbs, that is not realistic. A better goal would be “getting perfect bench press form in 30 days”\n\nIt cannot interrupt your daily obligations. Bills need to be payed, school work needs to be done. You need to eat, sleep, and relax every once in awhile. This is a challenge; do not let it become a chore\n\nDocument your progress through video, writing, social media, etc. I’m personally making a video\n\nExamples of skills-\n\nGetting better at Olympic lifts (Me)\n\nDoing a backflip (my friend)\n\nYoga (other friend)\n\nBecoming ambidextrous\n\nSpeed reading\n\nLearning a new language\n\nLearning how to solve a Rubix cube\n\n\n\nThat’s pretty much it! Find something that you want to get better at and start practicing. Remember that some skills take longer to develop than others, and that’s okay! The goal is to get as good at it as you can in 30 days, but that does not mean you have to stop after that time. Have fun!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jo95vk/new_skill_november/", "title": "New Skill November", "social_network": "reddit", "user": "nickckelly", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 29, "down_vote": 0, "creation": 1604538414, "permalink": "/r/DecidingToBeBetter/comments/jo95vk/new_skill_november/", "nsfw": false, "first_save": 1635438208.668546, "replies_charged": false}