{"id": "t5_2tand_t3_pm9g0m", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "Not completely sure if this post fits this sub buttt I used to be an avid reader. Read books here and there when I was younger, but most especially around college when I read a *ton*. Like visiting bookstores was always one of my favorite parts about going to the mall. But for some reason I stopped doing it, which always made me a little sad since I genuinely enjoyed it a lot back then.\n\nThe last one I finished front to back was probably the second book in the Miss Peregrine's series, and I think that was back in 2015/2016. The following years I would try picking up another book, try to read it, and then just abandon it some chapters in and never finish it. Over and over with different books. I literally have a lot of unfinished and even completely unread books here just collecting dust.\n\nBut last month I tried again, but with Go Set A Watchman. To Kill A Mockingbird's one of my favorite books ever, so this one at least I was excited to read about. I set myself the goal of reading at least one chapter a day, or if it's a bit too long, then just half a chapter. And about 2.5 to 3 weeks later, I've finally finished it. And I'm just happy, and feel kinda proud of myself for finally being able to do it. The icing on the cake is that I loved the book too and it actually helped me with some personal stuff.\n\nThank you for coming to my tedtalk. Let's hope this reading thing continues for me and doesn't end here.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pm9g0m/just_finished_reading_my_first_book_in_years/", "title": "Just finished reading my first book in years!", "social_network": "reddit", "user": "bellyjoegstring", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1631374174, "permalink": "/r/DecidingToBeBetter/comments/pm9g0m/just_finished_reading_my_first_book_in_years/", "nsfw": false, "first_save": 1635437394.8544288, "replies_charged": false}