{"id": "t5_2tand_t3_iegeg2", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Sorry if this doesn't belong in this sub, let me know where it would be more appropriate to post.\n\nI was part of a very close knit friendship group of 6 people about 7 years ago. We have stayed in touch but 4 of the group have stayed very close, whilst myself and my other friend started to grow apart from them over the years. I have considered moving on from this friendship group for a few years due to various reasons and could tell my other friend was thinking about it too, but I never directly asked her if she was feeling the same way. In January this year she stopped even reading WhatsApp messages I sent her, then RSVPd no to my wedding saying she couldn't get the time off work (I was expecting this as she had RSVPd no to a mutual friends wedding). Our wedding got postponed due to Covid so I I reached out to her just to let her know the new date and ask how she was. My message didn't even get read. About a month ago she sent a really long message basically explaining she no longer wanted to have any contact with anyone who was part of the original group of friends and how she would not be responding to any messages sent by us and was not interested in talking about why she was 'leaving the group'. Even though it was kind of expected, it always hurts to find out someone doesn't want you on their life anymore. \n\nI've been feeling pretty dejected ever since, wondering if I had told her that I was feeling the same way about the core group of friends, that perhaps we could have stayed in touch or she might have been more willing to reach out about whatever she is going through. I've considered sending her a message to tell her all the things I think I should have told her before she did the friendship equivalent of 'breaking up' but she was very clear about not responding to anything we send her and she's not read any messages since January anyway, so I decided not to.\n\nI recently had a dream in which I spotted her and we had a conversation. In the dream I was able to tell her everything that I would put in a message. It felt really good to 'say' these things to her (even if she hasn't heard them in real life) about how I've been feeling the same way about the friendship group, and how I hope she knows she can get in touch again in the future if she ever wants too. It's given me the closure I feel like I was missing from the friendship ending.\n\nI'm not really looking for advice or anything by posting this, I just wanted to share my story as I've been thinking about it alot recently. I'm a bit of a lurker on this sub but reading about other people's achievements keeps me going when I'm finding things difficult and I love the celebratory aspect of this sub, so just wanted to share my own recent story!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iegeg2/a_friend_broke_up_with_me_and_asked_for_no/", "title": "A friend broke up with me and asked for no contact. I've been feeling rubbish about it but recently had a dream where I spoke to her and now I'm feeling much better", "social_network": "reddit", "user": "holtothelolz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 138, "down_vote": 0, "creation": 1598093386, "permalink": "/r/DecidingToBeBetter/comments/iegeg2/a_friend_broke_up_with_me_and_asked_for_no/", "nsfw": false, "first_save": 1635437561.5882545, "replies_charged": false}