{"id": "t5_2tand_t3_n9xl8q", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I've been using this phrase egregiously lately. According to other posts in the past, it's originally a polish saying.\n\nI've typed out arguments for threads I have no business being in. I deleted my typing and carried on.\n\nInstead of letting myself pointlessly boil over at someone speeding and weaving on the freeway, I say that and keep on keeping on. \n\nI used to tell people \"Die mad about it\" if they didn't like what I was doing (i.e driving slower, wearing a mask, having lots of items in my basket at checkout). I have to admit I liked the power trip I got out of saying it. You say it in hopes of getting under someone's skin, sentencing someone to an angry death. I retired that phrase recently. You do not know what that random asshole is going through, what they did probably isn't worth potentially sending them off the edge into suicide or depression in the grand scheme of things\n\nI really stopped because I was afraid of it turning into some sort of cosmic karmic prank. When something aggrevating happened to me, I'd catch myself telling myself to die mad about whatever pissed me off. Because what the fuck are you going to do? Pull over that speeding car and whoop him? Make a random person on the internet rationally change their position? Convince Dr. Mask less and toothless that a mask is the bare minimum rn to be a contributing member of society? No! That shit just isn't happening. Let it go. \"Die mad about it\" leaves out the other option, \"get over it\"\n\nAll that did was allow the aggrevator to live rent free in my head, letting them get the last laugh, and adversely effecting me. Im not saying throw your hands up every time there's an inconvenience, more like it's not your job to fix random shitty people or random events, holding onto pointless anger like that is like drinking poison and expecting the other person to die. Random assholes exist, don't let them get a leg up on you and just don't give a fuck about them. Not worth your time, not worth your energy, not your monkey, not your circus. YMMV", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n9xl8q/not_my_monkeys_not_my_circus/", "title": "\"Not my monkeys, not my circus\"", "social_network": "reddit", "user": "Tripperfish-", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1620741444, "permalink": "/r/DecidingToBeBetter/comments/n9xl8q/not_my_monkeys_not_my_circus/", "nsfw": false, "first_save": 1635437539.8375661, "replies_charged": false}