{"id": "t5_2tand_t3_jwqlzf", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I am a total newbie and hope this is post is appropriate here...\n\nAfter years of struggling, I have finally found the value of self-compassion and saw the harm in constant self-criticism. \n\nOver the years, I have always believed that self-criticism based on harsh self-judgement is my best ally in life, someone that I can count on to point me in the right direction and to motivate me to work harder. However, with this habit, I have been living within an internal world filled with shame, guilt, fear and depression. I am so familiar with this world that I did not see any problem with it, despite all the discomfort that came with the constant self-berating.\n\nIt got to be the point that I started to refuse to let kindness and compassion into my life, as I believe these feelings make me weak and vulnerable. I have become quite impatient with myself and others. I would often get into episodes of rage and depression when experiencing intense negative emotions or when things do not go as expected. I hated myself so much to the point that I was stuck with constant suicidal thoughts in my mind and social isolation.\n\nIt took so much harm, to myself and to others, for me to see the cheapest plot twist: self-criticism, my best ally, is in fact a sabotager in some logical disguise. It did not only cause damage by diminishing my perception of self-worth but also lied about the fundamental meaning of kindness and compassion. Having kindness and compassion is not same as indulging in fake wishful thinking and it will not make people soft and less motivated; instead, it is a healthy and powerful emotion/feeling/attitude to cope with challenges in life...\n\nAfter reading more on the topic, I have decided to start from the beginning by developing self-compassion so that I can get to a better understanding of the feeling. It has been difficult, but I believe that I will improve with more deliberate practice.\n\nI hope that I can be kind to myself so that I can be kind to others.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jwqlzf/i_have_decided_to_be_kind_to_myself/", "title": "I have decided to be kind to myself", "social_network": "reddit", "user": "Random_Reality", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1605740475, "permalink": "/r/DecidingToBeBetter/comments/jwqlzf/i_have_decided_to_be_kind_to_myself/", "nsfw": false, "first_save": 1635438257.5532808, "replies_charged": false}