{"id": "t5_2tand_t3_mu1wjf", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I (30F) been self isolating for years to hide from the pain of having to face myself. For years I’ve felt like I’ve been leading a double life. A happy, positive and productive professional life paired with a lonely, shame-filled personal life driven by my poor body image and low self-worth. The past year has worsened those feelings exponentially as I spent most of it alone, giving me ample time to create new damaging (and straight up false) stories about why my friends no longer call, how I’m unworthy of their friendship... Throughout, though, I’ve heard that quiet voice in my head trying to speak up. Trying to tell me to get out and go. Trying to tell me that the world is waiting for me while I let the prime of my life pass me by.  \n\nOver the past few days, I’ve been reading “The Gifts of Imperfection” by Brene Brown, and am feeling inspired... feeling hopeful... for the first time in a long time. I have the urge to get up and embrace the day. To do things that make me and my soul feel fulfilled and not care about how others will perceive it. \n\nIt is going to be a long, likely painful journey. But as I sit here with the sun on my face, I feel empowered to shed light on my feelings instead of continuing to cast them in darkness. It still feels scary to be vulnerable and open about this with my family and friends, so starting my process of openness and honesty here, with you. \n\nThe more we can share and remind each other that we’re not alone, the more connected we become. \n\nI feel you, I see you, and I’m right there with you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mu1wjf/i_dont_want_to_hide_anymore/", "title": "I don’t want to hide anymore", "social_network": "reddit", "user": "Fun-Sundae473", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 128, "down_vote": 0, "creation": 1618842798, "permalink": "/r/DecidingToBeBetter/comments/mu1wjf/i_dont_want_to_hide_anymore/", "nsfw": false, "first_save": 1635436717.9919283, "replies_charged": false}