{"id": "t5_2tand_t3_7683sl", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "Hi everyone, Sorry if this isn't in the spirit of the subreddit, but I don't know where else this post would be better to go. This post is me rambling, and it has taken me about an hour and a half of straight typing, because I feel like i need to get this off my chest, and even so, I am scared to Post it, because I am scared to admit these things to myself. And also scared to make mistakes in this post and went over it 5 times, When I know i am messed up, and also I know I have an ego problem with thinking I know everything. (I Do have a TLDR though if people want to just look at that.)\n\nI also wanted to warn people that These are my feelings straight from my head, and I have opinions on Religion, Life, Whatever, that probably is a little messed up, and If you read this you may have problems with people with different opinions, or not who knows, but i felt like I should Write this anyway, I mean Nothing in what I am saying is super bad, but It isnt super great either.\n\n right now i have the belief that nobody in the world is happy. I know this a ridiculous statement to say (And i know I dont believe this deep down, but i am using it as an excuse to feel better about things) \n\nI have always had problems with being bored. I was always the \"classic underachiever\" in school (I was even called this in my middle school/and elementary school days). And in high school, I was basically told that I need to figure things out on my on, from my father, he said \"im only here to guide you\", and i appreciated this, but had no real motivation in high school in the beginning.\n\n But after a crappy year, I got everything together, by focusing entirely on my studies. every day i would do my homework, and since i was taking a tough load, it would be about 3 hours of homework a night, unless i had to study more for a test coming up. I gave up video games, until the weekend, where i would binge them, when i didnt need to study. I did this for 2 years. \n\nbut my senior year I got a job, and this job required me to work weekends. and I worked weekends, and with my normal schedule of homework, which would take me all of normal school time, (9-4ish) and then at home time. I would go home and on the weekends work 20 hours a week only on weekends, most weekends. And i went a little crazy, and wanted to quit, but my dad kept on pressuring me by saying \"you need to save money for college\". so i kept on doing it, and my grades went from really good (top of my class in calculus class, to not even handing in assignments, and hating the class when i used to love it.) \n\nEventually the only thing after work i would have time to do was video games, and i would play because i needed something to take my mind off things, but i needed something, and becoming a video gamer, became who i am, and who i was. I considered myself a video gamer first, and a person second. \n\nI grew to hate school, and I nothing interested me anymore. I grew from a disciplined person who spent almost every day of school for 2 years dilligently working 2 or 3 hours on hw, on something i hated. All for a dream I thought would be awesome, my goal was to become a video game designer or something like that, because i enjoyed playing games and stuff and thought it would be cool to make games because i liked the stories and all that stuff too. That dream was what got me to do good in school, and made me slog through school, which even before i didnt really find interesting. Later i realized i didnt even like programming, and while i had some experience with html and css, and very little javascript and found html and css were not bad, and kind of enjoyable, i tried Java, and it was like someone speaking in latin, and people saying that it is english, and i hated it.\n\nI also had a teacher that, when i was on my downwards spiral, and stopped handing in assignments, said to the other students when they were bummed i wasnt able to get my homework done \"don't trust your homework with (MY NAME) when i was out of the room\" and i heard this out of the classroom, and I started crying outside, and left for a while. There was one person who said it wasnt my fault, and gave me a hug, and that made me feel a little better, but i kind of pushed this person away and said that it was my fault, and i was a failure.\n\nAlso take into account that before this point, my mental image of who i was was \"I may not always get 100 percents or the best grades, but i always try my best, and I always finish what I start\" and when my teacher said this it broke me, and I realized this wasnt true anymore. So i delved more into video games to try and feel better, but i felt shitty for awhile, and after being told i was a failure, I became one. I started doing the bare minimum, and hoping to pass, and not being able to do homework unless it was completely neccessary, and i lost a lot of excitement in my life. I hated every second of it, and started having nightmares about this classroom, and would cry sometimes when i was alone, but i couldnt let anyone else see, so i tried my hardest to put up a facade. but months went by like this, and my mood seemed to be permanently \"meh\" when things were going good.... I lost hope in a time when i would feel happy.\n\nI graduated high school and went to university, still with my \"goal\" of being a game designer thing, but kind of not sure. \" so semester one went by, and I got good grades, and didnt play video games that much, and went to some clubs and stuff, and found them boring and hated them, but told myself \"i can maybe enjoy them later\" and then also got really good at talking to people, and I felt like I have almost infinite \"acquaintances\" and no friends, because the few people i hung out with before, ended up being jerks(would make fun of me behind my back, and gossip and shit) so i had problems connecting with people who were nice. \n\nAnd now i am in college, fucking everything up, and my grades are going down, and i am at the point where i dont care, i know i should care, but i dont anymore. I am basically just riding out untill i flunk out. And I want to care, and i want to do better, and i want to put effort into things. But i can't, because everything i do is worthless. And whats the point anyway, even if I do amazing and get better grades, what do I have to look forward too? A life of mediocre pay, and a crappy job, that means i get to go home and find something to waste my time? and do i want that?\n\nAlso One thing that I wont allow myself to get into, is any religion, I was raised as a Theist, and I would always go to church events and whatever, because I was told Theist's were right, and Atheists would go to hell because they had forsaken god, and was raised like this, and when i was around 12 i became paranoid that God could know I was having doubts about my religion, and since I had doubts I was doomed to hell for eternity, and whenever I went to church my heart would palpitate and fear would enter my heart whenever I was told about all how bad Hell is, and How Theists were doomed. and it took untill i was like 16 to be Ok Spiritually again, and I believe now that Religion does not matter anymore, Atheism or Theism, it does not matter what ends up being \"right\" I believe that there may be a God, but If he exists, he isnt a jerk, and his rule to get into heaven is \"Be a good Person, or at least try your hardest to be, if you make small mistakes, then you will be forgiven, and as long as you are an alright person, you are good, Also He lets in Atheists, As in like if someone dies and they are an Atheist, God flys to the newly dead and goes \"Hey there Person, you are a good person, you get to go to heaven, because you didnt go about hurting people\". Also IF there is no God, and Atheism is right, then whatever, (kind of the opposite of pascals wager, where even if I \"make the wrong choice\" and face \"eternal damnation\" eternal damnation doesnt exist, and if i was an atheist god would be like \"hey im real\" and i would be like \"ok\" and then we are good to go.\n\n\nTLDR: (Still Pretty Long)The best solution that i know of is to stop gaming/internet/tv/reading/(Escapism).\nBut that is the only thing at this point that makes life bearable. they are the only things i like, and when I do try to find something else to focus on I always end up back at video games, because that is who I am.\n\n\n Addicted to video games (and know I need to stop), but I feel like its all i have/ all that excites me, I feel like I cant make relationships work(friend/family/anything). I want life to be good. But I truly believe in my heart, and with everything that i have. That Life sucks, and nobody is happy, (even though i know it is a lie, and there are probably some happy people). I want to want to be happy, and not bored, but i dont know how. I want a Job that is exciting and worthwhile, and pays well, and I dont need to work every waking moment, and a workplace environment where people respect each other, if they dont agree, and all this stuff. And i dont think it is possible. \n\nI am also going to group therapy to feel better about myself, but it isnt working very well, and i often feel like it isnt helpful, because for one thing I dont let on how big of a deal this is, because i am scared to be considered crazy, and depressed, and my life would basically be over at that point anyway, because even if i get better potential employers would figure out I went to therapy, and consider me \"damaged goods\" and I nobody would want to hire me, so I would need to figure out how to go into business for myself, but i dont have the strength to do something like that.\n\nTLDR:(Short Version) I have no motivation anymore. There is no reason for me to do anything, and I dont care about anything anymore(besides video games or tv, and i get sick of that pretty easily a lot of times). I am not excited about my future, and the only things i enjoy are things that do not require anything from me. I know I will never be able to have a balanced life, I know that I will always obsess over something, What I am looking for now, is something to obsess about that will be useful, and have lots of things to do so I wont get bored, I need something to give my life meaning. \n\nPS: It has felt good to get this off my chest, even if it ends up not being helpful for me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/7683sl/how_do_i_decide_to_be_better/", "title": "How do I Decide to be better?", "social_network": "reddit", "user": "ThrowAwayNoMotivate", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1507932146, "permalink": "/r/DecidingToBeBetter/comments/7683sl/how_do_i_decide_to_be_better/", "nsfw": false, "first_save": 1635437187.074383, "replies_charged": false}