{"id": "t5_2tand_t3_mxzpnf", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Im nearing the end of my 20s and i think i'm on a life crisis. I regret so much of my life but i also can't help to blame my parents. \n\n**Heres backstory for context,  but you can skip for faster reading.** So I was raised by  a mom with a borderline personality and who is horrible at parenting.  She focuses more on being a cool friend to her kids than actually being a mom and guiding or directing.  As a kid i liked that she was never involved in my life.  She never asked where I was,  who i was with; it was like having a roommate instead of a mom. I was also raised by a dad who was very strict and quick to anger,  and he was always yelling at me when i had no idea what i did wrong. I just learned to be afraid of him and hide everything about my life from him that i could.  Now the thing is, my dad is incredibly incredibly smart.  I always idolized how smart he was.  He dropped out of the last semester of nursing school,  was almost a Master electrician,  plus was very mechanically intelligent and could build amazing things. I always wished i could learn what he does,  or that he'd teach me anything. But i was born with a vagina and he treated me like.. well.. you know. My younger brother was always invited to the shop.  Invited to learn,  gain new skills.  Funny thing, my brother HATES that shit. He doesnt have patience for numbers and design like i do. \n\n**Anyways, now** Im in my late twenties and i wasted my adulthood up to this point honestly still blinded, trying desperately to make my dad proud.  I got a guy, i got married, i got really good at house work and laundry (strict gender role shit).  I built myself a PC and learned some art stuff on the side,  but thats about all ive done for ten years. In 2018 it hit me that i'm not happy,  i feel like i'm living someone else's life.  I leave all that behind and i move back to my hometown in 2020 to figure shit out.  Boom, my dad died this year at age 47.  NOW im in full regret mode.  I just wish i could have learned something from this man. Even now,  so many years later im still terrified of him and he still would never give me the light of day to talk to him. Im pissed.  \n\n**Moving Forward,** I really wish to learn something.  I want to be so incredibly intelligent like he was,  i want to build stuff and create the inventions i have in my head. I just don't really know how to start.  I know these skills are learned by *doing* but it feels hopeless if you never had someone teach you basics in the first place.  \n\n**My final question is** where do you go to learn hands-on skills? Can i have a different dad adopt *me?* a grown adult? Im so far behind it feels unfair to take opportunities that are available to people younger than me.  Any advice, questions,  thoughts are welcome.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mxzpnf/looking_to_learn_handsonskills_i_feel_like_im_so/", "title": "Looking to learn hands-on-skills; I feel like i'm so far behind my peers.", "social_network": "reddit", "user": "salemandsleep", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1619320793, "permalink": "/r/DecidingToBeBetter/comments/mxzpnf/looking_to_learn_handsonskills_i_feel_like_im_so/", "nsfw": false, "first_save": 1635438182.27557, "replies_charged": false}