{"id": "t5_2tand_t3_qhhtb8", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "I am trying to better myself and stop feeling negatively about my friend doing things with / for other friends, small things often make me feel othered and unimportant to those I care about. Any advice on how I can look at situations differently or work on myself would be appreciated\n\nI  struggle to balance many friendships, I maintain 2 - 3 close friends at  any given time, currently 2. this has many pros, I feel very close to  these friends and see them more as family, but I also appreciate that it  can be a lot of pressure for those people fufilling such a large  portion of my social needs. I have tried maintaining more than 3 at once  in the past and it always causes me distress people always drift away  after a time.\n\nSome information  about me, I struggle a lot with feelings of ostriciation and  abandonment. I have two siblings, an older and a younger sister, all  from different fathers. we had an odd family dynamic. my older sister  never knew her real father and sees my younger sisters father as her  real dad. I on the other hand knew my father and split my time between  my mothers and my father 50/50 up until i was 14 when i moved in with my  father full time. whilst i was at my mothers i was the middle child and  was often forgotten about, i need more than one hand to count the  mumber of my birthdays they forgot. and i very vividly recall my mother  taking my sisters on expensive and lavish vacations whilst leaving me  behind. and then getting mad at me when they returned for not being  entusiastic about being shown their photos of a \"wonderful family  experiance\". my father was marginally better, he was always well  intentioned, but he was still a stunted man-child and never gave me any  meaningful emotional support. needless to say i always felt othered,  left out; and that has stuck with me my whole life. I am currently 24,  and i still have not grown out of those feelings. and i am worried it is  damaging my relationships because I often get envious when I see one of  my friends giving someone else preferable treatment over me\n\nFor  example, one of my current close friends is an artist, a few years ago  he would enthusiastically show me all of his drawings as he completed  them at the same time or even before he showed them to other people, and  it made me feel good. for the first time in my life i finally felt like  i was included in something. and they would even surprise me with  drawings occassionally. and it meant so much to me. it felt like i found  something that i had been lacking emotionally my whole life.\n\nhowever  over time it feels like they have gotten somewhat distant, they no  longer share their works with me at all, and every time  i see them post  a new work on social media, it hurts me a little, that they didn't  share it with me. and it makes me feel like a terrible person for having  these feelings. but they have a friend they they do art for frequently.  and every time i see that they have done work for that person and  nothing for me in months, close to a year, I feel irrationally upset.\n\nnow  to be clear i do not think they have done anything wrong, they owe me  nothing and i am lucky to have them as a friend. but it hurts me to see  them favouring another person over me. I feel petty and childish having  these feelings and I want to try and find a way to move past them\n\nHow can I look at this differently? is there anying I can be doing to move beyond my feelings?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qhhtb8/how_to_overcome_past_ostrication_affecting/", "title": "How to overcome past ostrication affecting current relationships", "social_network": "reddit", "user": "Burlyrn", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1635407344, "permalink": "/r/DecidingToBeBetter/comments/qhhtb8/how_to_overcome_past_ostrication_affecting/", "nsfw": false, "first_save": 1635435233.2293231, "replies_charged": false}