{"id": "t5_2tand_t3_q5otq3", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "b69cf201-6737-4217-b486-9096135546b8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "4b69452a-b1e5-47af-a734-ad3c2bdce185", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "TLDR: I realized I am a toxic person and I need advice on ways I can take baby steps that create long term behavioral changes to turn this cycle around…\n\nI always thought I was a good person. And I do feel like I have been for the majority of my life despite all my hardships. I never intentionally try to cause conflict or confrontation and always try to do what’s right. But the last few years have completely broken me and my spirit. How can I try so hard to avoid conflict only to be the bad guy every time? It became completely clear to me that I am the toxic person in my life when not a single person showed up to my birthday party this year except my bf who was already with me.\n\nOver the last few years, I’ve lost 99% of my family for standing up for what’s right, lost most of my friends for taking things too personally, am so close to losing my bf for not meeting my (mostly unrealistic expectations), and my daughter whose father has been involving her in custody issues and pitting her against me through lies (I don’t dare involve her by speaking ill of her father so naturally I look bad to her since she doesn’t hear my side of things). \n\nMy depression and anxiety have made me so bitter and angry and I project that. I am so unlucky in life with unfortunate events happening one after the other and now I dwell in it. I’ve just come to accept my life will be a constant fight and nothing will ever come easy. My happiness has been stripped and I am one bad life event from becoming a full fledged Karen. \n\nI constantly think about killing myself, but I am too big of a wuss to do it because I\nam completely convinced that I’d come back and have it way worse than the life I currently have. So I often pray for death so that it’s not by my own hand all so I can exit this world without my daughter thinking of me as a coward.\n\nThis isn’t me. At all. I hate who I’ve become and that I have allowed my incredibly poor luck to win.\n\nI recently got on antidepressants, go to therapy, take time to myself, etc. and it just isn’t enough. People can’t handle being around me and I’m losing people left and right.\n\nSomeone please help me end this cycle. My daughter needs me, but I desperately need to keep people around in order to feel motivated to stick around.\n\nI’m going to bed but I will accept any and all constructive criticism. Please go easy on me. I’m fragile.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5otq3/current_toxic_person_looking_for_advice_from/", "title": "Current toxic person looking for advice from former toxic people - please help me end this cycle", "social_network": "reddit", "user": "okitwasme2", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 28, "down_vote": 0, "creation": 1633929283, "permalink": "/r/DecidingToBeBetter/comments/q5otq3/current_toxic_person_looking_for_advice_from/", "nsfw": false, "first_save": 1635436256.4720218, "replies_charged": false}