{"id": "t5_2tand_t3_pp0wpk", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "Whenever we think about a Viking, we imagine a brutal barbaric bearded man, a great big ax in hand, who knows nothing but to pillage and plunder. However, the reality is far more shocking and exemplary.\n\nA Viking takes care of himself. He would eat only two meals a day- The first meal, **dagmal** is served about an hour after waking up. The second meal, **nattmal** is eaten in the evening after he finished with work. Research has found that eating a good portion of food (protein and fats) early in the morning helps stabilize metabolism, and provides sustained energy throughout the day. Most people who suffer from anxiety, reported their anxiety vanishing overnight after they started eating a good morning meal.\n\nAlthough he doesn't have access to as varied a diet as the modern man, he eats surprisingly well- vegetable-meat stew, bread (usually made of rye), and also various types of fruit such as cloudberries in the morning. His diet is rich in protein, mainly in the form of lean meat from fish. Nutritious food is essential to performing well.\n\nHe also took care of his hygiene, grooming himself with tweezers, razors, combs, and ear cleaners. He also washes once a week, which is very impressive by the standards of medieval Europe. He also loves physical activities like skiing. Hygiene is not just about being healthy, but being presentable and feeling good about yourself.\n\nHe is technically adept, capable of making some of the finest boats in the world, he toils to better his craft. His most treasured creation, the \"longship\" outliving himself and influencing shipbuilding for centuries to come. A few of his friends are \"berserkers\" who can enter a trance-like state of fury at will, allowing them to overcome their limits and accomplish seemingly inhumane feats. Such an ability is only achieved after serious emotional and physical training, for channeling one's anger, hatred, and such raging emotions is a feat of the highest caliber. Working towards a cause greater than yourself provides drive and fulfillment. Conquering your mind is the secret behind rarest accomplishments.\n\nIf you learnt something, you might benefit to join my journey of development.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pp0wpk/what_i_learnt_from_a_viking/", "title": "What I learnt from a Viking", "social_network": "reddit", "user": "NotRealHyde", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1631746138, "permalink": "/r/DecidingToBeBetter/comments/pp0wpk/what_i_learnt_from_a_viking/", "nsfw": false, "first_save": 1635436713.6810691, "replies_charged": false}