{"id": "t5_2tand_t3_qbtcew", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "***tw: eating disorder mention***\n\nedit: its my first time posting heree hii sorry if i made mistakes\n\nedit 2: might take time to check out comments cause im genuinely feeling embarrassed to post here cause i know this trait of mine is extremely wtf trait lol thanks!\n\nokay, i know it might sound weird. some might say 'kpop really gets out of control and becomes an obsession to teenagers' but hear me out first.\n\nIve been a fan since December 2017, and KPOP saved my life on my darkest days, im not trying to be cheesy. The thing is, I have an older sister and she isnt into KPOP so much back then, just a casual listener. I remember her making fun of it towards me (but not in a serious degree) but since i was emotionally unstable, i felt extremely offended cause their music literally what gets me through every day.\n\nNow, quarantine happened. She got into KPOP this time and yes, as some of you expected, I feel extremely annoyed by it. At first, I will casually feel irritation but it usually passes by. But as time goes by, I feel extremely annoyed that she's listening and jamming into the same people I idolize. To the point I become teary eyed cause I couldn't enjoy watching their shows or listening to their songs cause she will always pop out and react unnecessarily? I think she's catching that attitude now that sometimes I can tell she's doing it to tease me.\n\nsometimes, i prefer not to eat in the table cause she is humming the song and makes me feel uncomfy. her reactions makes me cringe when she watches in our big screen aaaa for some reasons idk why? like i slap myself after.\n\nI've tried to think a lot of ways to overcome this cause I don't want to break our bond just because of this hobby. We are super close.\n\nI tried to evaluate my thoughts and keep on trying so hard to stop being toxic but nothing really helps. I get more impatient and I assume it is also influenced by my ED worsening (as mentioned on the TW above, i have an eating disorder..) or because of the pandemic + lockdown, everything is just tiring. I thought that as time goes by, I'd be able to mature. but i am just *annoyed and mad* when I see her things that makes me feel safe.\n\ni do not want to be like this. i feel disgusted by this trait. is there anything i can do? i am trying so hard to open my mind, im getting tired of myself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qbtcew/how_do_i_stop_gatekeeping_what_i_like_kpop/", "title": "How do I stop gatekeeping what I like (KPOP)?", "social_network": "reddit", "user": "butterfly2507", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1634706006, "permalink": "/r/DecidingToBeBetter/comments/qbtcew/how_do_i_stop_gatekeeping_what_i_like_kpop/", "nsfw": false, "first_save": 1635436772.0868711, "replies_charged": false}