{"id": "t5_2tand_t3_c4nnh1", "request": ["da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "Or somewhere thereabout.\n\n\nThis morning I woke up extra early, plenty of time to get my day started and not at the ass-end of a time where I know I may only be five or ten minutes late. No scrambling, no blood-shot eyes from drinking last night. My journey into sobriety has just begun but I already feel like another person. But that's the funny part; this new version of me is actually the old version, I had just forgotten who I was without the rampant binge drinking.\n\n\nI didn't crawl out of bed, instead I woke up to my alarm, laid in bed for a few minutes as I went over what my work week was going to look like. Many obligations to tend to this week, instead of being anxious about it all I can meet them head on as tasks to clear off with a simple path to get there. Without the drinking it all seems very simple. Drinking is like living with one arm tied behind your back and one leg tied up, everything is easier now. \n\n\nThese small moments of clarity come all the time and my most recent one greeted me on the edge of my bed this morning as I sat there letting my body wake up naturally. I made my bed, it feels so good to leave a made bed behind, and to come home to one as well. My room is neat and tidy from the night before, because I took the time to put away the laundry I had time for, because I wasn't wasting away at the bar talking myself into one more drink. \n\n\nI showered with a clear mind, dried my hair, long and healthy from a better diet. My skin is clearer, and feels healthier as well. Likely from the better diet but also the extra money I have these days so that I can afford to spend it on other things I want or need, like proper lotion for my spotty eczema. My eyes feel brighter, and they *look* brighter or so people have told me. Once recently, my roommate stopped me in the kitchen and hugged me, albeit drunkenly, and said \"It is like someone turned the light back on in your eyes my friend,\" he sounded sincere so I took it at face value. \n\n\nI think perhaps that is the best part of it all; I've really begun to hone in on what matters, my battles are chosen more wisely, I let things go with relative ease by comparison. All problems are just solutions waiting to happen. The nagging voice in the back of my mind is quieter, and has much less to say. I am not out of the woods completely, I know this. \n\n\nBut I am also okay with this and I may never be completely in the clear. And if I ever feel the weight of worry come on all it takes is a moment of reflection, a comparison of what I left behind versus where I am... and a glance forward to where I'll be tomorrow, next week, next month, next year. I don't know where this journey ends but for once I am eager to see. \n\n\nI started a new job last Monday, to my new peers and bosses this is the person I've always been and that silent anonymity is a warm blanket in a lot of ways. The bright-eyed, gung-ho ready to go guy that greets them in the morning is just me. They will never know the grumpy, tired, half-asleep ogre I used to be if I have anything to say about it. However, sometimes I wish they could see the juxtaposition if only to satisfy my need for others to see the change in myself. But again, that doesn't really matter. The self is easier to satisfy these days. The soul is wanting but now the flesh has the means to dictate, to satiate. And being in that type of control, for once, is enough.\n\n\nHello, and good morning on a rainy Monday.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/c4nnh1/my_50th_morning_sober/", "title": "My 50th Morning Sober", "social_network": "reddit", "user": "CleverFeather", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 889, "down_vote": 0, "creation": 1561382158, "permalink": "/r/DecidingToBeBetter/comments/c4nnh1/my_50th_morning_sober/", "nsfw": false, "first_save": 1635438092.0378723, "replies_charged": false}