{"id": "t5_2tand_t3_ho74r2", "request": ["da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "I used to be in great shape as a teenager and in my 20’s. i never focused too much on nutrition besides staying away from sugary stuff for the most part and I generally ate until i was full. I was able to keep weight off because my young metabolism and active lifestyle. While I looked pretty good, i still probably didn’t live up to my full potential, but i was happy at the time with myself for the most part.\n\nEnter my 30’s. The stressful job and having kids changed everything. I could no longer spend 2 hours in the gym, hours of hiking in the mountains, surfing, etc. I still had free time, but I wasn’t using that time wisely and ended up getting way out of shape, and gaining 20 pounds. I had an excuse for everything and just wasn’t living up to my potential.\n\nI abandoned the hobbies that made me feel alive. I replaced my active lifestyle with hours of gaming, TV, and browsing reddit all day. i continued to eat whatever I wanted until I was full. Instead of eating for fuel and nutrition, I would eat because was I was bored.  The worst part is, over the last 7 years i have hated looking at myself in the mirror and don’t let people take pictures of me. Instead of doing anything about it, i continued to eat the way i always did. To me I deserved to eat that way because i worked hard all day and took care of my kids. I deserved that dopamine spike, so I thought.\n\nI drank every day, and smoked weed every night. I didn’t get drunk, it was a drink or two and I was hardly buzzed. But the calories add up, and that slight buzz was self medicating. To help sleep I used a vape pen every night. Except I would end up browsing reddit late into the night looking at garbage content. Often times i would then eat even more late into the night. \n\nI lived without discipline. I never said no to myself. I was unhappy. This lifestyle was satisfying in the moment, but long term it filled my life with sadness and regret. I took the easy way out every day. Living life in numbness with a slight buzz and waking up groggy and dazed every morning. I’ve been told so many times that cannabis is harmless, but i was addicted to it. I would go into a panic when I couldn’t get any. It fucked up my lungs, and made my voice scratchy, but I still never gave myself a break from it. While cannabis didn’t give me the hangover liquor did, I still woke up in a foggy state every morning. I’m not anti weed, It was just a bad situation for me because i have poor impulse control.\n\nHaving a drink and using cannabis every night made it incredibly hard to wake up ready to take on my day. There was zero chance I was getting up to work out, or do anything productive. Instead I would sleep in as much as possible, then stare at my phone until I had to get up. There was so much of life I was missing out on due to my life choices. I wasn’t waking up on a mission to accomplish goals, I was sleepwalking out of bed and stumbling through life.\n\nIt finally came to a head during the covid crisis. I was spending 6 hours a day plus playing animal crossing, putting off house projects, my eating and drinking became out of control and I gained 10 pounds. When I shaved off my covid beard(three months of growth) I saw a face I didn’t recognize, I’ve never seen myself that unhealthy and out of shape. It was incredibly shameful, and I immediately started growing a beard again to try to hide what I looked like. When family facetimed me, I wore a hat low and mostly pointed the camera at my kids out of shame.\n\nI realized then that I had to change my life. I started doing 3+ hour hikes once a week. Waking up at 4:45 in the morning to drive an hour into the mountains. I was doing death marches up 10k ft mountains, out of shape, but feeling so inspired. The way i used to live I could never get up so early to do something so strenuous. I can’t even begin to tell you how incredible  it feels to hike to the top of a peak by 8:30 and be back home before noon. It’s an incredible confidence booster.\n\nWhile I was feeling stronger, and healthier my weight remained the same. My eating was still out of control. I ended up seeing an ad for a meal replacement product and jumped right in. With that product I could count calories easily and replace a meal or two a day. I won’t share what product i’m using, but if you’re curious PM me, and i’ll let you know. That product though isn’t going to solve all my problems. \n\nI’m now meticulously counting calories using the Loseit app, and i’m having a ton of fun doing it. I’ve never paid attention to calories, so i’ve been learning so much about nutrition. I’ve allowed myself about 1600 calories a day, when I spread that out correctly I feel satiated. One of the best things about counting calories is that you have to face whatever you consumed for the rest of your day. It becomes easy to see where you made a mistake in your diet when you regretfully overconsumed something. It really helps you become mindful about what you put in your body.\n\nI feel so great about the direction i’m headed. Just a couple months ago I felt so uninspired about my life. I feel like the whole world is opening up. Food is exciting again, i’m setting goals to do more hikes in the mountains, and I feel like in finally figuring out a sustainable healthy lifestyle. No crash diets, just regular food in healthy proportions and a healthier overall lifestyle. I still have some things i need to cut out(i love energy drinks). But I love the direction i’m headed. I feel like i’m finally becoming the dad my kids and wife deserve.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ho74r2/finally_decided_to_stop_making_excuses_and_hold/", "title": "Finally decided to stop making excuses and hold myself accountable. 3 days ago i started counting calories, 2 months ago i stopped smoking weed, I recently decided to stop my daily “night caps”, and a month ago I started hiking again.", "social_network": "reddit", "user": "DouglassFunny", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1594315236, "permalink": "/r/DecidingToBeBetter/comments/ho74r2/finally_decided_to_stop_making_excuses_and_hold/", "nsfw": false, "first_save": 1635438092.68795, "replies_charged": false}