{"id": "t5_2tand_t3_n03sle", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Small disclaimer that people's anxiety issues are unique and this may not be the best exercise for you.\n\nI am a perfectly happy and content person when I am single and do not experience stress or anxiety. Objectively, I am happy with myself and who I am and how I present myself to people. However, in relationships I struggle heavily with obsession and anxiety issues.\n\nThe cycle goes like this: I am happy and content being single, but then I meet someone who I make friends with and decide that I want to be with. We start dating, and I develop unhealthy obsession and anxiety over intrusive thoughts, like \"she's probably going to sleep with someone else\" or \"she's so outgoing with these people and I'm not\", which would make me feel worthless. Eventually I can pull myself out of this hole, and the relationship is great and I feel normal, but then after we break up, the obsessions and anxiety come back, with thoughts like \"she's probably seeing someone else already\" and \"she's probably over you already\", which again are very hard to deal with and make me feel worthless. Eventually, I pull myself out of this hole. Deep down, I have some emotions that are going on that morph into anxiety and obsession.\n\nJust recently, a relationship ended for me and I was again overcome by obsessive thoughts and anxiety again. However, I used my two-pronged approach that really helped me get clarity and allow me to process my thoughts in a healthy way. I still feel sad because I miss the person, but I don't feel anywhere near as anxious or obsess over my thoughts, and I feel that I now have the space to feel my emotions without feeling worthless.\n\nHere's the first prong of the approach: Consider yourself and how you are usually happy and content with yourself. Write down things that you like and appreciate about yourself. Next, consider the benefit or utility of each intrusive thought to you and your well-being. For example, \"she's probably over you already\" has absolutely zero benefit to me to think about or ruminate on or obsess over because it just makes me feel worthless. Now when you experience a thought like that, do these things simultaneously:\n\n1. Take a deep breath\n2. Say a mantra to yourself. I like to use \"I am the circle and the circle is me\", but you can pick anything\n3. Focus on something completely different. This can be something you're looking forward to, a positive interaction you've had recently, something you like about yourself, the color of the wall, your hands, really anything.\n4. Push the intrusive thought out of your mind\n\nRemember, do this *every time* you have an intrusive thought. When we do not allow ourselves to be swept by intrusive thoughts, we are practicing self-compassion. The relief will not be immediate, but keep doing this over a few hours to a day and you will notice relief; you will simply have less intrusive thoughts and your mood will improve. Keep reminding yourself that there is no benefit to thinking these intrusive thoughts whatsoever. \n\nHere's the second prong of the approach:\n\nSometimes, the first prong seems to stop working and we cannot stop the intrusive thoughts. Maybe we were triggered by something, or not. In this case, here's what to do:\n\n1. Take a moment, 10 minutes, 20 minutes, however long you need, to sit down without any distractions and hold whatever is distressing you in your mind's eye and say any negative things to yourself out loud. The point is to really feel what is distressing you. You may feel worthless and more distressed than before, but this is okay. Do this until the intensity and anxiety starts to lessen slightly.\n2. Bombard yourself with positive affirmations and self compassion and happy memories of yourself, while simultaneously using the first prong to push aside intrusive thoughts. Do this for as long as you feel necessary.\n3. Keep using the first prong of the approach after these little sessions to push aside your intrusive thoughts and keep your mind on positive things about you and other normal thoughts.\n\nOne final thing to keep in mind is that this approach works best when I minimize my triggers - no contact or social media with my ex, or going to places that we used to go together. This is because not being triggered a lot gives me the space to actually get process the underlying emotions that have morphed into anxiety and intrusive thoughts. \n\nI have been using this over the past few days and I have not felt better in weeks.  I still have some intrusive thoughts but this has thankfully given me some room to process my feelings from my break-up, and just some space to feel normal and good again. You are worth it! \n\nAlso if anyone knows how I may be able to break this cycle and never get stuck in a hole like this again because it is 11/10 terrible, I'd love to hear it!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n03sle/this_week_i_am_taking_charge_of_my_intrusive/", "title": "This week, I am taking charge of my intrusive thoughts and anxiety after a breakup", "social_network": "reddit", "user": "rectumpirate", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1619573428, "permalink": "/r/DecidingToBeBetter/comments/n03sle/this_week_i_am_taking_charge_of_my_intrusive/", "nsfw": false, "first_save": 1635438445.3513894, "replies_charged": false}