{"id": "t5_2tand_t3_d71y2j", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I wasn't sure what sub to post this, but this seemed like a good place, because it's a bit negative/depressing and I want to get out of it.\n\nA few months ago I started working full-time for the first time in my life. It's alright, but my spare time is very limited due to circumstances, so on weekdays I only have 1-2 hours I can effectively spend on art. Art has always been one of my most important hobbies, and I want to keep creating, it's one of the things I care the most about in life. The thing is that it requires a kind of \"maintenance\" to keep my desire alive and to not get rusty, and because of my limited free time (and energy!) after work days, I tend to neglect my art projects and just collapse, doing not much but browsing the internet and even getting bored of that. The lack of creating art makes me less interested in it, which in turn makes me spend less time on it, etc. etc. I'm really getting frustrated because I'm working on some pretty ambitious art projects and I can't seem to make much progress or enjoy it as much as compared to when I had more free time. Everytime I manage to spend more time on such things, I get more and more joy out of it, it can almost become addicting at some point.\n\nI also notice it in me having less interest in stuff like hanging out with friends, dating, exercise, etc. I'm quite the introvert and it feels like those things would eat up my remaining free time, even though I know it's not a healthy way to think like that.\n\nI guess I'm not really looking for practical tips but more like some type of inspiration? I'm already a pretty practical person, but my major challenge is that I need the magic and amazement that is common in childhood but adults often tend to forget. In fact, I think I need it more than most others due to the kind of person I am. I still think it's possible to keep that in my life even as an adult, but it takes some conscious effort now.\n\nPS: I want to mention switching to a different job is not an option for now and I'm honestly fine with working at my current job. It's just the hours that I have problems with (but I can't really just decide to work part time and still be able to pay my bills). And even then, just better time management alone won't help, I need to make some changes in my deeper emotional state.\n\nNot sure if this makes much sense, but I just hope you guys can help me. I really want to change something.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/d71y2j/working_fulltime_and_trying_to_find_back_my_joy/", "title": "Working full-time and trying to find back my joy in hobbies and other things", "social_network": "reddit", "user": "Aravoid1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1569017429, "permalink": "/r/DecidingToBeBetter/comments/d71y2j/working_fulltime_and_trying_to_find_back_my_joy/", "nsfw": false, "first_save": 1635437325.2250445, "replies_charged": false}