{"id": "t5_2tand_t3_pgsrlf", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8"], "text": "I'm just a lil lady that doesn't like being told what to do. I worked for the government. Hated it. Worked for corporations. Hated those too. Worked for private business owners. Fuck this one guy in particular, but I really didn't care for that either. \n\nI love working outside. I am a stone mason with years of experience. I know how to work hard while doing hard work. \n\nMany business owners won't hire me bc I'm a small lady and probably bc I'm a lady in general. I was once told by a dude who wouldn't hire me bc I'm \"a sexual harassment case waiting to happen.\" I've been told \"ya know this is really hard work\"  as if I didn't know what I was applying to. I've busted my ass 3x as hard and produced 2x as much work as all my coworkers, but for some reason had bosses think \"she really can't keep up\" despite all my coworkers backing me up.\n\nOne time I was groped so aggressively I went home and cried in the shower for an hour (don't worry I don't pay for water lol) not because it happened, but because it wasn't the first time it happened. It wasn't even the second. And I'm the one that got fired. I slowly became more volatile in my personality. More defensive. So angry. \n\nI tried working for this corporation bc I was afraid to work with people. I was tired of the sexism. It made me fall into a deep depression. I was so so sad being away from a chisel and hammer.\n\nSo I took a risk. I quit. I bought some landscaping equipment. I posted an ad advertising myself as a woman and support is coming in left and right. I had a request for service that night. My schedule is slowly building up to where I'm not sure I can manage it alone. I might have to hire someone. \n\nFrom the day that I quit, it was like the universe has been speaking to me as corny as that sounds. Everywhere I turn someone is giving me tools, connecting me to potential partners, providing me guidance, offering me training. The build up is insane.\n\nI'm going to go to school and study construction technology. I'm going to get certified for a globally recognized stone masonry standard. I'm going to get licensed and insured.\n\nI'm going to hire a bunch of people who wouldn't be hired by your average company. I'm going to teach work shops. I'm going to pay it forward when I'm established enough. \n\nI'm doing the thing.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pgsrlf/i_didnt_like_my_life_so_i_quit_my_job_and_became/", "title": "I didn't like my life so I quit my job and became a freelance landscaper", "social_network": "reddit", "user": "squigglylinesofine", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1265, "down_vote": 0, "creation": 1630623610, "permalink": "/r/DecidingToBeBetter/comments/pgsrlf/i_didnt_like_my_life_so_i_quit_my_job_and_became/", "nsfw": false, "first_save": 1635436965.942911, "replies_charged": false}