{"id": "t5_2tand_t3_mtczmb", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "As you know, our excellence comes not as a result of a single action. It's a compound effect of habits and gradual, disciplined practice.\n\nHowever, we usually limit discipline to trivial things such as waking up early or working out three times a week. I'd like to bring up one more aspect of discipline, the discipline of our judgment. By judgment, I mean here the frame that shapes our perception of the world, our thinking.\n\nAesop put it beautifully in one of his fables. Each of us has two sacks, one with others' flaws, and it hangs within our view. Another is behind our back, filled with our own flaws. That's why we see others' mistakes quite clearly, but can't see our own.\n\nSo our flaws in thinking are as hard to see as character flaws. For example, 90%+ of people consider themselves better than average drivers and lovers. Isn't it funny? That's how our overconfidence works, and there are thousands of other biases like that.\n\nWhile it's hard to see them on our own, we'd probably benefit from someone outside who could help us see them. And that someone doesn't need to stand there all the time. Instead, it can be the image of the person we deeply respect and admire; we call it the Role Model.\n\nThat's where the stoic perspective becomes useful. Stoics had their own teachers. They treated them as models, whose behavior they were inspired to emulate, and mentors who could give them valuable advice.\n\nSo let's proceed with the practical exercise that I framed from the perspective of Marcus Aurelius. We will learn how the Role Model can help us get disciplined in judgment, cope with insults and other negative emotions.\n\n## Exercise\n\nHi! My name is **Marcus Aurelius.** I am an emperor from the Golden Age of Rome.\n\nDuring my time as Roman Emperor, I fought many wars for our empire’s glory and peace and faced many hardships. But I found that people’s inner peace doesn’t depend on neither external stability nor fortunate events.\n\nFor us Stoics, the key to inner peace and discipline lies in our judgment. What is judgment, you'd ask? It's our ability to master our perception of the world.\n\nThe wrong judgment will lead to disturbance and suffering even in the most fortunate circumstances. While the right one will preserve our inner calmness against all of life’s hardships.\n\nSo the goal for this first lesson is to teach you how judgments affect our inner peace. We will also learn how to change our judgment so that you can keep your stoic calm under harsh circumstances.\n\nStoics believe that our mind’s balanced state is disturbed by intense emotions, especially by negative ones, such as anger, despair, fear, or envy.\n\nMoreover, an obsessive passion might disturb our inner peace.\n\nOur emotions are not caused by things or events themselves but by our judgment about them.\n\nThink of a perfectly straight stick. When you put it underwater, it will appear as bent or broken to the onlooker.\n\nWhile external things and events may not be under our control, we certainly control our judgment. Therefore, we have the key to our inner peace always at our disposal.\n\nLet me give you an example. Imagine you are insulted by two different people. Both are calling you “a failure.” Now, if the first person appeared to be a mad man who randomly insulted you in the street, you most likely wouldn’t care too much. Buf if a beloved one, like your father or your sister, would call you “a failure,” it would probably hurt you.\n\nBut why is that? In both cases, the insult was the same. The reason lies in our value judgments and expectations. The person on the street doesn’t know you, and you might not even care what he thinks of you. Also, the fact that he appears to be mentally ill makes his behavior expectable.\n\nOn the other hand, we usually want our beloved ones to have a positive picture of us. We expect them not to insult and hurt us. Even though it’s ultimately not under our control.\n\nBut often our beloved ones know us better and there might be a lot of truth to their words. If it's true, then instead of focusing on insult, we should use this situation as an opportunity to become a better person, to correct our flaws.\n\nNow, let's do the first quick exercise.\n\n**When was the last time you were insulted? How did it make you feel? Try to identify the underlying judgment and expectation towards the other person.**\n\nThis exercise is supposed to emphasize the role that our judgments play in forming our emotions.\n\nSo far, so good. But in which way should we change our judgments to preserve our inner calmness when we face adversity and hardship?\n\nWe should change them in a way so that they reflect the level of control we have over a particular object, person, or event.\n\nThink of it like that — we don’t control external things, such as the weather, illness, and other people’s behavior.\n\nSo the reason we get hurt by other peoples’ insults is that we assume them to act according to our expectations about how they ought to behave towards us. And since we cannot ultimately control behaviors or opinions of others, such unrealistic expectations might provoke frustration and anger when those expectations are not met.\n\nI firmly believe that we should focus and care more about the things within our power, about our character and judgments, and less about external things.\n\nIt just so happens that we as humans are naturally drawn to them.\n\nLet’s leave it here for now. We will discuss internal and external things and how we should deal with them in the next lesson. I hope you will join me!\n\nAnd now, I would like to introduce you to a Role Model exercise that will help you control your emotions through exercising your judgment.\n\n**Imagine that an ideal Stoic person observes what you are doing. Whenever you are about to lose your inner peace, you should ask him or her how you could reframe your perspective, accounting for things within and without your control.**\n\n**This ideal person might be your favorite teacher, grandfather, priest, or favorite author. Just think of them as Stoics in this exercise.**\n\nRemember, if you are distressed by anything external, the negative emotion is not due to the thing itself. It's our estimate of the thing that makes us feel bad. And have the power to revoke it at any moment. See you in the next lesson!\n\n&#x200B;\n\nP.S. Just in case you are curious to explore more exercises like that, let me know and I will DM you the link to my other lessons.\n\nThe themes I cover are: getting disciplined, reducing anxiety, learning about your life values, decision-making, the art of happiness, and being present in the moment.\n\nThe lessons are based on the primary sources of wisdom from more than 2500 years of history of philosophy, from Plato, Aristotle, Lao Tzu to Carl Jung, Erich Fromm, Nasim Taleb, and others.\n\n&#x200B;\n\nI also encourage you to share whom did you chose as your Role Model in the comments.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mtczmb/how_to_improve_your_thinking_forever_with_a/", "title": "How to improve your thinking forever with a simple Stoic exercise from one Roman Emperor", "social_network": "reddit", "user": "Sviat-Hni", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 38, "down_vote": 0, "creation": 1618753137, "permalink": "/r/DecidingToBeBetter/comments/mtczmb/how_to_improve_your_thinking_forever_with_a/", "nsfw": false, "first_save": 1635436618.9556954, "replies_charged": false}