{"id": "t5_2tand_t3_irqyth", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hi all, I have been thinking a lot recently. Recently broke up with my girlfriend (y24) that told me (y22) we are not compatible with each other after dating for two months. I was too heartbroken to move on and the thought of losing her drives me nuts that I am sleep deprived for a week. Linda (not actually her name) and I are both international students in Australia looking to build a career here. She told me we rushed into a relationship, hence overlooking many values that are vital for starting a grounded relationship. But I feel like right now I am too emotionally attached to her to move on. \n\n I am currently stuck in lockdown in a cramped shared house and the feeling isolation left me feeling detached from the outside world. Throughout this time, I feel very vulnerable and depressed about being stuck here. Initially, my plan is to look for a job here for a short time before heading back to help out the family business. Acknowledging the chances of getting a job here after the pandemic is slim is making reconsider my time here and makes me question if it is even worth continuing to stay here. I have been stuck with my own thoughts for a week now and can't move on. I am trying hard to decide what outcome I want and don't know if going back to shelter myself again is the best for my personal growth. \n\nTLDR: I can't get over my ex-girlfriend who I dated for two months and can't move on with making a sound decision for myself. \n\nThanks for whoever made it to the end of this thread about how miserable of a privileged kid i am", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/irqyth/looking_for_selfimprovement_but_too_scared_to/", "title": "Looking for self-improvement but too scared to move on", "social_network": "reddit", "user": "banana_ET", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1599968008, "permalink": "/r/DecidingToBeBetter/comments/irqyth/looking_for_selfimprovement_but_too_scared_to/", "nsfw": false, "first_save": 1635437853.7416153, "replies_charged": false}