{"id": "t5_2tand_t3_npe7gs", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "Part of deciding to be better was putting away all my art supplies. I work in multiple mediums, depending on my mood. (Complete amateur, BTW) I got to a point that art was ALL I was doing. After I got off of drugs, (clean and sober 7 years now) someone gave me a jewelry making kit. That progressed to all these other creative outlets but they became my obsession, my new addiction. \n\nI didn't want to go anywhere, I didn't want to see anyone, between that & depression it was often 5 days or more between showers. I didn't even have a job. God put it in my head that 'it's time to put away childish things'. So I did.\n\nI'm happy to say that since January (with the help of the Lord and my therapist) I've learned to build new habits and get rid of old ones. I even have a job!! Plans to move with my teen age son to the state where my oldest child lives with her son, my grandson, are actually a reality now.\n\nI'm boxing up all the stuff we don't need day to day & putting it all in storage. Part of that is my art supplies. I had no idea just how much I have! Anyway, I was ok (not great, but ok) boxing up the beads, the paints, the inks & stamps, the embossing folders, and the dies. But right now I'm boxing up the mixed media goodies I've collected and the ephemera and the adhesives. I'm sad. I miss it all so much! I'm also so proud and so grateful to God that I am able to do the hard stuff.\n\nI can't get rid of it because I am going to retire someday. However, I feel powerful because I can put it in storage and leave it there. It may call to me, I may have ideas in my head of stuff to make, but it doesn't control me anymore! Praise God\n\nTLDR: I've finally broken my addiction/obsession with artsy stuff and am putting all of the supplies in boxes and taking it to my storage unit. I'm both sad and proud!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/npe7gs/sad_yet_proud_of_myself/", "title": "Sad Yet Proud Of Myself!", "social_network": "reddit", "user": "Tackortape_it", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1622497540, "permalink": "/r/DecidingToBeBetter/comments/npe7gs/sad_yet_proud_of_myself/", "nsfw": false, "first_save": 1635437943.0475502, "replies_charged": false}