{"id": "t5_2tand_t3_5m7um9", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "Tomorrow will be your best day ever, but it starts today.\n\nHello, all. Disclaimer: This will likely be a very long, rambled post. But the objective is that the passion oozing from my words will seep into your life. Yesterday I had an epiphany, I have had many like it, but this was THE one. The last straw. I want to be great, and I will. We’ve all probably had this before, a certain burst of motivation to workout, eat better, make more money. Then before we can even act on it, it’s gone. Then we return to our life of mediocracy. So often. We blame our loss of motivation for all of our downfalls. Let me tell you something, only a weak minded fool believes that anyone but themselves is to blame. I am not excluded. \nI may or may not be similar to most of you, but the point of this post is to inspire the fact that no matter the origin, we can all reach the same destination. I am generally happy with my life, I’m mostly always in good spirits, I think I have a mindset to succeed, and I believe I am in a good position as a 20 year old. But I want more. Need more. Don’t we all? Or at least we say it. HOW MANY TIMES ARE WE GOING TO LET OURSELVES DOWN? Ask yourself: Why am I okay with saying one thing with such passion and then lying right to my own face? Don’t I deserve better, from myself? The good news is you can treat yourself as well as you’d like. Self-awareness.\n\nRealize that you owe yourself happiness. Happiness is different for us ALL. If you are TRULY happy with your 2013 Honda Civic (sweet car) and Mon-Fri IT job, and you have it, then you have your happiness. Having a jet and a 7 figure salary is not everyone’s vision of success, THAT’S JUST WHAT EVERYONE TELLS YOU SUCCESS IS! Self-awareness is the 1st step of success. Distancing yourself and being HONEST in identifying what success is for you. Otherwise you are on an aimless road. The worst thing you can do is telling yourself you are happy with yourself to adjust for the fact that you are so terrified of “failing” trying to achieve what you really want.\n\nI say this all the time. I am my HAPPIEST in life when I KNOW I am participating in a lifestyle that is built upon the creation of my success, whatever it may be. It takes WORK to get into that GROOVE, but once you’re in it, it’s almost harder to steer clear of your dreams than it is to fall face first into pure bliss that is your life. **You need to realize two universal truths here today. 1.) You have the ability to change the course of your life today. I know because I am a living example. For those who immediately thought, “I can’t because I’m too young, old, etc.” This post is not for you. You are the “others” who make excuses to accommodate for the lack of mental strength. 2.) Everything in this post is 100% true, if you work unwaveringly at something, the universe will help you achieve it.**  Obsessive desire is the #1 trait to stupendous success, and it can be built. \n\nYour homework.\n\nRather it be in a PM or comment, tell me a little about yourself and what your vision of success is. We will work together in creating a plan. Secondly, write down a list of things you plan on doing TODAY to make tomorrow the BEST DAY EVER. \n\nI love you all, and I know you can do it. \n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5m7um9/tomorrow_will_be_your_best_day_ever_but_it_starts/", "title": "Tomorrow will be your best day ever, but it starts today.", "social_network": "reddit", "user": "Choosehappinessguy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1483638730, "permalink": "/r/DecidingToBeBetter/comments/5m7um9/tomorrow_will_be_your_best_day_ever_but_it_starts/", "nsfw": false, "first_save": 1635435663.1497867, "replies_charged": false}