{"id": "t5_2tand_t3_efb8wp", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "Guys, first and foremost please let me say how very grateful and appreciative I am for all the love my original post received a few days ago. I wrote the post in the car on the way to the facility and didn't have time to read any responses before I had to give up my phone. I was shocked to find the dozens of comments and PMs I received while getting treatment. I read each and every post after celebrating Christmas Eve with my family but unfortunately have yet to make any responses due to it being the holidays. To anyone who took the time to reach out to my post, expect a PM from me soon. \n\n\nI am also so, so very grateful to my wonderful girlfriend who cared enough to not only hold my hand on the path to recovery but to hold me up when I was at my very lowest. She is the most selfless, nurturing human being I know and I love her with every ounce of my soul. I absolutely would be gone without her. \n\n\nI made it through the 100 hours of treatment  recommended by my psychiatrist and am happy to finally be home spending the holiday with my girl, my son, and my kitties. Taking the first big steps to recovery were painful and frightening. The first 24 hours while on unit restriction, all I could think about was home, giving up, calling it quits and saying whatever I needed to get home and resume business as usual as soon as possible. Then the next day came and things got a little better. The staff were friendly overall, I made a few friends and heard some incredible and some very sad, painful stories. I realized I am absolutely not alone and exactly where I need to be. \n\nI put in the work. I got up early, made up my bed, did some stretches and ate a good breakfast, participated in group, recreational, and individual therapies. I was honest with the medical professionals who were making an honest attempt to get me on the path to getting better. I'm fortunate to say I had a very caring and attentive team of Psychiatrists, Therapists, Nurses, and Nursing Techs who at least appeared to give a shit about me. I exchanged stories with people who have been through things I couldn't imagine happening to a human being. And they cared enough to listen to me, to give a shit about me. They helped me feel like I wasn't alone when they were never expected to and I am grateful for each and every one of them. \n\nTaking the first steps to recovery were grueling and painful. Sometimes downright dreadful. I had to acknowledge the hurt and trauma I've endured and even inflicted on others in the past. I had to learn to grieve properly. I had to learn to cope properly. I had to learn to forgive properly. I had to learn to take myself to positive places in my mind and in the real world; not to run from my problems but to remind myself that life is worth living. That it is a beautiful thing that you don't have to take so fucking seriously ALL the time. I can't dwell on the past, it's gone forever. I have to acknowledge it because it happened but I can no longer let it constantly flood my mind with hurt and guilt and shame. I can't dwell on the future because it isn't here yet. I can't decide what the future will hold just because I assume the worst possible outcome will happen. I can't be afraid of failure. I have to embrace it and use those experiences to my advantage. I have to give myself a fucking chance. I owe myself that at the very least. \n\nNow begins the long road of ongoing, individual therapy and a new medication regimen that I hope will help make the load a little lighter and make the road to recovery a little less intimidating. \n\nTo all others who might read this who are struggling with any form of mental illness, please know that you are not alone and there is hope. You can get better. You can live a life worth living because you are deserving of life. It is not easy. It is hard. It is painful. It is deciding to do the things that make you uncomfortable. It is getting up out of bed, putting one foot in front of the other and considering every single step a step of fucking victory. I was very nervous about the cost of attending this facility since I was going to end up paying out of pocket due to lack of insurance but the badasses at the facility applied for insurance for me, and it turned out I qualified fo help! All I had to do was show up. \n\nThis post has gotten much longer than I intended so I'm gonna wrap it up. Brothers and sisters of Reddit, have a wonderful Holiday season, cherish your loved ones and cherish yourself. I love each and every one of you. Cheers to the new decade and to taking it all one day at a time. I wish all of you a long, prosperous, happy life. You deserve it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/efb8wp/update_im_checking_myself_into_a_mental_health/", "title": "UPDATE: I'm checking myself into a mental health clinic for my depression today.", "social_network": "reddit", "user": "Grayed_Out", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 124, "down_vote": 0, "creation": 1577243908, "permalink": "/r/DecidingToBeBetter/comments/efb8wp/update_im_checking_myself_into_a_mental_health/", "nsfw": false, "first_save": 1635436645.816201, "replies_charged": false}