{"id": "t5_2tand_t3_p1y1q8", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "e234981c-b061-4d83-8134-70d441847f74", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Hello, Reddit. I hope you are all having a good day and staying safe in these trying times.\n\nI guess I come to you because I’m at a point in my life where I don’t have the faintest clue as to what I should do. Not that I ever did, mind you.\n\nI’m a 26-year-old failed academic. I graduated top of my class with a degree in Modern Languages, did a summer research internship in Canada and then came back to my country to pursue a Master’s Degree in Translation in one of the “top” grad schools here (yes, this is one of those gifted kid who fell prey to anxiety and depression stories). I finished my courses in summer of 2020, then spent the rest of the pandemic year working on my thesis. This July, I finally got my degree…\n\n…and it meant absolutely nothing for me.\n\nI spent 2 years in grad school. By the end of my first semester, I was kind of enjoying my courses and I was still hyped I had been accepted into a “prestigious institution”. It all went downhill when I started my 2nd semester. I just felt like it was all a waste of time. Unlike science, where things are theoretical but grounded on observable evidence (gross oversimplification, I know), research in the humanities feels like one big circle jerk. You sit down and talk about things that are obvious as if they weren’t obvious at all, about how important it is to research and write articles on stuff that no one will ever read and that amount to nothing. I was miserable, but I still passed my courses… and I had signed a contract with a Public Institution to get a scholarship, which I would have to pay back if I quit my M.A. I also felt I *couldn’t* quit. I had worked so hard to get there. Things would surely get better.\n\nThey didn’t, really. But I carried on and graduated. I don’t mean no disrespect to any of you who may find pleasure in academia, especially in the humanities, it’s just not for me. I guess I could stick to that path if I had no other choice, but I’m almost certain I would be miserable.\n\nSilver-lining: I don’t have any debt. In fact, I came out of grad school a little “richer” than I came in, since the scholarship was kind of generous. I suppose I also did a little (academic) networking, and I had a degree from a fancy school that would no doubt give me a bit of an edge if I wanted to get into a PhD… but I don’t want to follow that path anymore. I didn’t enjoy research at all, and what is more, I don’t want to willingly walk into the fiery pit of academia, and spent like a decade being a post-doc-PA before I can even aspire to a nicer position in God knows what college. I did not want that.\n\nAnd therein lies the problem. I don’t know what I want. And I feel that every day that goes by without me finding a solution to the problem, things will only get worse. As you can no doubt imagine, that led to anxiety and depression.\n\nI have tried to take care of the mental health problems. I went to therapy, and then to a psychiatrist. I took some sertraline for over a year and felt somewhat better (there came a point during the writing of my thesis where I couldn’t be bothered to care anymore. I was crying constantly and just wanted to die. The pills took all that away, but the root problem remains). I also started to take my physical health more seriously. Started watching my calorie intake, watching what I eat, exercising regularly. Hell, just this month I overcame my fear of water and signed up for some swimming lessons. I am the absolute worst at the pool, but today I could “swim” (with the help of one of those noodle thingies). Last month, I wouldn’t have been able to get my head under the water without panicking, I call that exponential progress (just let me have that). I’m challenging myself, trying to better myself… but I still am anxious because I don’t know what to do.\n\n“A job is only something you do to get food on the table and a roof over your head”, I know, I know. It doesn’t have to be the best thing in the world… but I can’t help but feel that I have wasted so much time. That, as a failed academic, my credentials will only be good enough for some mediocre desk job with a bad salary, and the occasional translation job. I originally got into languages and translation because I was enamoured with the idea of being a freelancer, of working in the book business. I’m not saying those goals are unobtainable, I’m pretty sure they are (I do bear in mind that the English-Spanish; French-Spanish market is quite saturated, so it wouldn’t be the easiest thing in the world, probably not the best-paid either), but… I do have second thoughts. “Is that something you really, *really* want to invest your time and energy into?” I ask myself. “Will the reward be worth it? Will it give you the stability you want?”. I honestly don’t know… and since I don’t know, since I don’t know what to do, I just freeze. Like some mind numbness overcomes me.\n\nMy inner monologue is a bit of a cheeky fucker, too. Sometimes I feel like my mind is divided. I know that I will not achieve much just by letting that brain fog take over me. I am aware of that… but it still happens. It’s like one half of my brain is yelling at the other “move your ass, asshole”, and the other half is just… unable to. I don’t know if there is something else wrong with the wiring of my brain, or if it’s just the weight of my past failure crushing on my shoulders. Sometimes, nihilism takes over me. I take a look at the news, I see the bloody world is on fire and people being awful at one another and I think “why bother?”.\n\n\\[Not that the bloody world hasn’t always been on fire. Not that people have always been awful. World history is the biggest anthology of people-being-awful-to-one-another stories\\].\n\nI have tried some of those exercises for mental clarity, with limited success. What stuff do I like? I like writing. I like creative stuff in general. I like baking. I like hiking. There’s the ubiquitous “become a copywriter” thing, I have applied to some of those positions, but I guess the world has no shortage of failed writers who turn to copywriting. I wouldn’t mind working in a bakery if it weren’t for the bad wages, and I toyed with the idea of having my own bakery, but then I checked r / baking and realized that having a business is a whole different beast, and probably not the best next step for me. I wold also like to learn new things, of course… but it kinda feels like it’s too late (I tried to learn how to code. While I didn’t hate it, I found it boring. I know, I know, a job doesn’t have to be fun, it just has to provide sustenance… but I always remember the words of Louis Rossman in one of his videos. He was talking ‘bout repairs, of course, but I think the point still applies: in tech, you’re competing with people who live, breathe and eat tech. People whose hobby is coding, who find it fun and, therefore, don’t mind spending their free time learning even more of it and getting better at it. I don’t think I am one of those people). \n\nI don’t strive for a life of luxury, just for a good life. Enough money to take care of myself, to pay for the stuffies I like (books, videogames, the occasional travel if possible). I do want to get better, find a boyfriend,… stability, really. Easier said than done, I know…\n\nI just feel the world is a tangled mess, and that I am ill-prepared to navigate it and find my place. If any of you have ever felt like that at some point of your lives, I would truly appreciate your advice.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p1y1q8/failed_academic_kindly_asks_for_advice_please/", "title": "Failed academic kindly asks for advice, please", "social_network": "reddit", "user": "Admirable-Corgi-3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1628628751, "permalink": "/r/DecidingToBeBetter/comments/p1y1q8/failed_academic_kindly_asks_for_advice_please/", "nsfw": false, "first_save": 1635436830.7589235, "replies_charged": false}