{"id": "t5_2tand_t3_kx8ht6", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "**22F here, and this one is gonna be a little long.**\n\nSo it all started back in 2017, I was an undergrad living away from home for college. It was a whole new experience for me and it was the first time on my own. I spend a lot of time online and that's when I met Sam (let's call him that). He was 5 years older than me and was a grad student overseas. We clicked as we shared a lot of similar interests in music, movies, aesthetics, our love for reading and we were both science nerds. He shifted to a new country newly so he would show me places around through pictures or facetime and I would do the same. I didn't know much about his personal life apart from his interests, but I thought we had all the time in the world.\n\nA few months later we both kinda confessed feelings for each other and started a relationship. It felt very real, at least he made it seem like he was in this only to be together. I too gave in and got serious as he was so exclusive. But then the tables turned. He got busy with his research work, and he completely turned his back towards me, and when I confronted him about it, he ghosted me and blocked me everywhere. I couldn't deal with it well, as I didn't have many friends over there, and it was really very hard to conceal how I was feeling inside every day. But I went NC and dealt with all the pain. I couldn't handle the fact that it got over even before we met.\n\nA couple months later, another guy at college approached me. Let's call him Alex. I was so heartbroken that I refused to go out with him but then another month later I decided to give it a shot. And he really understood me as he too went something similar. So we went on dates, trips, shopping together. We even studied together at the library. I forgot every pain and hurt I've ever felt and was the happiest.\n\nAnd then one day Sam texted me, he was all apologetic and regretted what he did. I was so content with my life that I immediately forgave him, and talked to him like we were friends. From the way he was talking it seemed like he wanted me back, so I told him I was seeing someone. And ever since then we were following each other on social media. He would check everything that I would post.\n\nSo my relationship with Alex went on for 2 years, with time it was losing all its charm and he was revealing his true colours. He was verbally abusive and toxic and wouldn't let me leave him, he manipulated me emotionally into staying with him and I stopped feeling things, I was numb and felt everything was fake.\n\nI didn't want to be with him anymore as we didn't even have same interests, we were just two lonely people who found solace in each other and the spark had diminished. I started to miss Sam, as he was always there on my social media, I never really understood why, so I texted him to talk about how his life was going on.\n\nAnd I'll cut right to the point here, I broke up with Alex, and I thought Sam was still into me and was the right one for me, and I regretted not going back to him when he came back. I gathered up courage to tell him I wanted to give us a shot. Annnd he ghosted me again.\n\nLater on I found out Sam wasn't who I thought he was, he has done the exact same thing to one of my classmates (YEAH! Can you imagine that?) and many other girls I know. I don't know what is it that he's going through, but I guess I will never look at him the same way I did. All that admiration, respect, and love is now replaced with disgust.\n\nSo that's the end of my story. I don't think I can trust someone like that with my vulnerabilities again but I have learnt to be on my own, thanks to quarantine. I'm never letting someone remotely treat me like that even if it means I will be alone forever.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kx8ht6/a_1000_contemplations_and_introspects_later_ive/", "title": "A 1000 contemplations and introspects later, I've decided to unburden myself from my exes' thoughts and memories and everything that comes alongwith.", "social_network": "reddit", "user": "champagne_supernovaa", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 37, "down_vote": 0, "creation": 1610640228, "permalink": "/r/DecidingToBeBetter/comments/kx8ht6/a_1000_contemplations_and_introspects_later_ive/", "nsfw": false, "first_save": 1635435819.3500738, "replies_charged": false}