{"id": "t5_2tand_t3_j7mwkh", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Honestly I didn't know where to turn as some of the people in my life that I enjoy being around are admittedly toxic, even if they love me. \n\nI'm 23, living in southern England. In 2018 I had a cancer diagnosis, and when my life went down to rock bottom mentally and physically. As time went on, slowly things started to improve. I was cleared later that year and sought to improve my mental health and physical activeness. Since then things improved a lot, though lockdown has done awful things to me, and honestly I feel unhealthy and mentally drained all the time. \n\nI try not to make excuses as to why I haven't improved my physical health, and honestly I'm a heavy guy but I'm fortunate enough to carry it well that I can get away with it, but this isn't good enough anymore. The only barrier left here is that my anxiety keeps me away from public forms of exercise, and I think that'd a step I can take some time, but I need to work up to it. \n\nMy mental, sexual and physical health aren't that great right now, and after a recent breakup and a pointless love triangle that honestly hurt me more than it helped, I'm turning to reddit for any of you extremely motivational people to perhaps offer advice. I have no start point, and I want to invest money into a new lifestyle, as a symbol of commitment, but I don't get my student loan for another 4 weeks (late because of student finance mistake). I have no money, no start point, no confidence, but I do have some motivation. It's not a lot, but it's there. \n\nHow do I start? Is there anything I'm overlooking? I want to improve my physical shape and my emotional wellbeing but honestly my self-image is drastically poor, and I've been admitting defeat to life since I knew what that meant, and it's because it was easier than to venture out and do it by myself. \n\nI'm nervous as fuck honestly, this is the most honest I've been with anyone in a long time and it's a public forum, so please be nice. \n\nAppreciate you, redditors. \n\n\\-Anon", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j7mwkh/23_and_want_drastic_change/", "title": "23, and want drastic change", "social_network": "reddit", "user": "Reasonedwood", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1602195739, "permalink": "/r/DecidingToBeBetter/comments/j7mwkh/23_and_want_drastic_change/", "nsfw": false, "first_save": 1635436635.134506, "replies_charged": false}