{"id": "t5_2tand_t3_pqre8d", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "Hi! So this is my first real post here on reddit, so sorry if I make any formatting mistakes and stuff life that. And sorry if this is the wrong sub for this.\n\nI literally don't know what the hell I am doing with my life rn. I still live with my parents and my 19 y/o sister who are absolutely fucking amazing and super supportive, but I honestly feel like a burden to them even though they think I'm crazy for thinking that. I do have a job that helps pay for university but I don't make enough to live on my own.\n\n I went to community college for 2 years and got a generic a.a. degree because I didn't know what I wanted to do. I transferred to uni and now I'm in my second year at a 4 year school. I decided to major in computer science because I wanted to get a job when I finish uni, and I liked it in my first year, but I'm slowly starting to hate it in my second year and I don't see myself finishing it through, which sucks because I know it's a degree worth my while. I really love learning other languages, geography, history, and , surprisingly, nutrition science, and I know my parents would be happy as long as I'm happy,  but I don't think I could get a good job in those fields, and I would  be wasting so much money trying to pursue them , and I'm already so old, idk if I can even change majors if I wanted to.\n\nI feel so lucky that I even have the opportunity to  go to  school, have wonderful close friends, have an amazing family, and to have lived a comfortable life so far. I'm so scared for my future, and I really don't know what to do. I've been so stressed out and feeling depressed, it's causing me to binge eat and I've put on so much weight because of it and I feel so bloated and shitty all the time, I just wanna go back to bed and watch youtube.\n\nSorry for the long ass post and anyrun on sentences. Any advice would be amazing.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pqre8d/21_and_dont_know_what_to_do_with_my_life/", "title": "21 and don't know what to do with my life", "social_network": "reddit", "user": "Fancy_Helicopter9493", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1631988524, "permalink": "/r/DecidingToBeBetter/comments/pqre8d/21_and_dont_know_what_to_do_with_my_life/", "nsfw": false, "first_save": 1635435999.59064, "replies_charged": false}