{"id": "t5_2tand_t3_9hqbrn", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "‘Believe in yourself’ ‘Have confidence in your abilities’ ‘you must believe that you can do it’. You always hear them, read them on social media, they always tell you the same thing over and over again. But, Did you ever wonder why ?\n\nWithout a doubt, confidence is one of the most popular topics when it comes to self-improvement and psychology. Everyone struggles with it, and everyone desperately wants to have it. If that’s the case, then why do so many people want to be confident ? You’re most likely also interested in becoming confident, but did you ever ask yourself why you wanted to ? What will you gain ? What’s the point of all this ? Well, looks like you and I need some answers. What are we waiting for ? Let’s get to it.\n\n**1. Personal fulfillment**\n\nBeing confident means that you know and believe that you can do whatever you put your mind to achieve. This gives you a great sense of power. You start feeling like you can do stuff, like you’re good enough, like you’re really good at what you do.\n\nWhen you believe in what you can achieve, you’re fulfilled and at ease with yourself, so you can have a more peaceful and pleasant life without always being uncertain and afraid.\n\nWhy it’s important :\n\nYou feel good about yourself and you’re a happier person.\n\n**2. Higher Abilities**\n\nDo you know why you always hear or read that confident people are more successful ? Do you know why they have higher performance ? The reason is extremely simple, yet no one seems to get it : confident people know that they actually can succeed, so they try, that’s it.\n\nThink about it, if you’re not confident, then you think you can’t do it anyways so why should you even try ? And even if you actually try to reach a certain goal, the fact that you’re always telling yourself ‘I can’t’ will make you sabotage your own success even if you manage to reach it, because you always want to prove to yourself that you can’t, and that you were right to not believe in yourself in the first place.\n\nHigh confidence will enable you to reach much harder goals, because when you believe that you can attain something, suddenly, the obstacles in your way seem like they’re part of the journey, and you already know that you can reach that goal of yours, you know you can get it, you know that you have what it takes, so what’s stopping you from trying ? Nothing.\n\nWhy it’s important :\n\nYou can unlock new abilities and reach goals that you thought were impossible.\n\n**3. Clearer direction in life**\nIn other words, you know what you’re doing with your life. When you’re really confident, your life seems much clearer and well defined, so there’s not much room for self-doubt and indecisiveness. This will make your life a lot more fun and enjoyable since you know what you want in life, instead of always wondering, thinking, and stressing about what to do, and what not to do.\n\nWhy it’s important :\n\nYou’re less stressed, more focused and more effiecient in your life.\n\n**4. Much better social skills**\n\nNot sure what this means ? Well, confident people com off as more charismatic, powerful, and even likeable. Think about the people that you admire in your life. When you think of them, what comes to your mind ? Is it someone who always doubts himself ? Or is is someone who’s sure of himself ? You might be thinking ‘ that’s all well and good but what’s the point ? ‘\n\nWell, having good social skills help you with dealing with conflicts, making frienships, getting stuff done with little effort since others are willing to co-operate, getting people to value your ideas and win them to your way of thinking….and the list goes on. The bottom line is : confident people are much better at dealing with people.\n\nWhy it’s important :\n\nYou have less conflicts, people value what you have to say, they respect you, they are more drawn to you. All of this can be applied in business, relationships, and leadership skills, so it’s pretty useful.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9hqbrn/heres_what_youll_get_from_being_more_confident/", "title": "Here's what you'll get from being more confident", "social_network": "reddit", "user": "rafikGk21", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1537539370, "permalink": "/r/DecidingToBeBetter/comments/9hqbrn/heres_what_youll_get_from_being_more_confident/", "nsfw": false, "first_save": 1635437713.3292658, "replies_charged": false}