{"id": "t5_2tand_t3_qg750s", "request": ["1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "I don’t know what’s wrong with me. I was doing so well for so long. \n\nI’m exhausted, burnt out and sad. I rely on CBD, coffee and wine to get me through the day. \n\nI know I’m a perfectionist. I know this is preventing me from being happy. But I also know that letting things go doesn’t make me happy either. \n\nI’m a mom of two, I am constantly overwhelmed by chores, laundry, lunches.\n\nI work full time, and my job can be stressful. \n\nI wake up at 5AM everyday, I’m doing an online course, so I study. Then I journal, run or work out, then I get ready for the day. Make up, hair, get dressed. \n\nI get home, do some laundry, cook dinner, give my youngest a bath, try to get him in bed on time. \n\nI rotate between each family member having a “day” to spend quality time together. My daughter, son, partner and myself each get a “day”. \n\nI’m always battling sleep deprivation, I recently started taking every other morning “off” and sleeping in, I also stopped waking up at 5 on the weekends to bank sleep. I don’t even really feel like this has helped, I just feel more guilty. \n\nThis sounds like a good life right? Good job, working towards a higher education to grow career opportunities, in the best shape of my life, no longer struggling to live paycheck to paycheck have a wonderful relationship. My life has been so much worse. \n\nI feel sad, empty, bleak, tired. I want to crawl into bed and never get out. Everyday when I wake up my first thought is “I can’t do it”.\n\nI know this sounds like depression, I have an anxiety disorder and possibly OCDP (suspected but diagnosis is tbd). \n\nI spend way too much money on CBD, but it’s the only thing that helps. \n\nI feel like a failure. My life is dominated by shame and fear.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qg750s/when_you_should_be_happy_but_your_not/", "title": "When you should be happy but your not", "social_network": "reddit", "user": "Gorl08", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1635257097, "permalink": "/r/DecidingToBeBetter/comments/qg750s/when_you_should_be_happy_but_your_not/", "nsfw": false, "first_save": 1635437056.323885, "replies_charged": false}