{"id": "t5_2tand_t3_cbzadg", "request": ["b1a66ef4-3e71-4d03-875c-961dbcef2285"], "text": "Chapter one:\n\nAnthony Robbins describes a trip to one of his public speaking events and how it affected him. Then he goes on to describe how to make lasting changes.\n\n**-raise standards**\n\n**-believe you deserve those standards**\n\n**-try to change your strategy to fit the situation**\n\nHe states that this will help us master our **Emotions,Relationships,health,time, and financials.**\n\nChapter two:\n\nHe starts of by reminiscing.Then he asks questions regarding the future.\n\n\\-*How am I going to live the next ten years of my life?*\n\n\\-*How am I going to live today in order to create the tomorrow i'm committed to?*\n\n\\-*what am I going to stand for from now on?*\n\nHe also talks about human decisions determine the course of how our lives turn out not the circumstances around our lifes. The main idea was the thought that if we make new and aware decision that we are dedicated to we can create real change in our lives.\n\nHe simplifies decision making to something called “The ultimate success formula”\n\n\\-**Decide what you want**\n\n**-take action**\n\n**-notice the flaws and the successes**\n\n**-change your approaches**\n\nThis basically makes decide if the decision will result in change.Also he tells us the three things that can help us\n\n\\-*What do you need to focus on?*\n\n*-What do things mean to you?*\n\n*-What do you need to do so you create the results you desire?*\n\nHe explains the five parts of internal decision\n\n**-your core beliefs**\n\n**-life values**\n\n**-references**\n\n**-consistent self question**\n\n**-your emotional state**\n\nThen he summarizes six key points\n\n\\-**we have to remember that decision are tools used to help make or create change**\n\n**-making a final decision is always hard but in the you will always have to make that decision sooner or later**\n\n**-The more decisions the better**\n\n**-decisions always have lessons to learn about**\n\n**-be flexible and committed**\n\nChapter 3\n\nHe develops the concept of pain and pleasure.He states that we do activities to either get pleasure or avoid it. He also states by thinking of pain before dealing with it will bring more pain overall.During this whole chapter his main objective is to make you change your perspective of pain and pleasure and that you can use that as a tool. The tool he is talking about is linking pain to bad habits and pleasure to beneficial acts or self improvement.\n\nChapter 4\n\nThe main focus of this chapter was about our belief system. He wanted to put emphasis on the point that events don't change us but how we see those events. He also reinforces the point that our decisions are based off beliefs and precognitions/bias. Allowing ourselves to allow bias to control more complex parts of our life we create negative beliefs.He simplifies how beliefs are strengthened by comparing beliefs to a table.The reasons why we believe things are called legs and the belief is the table. For instance if you believe you are smart. Then you have reasons why you believe so for instance you got A on a test. Then he talks about conviction and the difference between belief.He also goes to talk about how mastering many things is better than mastering one skill.Then he talks about how to dissect a limiting belief with questions.\n\n*-how is this belief absurd?*\n\n*-was the person i learned this belief from worth imitating?*\n\n*-what will this belief cost me emotionally?*\n\n*-what will this belief cost me relationship wise?*\n\n*-what will this belief cost me financially?*\n\n*-what will this belief cost me physically?*\n\nChapter 5\n\nIt seemed more like a autobiography this chapter that went into depth of is history of psychology. Then they went to talk about how the brain works and etc. The main take away from this was the three ways to look at long term change\n\n**-No one but you are responsible for your own change**\n\n**-you have to believe that you can change**\n\n**-you must that you change can change it**\n\nHow your brain looks for sources of pain\n\n**-Your brain looks for something unique**\n\n**-your brain looks for something happening at the same time**\n\n**-your brain looks for similar occurrence**\n\nChapter 6\n\nThe main focus of this chapter is how break bad habits. They are NAC masterstep and there is a total of 6\n\n**1-decide what you want and what's preventing from achieving it**\n\n**2-You have to want to and you have to use pain to change and use your pleasure to keep going**\n\nWe can use a lever to keep ourselves from relapsing back into bad habits. The greatest lever we can use is the sense of failing our own beliefs or standards.\n\n**3-we must change the patterns that stop us from being the best you can**\n\n*3a-you can do this by thinking of sad or frustation moment but instead of thinking of negatives think of this as a reason to change*\n\n*3b-Change the situation into a cartoon then see how you feel about it know*\n\n**4-Think of good habits that can be used to replace the bad habits**\n\n**5-condition the new pattern until it’s consistent**\n\n*5a- any pattern done in repetition will become a force of habit and anything that we fail to do in repetition will not have long lasting effects*\n\n**6-Test it**\n\nChapter 7\n\nThe main topic is about focus and the types there are. He starts off by explaining why focus is important and how it can change your perspective on things or motivate you.He talks about how focusing on certain topic can only offer you one of many perspectives. Then continues by telling us if we focus on what we want we can achieve it but most of the time we lose focus on what we want by expectations and fear of the negative. Focus can be control by asking yourself question because it brings out all the possibilities. Then the second part of this dissects submodalities. We can use submodalities to change the way we feel about a certain experience. For instance if we want to turn a experience more cheery we can imagine it's brighter. He also talks about how to create change just by doing simple things ,but most of the time people fall into bad habits for instance smoking, overeating, and etc. This can be bad because it's all subtle and we can’t notice that it's going to have a tragic end. So instead of indulging in bad changes we can try things like being more dedicated. If we can choose to do something with dedication and with the right emotions we can break the self limitations. Which can lead to more change.\n\nChapter 8\n\nThe main point of this chapter was to show us that questions can have big effects on how we think and make decisions. He explains this by showing us that thinking is a series of Q&A . The better your questions get the better results you get. Questioning what we believe we can do will help tear down the limiters you placed in your life.Then he explains why our brain is amazing. Then he leads us to find out how a question is good. A good question is a question that can help you think of the future or a question that can help you realize how can you better yourself. Asking the right questions during a crisis can lead to amazing opportunities. In most scenarios people fail because they focus on the thought of failing or trick themselves into thinking they can't do it instead of doing something productive like thing of ways to succeed. They don't ask the question that mattar. He also goes into depth about the negative effects of asking bad questions or questions that lead to presupposition. For instance whenever you fail you automatically ask why do always fail which can spiral to a bad experience so it's more beneficial to ask how can I succeed. He also listed questions you should ask yourselves when you encounter a problem.\n\n*-what is great about this problem?*\n\n*-what is not perfect yet?*\n\n*-what am i willing to do to make it the way i want it?*\n\n*-what am willing to stop to achieve my goals?*\n\n*-How can I make the process fun while achieving my goals?*\n\nChapter 9\n\nThis chapter main point is how we say things can affect our lives and situation. Words define the man that's why the greatest leaders had the great speaking skills. So if we decide to change the way we speak then we can change the way we are perceived.\n\nWords have the power to break people down or build them. The way we talk can change our emotional state. So it can be used as important way to maintain clarity.\n\nChapter 10  \nThe main point of this chapter is to talk about metaphors. Humans like to compare or liken things to each other. So he basically say metaphors come to humans like a second nature. Metaphors can be used to simplify things so they can be explained to people. Metaphor can also be used to intensify emotions or convey extreme message or feeling. One way he explained breaking a pattern is by doing the unexpected and doing this can break someone's thoughts on negative metaphors so they don't intensify. The basic thing about metaphor is easily summed when Anthony Robbins said “A whole set of rules, ideas, and preconceived notions accompany any metaphors you adopt.”(pg 232). The global metaphor you choose will define how you make decision in some some cases it makes life easier but in others it can cause stress.\n\n**-what is life?write down the metaphors you already chosen**\n\n**-pick another area of your life that impacts you most**\n\n**-create new more empowering metaphors**\n\n**Create new and more empowering metaphors**\n\nChapter 10\n\nThe main focus of this chapter is the ten emotions that have a major impact in our lives.Also explains the four ways we deal with emotions and how to attain mastery of our emotions.\n\n***1)Avoidance***\n\n*1a) Humans like to avoid things that cause problems and because of this we see things in the short term. We think of the pain and we avoid even though going through the pain might have pleasurable effect. Avoiding Pain blocks a opportunity of future pleasure.*\n\n***2)Denial***\n\n*2a) Sometimes we like to deny things that can cause problems later. If we deny that we failing in a certain aspect in life that won't just magically disappear. This cause your emotions to go even more rampant because there is no release your just building up negatives that one day just might burst.*\n\n***3)Competition***\n\n*3a) Competition is when you try to take pride in your failures by believing you have it the worst compared to others, but with this mentality you can’t ever have true success because you have this false sense of achievement through being at your worst.*\n\n***4)Evolving***\n\n*4a) This is the most effective way to deal with emotions because through this method we can improve and better ourselves. Through this we don’t have any pent up emotion nor are we not leaving important things unsolved or developing negative habits/sense of achievement. Through this we can learn how to control important emotions and ones that can be beneficial*\n\n***-Identify what you’re feeling***\n\n***-know that you have emotions and be thankful that you have a support system***\n\n***-try to find out what your emotions mean***\n\n***-get confidence***\n\n***-know that you have what it takes to handle whatever might come***\n\n***-get excited that you have to take action***\n\n***1)Discomfort***\n\n*1a)This is a minor problem it just a sense of annoyance over minor inconveniences over things that aren't going right to solve this just try a slightly different approach or get your desires in order*\n\n***2)Fear***\n\n*2a)Fear is emotion of anxiety over things that concern or cause fright. Most of the time Fear is caused by lack of preparations. The solution is simple just reevaluate the things that scare you or cause anxiety and mentally prepare yourself.*\n\n***3)Hurt***\n\n*3a) Hurt is the feeling of losing something. Hurt just means that we didn't get are wants or desires ,but the solution is simple we most reevaluate what we may or may have not lost and if you lost something try to express your emotions to the person involved.*\n\n***4)Anger***\n\n*4a) Anger is a strong feeling of hate,fury and rage. Anger is mostly caused when your beliefs or standards of life have been broken by someone. The best way to break out of anger is to think of is the anger worth the person it's directed to for instance a loved one or such and secondly you must see all the factors.*\n\n***5)Frustration***\n\n*5a) It's the feeling of not getting what you deserve or being blocked from achieving. This is a simple case of underestimating yourself. All you have to do is realize that you're close but you might need to try something different. Just realize that frustration is positive*\n\n***6)Disappointment***\n\n*6a) Disappointment is one of the more destructive emotions. Disappointment is the feeling of being let down or not achieving what you want. This just means that it's time to get a brand new goal. Learn from your past mistakes and use it for something positive.*\n\n***7)Guilt***\n\n*7a)The emotion of guilt is a feeling of regret over something that violates your basic beliefs or standard of living. Guilt is not an emotion that you can deny or repress because it comes back stronger, but don't wallow in guilt because all that does is make it worse. All guilt means is to recommit to your human standards or beliefs and strive to be better.*\n\n***8)Inadequacy***\n\n*8a)The feeling of not having worth. It just means to improve. It's just telling you to change your thinking from am I worthless to how can I get better ,but you won't get better if you don't have confidence you won't get better.*\n\n***9)Overencumbered***\n\n*9a)overencumbered is the feeling of being burdened by too much negative emotions. It's just a sign that you need to slow down decide what you need to do. First decide what’s the most important than go confront your problems then one by one drop the emotions attached to the problems. We solve this problem by just by taking this thing step by step*\n\n***10)Loneliness***\n\n*10a) It’s just the feeling of being alone or separated. It just usually means that you need to form a relationship with someone. You need to know that you need a social connection then realize what kind of relationship you need and realize that you have people that you miss and love.*\n\nFor every negative emotion there is an opposite positive emotion\n\n***1)Love***\n\n*1a)Love can be known as a deep caring for someone. It can be used to wipe away most negative emotions.*\n\n***2)Gratitude***\n\n*2a)Gratitude is a great appreciation of something and give you a great sense of joy.*\n\n***3)Curiosity***\n\n*3a)Curiosity is a sense of wonder and fascination it can be used as a way achieve fun or cure boredom*\n\n***4)Excitement***\n\n*4a)Excitement is known as booster of some sort it can be used to speed things but it brings you a sense euphoria*\n\n***5)Determination***\n\n*5a) It just a heighten sense of commitment it feeling of wanting to get the things you want done finished*\n\n***6)Flexibility***\n\n*6a) It's the ability to change and be relaxed when you need to*\n\n***7)Confidence***\n\n*7a) It’s a feeling of certainty or unwaverable faith in yourself and beliefs*\n\n***8)Cheerfulness***\n\n*8a)just the feeling of being happy and have high morale*\n\n***9)Vitality***\n\n*9a)The good condition of your body or physical condition so you can fully express your emotion*\n\n***10)Contribution***\n\n*10a)It’s the feeling of knowing that you have help people. It’s not about self accomplishment it about the bonds you make and nature.*\n\nChapter 12\n\nThis whole chapter is about how you want to live your future. This chapter you discuss how to successfully plan out your future. The bigger the goals the more motivated you will get. Then we have to evaluate how good your life is in multiple aspects in the past present and future. Then based off of that then decide on goals you want to make for instance\n\n**-Personal Development goals**\n\n**-career/business/economic goals**\n\n**-toys/adventure goals and**\n\n**-Contribution goals**\n\nYou must person try to achieve and find some joy in your goals and such. The main reason you must do a goal is to not find a end but a beginning to living your life. Always try to have something positive while on the journey to your goal. If you want to finish your goals you got to do them now instead of putting them off and try to push yourself to make promises to people who see you of higher standards. You must always see a future worth grasping because without it your just a hollow shell.\n\nChapter 13\n\nThe main point of this chapter is to promote consistency. Its human nature to resist change but if you really want to experience something new. Then you are going to have to break your pattern of habits. If you want your new habits to stay you have to do it consistently. The best way to break habits is to introduce something new and unexpected. He used the example if you eat too much candy then do eat only candy then you'll get sick of it for a while.\n\nThe rules of true change are as such:\n\n**Rule 1: for the next day refused to dwell on unresourceful thoughts or feelings**\n\n**Rule 2: If you are ever thinking of something negative you must instantly redirect yourself to some positive or enlightening.**\n\n**Rule 3: You must focus on the solution to life.**\n\n**Rule 4: Do not punish yourself if you fail but look to the future for success**\n\nChapter 14\n\nIf you want to master your life you must learn the master system. The master system talks about evaluations. Those who make good evalution achieve better results. If you want wealth do not chase the money if you make good evaluations the money will come to you. The second part of the master system is questions if you ask more question that are linked to self improvement you have overall a better life. For instance do not ask why can’t I afford that instead ask how can I afford that. The third thing that affects your master system is your values depending on how you rank your values then that how your life is moved or lived. If you value things that will move you forward like compassion and love and such then you will have it better of than someone who values negative emotions. The fifth part of you master system is your experiences. The things that you experience can motivate you and give you a heightened sense of motivation because it gives a new perspective.\n\nChapter 15\n\nThe main point of this chapter is values. Our values are what make and break us. The way we place them can cause great success or tragedy. Once we realize truly what we want in life then we must reevaluate our values according to how you want to live you life. If you truly want to succeed then you must commit to your values because your values are what defines your character. If you want evaluate your values or see which ones are more important than others then you have no compass to navigate through life. Your values what help you make decisions and if you make decisions that correspond with your values then it's pointless it will only lead to pain. You must realize the hierarchy of you values if you don't then problems may occur in any aspect in your life. If you are healthy,happy, and passionate then is it worth ruining that for accomplishment and all the pros and cons that come with. You must decide on your values if not problems like this can occur.\n\nSub-Chapter 15a\n\nThis is just a minor theme of pain and how it can sabotage you. If you let the concept of pain motivate then you’ll just live in fear. It will cause you to not do the right things. If you let fear stop you from doing things then that’s living backwards because all you're doing is sabotaging yourself. If you let your values move you instead of the thought of being in pain that that will give you more pleasure because knowing that you did right by your values is gratifying.\n\nChapter 16\n\nThe main point of this chapter is to stop you from letting rules block your potential or happiness. If we live in a way that only derives pleasure from something that we cannot control then only pain will follow. If you want to feel good there is nothing stopping you from being happy. If you feel as if you're succeeding or not is all up to your rules. He also talks about how to change your rules so you can be happy and successful. First you have to determine which of your rules are disempowering. Then you must see if it's something that you can control or not. To determine if a rule is disempowering you see if there are a lot more negatives than positives.\n\nChapter 17\n\nThe chapters main point is to tell about how increasing your knowledge is beneficial. If you read it's basically like getting experiences. The more experiences you get the more perspective you get. Reading books helps you realize many thinks for instance learning new things or fixing misconceptions. By expanding your reference and how you live your life then you can experience true and deep change.\n\nChapter 18\n\nThe main point of this chapter is identity. He went into depth about how identity can be transformed by telling the story of a trapped prisoner and how they changed him from a patriot to communist. The way he said it was they started small then built from there.They build a message or belief a seed of doubt and they did it consistently. After that they built and built to the point where he truly believed them. He couldn't justify his action because he truly shifted his identity.. Then he goes into depth of what identity is and identity is defined as the way we see ourselves and decisions we made with a bit of anything you believe. To truly decide your identity you have to ask yourself who are you. Decide what you are then see how others would see your identity. Last see how you feel about your identity. If you want to reinvent yourself then you have to relate all the negative traits to major pain. After that you have to look at the traits you want to gain and then pursue that goal actively.\n\nChapter 19\n\nIt's just telling you to write down all of your emotions.Then notice your triggers. Then look at the things that can solve this emotions\n\nChapter 20\n\nWe have to know that health and fitness are to different things. If we focus on fitness then we will greatly suffer in our health. He explains that best way to increase both our health and fitness is to train your metabolism. The biggest difference between Health and Fitness is that Fitness focus on anaerobic ,while Health focus on aerobic exercises. Basically he saying that most people start off exercising in an anaerobic state which cause more damage to your body than good because it cause you to lose blood sugar which your body need to function. While aerobic exercise help you build up your body so you can have a stronger body.Then he goes into depth what the ideal amount of aerobic exercise is before it becomes anaerobic. Your heart rate should be 180-(age). You must always walk out or cool down for 10-15 minutes to get the lactic acid out of your body.\n\nChapter 21\n\nThe main point of this chapter is to highlight how a relationship should be. Then he warns you of the consequences of not knowing who you are in a relationship with and bonds you have.Secondly you should not see relationship as place to get something ,but as place to give to.\n\nWarning signs in a relationship\n\n**-Resistance**\n\n*Whenever your partner does something that you don't approve of or make you uncomfortable*\n\n**-Resentment**\n\n*When you develop anger towards your partner and build emotional walls*\n\n**-Rejection**\n\n*Whenever you avoid your partner or look for excuse to make your partner wrong*\n\n**-Repression**\n\n*When you lose the passion in your relationship to the point where you feel pain just being in the relationship*\n\nHe also warns people to spend days together to deepen intimacy and never use your relationship as a threat because that creates the possibilities.\n\nChapter 22\n\nIf you want to make wealth the key is to become more valuable to your place of business. Secondly try to make a bigger scale change to point where its cause positive changes for other employees or etc. Then you have to save and invest. Then learn to make good decision and evaluations when it comes to wealth. Then keep plans so you can maintain your wealth. Then lastly link creat pleasure to your business and such or wealth.\n\nChapter 23\n\nMake yourself a set rules or guides which you choose to live by. For instance a creed or such. It can be used as a measuring tool to see how much we achieve and if we achieve it without feeling negative emotions or breaking any of our values. It something you can commit to and as a result it will give you a boost dedication.\n\nChapter 24\n\nThe main point of this chapter is to use time to benefit you. He focus on three main things\n\n**1)Time Distortion**\n\n*The ability to change how time feels minutes may feel like hours and hours may feel like minutes the key to this skill is to measure time how time is experienced is by how you focus or look at it.*\n\n**2)Importance**\n\n*You must realize what is the best use of your time something that has a long term effect. So instead spending your time doing something urgent try to make time so you can do something important.*\n\n**3)Save years**\n\n*We can save years by modeling someone who has already succeeded and learn from their mistakes so we can save years by not repeating the same mistake*\n\nChapter 25\n\nThe main point of this chapter is to something fun\n\nChapter 26\n\nThe main point of this chapter is to address world problems like homelessness, world hunger, or poverty. He talks about how we can solve these problem if we put our heads together. He also talks about why it's so important to contribute to others. It just way of gratitude. It better for you then them it just gives you experiences and perspective.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cbzadg/tony_robbins_awaken_the_giant_summary_self/", "title": "Tony Robbins \"Awaken The Giant\" Summary (Self improvement Book)", "social_network": "reddit", "user": "terrorist_kid", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1562869748, "permalink": "/r/DecidingToBeBetter/comments/cbzadg/tony_robbins_awaken_the_giant_summary_self/", "nsfw": false, "first_save": 1635436383.5239513, "replies_charged": false}