{"id": "t5_2tand_t3_q5ftb1", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "My longest relationship has been barely 2 years and that was more than a decade ago. I am 30 so I am looking for different things than the average young 20 year old. I been looking inwardly lately and kind of reflecting on why I am still single yet other friends are in relationships. I think there is alot of things that contribute to my singledom.\n\nI have had numerous one night stands, 15 to be exact, but not alot of relationships. I say this not to boast but to show that I am not like a dweeb guy who can't get women. I would say 2 real relationships and the other 2 were more of consistent flings. I am a guy and I think guys have it harder in dating than women, but thats for another story. I can complain about the injustices that minority men have to deal with in dating, but that won't get me anywhere. I am kind of writing this for therapy for myself and maybe other people can relate. Heres are some list of things of my personality and why I am this way. I am thinking maybe I need to change my ways or I will be single forever.\n\nI don't put women on a pedestal\n\n\\- I never have. Always treated women like any other sort of person, but I notice that the guys who are willing to do whatever for a girl are usually the ones in long term and what looks like happy relationships from outward looking in. Just recently I heard one person I know moved across the country for a girl he barely know cause she moved for work. I don't think I would ever do that. I couldn't even move 1 hour away for a girl that I was kind of seeing.\n\nHalf assed. Always one foot in one foot out. Waiting for something better.\n\n\\- Maybe I have too high standards. I am not looking for superficial things. Most of the few women I have dated are usually well rounded. One girl that I blew my chance on has what I was looking for. Humble, intelligent (grad student), not superficial (shops at thrift stores), kind personality, attractive, easy going, high emotional intelligence. I believe I am a pretty well rounded guy so would like something similar. I have been told I am attractive, intelligent, educated, I have a good paying job over 6 figures, I work out consistently, take care of myself and hygiene, have a kind personality. These are some of the things one women told me so not just my own perception. I kind of want a women on my level so to speak but in the real world the selection of women is not the same as it once was in college.\n\nI don't like being taken advantage of.\n\n\\- I think this is a big one for me. I don't like putting in more than what I am receiving. Whether it be paying, texting if I am initiating more than you, or whatever it maybe. One of my friend does everything for his girl. She lives at his place rent free, uses his car, he pays for everything. That would never fly with me, but hes in a long term relationship and I am not. I think I am afraid of getting burned. I have seen so many stories of men who get taken to the ringer. Get used up for all they are worth and tossed aside. I am afraid to be another victim. I work hard for what I have which isn't much to begin with. I live humbly, work alot, and invest alot of my money. For someone to just take what I feel I have worked hard for doesn't sit well with me at all.\n\nGirls that I am able to attract\n\n\\- I think the quality of girls that I am able to attract isn't very good so I just rather be single and the few that I am able to well there is tons of competition. My main source of meeting people atm is dating apps. I tend to match up with women that are not very attractive looking which coincides with them being really over weight, not good careers, not educated, have kids, way older. People can say oh you are being superficial, maybe I am but why should I be the one to compromise? From outward looking in its like they are getting something much more than what they are.\n\nBeing successful in dating is a hard thing to figure out. I am getting older now and I don't have the youthful optimism of having endless time. I would like to get married in my 30s and have kids. I still have couple years where its socially acceptable to still be single, but towards late 30s most people are married or at least in long term relationships.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5ftb1/noticed_that_alot_of_my_romantic_relationships/", "title": "Noticed that alot of my romantic relationships have been short. I think I have some issues to work out.", "social_network": "reddit", "user": "samantha145151", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1633896966, "permalink": "/r/DecidingToBeBetter/comments/q5ftb1/noticed_that_alot_of_my_romantic_relationships/", "nsfw": false, "first_save": 1635435129.6028633, "replies_charged": false}