{"id": "t5_2tand_t3_kv7817", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I did it. I finally talked to a medical practitioner about my anxiety. \n\nSome background. I have had anxiety symptoms for a while and finally admitted to myself that what was going on wasn't normal. 2020 definitely put that into focus. I have always had a hard time with emotional regulation but recently I recognized how anxious I was and how much my negative emotions were affecting me. \n\nThen the pandemic hit. I had planned on trying to schedule a therapist but I seemed to come up with every excuse not to do it. I also have a history of having exaggerated moodswings while on birth control and my new prescription (that happened in jan 2020) reacted worse than ever. We decided to switch to condoms since my OBGYN was located in a hospital and then I found out I was pregnant. \n\nWhile a surprise we were more than happy to be pregnant again and my anxiety seemed to go away. \n\nThat was until it came back again. Fortunately I haven't had any panic attacks but I have had meltdowns and felt overwhelmed (not by the pregnancy but everything else). Today I got up the nerve to talk to my doctor about my anxiety. \n\nMy husband was supposed to be with me but had to cancel last minute. But even so I managed to talk about my anxiety. I did say how I wasn't sure how much of my anxiety was because of regular stress, hormone changes, or just it being a ridiculously stressful year. \n\nShe was very understanding and set me up with an appointment to see their counselor. She will help me discuss where to go from here. My doctor also recommended pregnancy safe Anti-anxiety medication which I didn't think was possible. After discussing it with her I decided to try it and I'm going to pick up my prescription shortly after writing this post. \n\nThanks for reading. I know this might not seem like much but it's a huge step for me. I have only a handful of people who I've admitted to about my anxiety so I'm glad I can finally get help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kv7817/seeking_professional_help_to_tackle_my_anxiety/", "title": "Seeking professional help to tackle my anxiety", "social_network": "reddit", "user": "amayawolves", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 29, "down_vote": 0, "creation": 1610385735, "permalink": "/r/DecidingToBeBetter/comments/kv7817/seeking_professional_help_to_tackle_my_anxiety/", "nsfw": false, "first_save": 1635436624.99441, "replies_charged": false}