{"id": "t5_2tand_t3_j3rw8w", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Becoming better and doing better, it is a continuous challenge to face every single day of our entire lives. I try my best to accept this challenge. I have made progress in little ways. I have had a complete change in my lifestyle, I have a healthy lifestyle now. I do the activities I enjoy. I read. I read a lot. I play music. I have started socializing every day. I have friends and I hangout with them. I laugh. I smile. I go outdoors. I learn a lot of things every hour every day. I learn something 24*7. Everything's good for the time being. Yet lately I have this feeling this thought which has been almost trying to sink all the good things I have managed to come across. This feeling and thought that I have not been giving back enough to the world. Just the world and the society in general, not people or my friends. I am not talking about my individual relationships with people. I mean to talk about the world, a broader paradigm consisting of society of men and kind and matter and mind. Like I have been unable to make a significant contribution. Leave significant, even a little small contribution. Before I changed my lifestyle, I used to be a mess. I did not want to contribute at all. I felt satsified with my mediocrity, with just been ordinary. Now I have changed and come a long way. Now when I have had all I had wanted, I still lack satisfaction. And now I feel this satisfaction would only come if I make a little contribution. If I give back something to the world. I am not even sure what this something means. Maybe it means an archive, a book, my thoughts, my ideas. I am not even sure. I don't know how to contribute to the world. I just want to make this small contribution. It doesn't have to be something that changes the world or shit, it should just let the world stay the world. Just help it to keep going.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j3rw8w/how_can_i_contribute_to_the_world_how_can_i_give/", "title": "How can I contribute to the world? How can I give back something?", "social_network": "reddit", "user": "holdencaulfield__", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1601633204, "permalink": "/r/DecidingToBeBetter/comments/j3rw8w/how_can_i_contribute_to_the_world_how_can_i_give/", "nsfw": false, "first_save": 1635438132.477463, "replies_charged": false}