{"id": "t5_2tand_t3_nnkakj", "request": ["b69cf201-6737-4217-b486-9096135546b8", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "e234981c-b061-4d83-8134-70d441847f74"], "text": "I followed this thread because I have in fact decided to be better. I couldn’t find any specific places to post any of my story anonymously. To keep it as short as possible though it won’t be.  I just want to talk about the importance of believing in yourself and how your mind is the center of your universe. Everything you believe and perceive is just a reflection, take that how you want to. \n\nAbout me, I grew up in a family of refugees from the Middle East and moved to the United States in my first 2-3 years of being on the planet. I grew up with 3 big bros which 2 of them were horrible influences and had me smoking trees at the age of 4. Extreme poverty everything I ever had, every gameboy, toy, etc was stolen. It’s bittersweet af as I had a few things but it was all taken from some other kid somewhere. \n\nIt was messed up but I didn’t know any better as that’s all I saw. Somehow I managed to be an All A student all the way through until just about middle school. One foot in the streets and one out seemed to embody my experience in many ways. Got into gangs early, kicked out &amp;amp;amp;amp; forbidden from attending school in the state of Texas , carried a gun at the age of 13 and thought it was normal. It was sad. I went to boot camp and escaped with the help of my brother, I flew to California to be with my oldest bro who was at this time an IT guru in Cloud Consulting. Attended school in Orange County, it changed the construct of groups as I saw many different cultures come together and made friends quickly. My brother became my legal guardian as my parents were unable to. Became a semi-pro skateboarder at the age of 17 after soaking up the Cali glory. Quite a change.\n\nCame back to Texas schools with the same kids I grew up with. Ruined me again lol. I was super athletic and picking up smoking ruined me. After my childhood I still never had interest in it until then. Left HS my last year, just walked out and never returned. Wanted to stay inside and watch tv all day.\n\nGrowing up seeing hard labor I always wanted to beat the system and was going to find a way. I started selling drugs. Worst thing I could do. I used my gifts in the wrong way.\n\nWhen you’re starving you’d be surprised the things you’d do. I’m just glad I’m still alive for some of things I can’t mention. \n\nIt started small, before I knew it - it got bigger. Next thing I knew I was deep in it. I had the dream car I wanted, things I wish I could buy and expensive designer crap. The same expensive stuff I had to walk to the store in when I lost it all. I can’t get into the specifics because I’ve actually caught a multi felony case for this but I will say I pulled a breaking bad and found a master way by doing something highly illegal. I studied pharmaceutical compounding for years secretly and the most I’ll say is what I sold was a purple liquid. \n\nI almost didn’t believe in anything anymore and knew the money I was making wasn’t pure or had anything to do with god, I almost embraced it was from the devil. I actually became the evil that I despised because my childhood was deprived of the purity. \n\nAs I was the youngest, I had no connections to my brothers anymore as they all hated each other. I was on my own and was going to eat by any cost. \n\nI believe in energy and the things you put into the world. What you give out you get back and that’s for sure. Although I didn’t feel like I was wrong because I was no longer starving. \n\nI grew up in a group as mentioned and everyone was older except for me and one of the other members little brother. They were rappers and we half a** were also. As we grew we got into music more and became the best of friends. The kind when I was starving that he would make sure I had some food on my plate even if it meant taking it off of his. We also sold drugs together. At the age of 21 one of his own friends shot him inside of his house in a botched robbery attempt. 2 days before that his exact words to me were, “you never know how long we’ll be here we have to make things happen, I don’t care if anyone’s with me on the journey as long as you always got my back bro”. \n\nThis killed me inside too, also realized I had some weird abilities as I saw a dream about it before but couldn’t recognize any faces until the situation unfolded in life. This post is already lengthy so I’m going to try and sum it up to whoever reads it. \n\nI went through and still go through, ptsd and trauma. Hella anxiety, more than I ever did while I was heavy in the streets. I’m gonna fast forward as there is too much. 2018 FBI kicked in my door at 4:00am in the middle of the night , destiny is in fact a thing. I sleep with a firearm every night, the night I didn’t I got raided. I thought I was being robbed, had I run out with my gun I wouldn’t be writing this post most likely. I got bagged, arrested caught with a closet full of what they weren’t originally looking for. Ironically they didn’t come looking for me, they came looking for my brother as he listed his address as mines and had been using my identity secretly. Once they got me it didn’t matter. I went to jail, never thought I’d get out. During this time of still selling drugs I had managed to create a fully functional online marketing agency that took me years of side work. I wasn’t a dummy by any means I studied cloud consulting and various forms of advertisement. \n\nI thought I lost it all, in my short stint in jail I once moved with the sun as it peered through the window just so I could feel the warmth of it until the very last second. I was so unhopeful I didn’t even make a call to anyone, besides my girlfriend who didn’t pick up. A common street saying is if you can’t bond yourself out of jail don’t do crimes. I got bagged with a few documented bucks from work so when I found out I had a bond I got myself out. \n\nMy charge, multiple felonies. The worst one being an enhanced 1st Degree Felony - even higher than a murder charge. I was facing 25 to life in prison at the age of 26. Everything I had again, I lost again. Goes quicker than it comes.\n\nI decided I had to change my life and the old saying in the streets you either end up dead or in jail rings true. Coming out of jail I made a promise to my god, the universe that I wouldn’t f*** around anymore. I went from making the daily money to being flat broke. The police even took all of my computers and phones they left me with nothing. \n\nI bought a 300 laptop with a friends money from Best Buy and used my acquired skills from learning WordPress web development, SEO, Google AdWords campaigns and etc as I didn’t have any income to manage an overhead. I put my pride to the side and took on deals I didn’t think I was capable of doing, I did it. I learned on the job. I was able to turn my life around and made more money legally than I did illegally. Also I no longer had to look over my shoulder. Today I own one of the largest marketing agencies in Texas and can’t say which one for obvious reasons. Also a successful artist with many million views which I once dreamed of but nowadays fame doesn’t even mean anything to me. It’s my only way to express myself. I just want to inspire anyone I can as I always wish I had the same. My past will forever be there but I don’t regret anything. I hope to be even better and love people even though many of the ones in my life didn’t love me. Stay positive and I hope everyone gets an ease of mind by knowing your purpose in life is simply to evolve. Whatever that means to you, that’s what it is. \n\nOn my birthday my family’s words to me were man I’m just glad you are alive. It’s jokes but it cuts deep as I feel that trauma inside somewhere and lived it. It still hurts me sometimes but I don’t have much attachment to physical nowadays and am just appreciating my life while I’m here to experience it. There’s so much to this story but some key points to put it.\n\n- Energy is real, do good things from a pure place and always appreciate yourself. Don’t take this one lightly.\n- You know that same energy you put into someone and then feel let down? Put that same love and energy into yourself and you’ll be surprised at what happens to you. \n- Be careful hurting peoples feelings or saying things even out of anger, people really can die from hurt, heartbreak &amp;amp;amp;amp; sadness. Love everything and learn even if it doesn’t love you or can’t. \n- Money isn’t everything, and can’t take away depression or sadness. You can’t buy a walk at the park or a breathe of fresh air. It’s priceless, when you are scared you won’t get it again it becomes to come to the surface.\n- Love your families and be a person of encouragement and enlightenment as we all have greatness within us.\n- Protect your mental health and don’t be afraid to daydream, visualize your future as this is what manifestation is all about. It’s not about how it’s going to happen just feel it.\n- Don’t do bad things lol. There are no shortcuts in life, and everything that happens to you I believe is happening for a reason. To learn.\n- You are exactly where you are supposed to be in life, stop thinking the other side is always greener. \n- Wishing everyone much love and success and appreciate yourselves, don’t do shit to impress anyone just do what you love as much as you can. There’s no replacement for hard work.\n\nI don’t know who’s even going to read this as it’s long af but hopefully someone does, this is probably like a consolidation of many years of trauma but I’m fighting through my past traumas and even if one sentence of this post can help at least 1 person that’s enough for me. Peace &amp;amp;amp;amp; love. Be the best YOU can be.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nnkakj/life_lessons_from_the_black_sheep_of_society/", "title": "Life lessons from the black sheep of society", "social_network": "reddit", "user": "Electronic_Lychee339", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 141, "down_vote": 0, "creation": 1622282690, "permalink": "/r/DecidingToBeBetter/comments/nnkakj/life_lessons_from_the_black_sheep_of_society/", "nsfw": false, "first_save": 1635436455.8765252, "replies_charged": false}