{"id": "t5_2tand_t3_gdil9q", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I expect this is just going to be a flow of thought that just comes flying out of my fingers, so we’ll see how this goes.\n\nOk, so I had a difficult enough time towards the end of last year. Suffered a breakup, struggled finding a job, lost quite a bit of fitness I had gained previously. Our dog Benji died. People have been in worse situations than this of course, particularly these days, but still, it was quite the personal struggle.\n\nFast forward 6-7-ish months and some things have changed. \n\nI checked myself into therapy beginning in October. Left everything on the table and held nothing back. Finished up in mid March after my therapist and myself agreed that there wasn’t a need to continue. Seriously lads, it was the best experience even though it was difficult and quite raw at times.\n\nI got the job I wanted, and it has turned out to quite suit me. I have a bit further to travel these days, but I’ve settled in well and recently passed my six month probation period, and thus, I have been made permanent. Happy days indeed.\n\nI still have not got my levels of fitness I previously had. I used to be a long distance runner. Now, I’m not as bothered to do that anymore these days, but it would be good to get back into shape. So, for the month of May, my sister and myself are going to walk, run, crawl 200k between us. This is for a cause that’s particularly close to us, but it’s hopefully got the added benefit of getting a bit fitter than I am. \n\nAlong side that, Phase 5 of Covid-19 restrictions being lifted begins in Ireland on August 10th (all going according to plan). From yesterday, it’ll be 100 days till then, so if I do 10,000 steps every day until then, I’ll have covered 1,000,000 steps. This wasn’t my idea, I saw it on Twitter, but it spoke to me, so again, hopefully it’ll help with my fitness.\n\nAnother thing I’m going, fitness wise, is I have joined a fitness and food plan course for the next three months, with a view to being “ripped” by the end of the summer. I’ve always been quite self conscious with my appearance, but with this in place, I feel like I’ll make progress there.\n\nThis process I’m in is ongoing. I’m trying to steer myself away from negativity wherever I can. Unfollowing negative threads and accounts on the internet, not looking at the numbers too much with the Covid 19 thing (but keeping reasonably up to date at the same time). Not taking things personally with people I meet, or taking others problems on board myself. I like to think I’m quite a positive pleasant person anyway, so hopefully I can project that a bit more and not be so shy all the time.\n\nWell, this is turning into a bit of a novel. If you’ve made it this far, thank you for coming to my Ted talk. Don’t forget to subscribe and smash that lik…..oh no wait, that’s a different platform. My bad.\n\nJust a quick word too, wherever you are in the world, I hope you and yours are all safe and healthy. Take care of yourselves\n\nFrom a random Irish person on the internet.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gdil9q/ive_made_a_lot_of_progress_but_more_will_be_done/", "title": "I've made a lot of progress, but more will be done over the coming months.", "social_network": "reddit", "user": "thespuditron", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1588621460, "permalink": "/r/DecidingToBeBetter/comments/gdil9q/ive_made_a_lot_of_progress_but_more_will_be_done/", "nsfw": false, "first_save": 1635437690.079736, "replies_charged": false}