{"id": "t5_2tand_t3_qadba6", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I don’t know what I’m doing wrong. In the past, routines, meditation, and cutting out weed have helped me so much in beating depression. But now, any routine I create feels too restrictive, but less strict routines don’t give me the stable structure I need for my life to feel meaningful. It feels like I go in and out of every day like a zombie, purposeless, meaningless, just going through the motions of life. \n\nI also have HUGE problems with perfectionism, and I think that’s why my routines have started feeling too restrictive. I place too much pressure on myself to accomplish things, and it ruins the beauty of routines for me. I need things to be done in a specific way, and that also feels too restrictive. But being looser with my expectations puts me in that depressed, meaningless spiral instead like I said above. Meditation has also lost all its power for me. Though that may be because I am not consistent enough with it - it’s hard to be consistent when I don’t have a meaningful routine to my day, and it’s hard to have a flexible routine when you struggle with perfectionism. So the cycle of depression continues. \n\nWould it be helpful for me to write out the things that are important to me, that I really want to focus on in my life, and build a routine around that? And also work on my perfectionism issues in the meantime, so I don’t end up being too strict with myself? It would be SO much easier for me to meditate too if I had a meaningful routine going for me. \n\nSorry for this ramble lol, this was more of a journal entry than a Reddit post. But if anyone has any other insights, please let me know!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qadba6/why_cant_i_beat_my_depression/", "title": "Why can’t I beat my depression?", "social_network": "reddit", "user": "silverflower1998", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1634523820, "permalink": "/r/DecidingToBeBetter/comments/qadba6/why_cant_i_beat_my_depression/", "nsfw": false, "first_save": 1635435347.3993194, "replies_charged": false}