{"id": "t5_2tand_t3_p9n7iq", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "*Long post. Has both my progress and problem detailed. Thank you for taking time out of your day to read this. I really appreciate it!*\n\nThese past few weeks have actually been great.\n\nI came up with a system that works for me, and I've been eating healthy and working out regularly. \n\nThese two small acts have made me feel like I'm in control again. My mind is CLEAR. It still can't process information very fast and gets muddled and confused, but I'm no longer spiraling into an incontrollable panic when it happens. I stay calm and figure it out.\n\nBut the problem is, recently my family had to face death, several times. The last one, was of someone who was very young, and even though we weren't very close, I'm still reeling from the realization that someone so young could just- *go*.\n\nThe rest of my family is devastated but I, like always, am very much numb to these type of feelings. It seems I block them out subconsciously so I never cry or get affected by it. It's all just some sort of show. \n\nI sympathize, but I don't empathize. I'm sorry for your loss, but when I go home I'm over it, y'know?\n\nI've gotten used to this numbness and accepted that it would be a problem I would tackle later on.\n\nBut this last one... it makes me feel... weird. Like, I'm not devastated or sad... more like - shock? It feels like I don't have the right to be happy, even though I'm not sad. It's hard to describe, and as someone who, as I said, finds it very easy to brush off emotions with jokes, this is my first time dealing with something like this.\n\nI've started doubting and overthinking every minute action and the panic from earlier is starting to set back in, so I NEED to know: \n\nHow do I deal with this?  What even is this? Is this being sad? Then why am I not crying or feeling that weight in my chest? And why is it happening now and not before? Everyone is crying, or remaining stoic and neither feels like the right response. It's like playing a new videogame without a tutorial.\n\nT**L;DR: My mind is clearer than it has been in years and I'm being forced to confront emotions that I have never felt before, and I don't understand what to do with them. It's making me panic, and I'm afraid of losing control.**\n\n*And just to be clear, when I ask these types of questions, it's not because I'm too lazy to find the answer, I ask because I don't know how to start looking for it.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p9n7iq/i_feel_like_a_newborn_in_a_grown_ups_body_i_dont/", "title": "I feel like a newborn in a grown up's body. I don't understand my emotions, and I'm afraid of losing control over my mind.", "social_network": "reddit", "user": "PanacottaCat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1629673825, "permalink": "/r/DecidingToBeBetter/comments/p9n7iq/i_feel_like_a_newborn_in_a_grown_ups_body_i_dont/", "nsfw": false, "first_save": 1635435785.3930926, "replies_charged": false}