{"id": "t5_2tand_t3_39435d", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "(there's a TL;DR at the bottom)\n\nI read that most people stop learning new words when they become fluent in a language. This means that once you get to a point where you are able to easily talk to friends/family/people at work, you usually stop learning more advanced/fancy/cool vocabulary simply because you don't encounter it that often.\n\nEnglish is my third language yet I speak it fluently due to attending an International school for 4 years. I speak French, Italian, English, Lithuanian and Russian, which in a way means that I don't know any of these languages in-depth (though speaking fluently).\n\nI get really obsessed with people who speak eloquently: Christopher Hitchens (author), Russell Brand (comedian), Bo Burnham (comedian), Tim Minchin (comedian).\n\nI decided to dedicate this summer to becoming more articulate by writing down any word that I don't comprehend while being on the internet, listening to people with vast vocabularies.\n\nThis was the first result:\nhttp://imgur.com/O6WfKdG\n(excuse the dreadful quality)\n\nSince you cannot see the words in the pic, here's a short sample of words that's in it:\nsolipsistic, dichotomy, blue blood, symbiosis, Gish Gallop, anthology, osmosis, extemporize, megalomaniac, compartmentalize, androgynous, voluptuous.\n\nI put it on wall next to me so that I could glance at it anytime. The next day I had friends coming over and one guy said he'd buy me coffee if he could get one as well since he liked the idea.\n\nI'm in the process of making more of these and I wondered if any of you are interested in having some as well? \n\nThe poster in the picture has about 90 new words. I'm not sure about the pricing, but just in general, would anyone be interested in having these?\n\nTL;DR: Is anyone interested in having a poster with fancy English vocabulary on their wall?\n\nEDIT: There's an update coming as I see that there are quite a few that would like to get one. The update will contain all the necessary details about the posters and how to get them. If you are also interested, leave a comment or send me a PM!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/39435d/is_anyone_interested_in_advanced_english/", "title": "Is anyone interested in \"Advanced English Vocabulary\" posters I'm making? [pic inside]", "social_network": "reddit", "user": "TheBetterOne", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 79, "down_vote": 0, "creation": 1433818514, "permalink": "/r/DecidingToBeBetter/comments/39435d/is_anyone_interested_in_advanced_english/", "nsfw": false, "first_save": 1635435104.1928859, "replies_charged": false}