{"id": "t5_2tand_t3_3mcmaj", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "1. You can’t change other people, and it’s rude to try.\n\n2. It is a hundred times more difficult to burn calories than to refrain from consuming them in the first place.\n\n3. If you’re talking to someone you don’t know well, you may be talking to someone who knows way more about whatever you’re talking about than you do.\n\n4. The cheapest and most expensive models are usually both bad deals.\n\n5. Everyone likes somebody who gets to the point quickly.\n\n6. Bad moods will come and go your whole life, and trying to force them away makes them run deeper and last longer.\n\n7. Children are remarkably honest creatures until we teach them not to be.\n\n8. If everyone in the TV show you’re watching is good-looking, it’s not worth watching.\n\n9. Yelling always makes things worse.\n\n10. Whenever you’re worried about what others will think of you, you’re really just worried about what you’ll think of you.\n\n11. Every problem you have is your responsibility, regardless of who caused it.\n\n12. You never have to deal with more than one moment at a time.\n\n13. If you never doubt your beliefs, then you’re wrong a lot.\n\n14. Managing one’s wants is the most powerful skill a person can learn.\n\n15. Nobody has it all figured out.\n\n16. Cynicism is far too easy to be useful.\n\n17. Every passing face on the street represents a story every bit as compelling and complicated as yours.\n\n18. Whenever you hate something, it hates you back: people, situations and inanimate objects alike.\n\n19. Ralph Waldo Emerson’s works alone can teach you everything you need to know about living with grace and happiness.\n\n20. People embellish everything, as a rule.\n\n21. Anger reveals weakness of character, violence even moreso.\n\n22. Humans cannot destroy the planet, but we can destroy its capacity to keep us alive.  And we are.\n\n23. When people are uncomfortable with the present moment, they fidget with their hands or their minds.  Watch and see.\n\n24. Those who complain the most, accomplish the least.\n\n25. Putting something off makes it instantly harder and scarier.\n\n26. Credit card debt devours souls.\n\n27. Nobody knows more than a minuscule fraction of what’s going on in the world. It’s just way too big for any one person to know it well.\n\n28. Most of what we see is only what we think about what we see.\n\n29. A person who is unafraid to present a candid version of herself to the world is as rare as diamonds.\n\n30. The most common addiction in the world is the draw of comfort. It wrecks dreams and breaks people.\n\n31. If what you’re doing feels perfectly safe, there is probably a better course of action.\n\n32. The greatest innovation in the history of humankind is language.\n\n33. Blame is the favorite pastime of those who dislike responsibility.\n\n34. Everyone you meet is better than you at something.\n\n35. Proof is nothing but a collection of opinions that match your own.\n\n36. Knowledge is belief, nothing more.\n\n37. Indulging your desires is not self-love.\n\n38. What makes human beings different from animals is that animals can be themselves with ease.\n\n39. Self-examination is the only path out of misery.\n\n40. Whoever you are, you will die. To know and understand that means you are alive.\n\n41. Revenge is for the petty and irresponsible.\n\n42. Getting truly organized can vastly improve anyone’s life.\n\n43. Almost every cliché contains a truth so profound that people have been compelled to repeat it until it makes you roll your eyes. But the wisdom is still in there.\n\n44. People cause suffering when they are suffering themselves. Alleviating their suffering will help them not hurt others.\n\n45. High quality is worth any quantity, in possessions, friends and experiences.\n\n46. The world would be a better place if everyone read National Geographic.\n\n47. If you aren’t happy single, you won’t be happy in a relationship.\n\n48. Even if it costs no money, nothing is free if it takes time.\n\n49. Emotions exist to make us strongly biased towards or against something. This hinders as often as it helps.\n\n50. Addiction is a much greater problem in society than it’s made out to be. It’s present in every person in various forms, but usually we call it something else.\n\n51. “Gut feeling” is not just a euphemism. Tension in the abdomen speaks volumes about how you truly feel about something, beyond all arguments and rationales.\n\n52. Posture and dress change profoundly how you feel about yourself and how others feel about you, like it or not.\n\n53. Everyone thinks they’re an above average driver.\n\n54. The urge to punish others has much more to do with venting frustration than correcting behavior.\n\n55. By default, people think far too much.\n\n56. If anything is worth splurging on, it’s a high-quality mattress. You’ll spend a third of your life using it.\n\n57. There is nothing worse than having no friends.\n\n58. To write a person off as worthless is an act of great violence.\n\n59. Try as we might to be otherwise, we are all hypocrites.\n\n60. Justice is a human invention which is in reality rarely achievable, but many will not hesitate to destroy lives demanding it.\n\n61. Kids will usually understand exactly what you mean if you keep it to one or two short sentences.\n\n62. Stuff that’s on sale usually has an annoying downside.\n\n63. Casual swearing makes people sound dumb.\n\n64. Words are immensely powerful. One cruel remark can wound someone for life.\n\n65. It’s easy to make someone’s day just by being uncommonly pleasant to them.\n\n66. Most of what children learn from their parents isn’t taught on purpose.\n\n67. The secret ingredient is usually butter, in obscene amounts.\n\n68. It is worth re-trying foods that you didn’t like at first.\n\n69. Problems, when they arise, are rarely as painful as the experience of fearing them.\n\n70. Nothing — ever — happens exactly like you pictured it.\n\n71. North Americans are generally terrible at accepting compliments and offers of help.\n\n72. There are not enough women in positions of power. The world has suffered from this deficit for a long time.\n\n73. When you break promises to yourself, you feel terrible. When you make a habit of it, you begin to hate yourself.\n\n74. A good nine out of ten bad things I’ve worried about never happened. A good nine out of ten bad things that did happen never occurred to me to worry about.\n\n75. You can’t hide a bad mood from people who know you well, but you can always be polite.\n\n76. Sometimes you have to remove certain people from your life, even if they’re family.\n\n77. Anyone can be calmed in an instant by looking at the ocean or the stars.\n\n78. There is no point finishing a book you aren’t enjoying. Life is too short for that. Swallow your pride and put it down for good, unfinished.\n\n79. There is no correlation between the price of a brand of batteries and how long they last.\n\n80. Breaking new ground only takes a small amount more effort than you’re used to giving.\n\n81. Life is a solo trip, but you’ll have lots of visitors. Some of them are long-term, most aren’t.\n\n82. One of the best things you can do for your kids is take them on road trips. I’m not a parent, but I was a kid once.\n\n83. The fewer possessions you have, the more they do for you.\n\n84. Einstein was wiser than he was intelligent, and he was a genius.\n\n85. When you’re sick of your own life, that’s a good time to pick up a book.\n\n86. Wishing things were different is a great way to torture yourself.\n\n87. The ability to be happy is nothing other than the ability to come to terms with how things change.\n\n88. Killing time is an atrocity. It’s priceless, and it never grows back.\n\nSource: \nwww.raptitude.com/2009/07/88-important-truths-ive-learned-about-life", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3mcmaj/88_important_and_epic_life_truths/", "title": "88 Important and Epic Life Truths", "social_network": "reddit", "user": "PositiveVibrations0", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 172, "down_vote": 0, "creation": 1443197022, "permalink": "/r/DecidingToBeBetter/comments/3mcmaj/88_important_and_epic_life_truths/", "nsfw": false, "first_save": 1635437709.1530745, "replies_charged": false}