{"id": "t5_2tand_t3_76g6a8", "request": ["8461abc5-2740-47d4-9b1f-f9a34c328cd4"], "text": "Hello Redditors, \nThis is a follow-up from my initial post, which you can find here : https://www.reddit.com/r/DecidingToBeBetter/comments/6qbl2n/my_own_path_of_rebuilding_myself/\n\nShort version : I'm on my own path to rebuild myself completely. I've started at the end of July, and this is a small list of what I've changed :\n\n- I go to the gym five times a week for a mix of cardio and muscular sessions. Results are showing now, my arms more notably have gained some real volume whereas before they were just chamallow sticks. Also met a few cool dudes there, that are my reference points.\n\n- I now eat healthy, have a diet for my training but also training myself to cook healthy for my kids (I'll leave her mother's house in a few months and I have to be ready to cook excellent meals for them when I'll be on my own). \n\n- I've lost quite a few pounds of fat, thus could change my way of clothing and start dressing in more elegant, fit way.\n\n- I groom myself up, starting with being cleanly shaved each mornings. \n\n- I move my ass and experience stuff I would have never done before July, and each time I'm just awed at all of that potential I was letting go stupidly.\n\n- I've started to get more confidence in myself and even got to get on stage to defend my company on a startups event, so yeah, here I was with a mic in my hand and talking in front of a hundred people I did not know. That was impossible for me two months ago. \n\n- Overall I got my shit together and I'm receiving smiles from people who are amazed how much I could change in such a short notice. \n\nAll of this is cool and it just encourages me to continue pushing my efforts up, to go as fast as I can in building that better me. \n\nBUT\n\nAs the title says, I have this behemoth to start fighting and I just don't know how to do it. And this behemoth is... **to stop being a fucking single.** \n\nI'm so bad at seduction, I'm so out of experience, know-how or blueprints, I could approach any woman and have ZERO idea on how to talk to her to gain interest. I do not know how to be \"sexual\", I don't know how to communicate that I'm available without being like a needy AFC. I know changing myself will take time, but I'm just panicking that, if I take four more years to complete my \"better me\", I will be 44 and I've would have lost a big chunk of my dating life in vain. Last, my friends are way too far away, and my very short social circle here is made of people under 30... \n\nSo... two questions : \n\n1 ) How the fuck can I start changing this ? I've tried talking to some PUA and one of them asked me as a student, but when he told me his price I had a brain freeze, it was extremely expensive, way too much for me. So this option is out the window. Youtube videos often shows dudes that are very handsome - I'm not exactly handsome - and most of the tips are for women under 30, but those are now out of range for me. Is there any ressources for morons like me ? \n\n2) I'm a geek with an extensive geek culture. I'm a futurist and thus an optimist. I'm a maker (my latest tool is a 3D printer which I use to create toys for my kids). I listen to orchestra or psybiant music and avoid radio/club music like the plague. I'm fascinated by our world heritage and I like to go to history museums. \nAND I'm terrified I'm such a weird mix of tastes I'll never find a woman who could understand me or enjoy the same stuff as I do. Am I panicking for nothing, or did I set up myself in a nice one-people-only box ? If not, where can I find people like me ?\n\nI could use any advices here, it will be greatly appreciated. Thanks a lot in advance for your help Redditors ! \nCheers ! ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/76g6a8/huge_changes_two_months_later_but_the_behemoth_is/", "title": "Huge changes two months later... but the behemoth is still to be killed.", "social_network": "reddit", "user": "Tenth_X", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1508031108, "permalink": "/r/DecidingToBeBetter/comments/76g6a8/huge_changes_two_months_later_but_the_behemoth_is/", "nsfw": false, "first_save": 1635436337.4416826, "replies_charged": false}