{"id": "t5_2tand_t3_dvuz10", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hi. Don’t know what I wanna say, so I’m just gonna ramble. \n\nIn high school, I was identified as “a good writer”. I was in an accelerated program that was writing heavy, and I was considered one of the best writers in my class. Got encouraged to enter speech competitions for my essays, but never went through with it because I’m a human hurricane when it comes to staying in top of shit. \n\nFreshman year of college, I take English 101 and fail- because I never turned in a single essay. Next semester I withdraw go avoid failing English 101 again - same reason, never finished the essay. Take it again over the summer, start failing-to-work again, but I pass because my aunt literally locks me in her house for a week and refuses to let me do anything but write- no matter how much I  cry, argue, or “go limp”. I pass with a D-, with one of theee major assignments missing, one only half written, and one with an A+ and the word “exemplary” written on it. \n\nThis becomes the general pattern with me and major writing assignments. Either I write nothing and fail, or I shit out a diamond somewhere between my “I hate writing” tantrums and sulking spells. Usually, I fail. In most classes in college, whether I pass a class depends on whether there was a term paper to write. \n\nI can’t count the number of times I’ve been told “you’re smart enough to pass. Your ideas are excellent, you can explain them just fine *telling* me about it. I don’t understand why you can’t seem to pass”. I try again, and fail again, give up a little sooner each time, and the problem festers and festers. \n\nWriting was my *thing*. Wasn’t it? Was that just something I was told? privilege overblowing my talent? Or did I lose something? Sometimes I want nothing more than to write again - and the few times I manage to get something out, I’m so proud of myself, and happy with what I created. But it’s so far away, and a lot of the time I never want to write another goddamn paper in my life.\n\nAnyway. I just withdrew from professional writing. Again. Never submitted a single thing. Same old same old. As soon as it got hard I shut down. I now have to ask for special permission to take it again. If I had passed, I would have graduated this semester. I’m not ashamed of graduating late- I’m already 25, I’m past shame in that department. \n\nBut why on earth will next semester be any different? At this point, it feels smarter to just drop out of college. It feels like I’ve walked down this goddamn road 100 times. And I know the only way out is through it- push through the crying jags, push through the feeling that my head is unraveling, push through the hopelessness and the little voice saying “you’re gonna give up eventually, why not save yourself the time and pain and do it now”? Push through the awkward conversation with kind people offering solutions I’m sure won’t help, because they’re addressing the wrong problem.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dvuz10/cant_graduate_without_passing_professional/", "title": "Can’t graduate without passing professional writing, but I self-sabotage every time I’m given a writing assignment", "social_network": "reddit", "user": "Coppercumin2357", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 16, "down_vote": 0, "creation": 1573665817, "permalink": "/r/DecidingToBeBetter/comments/dvuz10/cant_graduate_without_passing_professional/", "nsfw": false, "first_save": 1635437858.331449, "replies_charged": false}