{"id": "t5_2tand_t3_qfncj3", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "Hello all. I'm pretty sure I'm extremely depressed. Well. I know I am. I've no confidence. I've no drive, willpower, really any modicum of anything that denotes some form of getting into action to pursue a better course for life. A potential coupling with burnout. Lots of apathy. I. I just feel broken. There's no point to lift my feet, to further this journey. I. I want to be done. I don't want to worry about living as an adult. Taking care of myself. Making money. I don't care anymore. I've also been diagnosed with ADHD. As well as pursuing some type of spiritual awakening type stuff. My parents have passed. Mother when I was two, father a few years ago. I'm not really close to anyone anymore. I no longer speak to my army buddies. I'm. I'm very much alone. I've ostracized myself from everyone. I don't enjoy living like this, but it feels all encompassing, like I can't shake it.  \n\n\nI work as a software developer. I've got two dogs, two cats, a reef tank and a lizard. A mortgage payment. I'm pretty terrible with my money. I don't have many bills except utilities, mortgage, two credit cards, a loan, cell phone and some entertainment stuff.  \n\n\nI want to start a farm. I want to care about life. I want to wake up in the morning and get my shit together and have a great productive day. I don't want to stagnate. I've \"found\" purpose, but I can't even seem to get that behind me for a good push. I want to just start something, anything that would then put money into other projects for the betterment of society and the environment. But I just can't seem to make anything happen. I know why, it's because I don't do anything.\n\nI also smoke somewhat regularly Delta-8 THC, Fluoxetine for anxiety, and concerta for my adhd. I sometimes drink as well. But anymore it tastes like poison to me.\n\nI almost feel I need that rigid structure of the military or high school or a parent to tell me to get my fucking shit together and apply that external pressure of which I seemingly have none. How the absolute hell do people exist and propel themselves forward through life? Like, what should I do here?  \n\n\nAnd look. I know what the implication of the title is. I don't want to kill myself. But if I can't even change who I am for a better life, for me and others, and all this impending collapse stuff, yea. I'll just quit the game. I dunno. Regardless, thank you for your time. I hope that all comments are useful not just for me, but others struggling through a similar situation.  \n\n\nPlease do not pity me. I am not special for my struggles. I am just a man. Thank you for your time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qfncj3/hello_if_i_dont_change_i_will_probably_seek_an/", "title": "Hello. If I don't change, I will probably seek an early termination.", "social_network": "reddit", "user": "DrupalFrogsFish", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1635187237, "permalink": "/r/DecidingToBeBetter/comments/qfncj3/hello_if_i_dont_change_i_will_probably_seek_an/", "nsfw": false, "first_save": 1635436440.3508165, "replies_charged": false}