{"id": "t5_2tand_t3_flxu10", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": " \n\nHello Guys,\n\nSince last year i've been changing my habits such as pornography and eating unhealthy food. I had a long term relationship and we were not together because i was studying in another country. During this time I felt a huge need for intimacy with my girlfriend and beucase i was far away i used porn to relieve my stress and my needs. I used to watch it everyday and sometimes more than one time per day! I know, it's crazy.\n\nUnfortunately I started to feel that i couldn't last longer in sex because i felt over exciment before i even started. This was a huge mess for my partner. I could notice that she was not happy and i was willing to do everything i could to get better in this topic.\n\nAfter 7 years of relationship with her she broke up with me. There was several reasons and she really disrespected me. She started a relationship with another guy 3 months before we broke up and just kept talking with me like nothing happened... It hurts me a lot and I'm really sad... Nobody deserves this, it's to violent.\n\nTwo months ago I went to a doctor to see if there was a problem with me and the first thing that he asked if i was watching porn with regularity? I said yes and he basically explained how porn changes my brain. It's like being addicted to cocain!!! The images that i watch on porn will pass for sex creating overstimulation and a there is also an huge ammount of dopamine (molecule that is related to the antecipation pleasure of an experience) that is secreased itself in the gap that exists in between two neurons called sinaptic cleft. Dopamine is squirted and stays there for a period of time and this two variables are related to the amount of pleasure that we have with something, in my case, with porn.\n\nSince then, I stopped watching porn and masturbating and I felt a huge difference. I could stay more focus for larger periods of time, I was able to control my anxiety and stress and in my profession is really helpful (professional musician). With this I also exercised more, strated to read again, started a blog and I focused more on my daily tasks. I'm really impressed how this changed completly my life in every aspect.\n\nI didn't tell my girlfriend nor my parents that I went to the doctor but I was ready to show her that i changed until i found what she did to me. Despite this I don't deserve what she did to me, I always respected her and I was fixing this little things that can change our relationship. Unfortunately I couldn't show her and also didn't tell her.\n\nI am really disappointed with her, despite what she did hurts a lot, finding that she could do this to me revealed who she is and that killed me because i thought that she had certain moral values that set her apart from others, but apparently I was wrong...\n\nTo conclude, don't let anything destroy what is special to you. Be able to change what is making the other unhappy because in my opinion it is a way of respecting your partner. Hear what your partner is telling you, not just by saying, but look what their eyes and actions mean.\n\nUnfortunately in my case was too late..", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/flxu10/how_pornography_changed_me_and_my_relationship/", "title": "How Pornography Changed Me and my relationship", "social_network": "reddit", "user": "NuggetFlint", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 469, "down_vote": 0, "creation": 1584721451, "permalink": "/r/DecidingToBeBetter/comments/flxu10/how_pornography_changed_me_and_my_relationship/", "nsfw": false, "first_save": 1635437769.4436817, "replies_charged": false}