{"id": "t5_2tand_t3_mprok7", "request": ["9ad14901-6d2f-44f9-8b16-48a4f40b66ab"], "text": "I’m a 31M proud Black man from the Southside of Chicago (No I don’t know Chief Keef but we are from the same neighborhood).\n\nApril Fools 2021 for me wasn’t a joke. I left a hostile work environment 4 years where I worked in sports doing a job I really loved (perks galore). Same day me and my girlfriend of almost 3 years decided to mutually split because we were both unhappy with our relationship.\n\nI shared this update with my friends who thought I must’ve been really hurt or down on my luck. Your income and your love life are things people have a hard time dealing with ambiguity in. But honestly it’s been refreshing to free myself of some unfair burdens I had been carrying. From there the focus has become taking the steps to be the best man I can be in the future. 2020 was a jolt in my life that I didn’t know I needed but I’ve been beaming with confidence about the future and how I can be a leader for my community and inspire other Black & Brown boys around the world. \n\nMy job didn’t recognize my value and used the fact that I was a high achieving minority to parade me around but not support me internally. My gf and I were still stuck on issues from 3 years ago, kept our friends in our business and didn’t understand me emotionally. Yes all of this hurt very bad but I embraced the pain and didn’t lie to myself about it. I do believe in therapy and I’ve been consistent for a few years. Therapy allowed me to breathe deeper and take the leap of faith and bet on myself.\n\nFast forward, I got a job offer that following week for an additional $20k with a company I feel great about! I am also waiting to hear back about a business school decision for the fall. These were two goals of mine I have been working on for at least 5 years, I just never gave up. I’m not chasing another love life, I know the universe will reward my hard work and diligence down the line. Part of me wants to go back to my gf but I don’t think she understands how she hurts me and may need to mature a bit. I do want to get married and have a family one day but that day isn’t here yet and I am not where I want to be to even launch that phase in life yet.\n\nAll in all, don’t cower to outside pressures. Some people might think at this age I should be something and have this or that, but in reality those people are also just making it up as they go, just like we all are. And if I really look at my life, I’ve overcome so many obstacles to get to this point, Im so fucking proud of myself. I decided to dedicate my life to creating a platform for others and from there the chips will land how they fall. \n\nListen to your gut, heart and mind. Its never too late to prioritize yourself.\n\nLove everyone and be kind to yourself on your journey.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mprok7/trust_in_your_wildest_dreams/", "title": "Trust in your wildest dreams", "social_network": "reddit", "user": "Hairy-Match990", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 95, "down_vote": 0, "creation": 1618275590, "permalink": "/r/DecidingToBeBetter/comments/mprok7/trust_in_your_wildest_dreams/", "nsfw": false, "first_save": 1635435307.3343296, "replies_charged": false}