{"id": "t5_2tand_t3_pslz5v", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "Im having a bit of a dilemma that's all because of my own doing, but im very lost and I'd like to hear what others think.\n\nI've already finished my first two years of college as an undecided major. I have to officially and conclusively pick my major by the start of next semester (which is starting next week, yay me)\n\nMy dilemma is that for a long time I've had this severe anxiety surrounding studying, doing schoolwork, projects, etc from before i even entered college. This has led to a high amount of stress and pressure every semester even with just general subjects, and so far I've been able to do minimal progress to improve it. Sitting doen to study gives me headaches and makes me feel panicked and frustrated almost immediately, to the point where even if i stop and do something else, i legitimately can't calm down or focus on anything else for the rest of the day, and often have to resort to falling asleep/taking a nap just to make the \"tension\" go away.\n\nThere's also my perfectionism tendencies that make it hard for me to start projects in the first place, and the fact that i barely know how to study \"properly\" anyway (i used to just brute force memorise EVERYTHING which burnt me out in school)\n\nThis has led me to resort to possibly picking the easiest major available, Communication and media, but looking at the jobs available for it i don't find myself really *liking* any of them, nor do i really love the major either (I've taken a few classes and it is rather easy, so at least the classes aren't a pain) so i feel guilty and like im letting my anxiousness \"win\" if i pick Comm as my major.\n\nThe problem is is that i have no clue what i *want*. I have narrowed it down to Computer Science, or maybe even Visual Arts, as both drawing and coding seem interesting to me. But don't get it wrong, im still not gung ho about either of them, im just seeing them as majors i might *possibly* enjoy and the jobs that i can get with the degree. But i honestly don't feel confident enough about either of them to confidently say \"I want to take this major and I'll put any and all work needed to pass\" as i don't trust myself enough to say that.\n\nComp. Science and Visual Arts are difficult majors, and people who enter them have to be super passionate about the fact that that is THE major for them, and even then they might find it difficult. Then theres me, looking at all three majors with uncertainty, not really \"loving\" or am convinced of any of them, but i would feel less guilty picking Comp.Science or Visual Arts because im not picking either as a \"this is the easiest so i have no other option\" like i am with Comm. However i don't trust that i will be able to handle the work load for either of them, and from past experiences i tend to fall apart and freeze when things get even slightly overwhelming, leading to a lot of missed homework, and procrastination until the very last minute, which just adds to the stress.\n\nOne final thing is that as i said, my semester is starting next week and i already signed up for a few Comm classes. I have two options, either i take the classes next semester, solidifying myself as a Comm major, or dropping the classes, not taking this semester, waiting until we move back to our home country where i can transfer to college there and take Comp. Science/Visual Arts/ whatever, which is going to be a completely new experience with new people as I've only ever visited my home country for short bouts of time.It was made pretty clear by my parents that if i pick a \"hard\" major i cannot fail any classes (not like that was okay to do anyway) , and if i do pick a hard major and end up faltering, well, i dunno what exactly would happen.\n\nSo im at a loss, do i just accept that i can't mentally handle the work load nor am passionate enough about the harder majors and just take Comm., despite the guilt, or do i just bite the bullet and take a major i *might* be more passionate about, despite its difficulty?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pslz5v/difficulty_deciding_on_a_major_in_college_because/", "title": "Difficulty deciding on a major in college because of my anxiety", "social_network": "reddit", "user": "_tellerteller_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1632240756, "permalink": "/r/DecidingToBeBetter/comments/pslz5v/difficulty_deciding_on_a_major_in_college_because/", "nsfw": false, "first_save": 1635435779.8638456, "replies_charged": false}