{"id": "t5_2tand_t3_qgus7h", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "(18 yr male) I’ve been raped & abused since the age of 8, so as I grew up I felt it was normal to be called names & to be picked on even hit on certain occasions. I would keep it all to myself because I was just a kid what the fuck did I know about that shit? Plus my mom probably wouldn’t have believed me or I would never be able to see my siblings cause they stayed with my father (side-note I’m not going to go much into detail on this part but I was harmed by my stepbrother and another I’m not to proud to admit) & the only person I felt safe with in some way was my blood-brother but nowadays that isn’t going well…. He told me something similar happened to him while we were in the car with his mom who was disappointed to hear what her other son had done to people. Also after my stay there when I returned a few weekends later my brother didn’t talk to me neither looked in my direction and never speaks to me now like wtf dude that really ticks me off (I noticed big changes he’s now more feminine acting, I think to myself maybe he thinks I’ll be mad he’s gay or something.) then theirs me shy or just untrusting of others & broken with drugs to numb the pain cause therapy ain’t working or anything besides that & I think I should maybe call quits so I can finally be free.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgus7h/im_at_the_point_where_quitting_seems_to_be_the/", "title": "Im at the point where quitting seems to be the only option.", "social_network": "reddit", "user": "Significant-Ad8278", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 179, "down_vote": 0, "creation": 1635335067, "permalink": "/r/DecidingToBeBetter/comments/qgus7h/im_at_the_point_where_quitting_seems_to_be_the/", "nsfw": false, "first_save": 1635437379.61359, "replies_charged": false}