{"id": "t5_2tand_t3_mokp1k", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Yes, I know I'm ugly. People always say: \"Ohhhh sweetie, noooo. You look great!\" But I know they're all lying/just being nice. I'm short, I have a big/strange shaped head, I have a fat nose, I can't seem to find a haircut that suits my face, I have a lazy eye, large pores, acne/acne scars, a small body frame, bad posture, uneven skin tone, and freckles/splotches all over my face and body. \n\nThere are a lot of things I just can't fix because I was fucked over with shitty genes. While I've never really been picked on for my looks, I still feel like it's because of my looks I have a hard time finding a woman to love me. Looks are the first thing that lets someone know if they want to be friends with a person or if they want to take things further. \n\nLately I've started to hate myself even more because of the way I look. I'm getting older (27) and I'm still a virgin. I've still never had a gf or my first kiss yet, and because of this, I'm always depressed. I've seen a lot of older dudes who are also ugly/lonely grow to hate women. I'm worried that I will eventually become one of them. I mean I'm already halfway there the bad looks, loneliness, and the virginity. \n\nPeople always say shit like: having a gf/bf isn't that great or sex is overrated lmao. Well then why is being a virgin or not being able to get a gf the main insult online/irl? Sex and having a gf is important because people talk about it all the time. Anyways, I'm sure just from reading this you all can see that I am slowly becoming ugly on the inside, and this is what I don't want to happen. So how do I fix myself because I turn full incel mode?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mokp1k/ugly_on_the_outside_and_slowly_turning_ugly_on/", "title": "Ugly on the outside and slowly turning ugly on the inside.", "social_network": "reddit", "user": "Wh00pity_sc00p", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 23, "down_vote": 0, "creation": 1618117107, "permalink": "/r/DecidingToBeBetter/comments/mokp1k/ugly_on_the_outside_and_slowly_turning_ugly_on/", "nsfw": false, "first_save": 1635437218.1052198, "replies_charged": false}