{"id": "t5_2tand_t3_ppiib5", "request": ["f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Tw: Eating disorders, body shaming, overeating, bullying, harassment, stalking.\n\n\nWhen I was 16, I never thought about calories. I never thought about what I ate, just that I liked healthy tasty food. I loved anything spicy. I was a healthy weight for my height. But tbh, I wouldn’t have known because I never weighed myself. But I was very insecure because I was a late bloomer. I looked awkward. I had puffy frizzy hair, gaps in my teeth being fixed with braces, I hadn’t developed at all so I thought I looked 12, and I had bad acne. \n\nI started doing musical theatre and I met this group of girls I wanted to be friends with. They were *so* talented. They sang better than me. They got really good roles. And guess what? Turns out, they wanted to be friends with me too. But it wasn’t long until they started making comments on my weight. They told me that because I was underdeveloped I looked trans, I was grossly skinny, I was like a bag of bones and they spread a rumour that I had Marfan syndrome and anorexia so no one wanted to be my friend. Cause who wants to be friends with a girl who has an eating disorder? They would humiliate me in front of others all the time about my weight. And people laughed. But I was so inexperienced in life I didn’t question them, I questioned myself. They ended up stalking me, following me to the bathroom to see if I’d throw up, and then they excluded me. \n\nI had diagnosed ocd and was seeking treatment but I found my new obsession: my weight. I started going on a caloric surplus. I ate way too much for my weight, and then it would always be unhealthy food. I was binge eating thinking this would make me curvier and I’d make friends. I refused to wear clothes unless they were baggy, and I didn’t have a healthy relationship with food. I didn’t eat to be healthy, I stuffed my body. My IBS was not fond of me for that one. Doctors wouldn’t take me seriously when I told them my concerns about binging. They said “well you’re not throwing up, so you don’t have an eating disorder.” \n\nI looked online for pills to make me put on weight, ended up losing weight because I wasn’t eating anything healthy. I was tired all the time. I just wanted to be accepted. \n\nI told my therapist my adventures of weight gain. She told me to just continue what I was doing. I then went vegan thinking I’d gain serious weight eating hummus all day. \n\nOnce I entered university, I refused to date. I couldn’t fathom the idea of a guy critiquing or seeing my body. One day my mom sent me a photo of how I looked before all this started. I saw I had nice wide hips but a tiny waist. Which is what I was trying to accomplish. I saw a happy girl who didn’t think about calories and beat herself up if I didn’t reach them. I decided to start seeing a nutritionist and switched therapists. \n\nTurns out I had body dysmorphia and binge eating disorder. But my doctors didn’t take me seriously because I wasn’t trying to be thin. \n\nI got into weight training and developed a healthy relationship with food. I even found a love for cooking. I saw my body as a vessel that keeps me strong so I need to look after it in order to stay strong. I wear the clothes I want and blocked everyone from my highschool years that hurt me. \n\nIn short, eating disorders are complex and its not black and white. If you find yourself struggling with food, be sure to contact a doctor who you can trust. It isn’t how it’s portrayed in the movies.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ppiib5/how_i_developed_an_eating_disorder_in_the/", "title": "How I developed an eating disorder in the weirdest way. It’s not always what you think - and how I healed!", "social_network": "reddit", "user": "throwaway283049", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 290, "down_vote": 0, "creation": 1631815273, "permalink": "/r/DecidingToBeBetter/comments/ppiib5/how_i_developed_an_eating_disorder_in_the/", "nsfw": false, "first_save": 1635438392.8036022, "replies_charged": false}