{"id": "t5_2tand_t3_oxij67", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "It takes life experience and introspection to discover that not all thoughts, feelings and emotions are ours. We have as much to do with many of these as we did with this body we were born in. A lot of times, these thoughts, feelings and emotions are as predictable to us as the weather.\n\nSo then, what are we? There is an I after all in that murky sea of all of that automatic stuff that is always there. Not that it is all bad. We can often be quite successful in all that automatic stuff. Yet at times, it clearly leaves something to be desired.\n\nWho we are is our commitments, our passions, our values and the actions that come forth from those. There clearer we are on what those commitments, passions and values are in the various aspects of our lives, the easier it is to override the automatic system. We have all done it before too.  For instance, we all woke up one day where our body and the voice in our head says to stay in bed. Yet we got out of bed because we had a commitment to be at an appointment on time or we had a loved one who was counting on us. (And we have all stayed in bed too at some point in time and dealt with the consequences) When we act on our commitments, passions and values it is fulfilling to us, even when our body and mind didn't \"feel\" like it.\n\nOften we are dictated by our \"feelings.\" You can hear it in the words we say: \"I don't feel like it.\" or \"It just doesn't feel right.\" and \"I'll do it later.\" (when I feel more like it)  Afterward we often ponder: \"Why *the hell* did I not: exercise, finish my tasks, behave in a nice way, leave the house on time, pay my bills, etc., etc., etc.\" Changing unproductive habits like that is an absolute bear for us, even though we are clear we want to change them. Yet, when we train ourselves, we discover that our freedom is on the other side of those habits and we all have the ability to change.  When we do not, we just do not know how yet.  Then it is time to get interested and discover. Especially today, there are so many great books and videos out there by smart people that help us take on ourselves: David Goggins, Rich Roll, Jesse Itzler, Joe Dispenza, Tony Robbins, etc.  Start and never, ever, ever, ever give up!!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oxij67/you_are_not_your_thoughts_you_are_not_your/", "title": "You are not your thoughts. You are not your feelings. You are not your emotions. So what are we?", "social_network": "reddit", "user": "epozzo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 689, "down_vote": 0, "creation": 1628042659, "permalink": "/r/DecidingToBeBetter/comments/oxij67/you_are_not_your_thoughts_you_are_not_your/", "nsfw": false, "first_save": 1635436701.3265927, "replies_charged": false}