{"id": "t5_2tand_t3_q1s4q9_t1_hfieyog", "creation": 1633459568, "origin": "t5_2tand_t3_q1s4q9", "height": 1, "replied_to": "t5_2tand_t3_q1s4q9", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AngelicHope", "text": "No one is misunderstanding op.  I'm coming out of a relationship that smacks of that energy and I was like you.  I let work and love define me..  The problem is that asking another person to supplement that energy would be you hurting someone you care about.  You're looking at someone special enough to hold a place in your heart and saying \"I want you to keep rocking life on the level you have been but carry the weight of my lack of motivation too\" and that creates resentment in the other person.\n\nHon you aren't wrong for looking towards better things but that motivation has to come from within.  Look at it this way.. if you're having trouble keeping yourself motivated how are you going to uplift your significant other when they are having a bad day if part of the job you need them to do is keep you happy?  I broke my toe.. my so left dishes and laundry for me to do.. I was supposed to be resting with my foot elevated and couldn't.  I still have pain in that foot to this day.  Little things are magnified within a relationship.\n\nWhy do you need a relationship to change?  What are you searching for?  Validation?  Join a couple of groups that are focused on the same interests.  Are you wanting someone to do it with?  Their are local chat groups and forums that allow you to connect with people in your area for everything from gardening, to reading groups, to running and weight loss to learning a skill/language.  Along the way you will likely find that when you aren't even looking there is someone keeping pace beside you, thinking that you are everything you wanted to find in someone else.\n\nFocus on you and you will find your life turning around.. don't get mad or take it personal.. you just don't understand because you need to have the awakening others are talking about.. you've got this.. honest.. just take a breath and find something to take a class about.", "permalink": "/r/DecidingToBeBetter/comments/q1s4q9/a_girlfriend_will_cure_my_depression/hfieyog/"}