{"id": "t5_2tand_t3_lazl22_t1_glsqzpo", "creation": 1612309201, "origin": "t5_2tand_t3_lazl22", "height": 1, "replied_to": "t5_2tand_t3_lazl22", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SRS15gyuto", "text": "We hear the term Free Will so much that it is cliche. It is rare that anyone ever really thinks about what that phrase means. I am 50 and only recently given it anything other than cursory thought. But think about what that phrase means: Free Will. I have come to realize it means I have the choice to react to my environment how I want to. I can choose to be excited  by the curve of a woman's shape, enraged by someone's post. Or, I can choose to react in ways that will benefit my wellbeing. It doesn't give me as much of an pleasure or adrenalin bump as lust and rage but...\n\nOne thing that is helping me is \"Every reaction is a conscious choice\". Every single reaction you have is pushed by your own will. Let that sink in... every feeling, every thought is a choice. You have free will. You can choose to give in to your urges or you can realize that the urges (like all human thought and emotions) are just a series of chemical reactions and you can choose your response.\n\nNo one makes you mad. You choose to be angered by their actions or words. \n\nNothing can stress you out unless you let it.\n\nIt is taking a lot of practice but I am learning to view my physical and emotional reactions to stimuli as chemical reactions. But I already know that some of the reactions are bad for me (giving in to the need for instant gratification like porn, masturbation, and cigarettes) while others like my child's laughter or my wife looking at me \"that way\" are good for me. I can CHOOSE how I react.\n\nAddiction is hard but one tool you can use against it is to realize that your conscious thought is in charge of your reaction. You don't HAVE to do that thing your hind brain is telling you it needs. Some addictions are harder than others but ones like this (basically a form dopamine addiction) are easier to fight with the knowledge that it is only a chemical reaction.\n\nYou are not alone but you don't NEED anyone else to do this. Others can help but you can do this by yourself. It is not a matter of convincing yourself that you can do it, you are a human being with free will, it is a fact.", "permalink": "/r/DecidingToBeBetter/comments/lazl22/25m_finally_kicking_my_worst_habit_to_the_curb_so/glsqzpo/"}