{"id": "t5_2tand_t3_pt8bz1_t1_hdvu4ds", "creation": 1632339950, "origin": "t5_2tand_t3_pt8bz1", "height": 1, "replied_to": "t5_2tand_t3_pt8bz1", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "daitoshi", "text": "Let me go over the list:\n\n1. Building habits & routines is difficult\n2. The only task lists that get done are the ones in your face *right now*\n3. Managing your own time is very difficult\n4. You have problems with finances, and have a hard time remembering what you've spent, impulse spending, and general self-control when it comes to money.\n5. You perceive both your successes and failures as something shameful - fearing the negative opinions of your family so much that you actively hide both.\n6. You feel like you're putting in a TON of extra effort to do what others can do comfortably, but at the same time view your accomplishments as something worthless or minimal.\n\n&#x200B;\n\nLet me make some extra guesses....\n\n* You probably tend to get absorbed into projects or into distractions and don't 'feel' time passing until some external stimuli shakes you out of it - even when you KNOW you're on a deadline.\n* You probably don't have a sense of time passing - you can't 'feel' when 1 minute, 3 minutes, or 5 minutes have passed.\n* It's difficult to estimate how long a task is going to take. Things that others say is difficult, you find easy - but 'boring' or routine things that others find easy, you find incredibly time-consuming or frustrating.\n* Despite dedicated effort you've had a ton of trouble with even the most basic and forgiving routines, like brushing your teeth every morning and night, going to bed at a certain time, or manually paying your bills every month.\n* You probably wondered if you were bipolar, or at least hypersensitive to emotions. \"weak\" or \"can't control myself\" is in your vocabulary, because *criticism hurts way more than it logically should*. The wrong words from the right person can easily spark a depressive spiral strong enough to want to die for a couple minutes.\n* But hey! Your emotions tend to bounce back quickly. You can go from being absolutely miserable to actually pretty ok in just a few minutes. It's like the emotions spark-flash and consume your whole brain, and then fizzle out. \n* Boredom is physically painful. It itches in your bones, in your muscles, like burrowing parasites or electricity jittering up your nerves. ANYTHING is better than true boredom.\n* You may have wondered if you have a brain injury or traumatic past, because your memory is just *that shitty*. You might forget what people said to you within seconds of them saying it, despite *knowing* you heard them. If someone else starts listing instructions with more than 3 steps, you'll probably forget most of them immediately.\n* You see yourself as highly talented, with great promise for success.... if *only* you could deliberately focus on something for more than a day at a time.\n* Actually, if the right kind of interest sparked, you could probably become proficient in *any* topic, because when something captures your brain, it consumes your interests entirely, making it hard to focus on anything else!  In that state, you can pick up skills and knowledge like they're being poured right into your brain.\n* Chores get left un-done for *days* and *weeks* longer than you intended, because even when you think \"Oh, I should do the laundry\", your body doesn't actually *move* and you end up just living around the slowly growing messes until someone is visiting or you feel too ashamed to bear it, and go on an angst-fueled cleaning spree.\n* You care *very much* about how people perceive you. How they *think* about you. The idea that *they think you're stupid/insecure/weak/unmotivated/emotional/bad* makes your stomach lurch.  Who is 'they'? They're anyone you want to like you.\n\nAnyway, if this all feels super familiar, maybe check out ADHD. It's less of a hyperactivity thing, and more of an 'Executive Function, Mood, and Memory' disorder.\n\nIf I missed the mark, sorry for the long post, and best of luck to you.", "permalink": "/r/DecidingToBeBetter/comments/pt8bz1/i_have_lived_a_relatively_formless_life_for/hdvu4ds/"}