{"id": "t5_2qh5i_t3_7pdew3_t1_dsi1n35", "creation": 1515638671, "origin": "t5_2qh5i_t3_7pdew3", "height": 1, "replied_to": "t5_2qh5i_t3_7pdew3", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bixxlixx", "text": "i don't mind you asking at all!\nIve been going to counseling on and off since I was eight (when I first started talking and writing about suicide) and in the last year I had a new therapist through my church (it's a huge church with an office of licensed counselors) and she really showed me how I was dragging myself down and I learned how to come out of my old mindset. I died and became a new person completely. \nA few general changes I had to make in my thought patterns were 1. I am not the only one who has low self-esteem or who is insecure, 2. I have to stop basically being an attention whore where I want everyone around me to tell me I'm great all the time and to never think badly about me ever, so I had to stop caring when someone didn't like me and I had to stop looking for people's approval, 3. I had to just sort of pull myself up by my bootstraps and force myself to wake up early and sleep consistently and exercise everyday and eat healthy meals, and 4. to recognize my inherent worth and to remind myself that I truly deserve love and acceptance and life and that i am the shit and that my opinion matters. \nAfter I realized these things, it was still difficult to get where I now knew I needed to be without medication but I didn't want to start that (I have a family history of depression and my father advised against it based on his personal experiences.) I grew up in a christian family and I had been an athiest for several years. I converted to christianity when I was 16, but it didn't really affect my personal life that much (I was (obviously) very emotionally unhealthy and I was making a lot of bad decisions that were hurting myself and those around me.) I had several break downs that spring and summer around my eighteenth birthday where i knew I needed to stop living the way I was living and that there was a better life for me in store but I just didn't know how to get there, and I would just have these bawling, dramatic knees-on-the-floor episodes where I cried to God that I needed him in order to change, that I needed supernatural intervention. Now, I obviously know that many people think that that doesn't work, or that religion is false hope, but you asked and I am being honest that it wasn't until I admitted that I was only human and not strong enough to save myself and that I wanted Jesus in my life that I had any real change in my mental health. I prayed that He would take my depression away and he did. I haven't had a single suicidal thought or tendency and I haven't wanted to self harm since I simply asked God to protect me from those thoughts. \nI do believe that there is true evil in this world, and that Satan works in our hearts like God does. I had to come to the realization that those thoughts that told me I was stupid, that I was unloveable, that I was ugly, that I was socially inept, and that I was better off dead, those voices that told me every day as i took the subway to and from school that I should jump in front of the train and end my life, the dead, numb feeling i almost constantly had, the temptation to purposefully burn or cut myself, all of that came from Satan and I was not strong enough to guard myself from it unless I had Jesus' love surrounding me and protecting me. I don't know how any spiritually aware person could ignore the obvious good and evil spiritual influences we come into contact with everyday. \nNow I am who I was created to be. ", "permalink": "/r/happy/comments/7pdew3/after_ten_years_of_battling_depression_suicidal/dsi1n35/"}