{"id": "t5_2tand_t3_fw56gq_t1_fmnbhha", "creation": 1586222318, "origin": "t5_2tand_t3_fw56gq", "height": 1, "replied_to": "t5_2tand_t3_fw56gq", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "justpeachblossoms", "text": "Absolutely seconding this. \"Why\" you move forward with anything in life - programming, music, relationships, your own health - matters for more than the details of what actually happens. Your why keeps you coming back when mistakes are made, things don't work out, or the high of success wears off. \n\nTo add onto this: I know a lot of successful musicians due to the scene I'm in and I can promise you they are as average and frustrated in their emotions as everyone else (or vastly worse off mentally, not going to lie). The money, fancy house, awards, etc. are a high that wears off after a while. For the ones who didn't have a strong \"why\" for what they did, they often grow to hate music (or life) or feel jaded and empty. For the ones who are still in touch with the \"why\" of why they create (an intrinsic satisfaction) they keep going and, along the way, sometimes create something amazing beyond the trappings of what looks successful. \n\nFor me it is easy to step away from comparing myself to those who look so successful or who have been so successful because I've seen firsthand how externally measured \"success\" is just a plateau. Life goes on afterward - and for the best creators I know, the external measures of success are just a nearly forgettable by-product of pursuing the internal motivation they have within themselves. \n\nYou say you don't deserve to spend money and time on yourself - but isn't that the best gift you could possibly make out of this life? Pursuing what brings you joy, regardless of what anyone else is doing? In the end no amount of external success or achievement will make you permanently happy - but what is stopping you from pursuing that contentment right now, if your happiness is just as valid playing music or creating a successful piece of software right now, as it would be if you had some half-forgotten awards on the wall? \n\nYou deserve to give yourself that endlessly renewing sense of satisfaction and growth - and comparing yourself to others whose circumstances, luck, and life are vastly different to your own robs you of that priceless opportunity.", "permalink": "/r/DecidingToBeBetter/comments/fw56gq/anybody_knows_how_to_deal_with_that_feeling_of/fmnbhha/"}