{"id": "t5_2tand_t3_p6zl9e_t1_h9gjqv4", "creation": 1629324192, "origin": "t5_2tand_t3_p6zl9e", "height": 1, "replied_to": "t5_2tand_t3_p6zl9e", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "OakAndAspen", "text": "1. **Be specific about your goals**. You will achieve this if you are able to say exactly the thing you want. For example: I want to be able to play my favourite song on the piano.\n2. **Divide the skill you want to learn into sub-skills**. \"Playing the piano\" it's definetly a skill, but you can't just throw yourelf into it mindlessly. In the piano example, you could make it like this: Learning chords, learning easier songs, playing by ear, improvise over a specific chord progression, learning all major and minor scales, etc. When doing this division, keep in mind the final goal!\n3. **Practice more and watch less**. Well I guess this depends on the particular skill, but almost everything you want to learn, you will do by actually doing it. It doesn't need to be perfect, but you must throw in the hours until you start comprehending the deepness of the skill you want to learn. With time, you will start making questions to yourself, and THEN it's when all the accessible resources (courses, tutorials, etc.) will really be useful. If you don't practice enough, all the info you get will enter one ear and go out the other ear (idk how to spell this sentence properly in english :P). Remember, *questions before answers!*\n4. **Trust the process**. You, and almost anyone, are clever enough to improve in the skill you want to learn to a really good level. We just don't put in enough time and thought.\n5. **Enjoy what you do!** If you enjoy what you do, you won't have any problem with putting in the needed time and thought, and before you realice you will be a lot better at the skill you are practicing.\n\nI think this is really good advice. I say that because I failed miserably at trying to learn a lot of skills (drawing, learning guitar, writing...), and now that I am more conscious of the points I said earlier, am now learning piano from half a year now and I'm absolutely killin it. Keep doing it, trust the process, and enjoy!", "permalink": "/r/DecidingToBeBetter/comments/p6zl9e/how_do_you_hone_a_skill/h9gjqv4/"}