{"id": "t5_2tand_t3_a1qy5h_t1_eas3zco", "creation": 1543576319, "origin": "t5_2tand_t3_a1qy5h", "height": 1, "replied_to": "t5_2tand_t3_a1qy5h", "down_vote": 0, "up_vote": 23, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "love_drives_out_fear", "text": "Hi there! You're not a waste of space - you're just in a bad place right now. The good news is that you have a very specific handle on what exactly is wrong, and you want to fix it. You're obviously a driven person based on what you've accomplished in the past few years in terms of driving, college, work, and running.\n\nI can't really speak to the weed or money issues, but I've been in the same place as you with binge eating and sugar addiction, battling it on and off for years starting in my teens. Like you, I always managed to keep my weight under control just well enough that the people around me didn't suspect a problem. I know you feel ashamed to discuss any of these issues with your wife, but I think this is an area that you two can really tackle as a team. You don't need to reveal the full extent of your problem at this moment if you don't want to - but I think you should let her know that you have an issue with sugar and that you need to come up with an eating plan that keeps you feeling full with nutritious food. Whenever I increase the fat content of my diet - full-fat yogurt, nuts, cheese, more meat, etc. - the sugar cravings tend to lessen, so that may be a good starting point for you. (I know you binge on fatty things too - I did too - but I think it's the sugar highs and lows that create the vicious cycle where you keep getting \"hungry\" even though you're eating fat.) I also highly recommend a daily multivitamin if you don't already take one - just that little habit of taking care of myself makes a difference in what I eat, and I think I have fewer cravings because I'm not missing out on random trace nutrients.\n\nMy husband knows that I struggle with sweets, so having him to keep me accountable is very helpful. Sugar literally makes me depressed and hate myself if I consume a lot of it (ugh those self-loathing binge sessions!), so I think starting with the food might get you into a better place to start addressing the other issues. I can't emphasize enough how much I think you should talk to your wife about it. If my husband were struggling with this, I would absolutely want to know so that I could support him!\n\nAlso congratulations on your second baby, that's so exciting! My husband and I are trying for our second now.  :)  I'm sorry I couldn't offer any insight on your other issues but I really feel you on the food thing. You can do this! Get your wife on board. If she's anything like me, she'll be really happy that her husband is opening up and being vulnerable.   :)", "permalink": "/r/DecidingToBeBetter/comments/a1qy5h/emotional_eater_smoker_spender_currently_hiding/eas3zco/"}