{"id": "t5_2tand_t3_hdanhf_t1_fvmcbxn", "creation": 1592815867, "origin": "t5_2tand_t3_hdanhf", "height": 1, "replied_to": "t5_2tand_t3_hdanhf", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Reisno", "text": "Actually getting a tDCS device is really easy, you can even buy it online, the cheaper ones are roughly $60-$100. I bought mine on an international site that likely doesn't ship to the states, so I don't know what sites you'd buy it on in the US but there are youtubers out there that review it and they would have links to where you can get it.\n\nThe device plus the conductive gel or saline solution (which you can make yourself but it is easier to buy it), the fitness cap, and the eeg cap were all relatively affordable. The eeg cap and fitness cap isn't an absolute need but it did make measuring your scalp and hitting the right points way easier, otherwise you will need someone else to help measure your head. All of this will set you back roughly $200 at least but for treatment that works it is a really good deal.\n\nI did tDCS on myself, my partner found me the research and I combed through it to make it work but it took some months and tinkering before that success.\n\nTranscranial magnetic stimulation is more available in the US than it is here, but I doubt most insurances would cover those sessions. You would need these sessions every day in the beginning for at least a month to experience any results, both with tms and tDCS. That will get very pricy with tms but you can do tDCS on yourself if you are very careful and you do your homework and check it thrice.\n\nI was 180lbs or so when I was prescribed Abilify and I got up to 280lbs in less than a year, every person I met that was on that med gained massive amounts of weight in a very short period of time, even kids. But when I got off the med the weight stayed for years until the tDCS worked on my depression.\n\ntDCS and tms don't work for everyone, but if you have drug resistant depression and you've tried god knows how many different pills and therapy options, then it is worth checking out.\n\nIt gets better from here, I know it is hard but it gets better.\n\nLastly, I have no idea how either of these treatments interact with pills, I detoxed off of all of the pills I was on a year before I started tDCS. Psychiatrists generally won't know much about TMS or tDCS either but I think they can write a referral for TMS, mine did.", "permalink": "/r/DecidingToBeBetter/comments/hdanhf/i_used_to_be_300lbs_now_i_am_down_to_roughly/fvmcbxn/"}