{"id": "t5_2tand_t3_qcrrvc_t1_hhi6261", "creation": 1634831976, "origin": "t5_2tand_t3_qcrrvc", "height": 1, "replied_to": "t5_2tand_t3_qcrrvc", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "zekthedeadcow", "text": "I set my alarm for when I absolutely must get out of bed to be on time.   So figure out what time that is.  For me it's 7:30 for leaving at 8.\n\nThen go to bed normally and try to get out of bed before the alarm.  I'm in bed usually by 10 sometime 12.  I wake naturally at 5am and lay in bed for another 30min or hour... so I'm up an hour and a half before my alarm goes off.  Last night was closer to 12 so I woke at 7:20 and immediately disabled my alarm and got out of bed to get to work on time.  I do everything I can to avoid actually listening to my alarm... I also have a very pleasn't sounding alarm that isn't jarring because thats no way to start the day either when you already are late :)\n\n&#x200B;\n\nOne tool I started working with after listening to a UX designer is creating 'user stories' and 'experience maps' for my day.\n\nI was actually able to make some very small changes that drastically improved my morning which rolled into the next tasks.  For example.  I make some tea the night before and keep it in a quality vacuum insulated thermos so it's still warm the next morning.  I have that and some fruit next to my keyboard so I have something nice to look forward to immediately after waking.\n\nI really struggle being motivated to exercise so I bought a VR system be be active while gaming.  Now I moved a 30min session of beat saber to right after having that breakfast and I do another hour long one after work.  This did a couple things... it gave me something fun to do to get me to get out of bed as soon as I wake up and it also made me add a lot of genres I normally didn't listen to my music library like kpop and jpop ... because honestly it's fun dancey music and the words don't matter when I don't understand the language.  So I'm doing regular cardio and getting an occasional 'highscore' to start and end the day.... while being exposed to new-to-me music.\n\nI am also currently redoing my commute.  I am 30-40minutes one way. There are a couple intersections that are just infuriating ... and I noticed that last Tuesday I had already been in or witnessed 5 near-misses or road-rage incidents this week.  So I am avoiding freeways and taking the side streets in.  This may only result in adding variety to my commute route but if I can avoid one intersection in particular it makes it so my morning isn't started in a rage.  I would rather be in several low speed accidents every year than feel angry every morning :)", "permalink": "/r/DecidingToBeBetter/comments/qcrrvc/i_always_feel_tired_no_matter_what/hhi6261/"}