{"id": "t5_2tand_t3_qctkw3_t1_hhlkxh8", "creation": 1634894093, "origin": "t5_2tand_t3_qctkw3", "height": 1, "replied_to": "t5_2tand_t3_qctkw3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "crusafo", "text": "The world is going through hard times, and the pandemic has put a lot of people through different forms of mental illness: depression, anxiety, anger, dissociation, emotional/mental withdrawal, apathy, delusion, paranoia, etc.   \n\n\nI've been socially isolated for over a year and a half, and its taken a toll on my mental happiness.   \n\n\nPrior to the pandemic I was struggling with feelings of worthlessness and apathy, I did manage to overcome it through hard work before the pandemic, but the pandemic and all the difficulties have caused me to backslide a bit.  \n\n\nSounds like you've backslid too.   \n\n\nIt's okay. That is okay: its okay to not be okay. There is this prevalent lie in all corners of society that you *need or should* be happy and satisfied with your life all the time. That is advertising for ya. \"Feeling bad? Here, ask your doctor about this happy pill, (*side effects may include nausea, pregnancy, blindness, deafness, leg cramps, rectal bleeding, and weight gain*) and everything will be okay again!\" (/s just in case anyone doesn't realize I'm speaking satirically).   \n\n\nI don't know you personally and can't speak to your situation, but one thing I do know is something is bustin your chops, a thorn in your side, a pain in the neck. That something is looking for you to acknowledge it, and won't go away until you do. In fact the echoes will just keep reverberating louder and louder until whatever \"it\" is, rattles you to pieces.  \n\n\nIt could be grief, sorrow, anger, frustration, betrayal, self-hatred, a combination of all that and more, etc., but whatever it is, you need to face it to get the upper hand. Facing it can mean just writing it out in a journal, talking about it to a *trusted* friend, seeking therapy, doing art, meditation, or the simple act of letting go. Or it could also mean the difficult, tedious, careful act of scraping together the broken pieces and breaking out the proverbial super glue and starting put things back together.  \n\n\nBe honest with yourself, be humble/gentle with yourself (and others), and have faith that you have the power and strength to survive the crisis and come out stronger on the other side. No one can do that for you, you have to have the will, the desire, the discipline to do it for yourself.  You don't have to go by anyone else's schedule, you can go at your own pace. You don't have to live up to anyone's expectations. You don't need anyone's approval. There are no guarantees, become who you are.  \n\n\nThere is only one thing in this world that never changes, and that is that *everything changes.* This too shall pass. To help it pass quicker, you can start making some small changes yourself -- do something a little different, anything different, and build upon small changes until they are medium sized changes, and eventually it will build up to really big changes in your life.   \n\n\nYou are a stranger to me, but I can empathize what you are experiencing, since it sounds similar to what I've experienced at an abstract level. I am 100% committed to breaking free of the dark cloud that's been following me for almost 2 years now, and if I can do it, so can you. If you can do it, so can I.   \n\n\nBe at ease kind stranger, breathe in, and relax as you breathe out and let the tension drain from your mind. Take it one moment at a time, one day at a time.", "permalink": "/r/DecidingToBeBetter/comments/qctkw3/how_do_i_start_being_a_good_person_again/hhlkxh8/"}