{"id": "t5_2tand_t3_omy1xn_t1_h5q6qkr", "creation": 1626678681, "origin": "t5_2tand_t3_omy1xn", "height": 1, "replied_to": "t5_2tand_t3_omy1xn", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Black_Cockatoo", "text": "As someone who stopped smoking and drinking over 11 years ago, and who is also into music making, good on you! You can do it!  \n\nHere's some advice:\n\nSo... how social are you? \"Smoking socially\" is a trap, unless you're an isolated introvert and only catch up with people every few weeks or months. But even then, why bother smoking every few weeks? I mean, you've made it that far, so why fuck it up? \n\nSeriously, don't kid yourself, just stop. The withdrawals, the yearning for \"just one smoke\", dealing with that empty hole, and the habit that constantly tries to pull you back in... pushing through that is the cost of admission to a better life. All of those addictive hooks that seem embedded deep in your soul, well they stop having any meaningful impact a little bit further down the road, and they eventually disappear altogether. You've just got to be strong enough to carry yourself to that point. 11 years later, where once I would smoke a-pack-a-day, now I can't stand being around smokers, it's fucking gross.\n\nIf you're a musician, you probably hang out with a bunch of other musicians, yeah? Are drinks and ciggies a staple of the band practice session? You might have to remove yourself from that for a while.\n\nAlcohol... it's poison. It turns people into blithering idiots. It turns people violent. It clouds people's judgement. It poisons just about every part of a person's body. It destroys people. It destroys innocent bystander's lives. You're making the right choice.\n\nIf you are dependent on alcohol, then seek professional advice; if you aren't a chronic alcoholic, then cold turkey will be fine. Personally, I was in the binge drinking category. I would go a few days between bouts of party-mode drinking with \"the mates\". I stopped cold-turkey with zero repercussions. But I also had to remove myself from those drinking circles. When quitting drinking, much like deleting facebook, you soon discover who the fuck cares about you. \n\nNow for the good stuff (edit: aside from all the wonderful mental and physical health benefits). How much money are you spending on smoking and drinking? Where I'm from, cigarettes are mad expensive these days. Guess what? After a few months, that all adds up. You can now use that money to reward yourself with all kinds of music gear. Fuck yeah!\n\nGood luck to you, dear stranger. Keep reminding yourself why you're doing this. Be ready to mentally slap yourself when your habits try to take over. Life will open up for you down the road if you keep this promise you've made to yourself. \n\nPeace.", "permalink": "/r/DecidingToBeBetter/comments/omy1xn/ive_decided_to_treat_my_body_as_the_fucking/h5q6qkr/"}