{"id": "t5_2tand_t3_pjyb44_t1_hc0qkw6", "creation": 1631073943, "origin": "t5_2tand_t3_pjyb44", "height": 1, "replied_to": "t5_2tand_t3_pjyb44", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "onRedWinds", "text": "Hi, having been an adventurous college grad who went abroad, the beginning of your story had me jealous - wow your projects, especially the off-grid homes, sound so interesting and made me wonder how you got there.  \n\nI want you to know that the person who got that high paying job and went abroad and dealt with every single turn in life was YOU. That strength that made it possible is in YOU. You have not suddenly turned into another failure, and your current situation does not define who you are.  I learned this during the pandemic, I think I had low self-esteem around my own discipline around working out when all the gyms shut down and set up accountability buddies for myself. But as people dropped or flaked from workout sessions, I realize the motivation and strength is inside of me, even setting up accountability buddies  came from ME. So give yourself credit for asking for help, adapting to the curve balls, and getting to where you are.\n\nIt does seem like the pattern thats tripping you up might be your coping mechanism around drinking.  I don’t have much experience with that but I’ve heard that professional help and a support network is important, as well as developing alternative healthy coping habits so that when life inevitably trips you up again, you don’t fall back into that hole.  I would make that a priority.  You need to show yourself that you won’t just turn into a disaster every time you meet hardship and failure, that you have more in you and it’s a redemption arc in the making! \n\nThe rest as to where to go in terms of school or work etc. is really dependent on you, no one else would know the answer. School might lead to your dream career, but you might do well on a coding or design bootcamp (I did). You can research, ask people about their experiences, and then take that leap of faith. But I want you to be strong for anything you choose, and that starts with strong mental health even in bad stressful situations.", "permalink": "/r/DecidingToBeBetter/comments/pjyb44/how_do_i_get_back_on_track_after_ten_years_of/hc0qkw6/"}