{"id": "t5_2tand_t3_kb88ch_t1_gffoz8o", "creation": 1607717474, "origin": "t5_2tand_t3_kb88ch", "height": 1, "replied_to": "t5_2tand_t3_kb88ch", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Tibujon", "text": "Flow by Mihalyi Csikzentmihalyi \n\nYou really need to understand not only the state of flow, but how to trigger a state of flow. Tbh it can be summed up in a pretty [simple graph](https://cdn.psychologytoday.com/sites/default/files/field_blog_entry_images/flow%20graph.jpg)\n\nThe problem with starting something new is it is a high anxiety experience as you are overwhelmed with a challenge level much higher than your skill level. First, you have to accept that you are going to bad at something before you get good which is a huge hit to your ego, but that is ok. Second, you need to challenge yourself, but not get in over your head. Start small and work your way up. Many people get bored with “the fundamentals” but they really are important. The best way to make these beginner exercises which might push you back into boredom due to a lack of challenge is to establish a method of gamification. Starting something new is also hard because you can just be sort of apathetic about it. It is low stakes if you end up just quitting because you didnt really invest that much time into so who cares if you quit. I think you should first do an analysis of what kind of things you think you would be good at but that will also benefit you. You will quickly burn out if you are not getting back as much as you are putting in. This is also tricky because most people pick up new hobbies not for intrinsic motivation but for extrinsic rewards which are much much harder to actually get. It is like every guy who picks up a guitar to get girls and then it spends the next 20 years not be played. Chasing external rewards will not provide a flow experience, you have to find strong intrinsic motivation. So if you pick up a guitar because you love music and need an emotional outlet, you are much more likely to stick to it than if you think it will get you fame, money, girls or whatever else people chase. Sadly we live in a world that is all about instant gratification, you need to start thinking long term. If you want to make music, accept you will be doing so for the rest of your life, internalize it as part of your identity, but DONT expect people to care. For the most part, especially prior to mastery, they simply wont even your close friends and family no matter how excited about it you are.\n\nHonestly the book can revolutionize the way you do just about anything in your life and it provides a clear roadmap for how to turn most of your daily activities into flow experiences (not specifically but abstractly).", "permalink": "/r/DecidingToBeBetter/comments/kb88ch/a_book_about_how_to_enjoy_learning_new_skills/gffoz8o/"}