{"id": "t5_2tand_t3_pkc48s_t1_hc2js4q", "creation": 1631115753, "origin": "t5_2tand_t3_pkc48s", "height": 1, "replied_to": "t5_2tand_t3_pkc48s", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "astralmelody", "text": "Hey! First of all, I'm sorry you're feeling this way – i know it's hard to watch others succeed and know there's no way to acheive that same success for yourself immediately. It doesn't have to happen immediately though!\n\nI've found that what helps is really taking a look at the things that make you jealous – whether it's seeing your friend work out, someone's cool computer setup, nice meals someone's making in their kitchen all the time, or whatever it may be – and figuring out how to do them yourself. Sure, there's gonna be some things that are too expensive, or simply just not in your range of capability right now. That's okay – you can make most things accessible to you and your needs, whether that means doing free workouts on YouTube instead of going to the gym, or learning a few go-to recipes for meals or treats, hitting up a thriftstore or a TJ Maxx for some new wardrobe inspiration, etc.\n\nWill it seem like you're copying your friends/family? Probably. But that's *completely normal* *–* we learn what things we may like by observing others around us. Thats how human people learn about things. If anything, you saw that it was making them happy, and wanted to share in that joy. If someone's gonna get upset about that, then they're not really your friend.\n\nOnce you start doing the things you've been jealous of, one of two things is gonna happen:\n\n1. You're going to learn how much hard work goes into these things, and since you've done similar work, you'll appreciate others' work that much more.\n2. You'll realize you hate the thing. That it doesn't work for you or make you happy. Which is fine! Now that you know it's not for you, someone else's success in that thing is much less of a threat to your own joy in doing it – because you *don't* get joy from it. So it doesn't even matter\n\nThe biggest thing to realize is that the things you think aren't achievable for you *can be*. You might have to modify the strategy or try something a little bit different, but *you can do those things too*! \"Doing\" IS difficult, but that's what makes things worth it, if that makes any sense? Maybe try modifying to make the \"doing\" of the thing more accessible. Think of it as the easiest way to actually do the thing. It's a single step up from the \"easy way\" of not doing the thing at all – it's not too far of a leap.\n\nAs an example, I've ALWAYS been jealous of people who work out. I've tried and tried and tried to get into YouTube workout videos and gym routines with no luck. I'd end up being sore for days, and then after those days, I didn't want to get back into it just to repeat the cycle. So I started walking. Just taking small walks around the neighborhood. I could just open my front door, listen to some cool music, and walk around for as long as I wanted to.\n\nI did fall out of this habit, largely because it got *hot as shit* outside and working the rest of my day all sweaty was... not ideal. After a few months, I started feeling bad about myself again, so i sucked it up and got a gym membership. Just to go walk on my lunch breaks, regardless of the weather. *I have gone every single day since*. And it wasn't even hard bc I've been building the framework for the habit for so long, even if it wasn't actually happening. Does the fact that I pay for it make me more motivated to go? Maybe. But if it works, it works.\n\nMy point being: **Sometimes a plan that you think will work doesn't. You've gotta hold onto your goals, and keep modifying your strategy until it works.** And maybe the plan that you thought wasn't helping actually does, in the long run.\n\nI completely understand feeling like you're not capable of doing what others do bc you're not doing it. Here's a reminder that you can do a lot more than you think you can. Take the one little step up, and then the next step is another little step away, you know?\n\n(sorry for writing a whole essay, I just know this feeling entirely too well.)", "permalink": "/r/DecidingToBeBetter/comments/pkc48s/me_being_envious_of_literally_everyone_in_my_life/hc2js4q/"}