{"id": "t5_2tand_t3_pkc48s_t1_hc45ay0", "creation": 1631140791, "origin": "t5_2tand_t3_pkc48s", "height": 1, "replied_to": "t5_2tand_t3_pkc48s", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "axidentalaeronautic", "text": "Keep in mind that this feeling you’re having is totally NORMAL. And reasonable. And a good sign, in that it shows you have a social life and “social thermometer” (you can see and adequately appraise the actions of those around you as being good or bad, constructive or destructive). \n2 things: A) a sense of loss, and B) a fear of loss. \nA) youre seeing others around you “gain ground,” socially speaking. They’re accruing “social capital” by their actions. You sense that you’re falling behind, or not keeping up. Good-that’s normal, you should be having that feeling.\nB) fear of loss-somehow the ‘gains’ of your peers are being perceived as a loss for you-as though their success is taking oxygen from the flame of your own success. This is more problematic but not odd at all. Humans naturally have a sharp sense of being “screwed,” “played,” “stolen from,” “cheated.” Etc. It’s loss aversion. \n\nSee the success of your peers as a gain. They’re your friends right? See what they’re doing and emulate them. You get to ask them advice. When you don’t have friends/a peer group, you’re on your own and have to create your own way forward. Since you still have friends/peers, collaborate with them to find your own means for finding success. \nYou’re not *using* them, you’re *collaborating* with them. You’re growing together. Mutualism, not parasitism. It’s really a great opportunity.\n\nThat’s all sound stuff, and fairly feel good. Here’s the bitter part of medicine, though fortunately you already  see it coming: you cannot sit around watching shows all day and lollygagging about and hope to find meaning, success, happiness, or anything of that nature. Don’t misunderstand: Work won’t make you happy either, nor will passion or success, but passion, success, and meaningful work are far better than any other alternative. The drudgery of meaningless work… *shudders* there are few torments worse than waking up and doing the same meaningless mind numbing and self deprecating thing EVERY DAY for minimum wage. \n\nYou will have to [start](https://www.amazon.com/dp/B07LC9KDP5/ref=cm_sw_r_cp_awdb_3C1SS7A4SZ927D2KMGWM) putting aside your shows and games and little things like that. Maybe not completely, but enough to where they aren’t eating up your time, and attention. \n\nFill your day with better things. Become selective. \n\nWho do you want to be like? Are you proud of you? When you meet other people, who do you want them to see? None of the good things you want for yourself can be accomplished without work, and without changing what you do today to become like the person you want to be. \n\n“When I was a child, I did childish things. Now that I have grown to be an adult, I put away childish things.” \n\nMy advice and anyone else’s is ultimately never going to be as helpful as the advice you give yourself. That’s right, you’ll have to give yourself advice. You know what you want, where you are, and what specific things are holding you back, and what you need to do about them. It’ll take some time and practice to get good at seeing these things and taking smart steps to deal with them, but you can do it. you definitely can. Its totally doable, and gets easier and more pleasurable as you go. \n\nYou begin to take pride in yourself and walk a bit straighter, maybe with some pep in your step and no waver in your voice and eye contact with anyone who thinks they can meet yours. \nBut beyond all of this is a simple fact: there’s a way to do it, take a small step today-something you know you need to do-and don’t look back. \nYou are [Orpheus](https://youtu.be/RhaepLsP5eg) emerging from the underworld. You need not doubt and look back. If you stumble, don’t look back. There’s nothing for you back there. \nIt’s all you, and you got this.", "permalink": "/r/DecidingToBeBetter/comments/pkc48s/me_being_envious_of_literally_everyone_in_my_life/hc45ay0/"}