{"id": "t5_2tand_t3_pkc48s_t1_hc4cw17", "creation": 1631144509, "origin": "t5_2tand_t3_pkc48s", "height": 1, "replied_to": "t5_2tand_t3_pkc48s", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "prodbyNaTu", "text": "Hi, I’m 21 and I’ve been through the exact same situation for such a long time and it has affected my past relationships. ive gotten through this to a point where I’m enjoying my life and the first thing is to just learn to live and do what you like to do. And there’s an idea that if you give out and show fortune to others you will reap the rewards. I think that we get into states of thinking like this because we feel like our lives are not entertaining enough to express ourselves but in fact it’s that thinking that stops us doing and being exactly what we want. My issues came around when my brother had a lot of success in his career and it affected me in a way of sadness that I hadn’t done anything I wanted and had real conversation with friends of things I’m proud of. But I’ve learned to live my life how I want to and be positive with everyone I know, and I’ve also been putting effort into my friends, giving them time that helps socially and vibing with theM.\n\nAnother thought that I have is that, you also sound like a creative person since you like art, and I also am entering myself into the creative world through music producer side of things which involves creating beats. This is all creative work and is very hard to see results of what we’re used to and this lowers our self esteem. The one thing I would say is to focus on being what character/vibe you want, so that you can find yourself, because creative people find it easy to vibe on their own, but social anxiety comes about and is rectified through understanding to not deep everything and live like a happy creative human being. \n\nI just rambled a bunch of shit but maybe this helped in any way \nNate", "permalink": "/r/DecidingToBeBetter/comments/pkc48s/me_being_envious_of_literally_everyone_in_my_life/hc4cw17/"}