{"id": "t5_2tand_t3_qfjsmz_t1_hi1xrvw", "creation": 1635207330, "origin": "t5_2tand_t3_qfjsmz", "height": 1, "replied_to": "t5_2tand_t3_qfjsmz", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "max-bants", "text": "It's rough, when you're a guy, there's a number of things you can do to basically make long-term investments to make gains in your **broad** attractiveness to women. Careers, education, fitness, building confidence, accruing wisdom, power, etc. And whilst these things are nice when a woman has them, they don't scale anywhere near as fairly as with men. \n\nObviously, nature's twisted solution to the imbalance is to make women highly attractive around the ages of 18-25, just naturally. So that men who invested and made those gains pick them for a long-term relationship. Whereas men in the same age group are basically a joke by comparison, it's a well researched and understood fact.\n\nBut you're by no means 'past it', just like it's not impossible for a 19yearold man to be incredibly attractive to most women. Indeed, it's highly possible, it just isn't where the speartip of their advantages/affordances are in time. You can invest in yourself, and in fact, you absolutely should. You should consider doing so as necessary as caring for a child you have - it isn't optional. You exist, you're alive, you deserve to be supported by the power in your life, even if that power is somewhat ironically yourself. \n\nAre you fit? Is your diet as good as it could be? Do you have any skills that would be considered attractive? If so, how refined are they? Could they be made better? And of course; do you put yourself in social situations where your qualities, and their **trajectory** can be seen, and desired?\n\nEssentially, your job, as is everyone in every aspect of everything they do's job; is to articulate yourself. Articulate your spirit and form, articulate your femininity if you're a woman, articulate your masculinity if you're a man. You may think i'm talking woo-woo shit, and this line of thinking is sure as fuck 'problematic' these days, but it's really my most deeply held and sincere belief. We exist in this universe to refine things aesthetically. In doing so, the universe appears, for whatever reason, to favor us when we do, and grant us more resources, be they literal, emotional or spiritual. In doing so you engage in a ritual that crushes your ego into the shape it's supposed to be; a simple torch in the darkness, rather than a gambling-addict constantly trying to 'roll the bones' and hit the jackpot where you suddenly discover you were secretly a latent genius/savant all along. It's all about tuning your form and pattern into this station.", "permalink": "/r/DecidingToBeBetter/comments/qfjsmz/i_struggle_with_never_being_chosen_how_can_i/hi1xrvw/"}