{"id": "t5_2tand_t3_g0pikm_t1_fnb0szn", "creation": 1586807235, "origin": "t5_2tand_t3_g0pikm", "height": 1, "replied_to": "t5_2tand_t3_g0pikm", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ShadowHunter173130", "text": "21m here who did the same at New Years, I planned to kill myself on New Years but I didn’t knowing I didn’t fully try and hated the world and my existence for the circumstances that I could not change, I didn’t really focus on the things I could work towards changing, I just threw in the gloves and let nihilism and pains of the world beat me in to the ground before even getting up in the ring and fighting back for myself and those around me. \n\nI can tell you that fighting and getting better at it has been the most rewarding thing in the past couple of months. I have found/rediscovered god to be in my corner after being faithless for most of my life despite a Christian upbringing. I have found what my purpose is, to be how I want to see the world, to leave the world a better place than I left it. I have peace knowing any day can be my last day and I would be out of this painful at times Satan dominated mortal realm and reunited with god. \n\nFocus on what you can change today, whether that be your body, your attitude towards life, your career and habits, building connections with friends and family even significant others. Being so inwardly focused with a billion thoughts per second screaming slit your throat jump off a bridge run onto the tracks end it you worthless pos, it’s hard to get out of your mind but after some mental framework changes to create a stronger mind body connection I was able to get out of that mess, if you want tips I could give you a novel worth of tips to keep you productive and active, don’t want to write a novel in this thread but I’d be happy to reply to this if you would like. I can help keep you accountable.", "permalink": "/r/DecidingToBeBetter/comments/g0pikm/i_21f_have_been_depressed_for_most_of_my/fnb0szn/"}