{"id": "t5_2tand_t3_qf8lbg_t1_hhzkfbp", "creation": 1635171385, "origin": "t5_2tand_t3_qf8lbg", "height": 1, "replied_to": "t5_2tand_t3_qf8lbg", "down_vote": 0, "up_vote": 15, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "labdog", "text": "Well, sometimes I also can do projects for a month in a day. It happens very rarely though. It's a kind of glitch, non sustainable and I can't count on it.\n\nWhat you CAN count on is good organization. Set yourself precise times for doing things. Small parts, not whole projects, because when I set myself deadlines for projects - it almost always fails.\n\nWhat did work was \"I get up at 6, start working on a part at 8 until 12, repeat every day until finished\". And when's 8 - you CANNOT do anything else except working on whatever you have planned.\n\nOf course it doesn't always work, because there are OTHER PEOPLE who have better ideas what you should be doing with your time. And you can have bad diarrhea at 8 or 10. Or IDK, a blackout, no power, no Internet, broken PC / phone / router. Or... just you... you know. Not your day. But that's PAIN. And pain is useful. It makes keeping to your schedule more automatic and effortless. You just know that you have shit to do at exact time and not doing it at the time will hurt.\n\nThat's the first half of the problem solved. To solve it all - you need to LIMIT the work time to a value within your sustainable capability. Well, Henry Ford figured out once that people should work 8 hours a day. But it was a very specific physical work at Ford factories. Not all work can be done efficiently for 8 hours straight. Ford optimized his factories and he made it right. It worked perfectly earning a lot of money and practically building the capitalism as we know it.\n\nBut important thing is that a century has passed. We have plenty of new kind of works, very different from old Ford production lines. They require separate optimizations. And the full optimization will be personalization.\n\nSo FOR ME programming work is max 6h / d (1h break not included). Sometimes I'm perfectly capable of doing 12! But it is NOT SUSTAINABLE. I cannot plan my project like that because they will fail miserably. I tested it hundreds of times, so no reason to make the same mistakes I made.\n\nIf you can do a specific kind of work for 3h a day EACH DAY - then go for it! In a month - you will have the most work done! Way more than if you worked longer every day. You will be less tired and more satisfied with the work done.\n\nEverybody knows that Bojack quote \"but you have to do it every day\".", "permalink": "/r/DecidingToBeBetter/comments/qf8lbg/i_finished_a_project_that_was_supposed_to_take_a/hhzkfbp/"}