{"id": "t5_2qh1i_t3_pi3u0i_t1_hbn34r4", "creation": 1630807935, "origin": "t5_2qh1i_t3_pi3u0i", "height": 1, "replied_to": "t5_2qh1i_t3_pi3u0i", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PlotsOfAFrog", "text": "I attempted a few times, but the closest I got was nearly overdosing on sixty aspirin and twenty melatonin. I had severe mental illness that I had been hiding so it just got worse, and when I got in a minor fight with my mom I just felt so worthless and if I didn’t have my mom I didn’t have anyone. So I scribbled a note and took the pills. My mom shook me awake and was so scared she came across almost mean, and made me sleep with her. I threw up four times until at one in the morning my mom drove me to the hospital. I arrived and my ears were ringing and it just felt so surreal. I had to change into a I think yellow hospital gown- I just know it was a different color and a brighter one because people who are there for suicide attempts need to be watched and you know make sure they don’t leave before they are checked out and stuff ig. Anyways the doctor said I should be fine and be home in a few hours they just had to test my blood to make sure I was okay. So they sent the blood test to a different hospital and waited a few hours for it to arrive, and apparently the aspirin levels were a lot higher than the doctor has expected to they loaded me into an ambulance which was kind of traumatic because I had to be strapped down and stuff and I watched the outside world from the windows at the back of the ambulance. That day was the only day it snowed that year where I lived, and I saw it through the ambulance windows. I arrived to a more high tech hospital and they set m up and gave me an iv and basically I just had to wait until the iv put enough fluid in me that the aspirin levels dropped or something. I finally got home hours later and my dad came home from a work trip two days later. They took me out of every extra curricular activity I was taking, worrying I was over stressing myself, and set up more therapy. Two mental hospital trips, one intensive outpatient, and years of therapy and medications later, here I am. I survived and I’m thriving.", "permalink": "/r/AskReddit/comments/pi3u0i/suicide_survivors_of_reddit_what_is_your_story/hbn34r4/"}