{"id": "t5_2tand_t3_nwst48_t1_h1cdv7a", "creation": 1623369302, "origin": "t5_2tand_t3_nwst48", "height": 1, "replied_to": "t5_2tand_t3_nwst48", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Gwiz84", "text": "Don't be sorry, you can say whatever you want here. :)\n\nI get where you're coming from and I think the coping mechanism you have now is more common than you think. Most people who feel like they don't belong probably wants to flip their story into a positive one in some way, whatever story they tell themselves. Whether it's being a genius or a messiah or some other unique role (not saying you're not talented or smart, you probably are).\n\nI would say, ignore all the diagnosis crappola. It's getting out of control that whole concept, don't let some sort of definition of your diagnosis limit you in any way. The most important thing in the world is what you actually believe in, belief is much stronger than you think. If you believe you have asbergers you will effectively tell yourself that story, and put yourself in the prison of that definition. Don't actively search out something that will limit you as a human being, or stop you from doing anything.\n\nIt sucks that you can't afford therapy, because I think you could really benefit from it. The fact that you are aware of your own coping mechanisms is a HUGE step, most people spend years just realizing that they are bullshitting themselves. But I'm telling you, you're gonna need outside help (a good therapist) to help you get further.\n\nI've spent years of my life trying to \"fix myself\" and not made much progress, the point where I started to make real progress, was when I finally started therapy with a really skilled psychotherapist. Plus I made changes to my life, like killing bad habits (smoking too much weed every day), and the usual ones you've heard about a thousand times (excercise, eating healthier foods, getting out more, socializing).\n\nThe thing is, it's extremely hard for us human beings to view ourselves honestly, or to see ourselves as who we really are. We have all sorts of things getting in the way, like ego, lies we tell ourselves to cover up our negative qualities and so on and so forth. That's why you need other people to help you through your most important issues.\n\nReading your comment I have no doubt in my mind that you can completely change your life, you are very aware of yourself so you've taken the first steps. Now you need to find the money for therapy and invest in it, so you can take those final steps to a really positive change in your life. I hope you find a way to make it happen or at least seriously consider it, because it can be life changing. If you do it, make sure you find one that comes recommended from the get go. Because sadly there are a lot of not so good ones out there.\n\nWish you all the best my fellow human (and yes you are one of us) :)", "permalink": "/r/DecidingToBeBetter/comments/nwst48/i_want_to_move_forward_and_rebuild_human_contact/h1cdv7a/"}