{"id": "t5_2tand_t3_pkc48s_t1_hc3fse4", "creation": 1631128929, "origin": "t5_2tand_t3_pkc48s", "height": 1, "replied_to": "t5_2tand_t3_pkc48s", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Comfortable_Goose_42", "text": "Oooh went thru similar stuff with my therapist recently.\n\nSaid that my being a perfectionist was why I attacked myself so much. That I did not see the good in what I did because it wasn't perfect.  Then he said that I wasn't starting stuff because I was afraid it wouldn't be perfect.\n\nThen he said I should be okay with not doing anything for a while. That regrouping, grounding, relaxing is all valid and is an important part of being a functional human being.\n\nThen the last thing he said was to reevaluate my goals. My career goal was something that I am too old to finish school for and not in the physical shape for it.  And I keep beating myself up for -- well, you know what? I won't even say because that is not helpful for me.  But he said don't strive for something you cannot do, and won't come true because you are just setting yourself up for hurt and pain and disappointment. (And then I guess people set those goals because they KNOW they will not make them, and then can't feel as bad.)  But do set reachable goals.  And some can be difficult, and take a long time to complete, but ones that you can reach and feel good about.\n\nHe said set goals that I can look back on in five years and feel proud that I did them.  Not look back in five years at all the things I wanted but could not get.  Literally a week and a half after that session, I reached out to a volunteer agency in my new, chosen field, and promptly got a pretty solid position with them, doing what I do best and now hope to do for the rest of my working life.  I cried when I got my first assignment last night. \n\nSo maybe some of those points will put your head in a better place.", "permalink": "/r/DecidingToBeBetter/comments/pkc48s/me_being_envious_of_literally_everyone_in_my_life/hc3fse4/"}