{"id": "t5_2tand_t3_pkc48s_t1_hc40mbq", "creation": 1631138563, "origin": "t5_2tand_t3_pkc48s", "height": 1, "replied_to": "t5_2tand_t3_pkc48s", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "actualhumanfemale2", "text": "I have struggled a lot with this in life, including feeling really apathetic about artistic pursuits. have found a multi-pronged approach worked well.\n\n1. Success is built on smaller success. Phobias are built on avoidance. I got to a point where I got so mentally trapped I couldn't get out of bed till 8pm and was struggling to breathe every day due to performance anxiety.\nI started making tiny - and I mean tiny - goals like \"get out of bed before evening\". Whatever is at the edge of comfort, it's different for everyone. It's a tiny pebble but a couple of years later I have a great job, ran a marathon, and have ticked off a lot of things on my bucket list. The key is a sense of self-efficacy, and that has to be earned through action. Exercise is a really great habit to start with, it supports everything else.\n\n2. \"Everything has been done before/better\" - you don't need to do it the best. If it's worth doing, it's worth doing badly. Your achievements are the sum of you **completed** works. Also every artist/creative in the world has basically the same problem - should we all just give up? Should you stop making pancakes because they aren't the best in the world? Should flowers stop blooming because they aren't the single most beautiful rose? \"Struthless\"''s YouTube Channel helped me with this a lot. \n\n3. Forgetting about societal bullshit. \"Status Anxiety\" by Alain de Botton helped me with this one. Many people genuinely treat other people like shit because they lack completely morally arbitrary social symbols - money, looks, material goods that happen to be valuable or adaptive in our current environment. By letting your own feelings of inadequacy run rampant you're passively (and probably actively) contributing to the system of eternal consumption, vicious and isolating hyper-competition, focus on the superficial and general degradation of compassion and community in the world. Every time you play the game of life, you're also signalling to others what the rules are with every action you take. You internal beliefs shape what the world really becomes for the people closest to you. Is \"you must be the best or be valueless\" what you want the people you love the most to be hearing from your actions?\n\n4. Have purpose - you change the world every day, with every breath, every sentence you write, every piece of art you create. (Check out https://youtu.be/rPh3c8Sa37M). You've already just changed my day by posting and encouraging conversation. For me the final straw for envy was that when I took a good look at all the people I admired and loved and that have changed me - they are some of the most humble, brilliant, dedicated and giving folks. The richest people I've met have often been purposeless weirdos or ridiculous assholes. Do you want to keep rewarding that? The social world is created by our beliefs, and the next time I have a friend come and boast to me about how they get paid xyz or have been awarded something or other, I think about how maybe they secretly don't feel like they are good enough. Like they need to be loved more. Like they want someone to be impressed by them and to believe they are important and treat them with respect. And I want to be the kind of person that can let them know: you are important, and you don't need the decorations. You deserve to be celebrated, and the art you make is valuable regardless of how popular it is. But I'm proud of your efforts. The world isn't a treadmill because I see you, and let's just enjoy this funny thing called life together. But it starts with treating yourself in the same way.\n\nP.S. realising how much envy is messing with you before you're even 18 is a huge achievement in my books. Congrats!", "permalink": "/r/DecidingToBeBetter/comments/pkc48s/me_being_envious_of_literally_everyone_in_my_life/hc40mbq/"}