{"id": "t5_2tand_t3_pkc48s_t1_hc6fddo", "creation": 1631193608, "origin": "t5_2tand_t3_pkc48s", "height": 1, "replied_to": "t5_2tand_t3_pkc48s", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "80-20rule", "text": "I will definitely be using some of the advice in this thread myself. I get envious all the time of friends and family. But below is how I battle these feelings. \n\nI was listening to Naval Ravikant and he framed it a different way. If you're envious of someone you have to want it all. You can't just want their nice car, or the money they have, you need their life as well, their relationships, their problems. Reframing it this way can help shake you out of those feelings.\n\nAlso, do you know what game you are playing? Have you defined the kind of person you would like to be, and the kind of things you would like to do? Without this type of rudder it is very easy to be taken off course and become envious of people who are playing a completely different game than you even want to. For example, you might like to travel, but then you become envious of the friend that bought a brand new Tesla. The envy doesn't stop, but it can be quickly mitigated by remembering that you don't want a car that much, and you prioritise spending money on traveling instead.\n\nI think a lot of the problem goes away when you define this for yourself.\n\nAnd finally the nuclear option, avoidance!Try and spend less time in situations where this envy arises. I'm not saying stop hanging around with friends or family, but getting out of your normal social circle now and then can get you away from those feelings (and allow you concentrate on your own thing). For instance, I live in a different city to my family. I love to visit them, but when I do they will talk a lot about people (my peers) buying houses, doing \"very well\" etc. Getting to go back to my city gives me the break I need from this, so again I can focus on my game.", "permalink": "/r/DecidingToBeBetter/comments/pkc48s/me_being_envious_of_literally_everyone_in_my_life/hc6fddo/"}