{"id": "t5_2tand_t3_dvyxuf_t1_f7idhu2", "creation": 1573757666, "origin": "t5_2tand_t3_dvyxuf", "height": 1, "replied_to": "t5_2tand_t3_dvyxuf", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "FabulousLemon", "text": "Try to remember you can't judge a book by its cover. Children in wealthy families do have many advantages, but they are not immune to divorce, death, or abuse in their families. Some of those people may have been raised by hired nannies because their parents couldn't be bothered to put in the time themselves, so maybe they don't have close family relationships. I'd imagine it's unsettling in some ways to be raised by a series of hired hands instead of a loving mother.\n\nIt's better to judge people for things they can control than things they can't. Judge wealthy people on a case by case basis for not taking time to understand the plight of working class families, judge them for not treating service workers as fellow humans worthy of dignity and respect, but don't just judge them for their parents' fortune or greed because that's fruitless. They can change how they treat the person working on their car, but they can't change what school they went to as a child. They can choose to support better labor laws such as paid parental leave, but they can't change what neighborhood they grew up in. Go ahead and judge wealthy people who dodge taxes and don't give back to the society that provided a stable government, justice system, schools, infrastructure, and emergency services that allowed their businesses to grow, because that takes a stunning level of hypocrisy or willful ignorance of the foundation upon which that wealth was grown.\n\nIt's also ok to want to avoid the drawbacks of your upbringing and get away from that, while taking pride in how you were shaped by the hardships you faced. I think we all seek to improve our lot in life and you're not betraying your background in trying to better your life.", "permalink": "/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/f7idhu2/"}