{"id": "t5_2tand_t3_dvyxuf_t1_f7hvf2m", "creation": 1573748173, "origin": "t5_2tand_t3_dvyxuf", "height": 1, "replied_to": "t5_2tand_t3_dvyxuf", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CanadianFemale", "text": "Maybe  rather than comparing yourself to those who were better off, look at  how extremely fortunate you were to have a safe place to live and two  parents watching your back and loving you. I had a much, much worse  childhood, no family, young adulthood was even harder because at least  the awful and abusive foster homes were obligated to feed and house me.  If I ever focus on how little I had and how unfair it is that others had  more, it's understandably upsetting. But when I look at the people who  had much less, had more trauma, who were born addicted to drugs and  whose parents loved the drugs more than their own children, I see that I  was incredibly fortune to have been born into my life, rather than  theirs.\n\nPractice gratitude for the  things you have. And the things you lacked, look at how those were  opportunities to grow. Plenty of people who had very \"easy\" lives end up  incredibly unhappy and not successful, because they never learned to  work for anything. They never learned any resilience.\n\nAnd  those days when you're pitying yourself, try not to beat yourself up  about it too much. We all have pity parties on occasion. You get to  grieve for the things you wish you had but didn't. Just don't dwell  there. Turn it toward gratitude and look more closely at how strong you  are as a result of your life challenges.\n\nEdited to add: Also, look up self compassion. People who practice self-compassion tend to be less lazy. You can be compassionate with yourself for the reasons why you might be lazy. You might expect you're better off beating yourself up, but the compassion is more motivating than the shame and guilt.\n\nAlso, you don't really know what life was like for those really well-off people. My best friend in high school was quite wealthy, by comparison. She died of a drug addiction several years ago. She came from what appeared to be a picture-perfect, loving family. But I'm still friends with the family and I see some of the stuff that contributed to her problems. A genetic pre-disposition to mental illness, probably a feeling of not being wanted by her mother (I don't think her mom even likes children), sexual abuse by her nanny. Mom was a stay-at-home mom but had a nanny for her (likely due to her own mental health issues and depression / post-partum). This person that their wealth afforded them, sexually abused their daughter. She started using substances in her pre-teens and things just got worse and worse. She died miserable and quite alone, even though her wealthy family loved her and did everything they knew how to do, including probably a million dollars in treatment facilities over the years. None of it was enough. I envied her growing up and was frustrated to see her throw away so many opportunities that I'd never have. Turns out, she envied me and how strong and capable I was. Now she's dead.", "permalink": "/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/f7hvf2m/"}