{"id": "t5_2tand_t3_dvyxuf_t1_f7ggt5h", "creation": 1573703448, "origin": "t5_2tand_t3_dvyxuf", "height": 1, "replied_to": "t5_2tand_t3_dvyxuf", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Maybe what I'm going to say is advice that may be more applicable to me than you (since your story resonates with me and sparked some introspection), but what do you want from others? Is it validation?  Do you want people with more materially privileged upbringings to validate your circumstances and the challenges you've had to overcome?\n\nIs this an identity thing - are you unsure about your place in the world and what social class  you can/should identify with (e.g. you recognise your lower-class beginning, but have mixed feelings about, such as shame and pride, possibly because (a) you know that others had it worse and (b) there are good aspects of your childhood that you probably cherish, such as relationships with important family members/friends, events and milestones)\n\n&#x200B;\n\n>I really hate blaming my current lot in life on the fact that I may not have had adequate resources to succeed because I feel like it's shirking responsibility and maybe I'm just lazy\n\nI think you can accept that you've faced challenging things, and that there's nothing to be ashamed of with that, but don't expect the big wide world to know or care (I mean this in the gentlest way possible - it's not that you don't matter, it's that everyone is preoccupied with their own problems). As you've correctly identified, the flip side to making an honest assessment of your past/current situation is acknowledging what choices you can make now/in the future to get to where you want to be. A wise sage on Reddit once said: \"it's \\[referring to your childhood\\] not your fault, but it is your responsibility \\[to look after ourself as best as you can, deal with whatever problems you've inherited, or to chase opportunities in your path\\]\".\n\nSo, how do you define success? What are the resources (e.g. material, financial, environmental, relational) that you feel were lacking in your upbringing that has made you unable to attain the success you wish to achieve? As someone who has some lie experience and is currently engaging in self-reflection, what is important to you, and what goals do you want to accomplish? What do you want out of life? What can you do now to work towards the future you want? Are you confident that you can achieve the level of success you wish to achieve?\n\n&#x200B;\n\n**Tl;dr: (1)** Accept and validate yourself and the challenges you've faced to get to where you are today; the wider world will not, so don't look outside yourself for that validation or you'll never be satisfied. **(2)** Acceptance is a process, and it's okay if you have conflicting feelings about your childhood - life is messy and it's rarely straight-forward, as you're well aware. **(3)** Ask yourself (a) what success means to you, (b) why you feel as though your past didn't set you up for success and (c) whether there are steps you can take today to walk towards the success you'd like to achieve. See if you can find a mentor/ friend/ family member/ community leader/ counsellor/ careers advisor to help you get to where you want to be.\n\n&#x200B;\n\nBest of luck to you.", "permalink": "/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/f7ggt5h/"}