{"id": "t5_2tand_t3_dvyxuf_t1_f7g56ux", "creation": 1573694846, "origin": "t5_2tand_t3_dvyxuf", "height": 1, "replied_to": "t5_2tand_t3_dvyxuf", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gafflebitters", "text": "Thanks for asking the question, it is a great one that all human beings have to deal with at some point.\n\nI am just like every other person and i have fears and selfishness. I think you suspect that your answer is an inside job and you are correct. \n\nSorry this answer may be long , i will try to be concise. I remember my inner reactions to friends who had great jobs at GM plants when i was younger and working for close to minimum wage at a waste recycling facility. \n\nI envied them and wondered why I didn't get handed one of those cushy jobs. I have a well paying job now and i see things differently. I always assumed they had been lucky in getting those jobs, never did i  see that they might have worked hard to get where they were. I have worked hard to get where i am, it was not handed to me, i had to put up with a lot of shit and jump through a lot of hoops to be where I am, it's very likely they did too.\n\nI hope you see my fatal error in assuming.\n\nAnother key to release from envy is honesty, yes, that person seems to have it better than me, that is correct but why do i  not regard the many people who have it worse than me, I need to consider ALL of the data, not just the stuff that supports my feelings.\n\nIn back of this, because i am a complicated human being, are the fears of reaching for my own success, which, if i am busy doing that i will not have much time or inclination to sit around and brood on other's successes and the selfishness which makes me feel as though I should get things for free without having to struggle for them. \n\nFear, i often made the mistake of calling myself lazy when it was FEAR that was holding me back, i didn't even know it myself until i was helped by a group of people who talked about their fears all the time and i slowly started to realize my own.", "permalink": "/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/f7g56ux/"}