{"id": "t5_2tand_t3_dvyxuf_t1_f7l7inp", "creation": 1573834390, "origin": "t5_2tand_t3_dvyxuf", "height": 1, "replied_to": "t5_2tand_t3_dvyxuf", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ChrysolorasOfCorsica", "text": "I subscribe to the beliefs of /r/Stoicism, and I think the perspective Stoicism gives will help anyone immensely in every facet of life. Stoicism focuses on many things, but beyond anything else it focuses on the exercise of four virtues: wisdom, morality, courage, and moderation. These are to be exercised by every practicing Stoic in every situation in life, these principles will improve us as people and give us a greater sense of purpose. But how does this relate to your situation? Well, at the core of Stoic philosophy is rational judgement without emotion. This is not to say emotion is bad, but rather that it can cloud our judgements of things. \n\nThe deconstruction of events to better understand them is a core Stoic technique. However, we must first understand the three step process of how we form our thoughts and feelings about a subject. First, we are subjected to an event, an insult, a poor childhood, a memory, etc. Second, we process that information. Third, we feel an emotion that resonates with our interpretation of that information.\n\nWe see people respond very poorly to insults, and yet we see others respond with laughter. Why is this? Because in the second step, the processing of information, one person has a healthier filter. The Stoics believe that life should be focused on what we can control, and we should ignore all that we cannot control. So for example, we cannot control what someone says to us, but we can control how we process what they say and how we react. In other words, we are responsible for how we feel. No one can make us feel anything unless we allow them to have power over us. \n\nAs a side note, the Stoics do recognize what they call ‘Proto-emotions’ which are immediate emotional reactions which cannot be curtailed by thought. Additionally, the Stoics believe emotion is healthy, but that we indulge in it and that distracts us from progress.\n\nSo you are bitter about your underprivileged upbringing and you resent others that had more advantages? Let’s run that three step process on your childhood, I want you to pick out at least two specific events you have negative memories about, close your eyes if that helps you to focus better on these events. The first step then, what happened in these events? Not what you think happened, not what you feel happened, only what can be said to have occurred factually. \n\nSecond, reinterpret this information under this lens;\n\nFew events in life are inherently negative. To have little food in the house is not negative nor positive, it is as we perceive it to be. We choose to think, “I wish we had more food, for if we did I would not be so hungry all the time”, but we could choose to think instead, “It is lucky that I do not starve, and this lack of food means that I shall never deal with gluttony. I am lucky”. We live lives of want and need instead of gratitude, and that is a willful choice. Few things in life are truly evil, and our thoughts determine their value. We focus on what we did not have instead of what we did, and in doing so we focus more on what we lack than what we were lucky to have. We must ask ourselves, if we only ask about what we do not have instead of contemplating what we have, will this change once we obtain what we want? Or will we succumb to the same desire for more that we have been ravaged by our whole lives?\n\n“It is not the man who has too little, but the man who craves more, that is poor” - Seneca\n\nThird step now, how do you feel about these events and your childhood now? Under this different perspective, isn’t it clear that the feelings you held previously were a result of false judgements? The inherent belief that poverty is negative, the inherent belief that riches are positive. How many have earned their way to the top simply to realize they’ve lived an empty life? Losing time around the people they loved to make a few more dollars. Life is precious, for it leaves us at every second. Do not allow circumstances and individuals to define how you feel about them, it is the mark of a wise man to decide how he approaches a situation. \n\nYou lament your underprivileged beginnings, but allow me to give you two other perspectives on poverty. There lives a man who, despite not knowing Stoicism by name, lives as one in every day of his life. David Goggins is a man who was poor, abused by his father, and degraded at school for his race. When his mother escaped his father, he began school in a different, even more racist place. Still, things began to look up, as his mother began regaining her independence and met a good man who supported the both of them. His mother's mental state was getting better, he was getting better teaching at school because of a tutor which they could afford because of his mother’s new boyfriend. He was a real father, something Goggins had never had before. Then one day, his new father got shot several times in his garage. Goggins grades plummeted, his mother’s mental state shattered and Goggins seemed doomed to a miserable life. Fast forward till he was twenty, he was a 300lb exterminator, completely sedentary in daily life, with few aspirations for a better life. He was judgmental of others and hated himself. One day, when he heard a speech at a Navy Seal Ceremony on his TV, his mind flipped completely. He realized that regardless of what happened to him, it was on him and no one else to change his life for the better.\n\nThree months later he had lost 120 pounds.\n\nEight months later he was in Navy Seal training.\n\nToday, he is a decorated navy seal, he has run over 60 ultra marathons (50 miles at least), he got the world record for most pull ups in 24 hours by completing 4,030 pull-ups in 17 hours.\n\nBut most profoundly, in his book he talks about his upbringing as the one thing above all that made him mentally tough enough to make it through life. He decided to view all the beatings, all the late nights, all the things that ever happened to him as a positive thing which helped him later in life. (I cannot recommend his book enough, it’s called “Can’t Hurt Me”)\n\nThe other perspective I will give you is my own, I grew up middle class rich, and after learning about Stoicism and David Goggins, I wish I had a more difficult childhood, because if I had I could have learned discipline earlier, I could have learned the value of the smaller things, I could have learned so much more so much earlier. Yet even this desire is folly, I cannot change my past, so I should be grateful for having learned what I have now and not even later in life. \n\nStoicism is for everyone, and that is best exemplified by two of its most prominent authors. Marcus Aurelius, the writer of ‘Meditations’, was an Emperor of Rome for 17 years. Epictetus, the writer of ‘The Enchiridion’, was a slave for much of his life.\n\nThey believed the same thing, that they ought not worry about what they cannot control.\n\nMarcus Aurelius lamented the power he had. Epictetus enjoyed his years of slavery. I envy your poverty, and you envy my riches. It’s all about mindset. \n\n*Amor fati, frater.*", "permalink": "/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/f7l7inp/"}