{"id": "t5_2tand_t3_lobu4y_t1_go8e3tw", "creation": 1613920951, "origin": "t5_2tand_t3_lobu4y", "height": 1, "replied_to": "t5_2tand_t3_lobu4y", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "redubshank", "text": "Hiyo, life-long anxiety disorder and depression guy here... although I lied because I am more or less fine now.\n\nFirst, I want to touch on some positives.  You know you have an issue.  That is actually huge.  Second you are doing some things that actually help such as spending time with loved ones, exercising and seeking a mental health professional.  You also identified the trigger which was cocaine.  I've never done cocaine but from what I understand it's a huge boost of energy and, IMO, a lot of anxiety is energy that has no place to go(which is why exercise helps).  I actually have to be real careful with caffeine because of this.    So good job here knowing the cause and looking for solutions.\n\nSo based on what you are currently doing my two big suggestions would be:  \n\n\nThe first thing is to ween yourself of all stimulants such as caffeine.  It sucks and it doesn't have to be forever.  You are just removing one well documented trigger of both anxiety and insomnia. Cocaine gives you an insane burst of energy and triggers your anxiety so it's not a big leap of faith that a lesser stimulant wouldn't cause some degree of anxiety as well.  Again, this isn't forever this is just so you can get back to being the person you love then you can slowly add caffeine back and you might be 100% fine at that point.  Worst case is you probably take a much needed break from caffeine which no one ever does.  Just make sure you ween yourself off instead of cold turkey.\n\nStart trying a daily meditation.  My preferred type is something called 'Paradoxical Relaxation'.  Basically you get comfortable, so for me laying down in bed in a dark room,  and starting at the top of your head you slowly try to relax every part of your party.  So forehead, around the eyes, jaw, throat, shoulders, biceps, triceps, hands/forearms, upper back, chest, lower back, glutes, pelvic area, hamstrings/quads, calves, toes.  Thoughts will try to intrude and you just have to calmly say 'okay' and then go back to relaxing.   If you can't relax a body part just accept it and move on. If you get too distracted just start at the stop again.  Don't get angry, meditation is a skill and like any skill it takes practice.  If you are doing a 15 minute session you may not even be able to do the full body at first.  That's fine.  You will get results either way.  If you do get to the end you can either restart the relaxation process or just sort of 'exist' in the moment(which is the point of meditation imo).\n\nYou can also try other meditation types like guided meditation.  I never liked those as much but I know plenty of folks who use them successfully.\n\nAlso, I guess I'll relay my own experience with paradoxical relaxation.  I was dealing with a chronic pain condition that more or less ruined my life. Like locked up in suicide watch it was so bad and doctor's couldn't seem to help at all.  When i started PR I would do it for 1-2 hours at a time.  After my first session the change was so dramatic it was physical sensation.  The pain condition is more or less cured now and I mostly do 15 minute sessions a couple times a week but will do longer if I feel the need.  It's no longer to treat anxiety or a pain condition it's just because it provides a big mental boost and clarity.  Some of my best ideas tend to come during or after a session.  Additionally, it's a portable skill in that lets say the 'shit hits the fan' at work.  You can easily notice your body reacting to the stress by tensing up so even without meditating you can do a body scan and make yourself relax your shoulders, eyes, etc which ends up lowering the stress response and hence anxiety.  Basically what I am saying it's both a healing tool and can be used as a coping tool.\n\n&#x200B;\n\n> Okay, I am not doing drugs again ever in my life \n\nI mean, I would say cocaine and other stimulants should be avoided but if you like to party there are other recreational drugs that are fairly safe when used responsibly such as weed, mushrooms or MDMA.  The reality is these drugs affect people so differently you need to figure out your own boundaries.  I have friends who can't competitively game unless they are stoned where as weed makes me a quiet,  bumbling, sleepy idiot.  So weed is a good sleep-aid for me but you won't catch me using it socially :)\n\nAdditionally, I'm a big fan of using psycadelic and MDMA as a therapy tool(and this is quickly becoming mainstream) and I also think that using it responsibly recreationally can be a really empowering tool to lead a better life.  I would still be dealing with lifelong depression/anxiety if it wasn't for using these in a therapy setting and having a good integration therapist to help me.    \n\n\nTo be clear, I am not advocating that you use these substances just keep an open mind. \n\n&#x200B;\n\nAnyways, I typed enough.  If you need anything send me a message.  For most people with mental health problems there are solutions but all the good solutions require you to walk the path... not just take some pill :)", "permalink": "/r/DecidingToBeBetter/comments/lobu4y/want_to_get_rid_of_constant_anxiety/go8e3tw/"}