{"id": "t5_2tand_t3_89rm30_t1_dwueunf", "creation": 1522921584, "origin": "t5_2tand_t3_89rm30", "height": 1, "replied_to": "t5_2tand_t3_89rm30", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "successaddictions", "text": "I am sorry about my lengthy replies friend, but..\n True!! You need to make effort to achieve any life goals. The fuel to constantly make that effort is belief in your abilities, belief in yourself. Your efforts only go as far as your belief whether great or little. I perceive you are intelligent (very intelligent) already which is good but do you see yourself as such?\n\nTrue, You should not be overwhelmed by how strong other people are, or how much progress they are making towards their goals. However, unknown to you, You have entered an unconscious state over the years without knowing, where you entertained only information that tells you how weak you are, how impossible and out of reach your goals are, and like a self fulfilling prophecy, you are creating those results in your life. To put it honestly friend, you were making efforts to create those negative results in your life. \n\nNow you have to be deliberate, you have to consciously determine to receive information from others like me and most people in communities like this, that tells you how strong you really are. You have to accept these information by faith because what you have created over the years have not revealed your true potentials to you. The desire in you to create a successful life is the energy to succeed seeking expression.\n\nI agree you may produce shoddy results in your life pursuits, but never ever let that cause you to lose faith in your abilities to succeed. Study, study, study, and apply yourself to anything that will eventually give the results you desire. \n\nThe desire to succeed is the ability to succeed in you that is seeking expression. If there was no ability to succeed, you will not desire success. Your failure to succeed is frustration to you  because you know you have it in you to succeed but your efforts are producing a different and opposing result. \n\nI guess I stop here for now. If you reply then I might go on with time. Lemme quickly add again what others may have already said, its going to take sometime, and within that time, you will be changing on the inside, but your results, your environment will probably not look different or changed (outwardly). Don't let that discourage you, keep making those petty efforts but don't forget that the birth place of success is inside, in the mind, in your thoughts and beliefs. I hope you find this helpful.\nSorry about the lengthy nature.\n\n", "permalink": "/r/DecidingToBeBetter/comments/89rm30/how_do_i_turn_my_darkness_into_light/dwueunf/"}