{"id": "t5_2tand_t3_p8p1i2_t1_h9tt4nd", "creation": 1629577119, "origin": "t5_2tand_t3_p8p1i2", "height": 1, "replied_to": "t5_2tand_t3_p8p1i2", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "HungryMoblin", "text": "I started off with the assumption that the world was awful. I felt that way for years. And instead of strengthening that belief, over the year it has been eroded. Yes, injustice, inequality, and the such happen all the time with frightening regularity. But kindness and love happen in equal measure and how you feel about the world in general is typically what you'll reinforce. \n\nTo protect myself, I do pay attention to what I'm putting into a relationship, friendship, etc. How much people ask of me. And if I feel like it's very lopsided, I simply don't do the things they need. I trend the other way, I give people the benefit of the doubt until they've proven undeserving. \n\nAnother thing to consider is that we have a very, very, very limited viewpoint when it comes to humanity. Say you've got 50 years of life left. If you met a new person every day, that would be 18,250 people or 0.0056% of the US population (and a ridiculously small portion of the global population.) So the closest we can factually get is \"People *that I meet* are trash/suck/aren't good.\"  And even then the solution is pretty simple, you know what it looks like when someone is taking advantage of you, and you can cut them out and find someone who is worth your time or simply not giving them what they're asking from you. \n\nI think it's totally fine to feel positively about other people right off the bat and not make negative assumptions. I do think people are genuinely good, in general. The other side of the coin is just being mindful, paying attention to what you're putting into relationships and what you're receiving back. It was totally fine for you to call out your ex for not putting in as much as you were as long as your expectation of her was reasonable. \n\nI see a bitter old shitty world-worn man in my mind and I spend a lot of time and energy trying not to become him.", "permalink": "/r/DecidingToBeBetter/comments/p8p1i2/how_did_you_accept_that_the_world_is_not_as_nice/h9tt4nd/"}