{"id": "t5_2tand_t3_pyynau_t1_hez1pb5", "creation": 1633095114, "origin": "t5_2tand_t3_pyynau", "height": 1, "replied_to": "t5_2tand_t3_pyynau", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Every_Traffic_4808", "text": "Yoo i had same exact issue 5 months ago.. Hard depression, anxiety.\nI didnt take any therapy because i dont belive in it.\nHowever.. I made a list of the things that i want to change and realised that my issue is that i was addicted to alcohol, weed, i have done a no number of bad things in my life etc. etc. So if you are addicted it may have a and effect on you in terms of having uninterested feeling towards life..you just have to accept that it happened\n\nSo my recomedation is to ask yourself am i and how much am i ready to change myself?\nWhat i want to look in a year, two?\nNo matter how depressed and anxious you are you must have some thoughts here and therr oh this would be interesting..\n\nOk here is something that changed my life-\n1. Go for a walk at least 1h a day\n\n2. Start going or working out, i mean you just have to be active in order to feel better even if it's jumpin a rope for 10 min\n\n3. And this step you could put on a 2nd place you need.. No you have to take care fo your hygen, clean your living space. Because it will feel you better and while doing it you wont think about life\n\n4. Remove social media, looking at other people lifes makes you even worse..\n\n5. Last step is that you need to revive soem of the old friendships or go with your relatives on a drink or walk.. I mean you just have to talk with other human beings.\n\nAfter this i quarantee you, that you will feel much better! And you will solely make your plans and everything.\nI rolled on CS University, got clean from the drugs, made new friendships, started going to the gym and got many other benefits... However. I still deal with porn hahaha, but comparing what i was and what i am today after 5 months i feel amazing! In every aspect of that word.\n\nSo get you fucking head straight are you a hobo or a fucking lion of your life!\nGet your life set up for success and happines and dont cry over it! Good luck and i hope this will help you.\n\nP.S. This is all personaly tested and i found out it worked, so good luck!", "permalink": "/r/DecidingToBeBetter/comments/pyynau/i_cant_give_meaning_to_my_life_nothing_interests/hez1pb5/"}