{"id": "t5_2tand_t3_pyynau_t1_hf026qq", "creation": 1633111133, "origin": "t5_2tand_t3_pyynau", "height": 1, "replied_to": "t5_2tand_t3_pyynau", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "2manynightmares", "text": "It took me 10 years to find a therapist and psychiatrist who could help me with severe depression and PTSD. LOTS of medication changes until my doc finally found one that worked. It took a long time, lots of patience I didn’t really have, and yes could be quite expensive without insurance. But quite frankly, when you find the right combination of therapy and medicine…my life did a complete 180. I feel like there’s so much more meaning to this life and that I really want to experience it, explore what I desire, who I am…something I never felt since I was at least 17 (probably even younger then that). \n\nKeep trying. I know how hard and deflating it can be when it doesn’t work, but as someone who has had hard-to-treat depression, you truly do not have to feel the way you’ve been feeling. \n\nWhen you find a therapist who you feel like really understands you or wants to (this may take a few sessions to figure out), stick with them. Don’t worry about the “method” they use for therapy, just that you have a good rapport—in other words connection—with them, that you trust them. And then trust them. Open yourself up, mention what you’ve mentioned in this post, how you really feel, how in the past things haven’t helped, and asked them if they think they can help you. Therapy isn’t easy. It requires opening up to, essentially a stranger, in ways you may not even realize you’ve been closing yourself off. The emotions you feel that might be buried under years of numbness suddenly coming out or just the idea of being vulnerable with your deepest intimate thoughts can be scary. But you won’t get better if you don’t share them and stick it out. Tell your psychiatrist what medications you’ve taken in the past and what the side effects were and that they didn’t seem to help. If they prescribe you something that doesn’t seem to be working, or that makes you too tired, tell them what’s going on! They can always try something else. \n\nAfter being prescribed the “right” medication for me, which again took years of trials and failures, it still took about two months/8 weeks for me to actually see the results. Other people noticed I seemed different but I didn’t feel all that different for a couple of months. I was able to keep taking it though because I didn’t have significant side effects, in fact the only real side effect was that I seemed to have a bit more energy. I’m taking 150mg of Wellbutrin XL. It may not work for you, but it might be something you bring up to a psychiatrist if you haven’t tried it before. Only anti-depressant I’ve ever been on where I didn’t feel extremely fatigued/tired. \n\nI really hope the best for you OP. I know what living with a rain cloud above your head for years feels like but I also know that with the right therapy and medication, I can have sunny days now too and that I deserve them. I hope you find your sunny days even if it seems like you can’t find them now.", "permalink": "/r/DecidingToBeBetter/comments/pyynau/i_cant_give_meaning_to_my_life_nothing_interests/hf026qq/"}