{"id": "t5_2tand_t3_alcx24_t1_efdxpxu", "creation": 1548879988, "origin": "t5_2tand_t3_alcx24", "height": 1, "replied_to": "t5_2tand_t3_alcx24", "down_vote": 0, "up_vote": 20, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Willbo", "text": "One essential question I've asked myself is \"Where does happiness exist?\" Does it exist internally, in your own mind, or does it exist externally, by giving to others and contributing to society?\n\nWhen I was young I heard the proverb that happiness lies within you. You are the only one that can make yourself happy and you have a choice. At the time this really resonated with me and I ingrained it into my life. It made sense because happiness is felt inside. Over time it provoked many more questions. It made me ask questions such as: Are crazy people happy? Does this mean anything outside of myself is a distraction? I avoided people and responsibilities because they didn't make me feel happy, I listened to my impulses, and retreated inwards. Anytime I was forced to complete a social obligation I would become very bored, angry, and coped by dissociating inwards. It did not scale well into the adult life.\n\nAround age 19 I figured it was time to get my act together. I wanted to be somebody. I wanted friends, I wanted money, I wanted a girlfriend, I wanted to attract other people. The road I was on went nowhere. I indulged in myself and created a life nobody cared to hear about, a life of no meaning, a name that would be soon forgotten after the funeral. It triggered some existential anxiety and I pushed myself to contribute to society as much as possible. I went to college, I worked full time, I worked out, I put in the extra hours, I went the extra mile. I started making friends, I started talking to women, people started inviting me places, I was achieving all of this, but still, something felt off. I didn't feel like myself, I was too drained to work on things *I* cared about, my goals were in the backseat, I was being taken advantage of or lead into the wrong direction, women just wanted to be friends, I was burning out, anticipated salary negotiations resulted in chump change. I was spending tons of effort on things I didn't enjoy to impress people that wouldn't give me the time of day.\n\nNow I realize happiness is not one or the other, but a balance between the two. If you retreat into your own mind, reality will upset you. If you give up to the universe, you will end up somewhere you don't enjoy.\n\nHappiness exists when your external world matches your internal world. It's when your effort matches expectations, when you're shaping your physical world into your ideal and making progress, when everything falls into place, when you don't even have to stop to think, when you live in a state of flow.", "permalink": "/r/DecidingToBeBetter/comments/alcx24/advice_improve_your_life_by_engaging_deeper_never/efdxpxu/"}