{"id": "t5_2tand_t3_alcx24_t1_efexkf2", "creation": 1548906613, "origin": "t5_2tand_t3_alcx24", "height": 1, "replied_to": "t5_2tand_t3_alcx24", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "enlguy", "text": "I will say that if shitty shit happens, there probably IS something you did to bring it on yourself, even if not directly.  Karma and all that.  Life gives us what we need, not always what we want (the Rolling Stones seriously nailed it, I can't help but think how deep that song is).  \n\nThat said, I do appreciate a lot of what you said here.  In case anyone cares to respond to me, after having read everything, I guess my question comes .... well, not to hijack by any means, because this is a great post, but given my current situation, it leaves me thinking and wondering...... \n\nI was in the boat of tedious, routine, etc. about a year ago.  I was looking to make a change.  Thing is, a few years prior to that, I had been homeless, sleeping outside in the dead of winter in Colorado, snow storms and all, and after six months of that shit, finally caught a break with a place to crash for a week and a laptop to borrow, busted my ASS off looking for online freelancing gigs (back when that was still viable and legit), interviewed for a local job (got it), and soon had enough money to get a cheap room in someone else's house.  Kept busting my butt on the freelancing, took that with to a new place, then decided I wanted to work outdoors, got a job with Vail inside of a week of applying, got VERY lucky finding a cheap room to rent in town last minute, and moved (hitchhiked up there with all I could carry).  And thus began years of living in Vail.  I continued to build my savings, got my own place, traded up in jobs, greatly increased my income, improved my credit, got new credit cards, buried myself in debt buying ski equipment on credit (don't totally regret it), loved skiing, hiking outside my front door, bought a car outright, I mean just MASSIVELY improved my quality of life and LOVED living in a little town in the forests and mountains with access to everything and enough of an economy to make it sustainable.  \n\nThen, after several years, living in a very tiny place for a year, I had suffered some serious injuries in this time as well from my climbing and skiing habits (TBI that forever left things feeling \"different,\" though probably was all better after a year or so, near-death experience climbing that shook me up and did some permanent nerve damage to my extremities), I started questioning the isolation of living there.  Most of the town was either far younger than me and transient, or a bit older and settled down.  The chance of me meeting anyone there was slim (I DID meet someone, but sort of trashed it quickly as it got off to a rough start, and I didn't have the patience for that).  But that's what it was, the same people all the time, same job for years, leave work, hike or ski, go home, smoke a bowl, and sit in front of the computer.  I tried making deeper friendships there, but it's not easy.  It's not really that kind of a town.  It is and it isn't.  But the transient nature and the sensibilities of mountain people don't make it the easiest place to make really good friends that stick around.  Plus lots of addiction up there.  I had my own habits with weed, but so did EVERYONE, just about.  At least I wasn't drinking myself sick like a lot of people, or doing harder shit that was around.  But anyway, I got to a point where I said fuck this, it's starting to feel like a dead end, and bounced my resume around. Had a GREAT opportunity I kick myself a little that I passed on to go be an Assistant GM of a hotel in Aspen.  Really should have taken that.  Was worried about the vibe in Aspen (if you think Vail is stuck up...).  Then decided I'd go back to school since my income had nearly capped out for the job I was in, and it's a place you wait 10 years before getting a promotion sometimes once you reach a certain point.  Someone has to leave, you have to be next in line for the throne.  I had mapped that all out, found a school nearby that would give me what I needed, and was ready to do it.  \n\nThen lost myself in that dream, as the OP mentioned.  I met a girl online, figured I'd move to Australia and go to school there. After things were somewhat in motion, I realized the visa would be tough, the cost of living insane, and not enough income to make on the visa as it allowed me to only work part time.  SH even said I should just stay.  I was obstinate.  I spent all that money on a nonrefundable ticket, fuck it.  SO instead of eating $1000 I drove myself WAY farther in to difficulties by quitting my job, giving up my home, and flying around the world with nothing waiting for me.  \n\nFast forward 9 months.  I am now living hand to mouth dependent on someone helping me because the job I quit a teaching job I found in Cambodia for a remote job that never paid me, went to stay with a friend in Europe who was dealing with a bunch of shit and freaked me out, another girl in the Philippines (and I had been warned many times about trusting people in the Philippines) ended up flying me to her country, and here I remain with no money, no visa to let me work here, and she pays a small rent and brings me food, but that's it, she spends all that money for that, but won't fly me back to that States (she acts like she bought me), and so I've been working my ass off now, just the past few days (was far to depressed before that to do anything and fucked up over shit, but been feeling increasingly better over the past couple weeks) to make any income I can online in the hopes to get myself out of here.  I am now faced with my tourist visa expiring in less than two weeks, no ticket out of here, and no money to extend the visa unless she does that for me, and things are getting nuts with her (because she is BATSHIT and insanely unstable and doesn't even see it herself, like legit insane), and well, you get the picture.  \n\nSo leaving my comfort zone fucked me, trying to change everything up fucked me.  However, if I had done small things, maybe it would have been different (though I tried volunteering and then pissed a bunch of people off because my work schedule changed, and I couldn't anymore - even when I did no one ever really showed up for the free class I was running - I tried to volunteer at the hospital - they took three months to respond, then had nothing to offer).  I guess it can just be harder some places, in small remote towns, there just isn't as much you can really add to your life, and you're working yourself silly already, so free time is rather valuable.  And when you TRY to socialize with people, but most of them are too tired or too busy working to do anything...  it can be tough.  Maybe it's good I left, though I think EVERY day about how I'd rather be there with a tedious job that paid me well, my car, my home, my things, weed, a great winter for skiing, etc.  How I miss some of the people I haven't talked to since.  I was slated to go back this winter, actually, when a previous employer barred that from happening (NO CLUE why, I'm still trying to sort that out).   So... it leaves me wondering a lot, and hoping a lot, and working hard to make any money at this point, and just wishing the best for my future, since this has gotten rather more interesting than I'd like).  ", "permalink": "/r/DecidingToBeBetter/comments/alcx24/advice_improve_your_life_by_engaging_deeper_never/efexkf2/"}