{"id": "t5_2tand_t3_of8s8b_t1_h4ct5z3", "creation": 1625667145, "origin": "t5_2tand_t3_of8s8b", "height": 1, "replied_to": "t5_2tand_t3_of8s8b", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Goliath422", "text": "I am glad most of all that you’re seeking out professional help with your own issues. All the good intentions in the world can be easily overwhelmed by the alphabet soup of trauma and trouble you listed. That pain gets in your way in the best times and overrules rational thought in the worst. As somebody on a mental wellness journey of their own, my advice is to:\n\n1. Take your meds. If they don’t work the way they’re supposed to, or you’re not getting the results you want, or you’re suffering side effects, tell your doctor, but keep taking your meds every day at the same time(s) until you have tapered off per doc’s instructions. \n\n2. Work on your sleep hygiene. Sleep is the best indicator of mental wellness—or illness. Figure out what you need to function optimally (not just what your can survive on) and get that much sleep 90% or the time or better. Sleep is a chicken/egg thing—not getting enough sleep makes you mentally unwell keeps you from getting enough sleep makes you mentally unwell. Break that cycle, sleep, and get better. \n\n3. Don’t settle on your medical team. If your therapist isn’t listening, or your prescribing doc is hard to get ahold of when you’re in crisis, or any of them don’t treat you with respect, GET A NEW ONE. Keep the one you have until you find a replacement, but never accept second-best mental health pros for a single appointment longer than you have to. \n\nYou’ve got a great attitude and a genuine desire to shape yourself into a person you’re proud of—you’re going to succeed and you’ll be 100x the person you were yesterday. Good luck!", "permalink": "/r/DecidingToBeBetter/comments/of8s8b/i_realized_i_was_the_toxic_one_in_the_relationship/h4ct5z3/"}