{"id": "t5_2tand_t3_nat6p6_t1_gxz6s2d", "creation": 1620913554, "origin": "t5_2tand_t3_nat6p6", "height": 1, "replied_to": "t5_2tand_t3_nat6p6", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "redubshank", "text": "Check out Scooby on youtube.  He was kind of the original fitness you tuber and just gives practical advice and workouts.  No phony promises or trying to sell you stuff.  The reality is fitness is actually pretty boring and simple but it's easier for people to make money by selling you secrets and empty promises.  He also has a website with workout plans.    \n\n\nBut if you don't feel like doing all that then I'd start out with a full body workout 3 times a week.  The modality(body weight, suspension, free weights, etc) doesn't matter.  As long as you are working with resistance.  100% don't over do it.  It's counter productive.  More workouts does not mean more gains.  \n\n\nAs far as cardio goes, I was in the same boat for the longest time.  I was just a meathead who may do cardio for a few minutes at the end of a workout... though rarely. Now I mostly do cardio instead of weights because I managed to start finding it fun.  Treadmills(commonly called dreadmills) are terrible.  Experiment with different cardio options until you find something that you don't hate.  Jump rope, battle ropes, sleds, rowing machine, spin classes, swimming(legit swimming, not dog paddling around) are all good.  Even better is to start finding things to do outside.  I hate running on a treadmill but love running outside.  Cycling  can be really amazing since each workout can be an adventure.  Even just hiking is great.  Another option is to start experimenting with racing(or events).  Those give you very clear goals and progression.  5k, sprint triathlon, half marathon, trail races, mud runs, whatever.  Just play around and something will eventually click :)", "permalink": "/r/DecidingToBeBetter/comments/nat6p6/28_yo_male_looking_to_get_back_into_shape_asap/gxz6s2d/"}