{"id": "t5_2tand_t3_mogatc_t1_gu4z7ti", "creation": 1618139308, "origin": "t5_2tand_t3_mogatc", "height": 1, "replied_to": "t5_2tand_t3_mogatc", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "UnendingQuest", "text": "I'm a very all-or-nothing, on-and-off the bandwagon kind of person. I also get very down on myself and develop a dark outlook when I'm at a low point. \n\nOver many years of work, I've come around to the idea of just being thankful for the periods when doing the work is possible for me. I work really hard during those times, even though I know it's not going to last forever. \n\nWhen I get in a dark place, I try to just distract myself, get through it, and control my behaviour and its effects on other people as much as I can. This often means isolating myself, which feels bad, but maybe preserves some of my relationships. It means my relationships are all with people who are okay with time apart and picking up where we left off when I'm being social again.\n\nThe thing that usually gets me out when the dark periods have been going on for too long is exercise. Running especially. Intense exercise that makes me too tired and relaxed to think about anything. It makes me crave better food and sleep better, which also help. Once I start adapting to regular exercise, I will find my mood and energy level have improved. That's when it's time to start all of the other work, too.\n\nIts not perfect and my goals in life are different than the hyper-achieving go-getters of the world, but the average of all of my efforts and struggle is that my needs are basically met, I'm a reasonably healthy person, and I have quite a lot of contentment and some good times occasionally. It sucks that it takes this much struggle and work just to maintain this mediocre sort of life - but there's also a relief to it because at least this much is possible for me. \n\nSometimes it helps to remember what your life might have been like if you didn't have that 20% of the time to feel hopeful and powerful, if you hadn't put in all the work you had. It wasn't for nothing. \n\nIt sucks that there's not going to be this moment where I 'find the key' and 'break through' and suddenly everything is easy and natural and I can just relax into my best life. But I'm thankful for my capacity to take the life and psychology and circumstances I have and do what I can with them. And I'm thankful that I'm learning ways to do what I can while spending less time and energy beating myself up when I'm feeling down.", "permalink": "/r/DecidingToBeBetter/comments/mogatc/ive_been_trying_to_not_be_a_lazy_loser_for_years/gu4z7ti/"}