{"id": "t5_2tand_t3_mogatc_t1_gu5677m", "creation": 1618144993, "origin": "t5_2tand_t3_mogatc", "height": 1, "replied_to": "t5_2tand_t3_mogatc", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Thick-Resident8865", "text": "I'm going through the exact same thing. Balls to the wall or falling on my face. And like you, it's been 7 years. Today (on a positive note) I decided to try 3 different areas... with start and end dates. 180 days of a part time job, stay with it no matter how fucking miserable... 4 hours a day. I binge watch Netflix for 6 plus. WTF? Surely I can follow through on this for 4 hours a day. \n\nNext my health is on the radar. I'm 10 pounds overweight because I can't keep my word to myself. I walk (leap) over my own boundaries... so cutting 2 things out of my diet. That's it. Peanut butter and popcorn. 2 to avoid. That'll cut out 600 calories a day. Does this sound doable? For me, it's about doing this and not finding another equally bad replacement... a battle of my own will for sure for the next 90 days, that's it... 90 days....\n\nAnd finally, one 7-day goal each week during the 180 temporary job. Something. Anything. Starting and finishing reading a book. Making one change on a website. Writing and publishing one article. 7 lousy days to stay accountable to myself and following through with a small feather to add on improving my psyche. \n\nI guess I had to write this and put it out there to you guys. \n\nThanks for sharing your own battle. It really hit me this morning, and believe it or not you inspired me.\n\nI was hoping for a diagnosis of some malady too... nothing yet, so I have to find a super simple way to cope with failure and pulling myself up out of this hole. Good luck to you. We should hold each other accountable if you find a path and need a support system :)", "permalink": "/r/DecidingToBeBetter/comments/mogatc/ive_been_trying_to_not_be_a_lazy_loser_for_years/gu5677m/"}