{"id": "t5_2tand_t3_mogatc_t1_guef6b1", "creation": 1618339198, "origin": "t5_2tand_t3_mogatc", "height": 1, "replied_to": "t5_2tand_t3_mogatc", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "North_Gain_855", "text": "Hey I'm just a garden variety ADHD fuckup but I also went into engineering (previously studied arts). So it's a pretty rough course and there were plenty of teary all nighters BUT the extremely structured environment and rapid pace for like 6 years (I had to switch from BSc to get in, 4 year course, 1 year over target because I fuckn hate electronics haha) helped my brain to mature. Like my thoughts because more structured and to the point (vs endless philosophy rabbit holes). It forced me to learn to appreciate group work (kicking and screaming though). I only see my psychiatrist every couple of years (I just collect scripts) and she remarked what a change there was in speaking to me.\n\nGood luck! But while you're excited and passionate now, write a motivational letter to future you on all the reasons why you wanna study this - like your long term goals and life aspirations and whatever. Times will get tough again and you will go through a low point again. My letter to myself really helped me pull through. \n\nYeah also try some low hanging fruit / easy stuff to get right / complete, to keep your confidence up. Some creative or DIY thing, or train for a 5km race, or help some animals or something.\n\nYou are valuable a person. like your value isn't linked to your productivity but we tend to get our self esteem wrapped up in all of that. \n\noh random - I did this online quiz to find out what my \"life trap\" is (cognitive behavioural therapy thing). like are there some wonky ideas we carry about ourselves that cause us to fail. like a slap in the face mine was 'entitlement' lol. But maybe if you have a few min to burn try it because you seem to be beating yourself up a lot and maybe it's because you have to unpack some stuff?", "permalink": "/r/DecidingToBeBetter/comments/mogatc/ive_been_trying_to_not_be_a_lazy_loser_for_years/guef6b1/"}