{"id": "t5_2tand_t3_mogatc_t1_guaxxfi", "creation": 1618264379, "origin": "t5_2tand_t3_mogatc", "height": 1, "replied_to": "t5_2tand_t3_mogatc", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I mainly use this when a negative thought appears in my head and I’ve noticed that my negative thoughts usually contain one word descriptions (“dumb,” “failure,” “ugly”). Some people practice saying positive things in front of a mirror but I tend to forget so just catching these negative one word descriptions of myself has helped a lot. If I have a thought that I am a failure, I usually take a step back and observe the full truth. \n\nSo I’ll think, “I’m such a failure,” and then reflect on that thought with “I haven’t been able to get a job offer after college and all of my friends have. I am feeling down because I am comparing my progress to others. I have proven that I have knowledge in my field and graduating college IS a big accomplishment in itself.” Then I ask myself if I’ve put in all my effort. If I have, my positive affirmation would be, ”I am doing my best” or “I am capable of obtaining a job because I’ve done x, y, z.” If there’s more I can do, I can say, “What I can do is seek advisors so that I can practice interviews and get feedback or have my resume reviewed.” My positive affirmation would be, “I seek help when I need it so I am always making progress toward my goals.” \n\nBasically, I bring forth why my statement of being a failure isn’t completely true, identify what more I can do, then come to a conclusion that is more accurate of my current situation (recognizing my efforts).  Some folks may have a different way of utilizing positive affirmations but this is my thought process. Most of the time, my positive affirmations are not the direct opposite of my negative thought. In my example, I guess someone could say, “I am successful because of x, y, and z,” but that doesn’t address what’s causing me to feel like a failure at the moment. Hope this helps! Sorry for the long response.", "permalink": "/r/DecidingToBeBetter/comments/mogatc/ive_been_trying_to_not_be_a_lazy_loser_for_years/guaxxfi/"}