{"id": "t5_2tand_t3_nwf5vh_t1_h19ili8", "creation": 1623321113, "origin": "t5_2tand_t3_nwf5vh", "height": 1, "replied_to": "t5_2tand_t3_nwf5vh", "down_vote": 0, "up_vote": 30, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "oregonchick", "text": "There are these things called Defense Wipes you can order on Amazon that have tea tree oil and eucalyptus in them that are amazing for cleaning your skin. They're mildly disinfectant, which is great when your hygiene isn't, and they remove a lot of dirt and oil from your skin while still being hypoallergenic for sensitive skin. They're designed for athletes to use when they can't shower and they're a popular request in military care packages, too. \n\nThey're not cheap, but no-rinse shower caps are often used in hospitals to wash your hair when conventional bathing isn't possible. They are a step up from a lot of dry shampoo formulas in how much they clean your hair. \n\nIf you only have a shower or don't like baths, don't be afraid to buy a shower seat from a medical supply aisle or Amazon. They are especially great if you have a handheld showerhead. You can just sit naked in your shower until you are ready to put the water on, then turn the spray away until it's the right temperature. And you can wet your hair and skin (and rinse it off) really easily and quickly because you control the direction of the spray. You can also stay seated while you dry off most of your body if you don't have the energy to stand for that.\n\nDepending on your financial situation, don't be afraid to hire a housekeeper to handle your messy home. They can do one-time sessions or come weekly or monthly if that's better for you. You can find them via agencies like Merry Maids, word of mouth, even Craigslist. Just be honest about your situation and ask for a quote. You deserve to live in a clean home even if you don't have the energy to clean it yourself right now.", "permalink": "/r/DecidingToBeBetter/comments/nwf5vh/hygiene_tips_for_when_youre_at_your_lowest/h19ili8/"}