{"id": "t5_2tand_t3_ny4u1u_t1_h1kksaj", "creation": 1623544273, "origin": "t5_2tand_t3_ny4u1u", "height": 1, "replied_to": "t5_2tand_t3_ny4u1u", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NotReallyTaylorSwift", "text": "Honestly I’ve reinvented my life several times. It’s actually been mentally rejuvenating to move somewhere else and reset my life to a whole new chapter. I reboot my reputation, my apartment, my neighborhood or city or part of the country. It’s like either my rent got raised or I just needed to get a new job or I have some deranged stalkers or all sorts of reasons combined. But there’s weeding out the friends that I want to keep in touch with and friends that stopped being friends and I’ve outgrown them because they changed so much in ways that are too different for how I’ve changed. \n\nWhat I’m saying is that maybe you need to not only evolve who you are on Instagram and get rid of people that you’ve outgrown following or people that you don’t want following you but also apply that to your real life as well. Find a new city in another state or country and a new job and move. Create a new social life and everything. Don’t create a rut for you to be stuck in.\n\nThere’s just a lot of people that I learned don’t care about me and I don’t need the past dragging me down. No need to make one’s life stagnant. It’s a big world out there and some people never fulfill their potential of going out there and living in new places and traveling and creating a social/professional network that benefits them. Don’t hold yourself back from going out there and seeing the world and meeting new people while cutting out the people that are basically bringing negativity into your life. The time that you have in your lifetime is precious. Don’t waste it.", "permalink": "/r/DecidingToBeBetter/comments/ny4u1u/i_finally_unfollowed_my_ex_on_instagram/h1kksaj/"}