{"id": "t5_2tand_t3_aaofoo_t1_ecvdmvq", "creation": 1546177752, "origin": "t5_2tand_t3_aaofoo", "height": 1, "replied_to": "t5_2tand_t3_aaofoo", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "doc_samson", "text": "Congrats on the great career move. That took guts to leave the known and travel into the unknown. I made a major career change this year as well, having the choice between an easier but boring job or a far more challenging but rewarding job, and I chose the latter. (after much deliberation...)\n\nAnd thanks for passing on your experiences. This part here is so important for people to understand:\n\n> If you try, if you put in the work, if you do what must be done... you're going to see ***some*** wins, too.\n\nKey word there being *some*. There will be setbacks and failures. Progress forward is never truly linear. Maybe the job was wrong, maybe it won't work out, but getting out of the first job was a definite must. Maybe the next person has to make two job jumps, or three, to get to their success point. The only definite fact is that \"if you keep doing what you've been doing you'll keep getting what you've been getting.\"\n\nAs you wrote further up:\n\n> Several times during my first few months, I just stared at the wall of my cubicle and thought about how inadequate I was and how I didnt belong there. I hyperventilated a lot. I cried a lot. I screamed in frustration in the privacy of my own home a lot. I freaked out a lot.\n\nIt's so important for people to remember this. Too often we get these saccharin \"success stories\" about people who made a change and everything just magically worked out. It turns a real-life struggle into a Disney-princess fairy tale where their Prince Charming Job finally found them and they lived Happily Ever After^(TM). They gloss over all the trouble and frustration and anger and pain and stress they had to deal with, making it sound simple and urging everyone else to do it. You were honest about the frustration and pain of growth and that is great. Life doesn't work on bumper-sticker \"just do it\" platitudes, it takes hard work, which you put in, and grew as a result. \n\nYou tackled the challenge head on *and you succeeded*. Congratulations! You deserve to reap the rewards of your efforts now.", "permalink": "/r/DecidingToBeBetter/comments/aaofoo/when_persistence_pays_off/ecvdmvq/"}