{"id": "t5_2tand_t3_lqajy9_t1_gofqwk7", "creation": 1614064596, "origin": "t5_2tand_t3_lqajy9", "height": 1, "replied_to": "t5_2tand_t3_lqajy9", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Specialist_Bag", "text": "\nMany times we are overthinking because we are relying on others approval. Think at you as another person whom trust you have to win. This can t be done by simply talking to yourself and somehow convince you that. The medium is the way, so try to put you in environment that facilitate this.\n\n1. Start doing things, any things that are not familiar , does matter for the moment , just get into the habit of not thinking by engaging in different things.\n\n2. Set some boundaries and standards for yourself and try to maintain them. Please start small and continue to add more and more as you encounter different situations. Try to make this a long term goal.\n\n3. Start small in everything, talk to a stranger at the supermarket, or you can asks the guys who are sorting cans on shelves for examples. Get into a taxi and start a conversation with the driver. Do small things that you know you can do it well so that you will build trust. \n\n4. STOP doing things that make you weak. Make a list with things that you do or have that are not beneficial for you. Those things that make you feel small, unworthy , bad, miserable etc. You can start with external things like “ nails not being clipped “ or “ putting socks with holes “ these are the easiest to look for, don’t put on that list personality traits that are vague or hard to define (e.g over sharing ) Once you have that list you can start working on that direction, clip your nails, throw all your used underwear or socks away, get a haircut, wash your clothes regularly, whatever you put on that list.\n\n\n\nTry to shape your environment and avoid putting yourself in situations that are not beneficial for your growth. You need room to grow, so avoid toxic situations and people, once you develop your sense of worthiness you can expose yourself incrementally to uncomfortable situations just to grow even more. Think it like a game, you need to level up before fighting bosses.\n\nGood luck", "permalink": "/r/DecidingToBeBetter/comments/lqajy9/how_to_overcome_my_overthinking_habit/gofqwk7/"}