{"id": "t5_2tand_t3_gp73ve_t1_frma9b2", "creation": 1590295249, "origin": "t5_2tand_t3_gp73ve", "height": 1, "replied_to": "t5_2tand_t3_gp73ve", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "moxielicious", "text": "I would definitely not say gifts are my love language. There are basically three days each year I plan to exchange gifts with a sweetie when I have one: Christmas, birthdays, and Valentine's Day, and usually Valentine's Day is something homemade and funny. I don't really do gifts other days of the year, but I think those three are pretty standard. \n\nI would have been happy with whatever under most circumstances. If he hadn't asked me what I wanted, and just got me something that he thought I would like, even if it was a miss, I'd have appreciated that because for me, it's really the thought that counts. And in this case, the thoughts were not cool.\n\nAs far as gifts go, there are generally two ways you can go:  \n1. Think about what the other person would like and do your best to get them something they would like.  \n2. Ask them what they would like so you can get them something they would like.\n\nI'm a pretty practical person. I don't believe we are supposed to magically read anyone's—even our intimate partner's—mind. I consider that second option completely legitimate, and if someone pursues that, I'm going to do my best to make it easy for them by being clear and reasonable. No asking for something that would be financially painful for them, no making them do a lot of work trying to track down something hard to find, no setting them up for failure by making them guess what size I am, or anything like that.\n\nIn this case, he asked me what I wanted, I told him, and he basically said it wasn't worth the money for something that would just die. Here are some surrounding circumstances—we were double income (both engineers, so very good income), no kids, with a dog (aka DINKWADs). We were maxing out our 401ks, had our credit cards paid off every month, had an extremely reasonable mortgage, and his car at the time was paid off, I believe. Even after all that, we were both putting away extra money in savings, even after budgeting some spending money for things like a nice vacation each year and his pricey hang gliding hobby.  He had just dropped $1500 on a hang glider for himself the previous month. But here he was saying that even though I had just made it completely easy for him to make me happy on my birthday for the low, low price of about $50, less than what he would spend on gas or beer on a weekend trip with his buddies to go hang gliding, it wasn't worth it to him. He wanted to argue me into telling him something else I wanted, and when I wouldn't play the guessing game of what I was supposed to say I wanted, he grudgingly got me the cheapest, tiniest little thing of flowers he could possibly find that technically met the parameters I gave him. It was given not in the spirit of celebrating another trip around the sun completed and hopefully many more to come, but in a spirit of resentment toward me. It was not given as a \"Happy birthday! I am glad to have you in my life and I want you to be happy!\" gift but more as a \"There. You got what asked for. Can I cross that off the list now?\" kind of thing. In that sense, I guess he was right that it wasn't worth it because $50 to make me feel bad on my birthday does seem like a waste.\n\nIt was not about the gift itself. It was about him telling me that spending $50 frivolously on himself to make himself happy a couple of times a month was worth it, but spending $50 on me frivolously to make me happy on my birthday of all days was not worth it. It was about him not wanting to do the work of figuring out what to get me, but then ALSO going beyond that into making my special day hurtful by telling me my happiness on my day is not worth $50 to him, and then making it into a chore and a battle by expecting me to try and figure out what different thing he would think it was \"worth it\" to get me.", "permalink": "/r/DecidingToBeBetter/comments/gp73ve/ive_decided_to_be_kind_to_myself_after_a_breakup/frma9b2/"}