{"id": "t5_2tand_t3_povfzq_t1_hd3p5ux", "creation": 1631812870, "origin": "t5_2tand_t3_povfzq", "height": 1, "replied_to": "t5_2tand_t3_povfzq", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "redubshank", "text": "1. Some games just bring out toxicity.  Town of Salem does it for me.  Rocket League makes me toxic with myself.  If a game consistently does this it's probably time to take a break.  We are playing these for fun, right?  \n2. Always remember, the shit we do in video games doesn't matter.  A friend or squadmate in Warzone wipes your squad over a stupid mistake?  You can get angry at the person which helps no one or you can just laugh at it and start the next match.  There is a choice there.  If it doesn't feel like there is a choice then see #1.\n3. If possible, try to get a group of friends going you mesh with.  Every game has toxic people and it's a struggle not to respond back with toxicity so if you can just put together folks who play well together that takes out a hurdle.\n4. Remember that the people you play with are always human.  They have good days, bad days.  Sometimes they are new to a particular game.  Sometimes they are new to gaming in general.  Some folks might only game 1-2 hours a month.  Some of them are children. All of them are just trying to have fun, albeit in a sometimes misguided way.\n\nAlso just read in the comments it was Sea of Thieves, I love the game but I end up taking a lot of breaks.  The magic in that game is the sort of adventure and shenanigans that happen but when you start taking it seriously and get annoyed when you aren't raking in big loot hauls or you get sunk by another pirate it starts to lose the magic.  I mean, if you lose your loot you lost out on pretend money that is only used to buy cosmetics...  If you start getting very mad at that then it's a sign to take a break.", "permalink": "/r/DecidingToBeBetter/comments/povfzq/just_wished_death_on_a_random_person_in_a/hd3p5ux/"}