{"id": "t5_2tand_t3_gixkk8_t1_fqigdhv", "creation": 1589395637, "origin": "t5_2tand_t3_gixkk8", "height": 1, "replied_to": "t5_2tand_t3_gixkk8", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Man I don't believe the whole \"People cheat when they're missing something\" about relationships. People leave relationships because they're missing something. Cheating really is just due to the shitty person because it points to insecurity, selfishness, and immaturity.\n\nCheaters are objectively shitty people in regard to relatioships; just because you're insecure doesn't mean you get to cheat, but then act like you \"needed to\". I think a lot of cheaters try and push the narrative of \"missing something\" because it makes them seem like less of a bad person. Yet when most people realize they're missing something in a relationship, they either talk about it with their partner, or just end the relationship unrelated to having found someone else. An inability to do either shows selfishness, insecurity, and/or immaturity.\n\nOf course it's okay to look back and see where you may have made mistakes in relationships. We're all human, we all make mistakes. Learning from those is indeed essential to having better relationships in the future. That being said, not a single one of those mistakes, whether it's doing something wrong or a lack of doing something right, is an excuse for someone to cheat. Cheating is entirely a conscious decision, with the person being fully aware of what they're doing. Once you start splitting the blame for something that was entirely the choice of one selfish partner, it becomes a slippery slope. Blaming yourself for other people's choices isn't a healthy way to live. \n\nNot sure if you were trying to take that angle or I just read it that way, just wanted to give my two cents on that particular  concept.", "permalink": "/r/DecidingToBeBetter/comments/gixkk8/girlfriend_of_25yrs_left_me_for_someone_else_im/fqigdhv/"}