{"id": "t5_2tand_t3_gixkk8_t1_fqlnjej", "creation": 1589462361, "origin": "t5_2tand_t3_gixkk8", "height": 1, "replied_to": "t5_2tand_t3_gixkk8", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Linzinator", "text": "I understand that the societal definition of cheating is exactly what they want it to be. But have you ever explored pushing that boundary? Maybe opening up your perception of the word itself? Who's getting cheated by her emotional connection with another person? If you were open, she could commence with her healthy human connection while coming home to you to share that love even more.\n\nHumans by nature are not meant to be monogamous. I've personally never succeeded at having an open relationship (yet!) But I've been more and more open to the idea that I am no ones property and vice versa. We are all on this journey together, so why do we feel the need separate into pairs? We are always stronger in numbers.\n\nAlls I'm saying is, she clearly felt the need to pursue these feelings with the other person and she knew if she were more \"honest\" you'd break up anyway. I do have first hand experience with this situation (me being the infamous gf) and I know when I began to feel things for this other person, I had to bring it up as soon as I knew they were more than just school girl butterflies. My partner at the time took it well on the surface, but his jealousy boiled over, leading to our eventual break up. (I never did hook up with the other guy being that he's on the other side of the country.) Ironcially, my ex and I have since reconnected after a 7 month long separation.  We are better than ever now that we've both clearly stated our boundaries and explored our preferences. I learned that I've been raised to believe in monogamy, but my mind, body and soul don't always align with that notion....it doesn't make me unfaithful or disloyal. It just means that I'm figuring out what I like, just like everybody else. \n\nI say question what you want in a relationship. Is it a person or a notion? Is it based off what your parents taught you about love? If these feelings you're having about your ex have hurt you, then ask yourself why. The sooner you find out where it's all coming from the sooner you can make a choice about whether or not you wanna conform to those feelings anymore. Good luck to anyone dealing with this! The struggle is real.", "permalink": "/r/DecidingToBeBetter/comments/gixkk8/girlfriend_of_25yrs_left_me_for_someone_else_im/fqlnjej/"}