{"id": "t5_2tand_t3_1sv1hb_t1_ce31tu4", "creation": 1387208059, "origin": "t5_2tand_t3_1sv1hb", "height": 1, "replied_to": "t5_2tand_t3_1sv1hb", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "shallah", "text": ">I've always analyzed why I feel a certain way and explored what to do about it, but it was only recently that I realized I have to just let myself feel it as well. \n\nFeeling the emotions a little at a time (like exposure therapy to a phobia), allowing myself to really *think* it and *feel* it not just let it pop in my head and frantically shove it away or go along with that train of thought have been key for me in gradually reducing such thoughts.\n\nIn Dialectical Behavior Therapy they teach mindfulness and part of that is Observe and Just Notice. Observe the thought and emotion(s). Don't automatically try to shove it away or go along with it. Those both reinforce and even increase the emotional charge linked to it. I believe in some forms of meditation this is also referred to as Noting and Naming. \n\nOh, it's you again excessive self-criticism, anger, self-hatred, and sadness. Try to let the emotions float inside of me, feeling them as much as I can without risking overwhelm (i have an anxiety disorder). Do not violently shove them away or wallow... more dipping the toe or whole foot in there. The longer I do this with as many uncomfortable thoughts and emotions the more space there is inside of me to work with them. Oh and I have to remember to slowly belly breath when doing this. I tend to breath shallowly or catch myself holding my breath with stressed. Doing the mental/emotional work is not effective for me without including deeper than normal breathing because my physical body is not calm enough to break the association of negative thought/emotion = physical/mental/emotional threat/alarm/higher rate of panic attacks.", "permalink": "/r/DecidingToBeBetter/comments/1sv1hb/negative_emotions_are_key_to_wellbeing_scientific/ce31tu4/"}