{"id": "t5_2tand_t3_na3n1b_t1_gxszulq", "creation": 1620784585, "origin": "t5_2tand_t3_na3n1b", "height": 1, "replied_to": "t5_2tand_t3_na3n1b", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Tinsel-Fop", "text": "Hey, here's something a past dentist did for me. First, he and his staff used to specialize in pediatric dentistry, so I decided that was probably why they were so patient and careful. Anyway!\n\n**He gave me a tissue and said that I should raise it if at any time I want them to stop.**\n\nI thought that was great. What a wonderful way to give the patient a sense of control: actually put him ina control of the whole thing stopping or proceeding! I thought, \"That's a great way to treat a child. Oh, wait! It's a great way to treat any person!\"\n\nI saw them several times, even making a pretty good drive to their office when I moved a couple cities away. One time, I did raise the tissue. You'll never guess what they did. :-) They stopped! Immediately. Asked me what my concern was, addressed it thoroughly, and carried on at my word.\n\nYou could suggest tissue control to your kind, knowledgable, patient dental office, if you felt like it.\n\nLater I found a dentist whose services cost more. She was also president of our state's dental association, an educator in the field, and very much on top of advances and new technology. She was also kind and patient with a healthy sense of humor. She always carefully checked everything in there for signs of disease and dysfunction. She explained what she looked for in examining my tongue, for instance.\n\nOh, and she used to run the dental clinic in our city for people with HIV & AIDS. She knew all *kinds* of stuff! She would ask me how I had been feeling lately, told me mental health professionals sometimes ask about a client's dental health and appointments because people with depression (for instance) would miss or not set appointments. She never treated just teeth, or just the oral cavity. I mean, it *is* all connected. Her staff were just as lovely. Finally one day I realized I needed to tell them: \"I love you guys.\"\n\nOh, my gosh, if you need to tell them, \"I love you,\" ummm well, I give you permission!  LOL ... I am so glad you already know that you can trust and really count on your folks for excellent, compassionate care. All things considered, surely this will be the easiest it could possibly be. How wonderful that you have found the people you need. All the best to you, and tell them I said Hi! :D\n\nTL/DR: Try the tissue if it appeals to you. See small **bold** area above.", "permalink": "/r/DecidingToBeBetter/comments/na3n1b/first_dental_appointment_in_four_years_could_use/gxszulq/"}