{"id": "t5_2tand_t3_bzdv0j_t1_eqrvgn4", "creation": 1560270829, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Frusciante_Fucker", "text": "Thank you for the response :) \n\nYour point about the news being sensationalized is very true, often times to the point of fear mongering, I think. I ought to keep that in mind when I do consume news. \n\nI do feel there is merit to some of the \"doom and gloom\" aspects though, and perhaps it is manipulation - but from the information I've gleaned about what's happening to the environment, it could be a very slippery slope that propels us into conditions that surpass our ability to \"solve\" our way out of it. \n\nFor example, in the sensationalized spirit, I keep seeing headlines about \"the next great extinction event,\" or whatever. Some insect populations are reportedly plummeting, and while a great deal of us are apt to say \"I don't mind, less pests,\" we fail to take into consideration the long term impact of such a thing, and this is only one example.\n\nWill our knack for inventiveness and problem solving be able to reconcile with the consequences of insect extinction like food chain disruption? Think of the rippling impact that would have. \n\nI feel that there are so many ongoing (potentially)catastrophic issues happening under our noses that we will be blindsided by the mounting effects. With the Earth's ever-growing, exponentially expanding population and ignorant politicians, we're really straining the planet and I feel that if we do collectively get our shit together, it will only be by the skin of our teeth. \n\nNot trying to dismiss/discredit your examples but this, climate change, I guess, feels different. Of course, I did not experience these things so maybe the fear I feel over climate change is akin to the fear those convinced of Y2K felt sitting in their bunkers. . . but climate change seems too real. Nobody will look back at people worried over climate change and go \"oh how silly, they were worried over nothing!\" \n\nI feel like I'm playing devil's advocate, but honest to god it seems to me that the only way to find peace in this chaos is to ignore it, which doesn't sit right with me. \n\nthanks again for your response, definitely gave me some food for thought", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqrvgn4/"}