{"id": "t5_2tand_t3_bzdv0j_t1_eqtzzld", "creation": 1560322454, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MyNameIsMud0056", "text": "First of all, I want to start by saying that the figure from the UN, that we have 12 years to solve the climate crisis is not equivalent to saying the world is going to end in 12 years. Many news outlets were picking up on this figure but many were sensationalizing it, which could contribute to feelings of hopelessness and existential dread. But it’s not accurate. The report found that if we cut emissions by 45% by 2030 compared to 2010 levels, we can hold the earth at 1.5 degrees C of warming. 2030 is 12 years away or so, so that’s where the number came from. You can read more here: https://www.axios.com/climate-change-scientists-comment-ocasio-cortez-12-year-deadline-c4ba1f99-bc76-42ac-8b93-e4eaa926938d.html. Climate change does not have a cut off point, it’s a sliding scale.\n\nSecond of all, I understand how daunting thinking about the environment can be. I should know, I work in the environmental field, in green building, and spent the last five years learning about all that’s going wrong. But I know that we have to remain optimistic and hopeful, because that’s the only way we’re going to get stuff done. We have to believe in the work that we’re doing, otherwise we’ll fall into despair and inaction. We have to keep moving forward.\n\nEvery day amazing advancements and progress is being made, even if it doesn’t seem like it. For example China and many other countries are working to plant thousands and thousands of trees. Pakistan has planted over a billion trees. The work in energy efficiency and green building is very exciting too. Standards like Passive House and LEED are catching on, as is the Living Building Challenge. Advancements in mass timber means we’ll start being able to build tall wood buildings (and we already are), which are actually more fire resistant and sequester carbon. Renewable energy is making leaps and bounds. And cities around the world are actively pursuing efforts to increase sustainability, as more and more people flock to metropolises. NYC has now banned new tall glass buildings I believe, which are not very efficient, and existing ones will undergo retrofits.\n\nThe future is not lost and there are many ways to get involved. Perhaps local committees on energy and sustainability, lobbying your policymakers (seems you’re in the US), see if you can support your state’s renewable energy portfolio/goals, many states have one. Work with/support the Nature Conservancy, or Natural Resources Defense Council, find a local Sierra Club chapter. Join your town or city’s planning commission, attend meetings, VOTE. Make your house/apartment more energy efficient, \n\nI truly hope this helps.", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqtzzld/"}