{"id": "t5_2tand_t3_bzdv0j_t1_eqsyiua", "creation": 1560297253, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Windbiter", "text": "Wow. I know your twin, he is a tortured man with a lion’s heart. I can’t help him not feel these things deeply, I do feel them myself, but not like you or him. \nWe do all we can to protect flora and fauna. We have an organic garden. We have an organic farm.  And we try to encourage but it does seem useless. \nMuch control is in the hands of gvt. Research the candidates to see who is a friend of our environment. They push for protections and regulations. Don’t buy products from countries that are known to be destructive or toxic. \nAnd that higher power? I see the wealthy vile pigs that support candidates who will dismantle regulations, worth $billions, in their 80s and still not enuf money. I see ppl like Mr Rogers and Michael Landon dying too young. I do not see justice or fairness or rhyme or reason. “The rain falls on the just and the unjust”, makes me feel like I’ve been warned about fairness. I don’t believe any higher power is going to swoop in and save us from those pigs in power. \nI do say that ppl with you heart are needed in this world to help the rest of us like minded ppl make it every day. We need you. We need your heart, your outlook, your attitude, your efforts.  And we are out here for you. \nKeep living the good life. Days go by and maybe you’ll not see the many ppl who learned from you or noticed what you do. Every day you have the potential of influencing ppl, changing on heart at a time. And I guess, when it’s all over, ppl will say you did live a good life and we’re a grand example. And if it does matter to some higher power, you’ll see that grateful smile too.", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqsyiua/"}