{"id": "t5_2tand_t3_bzdv0j_t1_eqs03d1", "creation": 1560273723, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "furrysurender", "text": "My mom is 50 years old, when she was a teenager they were making a scare that California was going to drift away and become an island in a matter of years. Didn’t happen. Just know that this fear is purposeful, and has always been here. There is always a new thing to be afraid of. Remember Ebola? Lol. The world is not ending, mother nature is more in charge than we’ll ever know. Politics wants us to live in fear so we continue as slaves and conform to whatever their belief of life is. My solid advice: ditch the news and create your own belief. Live in love, not fear. That’s why you’re here. \n\nRight now is a tough time to grow up, the world is upside down, the truth is being hidden, we’re learning who to trust through deception and lies. But the good news is that love and safety is all around us, we’re just not trained to look for it. All the love, truth, and wisdom you need is inside yourself. Trust yourself more than anyone else. When we put our trust and faith in a system that has a control on us, we feel chaotic, fearful, confused. We need an inner compass to go through life, not a system telling us what to do. A higher being gives that to many people. Whether it’s an an organized religion, spirituality, nature, science, or just believing in something bigger even if you don’t know what all of this is. Just look at the stars at night. You can feel that this world is more than what meets the eye. But don’t believe that organized media, government, education system, and even religions - will point you in the right direction. They want you to be afraid, uninspired, unhopeful. Because then they’ve got their hook in you. It’s like depression. It controls the way you think, act, the choices you make - because you’re living in a fearful and uninspiring mindset. It is possible to live life through love. Spirituality is a great place to seek answers to the bigger questions of life. Just know that all you need to do is trust yourself. There are always 2 sides to every story, but really; there are so many sides. I’ve given up trying to make sense of the current politics. I do not keep track of the news and what is going on. It gives me no benefit, it actually makes me feel worse. Life is a matrix, there is more behind the screen. Don’t let them control your world. YOU get to decide what type of world you want to live in just like when you were a child and your imagination seemed endless. Don’t let them repress that inner child through fear and control. Love and hope is everywhere, but I promise you won’t find it in the media or politics.\n\nEdit: Have faith there is a bigger force at play that is keeping things balanced, or rather continuously balancing things. It doesn’t matter if you believe in god or not. It’s life. NOBODY has the answers to all of this, nobody ever has, nobody ever will. Step out of the system and live life the way you want to live, not the way someone is telling you to live through fear. Be in nature today. Feel the LOVE that the sun is giving to you. Everything has its place and will continue to find a new place if lost or destroyed. In destruction there is creation. You cannot fix the corrupt world, you can only recognize it and have control over situations that come your way. The most knowledgeable people know that they know NOTHING. And that’s how you live life freely instead of controlled by thoughts, ideas, narratives. But you’ll get lost in the nothingness as well if you don’t have something truthful to hold on to. And the truth is life, god, source, energy, love, light. It is all around us. Invite love into your space, your mind, your HEART ♥️. The universe is waiting to show itself to you, but you have to invite it in first or else you’ll be looking through the lens of fear.\n\nBless you, I promise things aren’t as dim as they seem. The world is sucky and corrupt, but it always has been. We’re living in amazing times still. It just depends on the lens you choose to view life through: fear, or love ♥️ \n\nTo make a long story short: Trust that the same systems that is controlling the world is also controlling the news and information they are putting out. They are in charge and control of media, education, government. They are controlling the narrative. But you have free will and can choose your own narrative. My advice is to choose love ♥️", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqs03d1/"}