{"id": "t5_2tand_t3_bzdv0j_t1_eqstdvk", "creation": 1560293308, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "smokeandfireflies", "text": "I am NOT a religious person at all, but this quote helps me a lot: “in short, God has granted to ordinary men and women the dignity of participating in the Great Reversal which will restore the cosmos to its pristine state. All the reasons for disappointment with God, as well as all cancers, all deaths, all broken relationships, all the collected groaning of our savage planet — all these imperfections will be wiped away... and we, you and I, are the ones selects to help bring that about... [we] can join the struggle to reverse all that is wrong with the universe. We can make a difference.” (Philip Yancy “Disappointment With God.”)\n\nAnd this: “Our present life feels like a real fight - as though there were something really wild in the universe which we, with all our idealities and faithfulnesses, are needed to redeem.” (William James “The Will to Believe”) \n\nAgain, I’m not religious by any stretch. I do, however, follow the same Gnostic philosophy that Carl Jung subscribed to, and these two ideas jibe perfectly with Gnosticism, as well as with most religions, if you happen to follow a religious path. The side of light, and faith, and right is the same, no matter what we call it in our individual practices. And none of us knows the end, because the ending of our story had not been written yet. Our job is to keep the faith, and to make the world a better place, moment by moment until —hopefully — the scales tip, and the side of goodness and life and hope prevails.\n\nEven if the worst happens, and the terrible predictions come true, there is no honor in giving up, in succumbing to despair. Keep the faith, knowing you are on the side of the Light. Who can say what unseen help is on our side?", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqstdvk/"}