{"id": "t5_2tand_t3_bzdv0j_t1_eqtl9nu", "creation": 1560313880, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "josski32", "text": "People are moving with climate change!\n\nLast August, a 16 year old girl in Sweden named Greta Thunberg started sitting in front of her local parliament demanding action for climate change. Now it's a huge thing all across Europe, thousands (probably over a million) school children don't go to school on Fridays to protest non-action for climate change. They call it Fridays for Future and argue what is the point of getting educated for a future that won't exist and what is the point of learning facts if the most important facts of all (on climate change) aren't even considered by politicians. Greta has given a Ted Talk and spoken at multiple national governments and the EU. \n\n[https://www.youtube.com/watch?v=oCVQdr9QFwY&t=45s](https://www.youtube.com/watch?v=oCVQdr9QFwY&t=45s)\n\nIn the United States, Rep. Alexandria Ocasio-Cortez has created a plan called the Green New Deal, which focuses first and foremost on fighting against climate change, and it calls for drastic action. Most of the 2020 Democratic candidates have sponsored or supported it.\n\n[https://twitter.com/AOC/status/1118520320653238272](https://twitter.com/AOC/status/1118520320653238272)\n\nElon Musk, of course, with Tesla, has been popularizing the electric car, and increasingly other car companies are making electric cars to compete.\n\nThere is a subreddit called r/ClimateActionPlan which talks about the strides countries are making towards sustainability and hope for the future. \n\nThis is a really scary thing. But I also think people are starting to get it. I'm experiencing similar feelings, just finally having some good mental health and feeling like it's all for nothing, feeling like we're all in the calm before the storm. It's hard. What I try to do is think about how many people are starting to care. Things ARE getting better. We are waking up. \n\nI think if you need to ignore it or not think about it that is okay. Just take it day by day. You're no help to anyone if your own mental health is suffering. You deserve to put yourself first, 100%. You don't have to think about it every second of every day. But vote for the politicians that will help this cause! Talk to people you know! You don't have to give up and you don't have to ignore it. But it doesn't have to be the demise of your mental health.", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqtl9nu/"}