{"id": "t5_2tand_t3_bzdv0j_t1_eqsxz1x", "creation": 1560296825, "origin": "t5_2tand_t3_bzdv0j", "height": 1, "replied_to": "t5_2tand_t3_bzdv0j", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I think that one way to help you feel like you are doing something, is to have compassion. \n\nHumans have never liked change. We've always resisted it. It takes *generations* for culture to change. So, it's no surprise that we aren't all upheaving our lives to save the environment. Is it good to ignore the future? No. But is it understandable why we are? Yes. Baby Boomers are not the first (or *last*) generation to \"be stupid\", \"ignore the facts\", \"ruin their children's future\". Generations before us have *always* pushed back change for (what they believed) was their children's benefit. Whether it be the popularization of writing ideas down, or women's rights, or something else. Was that good? No. But with the *knowledge they had* they tried their best. \n\nNow what's this got to do with the end of the world? What's this got to do with compassion? \n\nHere's some tips:\n\n1. Do not blanket blame people. \n\n*Nobody* likes being blamed. Especially considering each person was doing the best they could to achieve *their* goals. Don't blame a single country for a problem, a generation, a race, or gender. It's a complicated combination of things. Blaming makes people stop listening and *dislike* you. If you want people to change, don't blame them. \n\n2. Encourage every single little change. \n\nLet's take reusable straws and the #trashtag as examples. \n\nSome people say: \"ohhh you aren't making a *real* change by using metal straws!\". This doesn't encourage people to change, this encourages them to ignore you! This makes them think \"oh well i tried doing this thing, but only got criticism, so I won't do anything!\". \n\nIn a similar vein, some see #trashtag as a symbol of how horrible and dirty people are. \"ohhh look how much (insert broad group of people) litter! *I'm/We're* better because *i/we* don't litter!\". This doesn't encourage people. This blames people (see 1). This doesn't celebrate some taking their most valuable resource (time) and spending it doing a good deed. This helps no one, and possibly harms, because it exacerbates negative mindsets. \n\n3. Be patient. \n\nHumanity is a like a mule. It may be thirsty, but because you try to make it drink, it digs in its hooves and says no. Keep insisting? BAM! Kick to the head. No matter how hard you tug, it won't make the mule drink. \n\nSo what do you do? The mule is thirsty! It should drink for its own good! Its going to die if it doesn't!\n\nYou pull up a chair and wait. \n\nYou let go of the rope. You sit down. You pull out a magazine. Because the mule *knows* its thirsty. The mule *will* drink. But it doesn't want to do it when you tell it to! You sit long enough and the mule will get over itself and drink. \n\nThen you repeat. The next day, you lead it to the water and wait again. And again. And again. The mule won't learn. It's in its nature to be stubborn. It might get nicer. It might let you lead it closer and closer. It might give in faster and faster. But no matter how much you shove its nose in the water, it. won't. drink. \n\nI'm young too. It looks bleak. But if you listen to your peers you notice something! None of them have a solution. Why does that matter? Because they gladly criticize every solution offered! \"That'll take too long.\" \"Its too much money.\" \"Big Business will never agree\" \"thats the government's job\" \"that's the civilian's job\"\n\nHmmm...... Sounds familiar! Kinda like.... boomers, and everyone before them. \n\nMillennials aren't special. Gen Z (my gen) isn't special. We aren't \"breaking the cycle\". We aren't doing differently. We aren't better. We aren't worse. We are the exact same as everyone before us. Changing in little ways that the gen before criticizes. \n\nThe real solution to climate change, and every other problem on the news? Everyone on Earth banding together, working together, being peaceful. Is that possible? Even my optimistic opinion says no. \n\nWho? Who is to blame for us not banding together??? (well look back at tip 1!). Its not the boomers. Its not china. Its not any broad group. Its everyone. Millennials. Gen Z. Gen X. Boomers. Its Americans, Indians, Germans, and Australians. Its everyone. Because everyone hates change. Because its our human nature. \n\nHopefully this helps! Anyone who wants to chat more about my (seemingly but really not) unique opinion, just dm me! I got pretty morbid in the end there, which isn't my style normally. I'd also recommend following the other's suggestions. I only addressed part of your post so the other comments will be relevant too. They are important too!", "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/eqsxz1x/"}