{"id": "t5_2qh5i_t3_99sb25_t1_e4qxis0", "creation": 1535111402, "origin": "t5_2qh5i_t3_99sb25", "height": 1, "replied_to": "t5_2qh5i_t3_99sb25", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "a_rain_name", "text": "It depends on what level and ages of kids you are working with so I am going to try to create some blanket statements here.\n1) have fun and keep calm! It is so easy to get depressed or stressed out in this line of work. I don’t mean to imply that everything is meaningless but don’t make mountains out of mole hills. So your kid is having a melt down in the middle of the hall way? Challenge accepted! Get the kid out of public view and figure out how to remove whatever it was that caused the melt down. \n\n2) don’t take things personally. Kids with special needs occasionally have no filter. One kid asked me why I had pimples. Out right. In the middle of class. Brush it off and use it as a teaching moment. This occasionally applies to your co workers too. \n\n3) take your breaks!!! It’s so easy to think it’s easier to stay with your student and not take a break during the day. Protect your self. Read your contract or whatever and know what you get and fight for it (nicely). “I would really like to take my 15 at this time everyday. Can you cover for me or make sure Junior is cared for? Thanks.”\n\n4) do your job to the absolute best of your ability and keep appropriate communication with teachers and administration. It may not feel like they notice you’re a rockstar but they will. Just yesterday I was feeling a bit put out about my new schedule but I approached my principal about it and she made a few comments about why I was placed where I have been and it suddenly all made sense. All supervisors have to keep tabs on many situations and while you may just feel like a pawn to be used, you may get out somewhere because of your gift or talent. Lean into that. Remember that special education is a lot more involved with different policies and confidentiality laws. I create nicknames for students so I can atleast share stories about my day with my husband. “The kid who likes maps did this today...” \n\nGood luck again!\n\n\nAlso I keep my cell phone in a pencil bag with a clear cover. It’s a sneaky way to keep my phone on me in case I need help but then I also always have pens, pencils, erasers, sometimes candy and my keys with me but it’s not a book bag and it keeps my phone out of my pocket. I’m a woman and that isn’t an option all day as is leaving my phone on a counter or desk. I also most around the building a lot. The clear cover allows me to check messages without taking my phone out and letting students see. Yes most of them figure out what I’m doing before long but again, it’s a quick peek not a scroll like I’m on insta or reddit. ;) ", "permalink": "/r/happy/comments/99sb25/first_time_in_a_while_i_can_say_that_im_genuinely/e4qxis0/"}