{"id": "t5_2tand_t3_oygalt_t1_h7suwix", "creation": 1628169059, "origin": "t5_2tand_t3_oygalt", "height": 1, "replied_to": "t5_2tand_t3_oygalt", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "chrysanthemum44", "text": "You’re not overreacting by going to therapy- tbh there’s no minimum trauma or emotional distress you have to have to go to a therapist. Their job is to help you work through your feelings and learn how to deal with your mental and emotional struggles in a healthy way, whatever those struggles are. They’re kind of like dentists in that they treat anyone form people with perfectly healthy teeth to people needing serious intervention and mouth surgery. Even if you didn’t experience this abuse, you would still be perfectly normal for going to see to a therapist. And this sounds like something very serious, scary, and personal, so it makes sense you want to talk about it with a professional who may be able to help you.\n\nAlso, you can tell her whatever you want to, no matter how big or small it seems, and you can decline to tell her something, no matter how big or small it seems. Her job is to listen to you and help you work through some of your feelings. There’s no deadline for saying anything or pressure to be upfront with “all” of your struggles- she’ll understand if you don’t feel comfortable bringing up something that feels shameful right away. You should just say what’s on your mind, even if it feels like rambling- you could even say “there’s something that happened to me as a child that I want to talk about, but I’m a bit embarrassed/scared/nervous to say it right now.” That’s totally okay. Unfortunately, unless you’re her first client, there’s not much you could tell your therapist she hasn’t heard before. And she’s also bound by law not to share anything you say, so you can tell her whatever you want, no matter how embarrassing, and no one else will ever know.\n\nIdk if this will help, but when I first started seeing my therapist at 22 (also for CSA, domestic violence, etc), I was very nervous, i rambled a lot about everything that came to mind. Despite mentioning a lot of what had happened to me in vague, nervous ways, I also felt like I didn’t get to bring up everything I thought was wrong with me. I was also worried I would be judged, and I was scared and ashamed to talk about stuff that felt so deeply painful and personal-  and it turned out great. No judgement, she just listened and said she could tell i had been struggling for a long time and that she thought she could help me. She asked if I felt comfortable with her and wanted to keep talking to her, and I did. And yeah, she has helped a lot. I’ve been seeing her for 5 years now and i feel like I’m finally able to be myself and feel like a real person. It wasn’t easy or quick, but I don’t regret it at all, and I think therapy (with a good therapist you feel you can trust) can help a lot of people. I hope it helps you too, and I really encourage you to try it out.", "permalink": "/r/DecidingToBeBetter/comments/oygalt/going_to_therapy_should_i_tell_her_about_my_csa/h7suwix/"}