{"id": "t5_2tand_t3_pck101_t1_hajvku1", "creation": 1630069655, "origin": "t5_2tand_t3_pck101", "height": 1, "replied_to": "t5_2tand_t3_pck101", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CrunchyCookiez_", "text": "Everyone has bad habits, but most people choose to ignore them and pretend they don't exist, just because you decided that you wanted to change, you're already a king and you're already one step ahead of most people.\n\nWith that said, it will be a long journey because habits aren't something you can change overnight but, I'm sure you can do it! \n\nThe first step is to pick one thing you want to change and just focus on it for 1 month, ignore the other things you want to improve and just focus on that.\n\nFor you it could be binge eating, this is a problem that I myself have been fighting so I can give you some tips on that. A habit isn't like a sprint, it's like a marathon, so if you want to have good lasting results, you shouldn't be too rigid and you should take it one step at a time.\n\nStart by switching from the regular juices you drink to non-calorie juices, you can always drink those. Another important thing is that you can still eat pizza and all kinds of things you like on your diet because diet shouldn't be something you hate, diet should be normal for you, it's not just something you will do for 30 days and stop, it's something that you will do for your whole life!\n\nAfter that, you can also start eating salad with every meal, because most salads are low in calories and very filling, so you won't be so hungry to eat other things.\n\nIt would also be much easier for you if you decided to buy a kitchen scale (it's cheap) and start counting the calories you eat with an app on your phone (I recommend MyFitnessPall), it's not necessary, but it would help you a lot.\n\nTo find out how many calories a day you should be eating, you can use a tdee calculator (I recommend this one: https://tdeecalculator.net/) to see how many calories you burn per day and then subtract 20% of those calories. If you think 20% is a lot, you can start by subtracting just 10%.\n\nI trust you, you got this king!", "permalink": "/r/DecidingToBeBetter/comments/pck101/how_to_unlearn_a_bad_habit/hajvku1/"}