{"id": "t5_2tand_t3_g32ms0_t1_fnrkctu", "creation": 1587191715, "origin": "t5_2tand_t3_g32ms0", "height": 1, "replied_to": "t5_2tand_t3_g32ms0", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "wethelabyrinths111", "text": "Whether you call it a privilege or an advantage is quibbling over semantics, because those two have essentially the same meaning, a meaning that is at odds with human rights.\n\nIt has everything to do with rights because it's about what we consider our baseline, our norm. A right by definition is \"that which is due to anyone by just claim, legal guarantees, moral principles, etc.\"\n\nThe fact of the matter is that if something is my human right, I am under no obligation -- moral, emotional, psychological -- to be grateful for it.  It is mine. I did not earn it; I did not have to. If something is a human right, any person is entitled to it by virtue of existing. \n\nWhen we accept that rights do not require gratitude, we see that we should reject those who would deny or abuse our rights, who would profit by limiting or endangering our rights, who would use the people they have already successfully disenfranchised to convince us that we are privileged because we are not like those people.\n\nEssentially, when we accept that access to food is a right, we see that it is neither a privilege nor an advantage to not starve to death; not starving to death is the baseline. Anything less than not starving to death is a violation of human rights, and it is our duty to identify the source of the violation and rectify it.\n\nWhy do we express gratitude that you have food and shelter? We have been convinced that food and shelter are negotiables. They are privileges, advantages, whatever. Despite the absolute necessity of either for survival, we believe they are somehow \"extras\" or \"bonus,\" which is what ultimately what privileges and advantages are. \n\nWe have been convinced that refusing to be grateful for food and shelter is unseemly, even obscene. Why? Because others lack them. When we are obligated to be grateful for things to which we are entitled, we lose sight of the fact that our gratitude does nothing for the person who is starving or homeless. It does worse than nothing, because our gratitude creates a distance between that person and me. They are at best an object of pity and at worst vilified (e.g.they deserve their homelessness and hunger.) That distance allows the system that robbed that person of his human rights to continue unchallenged.\n\nNow I am grateful for many things. Gratitude is wonderful. Thankfulness, appreciation -- they are important mechanisms of a social contract. To give thanks or appreciation and to receive them: these create and strengthen relationships, and they help us reflect and prioritize. Furthermore, a sense of misplaced entitlement is disgusting and should be checked. But maintaining gratitude for your rights will keep you licking the master's boots no matter how hard or how often he kicks you in the face.", "permalink": "/r/DecidingToBeBetter/comments/g32ms0/if_you_can_afford_food_and_have_a_roof_to_sleep/fnrkctu/"}