{"id": "t5_2tand_t3_g32ms0_t1_fnqnhs5", "creation": 1587168176, "origin": "t5_2tand_t3_g32ms0", "height": 1, "replied_to": "t5_2tand_t3_g32ms0", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PalmMallALITA", "text": "I honestly feel the same way. I came to Reddit honestly hoping for some inspiration, maybe a few words to not feel alone. I quit my job before all this started, so I've faced the feeling of being useless/unproductive/lazy for quite a while now. I feel like it's my own fault for not trying to do more, whether that be productive and work on my goals, for writing, or learning Spanish, or working harder as an Instacart worker or a Lyft driver. I have opportunities around me to support myself, to keep the entropy at bay, to not feel like I am slipping down a slope without any reprieve in sight. Am I wrong for not trying to find a job? I'm perfectly healthy and able to work, I have a functional vehicle -- I could help drive healthcare workers or late night employees get home safe. I have ideas for articles I could post online, to start a blog and bring me closer to my own long term goals...\n\nBut I haven't really done that. \n\nIt's truly up to you what you decide to make out of this time. We're going to come out of this either way.\n\nI think it's an excellent point to make, that there seems to be a lot of guilt in all this endless free time we have in quarantine/lockdown/stay-at-home to be more productive and work harder on ourselves. We don't need to do anything right now. \n\nBut there's that feeling that makes it hard to accept. Is it guilt? Is it shame, that you aren't trying to be better than you were a second ago? Are you staring at the computer screen or out the window and wondering, why can't I be more productive and better right now? Why am I not using my time more wisely? Why am I not producing content or learning that language or improving my eating habits? What voice is really telling you that you are wrong for not doing these things? \n\nWe all live with several voices in our heads -- the voices of society, culture, social media, our leaders, our parents, teachers, the past, our younger selves, the projections of our future self -- but are they the real voice, your \"true\" voice? \n\nPractice tuning into that voice first. Listen to yourself. Evaluate what you hear on the outside too. Be patient with yourself. Are there days that end up with you sitting on the computer scanning Reddit for 3 hours (like me -- I was going to work out today and here I am, unmotivated and frustrated and bored)? Ok, that happens. Just accept it and move on from that. It doesn't define you or your future actions. \n\nMy partner works six days a week and is a bike courier, delivering coffee and bakery items while also working his other job at the coffee shop where I worked. I feel guilty when we talk, and I tell him about my day, and how non-essential and meaningless it seems in comparison to what he experiences and feels every day. He rides in all weather, has already hurt himself once (but recovered), has an impact on multiple people daily, is vigilant about his health and his environment, and takes photos of the areas he's traveled through, creating a photo journal to record these times to look back on, and to see what the impact is at large. He seems so much more in touch with the world than me, right on the front lines, serving his community and thriving daily doing what he loves (mainly riding bikes). \n\nI don't bring up his story to shine a spotlight on his efforts and how he's making it through. I feel like he put himself in an exceptional position, but is among many trying to make things work when things aren't. What I'm trying to say is, there is nothing to compare between what he is doing, and what I am doing. Our circumstances are different. I would still be working at the coffee company if I hadn't decided to part ways already. Now I am at home, trying to write, trying to learn and better myself some days, and other days I play Skyrim or watch Youtube videos and listen to DnD podcasts and drink with my friends. I watch movies and try to read when I'm not feeling too restless. \n\nIt doesn't matter what we do. What matters is doing what makes us feel alright, doing what helps us get through, whether it be playing videogames or working out, working towards a goal -- which I think is great to have, because it can help you focus and orientate yourself when you feel stuck in endless days of corona -- and it can be something to better us, something to change us, something to help our families, ourselves, maybe even our communities, our workplaces (offline or online). It shouldn't make you feel guilty, or ashamed or set you up to fail yourself, to let you down because your expectations were so high. \n\nI say, make sure it brings a smile to your face, it lightens up the gray days indoors, it gives you a sense of pride or accomplishment, or it makes you feel a little wiser, a little calmer, or a little stronger. \n\nBe gentle, be gentle and kind to yourself. If this quarantine can teach us anything, it is to take the time to be gentle, to unplug for a while, to rediscover ourselves and reconnect again. Make a list, set some goals, meditate, do 100 pushups, whatever -- just be gentle, and tell yourself it's okay, you're doing great, you are enough at this moment, and the next, and the next. Guilt and shame have no place in your mind.", "permalink": "/r/DecidingToBeBetter/comments/g32ms0/if_you_can_afford_food_and_have_a_roof_to_sleep/fnqnhs5/"}