{"id": "t5_2tand_t3_mcuqf8_t1_gs84jte", "creation": 1616710564, "origin": "t5_2tand_t3_mcuqf8", "height": 1, "replied_to": "t5_2tand_t3_mcuqf8", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Fillenintheblanks", "text": "Im 31 and had the same issues its hard and messed up a lot of relationships not just girlfriends but friends and family too. Some of them were because of my past watching people take advantage of my trust and low self esteem /shyness did the rest. Here are three things I try to remember that help:\n\n1.Work on yourself insecurity is you feeling un accomplished with where you are financially, physically, education/knowledge, relationships. Nurture these areas by making new behaviors they will work out a part of your brain and naturally curb alot of symptoms. plus when your busy learning and growing your not sitting and stewing. Idle hands and all.\n\n2. People are normally thinking about themselves or about you in a positive way. If you are not directly an asshole to them they tend to like you. Try randomly dropping, \"this is why I hang out with you\" in conversations after they say something funny, do something cool, or they compliment you. It's nice and everyone wants to know they are appreciated. If your sincere then everyone wins and you would be surprised how much they reciprocate enjoying your company too. You can't force people to be your friend but don't mistake something they might be going through to be about you personally. Be a friend when they need one and space when they need it the ones worth it will stand out.\n\n3.if it walks like a duck and talks like a duck its a duck. Have some self respect and notice when your niceness is being takin advantage of alot of these feelings you spoke about are not true and need to be fixed on your end but some people need to grow also and its no ones fault do not sacrifice your boundaries to just end up dealing with a bigger problem down the line. It will benefit you both. Take some time to figure out where your boundaries are in a relationship that are reasonable and not controlling be upfront about those boundaries at the beginning and no caveats they cause resentment and eventually doom.\n\nGot way too into that response I think i needed that. I hope it was as good for you as it was for me ;*", "permalink": "/r/DecidingToBeBetter/comments/mcuqf8/i_20m_want_to_learn_how_to_trust_people_who_love/gs84jte/"}