{"id": "t5_2tand_t3_miclmc_t1_gt79e55", "creation": 1617412685, "origin": "t5_2tand_t3_miclmc", "height": 1, "replied_to": "t5_2tand_t3_miclmc", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "joonimo", "text": "Good Q, I think a good guiding principle is to think about focusing on those relationships where you and the other person/people are comfortable and mutually supportive of one another. I don't necessarily mean that if you feel rejection you should keep going, but more so that if you feel rejection from one source, try not to retreat from society altogether. It sounds like you are putting a lot of effort into creating a healthier social circle, which is great. It's a good thing to be a part of a solid group of friends that is supportive without the emotional intensity that can sometimes accompany romantic relationships and crushes. \n\nSay you've got a feeling you're not sure about. Would following this feeling lead to something positive for yourself and for others? Will it help bring people closer together? Is everyone involved OK with it and on board? I think those are good questions to sort of guide your thinking towards challenging your feeling (like, in your example for the beach party, it sounds like that would be a fun thing that other people would enjoy and might be down to plan with you). In other cases, this feeling might lead to hurt and discomfort for yourself and for others, in which case it's probably better to detach and focus your efforts on other aspects of your life (like in your example of pushing for a relationship to happen when the other person's not on board with it/seems uncertain or uncomfortable). \n\nOf course, you might have additional guiding questions you'd ask yourself. And it can really help to consult a friend who \"gets\" you and who you trust to provide feedback that'll get you closer to where you want to be.", "permalink": "/r/DecidingToBeBetter/comments/miclmc/how_do_i_become_able_to_fully_feel_and_express/gt79e55/"}