{"id": "t5_2tand_t3_q2z2b6_t1_hfr85ni", "creation": 1633629635, "origin": "t5_2tand_t3_q2z2b6", "height": 1, "replied_to": "t5_2tand_t3_q2z2b6", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JGWol", "text": "My own self control and my barometer for “safe”\n\nIt’s harder to explain than one sentence. But essentially, whenever I get to a point in my life when I would hit a financial mark where I felt “safe”, I’d give up further progression and sabotage my progress.\n\nSo if I hit $10,000 in savings I’d quit my job and spend it all only to go back to work in a panic\n\nOr if I quit smoking cigarettes for two months I’d go back to smoking two packs a day. Quit alcohol for two weeks and go on a bender.\n\nThe shit hit the fan once and for all last year when I fell into a relationship for the first time and I got extremely comfortable. Really neglected my emotions. Developed a hardcore gambling addiction, and saw myself losing sight of my health and overall happiness.\n\nOnce the relationship ended I stopped getting comfortable. I set bigger goals. 2.5 years off nicotine, 4 months off alcohol, and I’ve saved up more money than I have my entire life. Haven’t gambled in six months. Picked up healthy habits and now I exercise 3 days a week. And I’ve also found myself being a lot pickier about who I give my time to. Not drinking has helped that a lot.\n\nThe big toll here is.. if I managed to live this way ten years ago, I would probably be a millionaire. I’m not kidding. I’ve been blessed with ample opportunity that I never took *long term* advantage of. Instead everything was taking for granted and I ended up with short satisfaction.\n\nCurrently sitting with a three year hard goal of owning a house 100% outright with cash. Six months in and I’m 15% of the way there. I had $5000 in car repair bills that took a licking but I’m staying the course.", "permalink": "/r/DecidingToBeBetter/comments/q2z2b6/what_perhaps_seemingly_small_bad_habit_of_yours/hfr85ni/"}