{"id": "t5_2tand_t3_fwz68k_t1_fms6dbn", "creation": 1586347947, "origin": "t5_2tand_t3_fwz68k", "height": 1, "replied_to": "t5_2tand_t3_fwz68k", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Recidiva", "text": "It became helpful for me to shift from trying to have a 'rewarding' life to trying to have a 'meaningful' life.\n\nI've suffered from chronic pain for the majority of my life and this shift in attitude is key toward framing the navigation represented by my choices.\n\nI do have to 'lean back' from advice that has to do with pleasure specifically and aim more toward overall substance. I try to see myself as part of a whole. Instead of wondering 'did I have a self-fulfilling and rewarding day?' I think - I chose things of meaning to me. I wrote about what mattered to me. I talked about what mattered to me. I tried to reach out and be helpful and make the world a better place by spreading some ripples of good will.\n\nAlthough I have had time to spend on thinking about what it is I want to do, what it is I want to accomplish, I've discovered that me alone isn't enough for me be inspired to get up in the morning. But since I'm attached to children that need me, a spouse that loves me, a dog that is sad if I'm sad...\n\nIn a conversation about what would happen to me if I didn't have family around me (I have been a suicidal person in my lifetime) I once spoke about maybe just disappearing, but only if nobody knew or if it wouldn't harm another person and my daughter said \"Mom, a kitten would find you.\"\n\nSo if you're searching for meaning, trying to navigate that way, find something bigger to be a part of and look out for the well-being of that ideal or group in your way, each day. Honor whatever it is that you find to be the most meaningful, refine that and connect it to reality after developing theories.\n\nIf a kitten doesn't find you, find a kitten. Preservation of innocence and kindness, the creation of safe spaces (mental and physical) and minimizing the suffering the world is capable of inflicting on animals/people/ecosystems at risk is a meaningful life.\n\nIt's hard, it's repetitive, it's not as easy to achieve as a spa day or a vacation, it requires mindfulness and focus, and it's the best way to remain spiritually connected to a difficult place to live and feel as though I have agency in the wider world.\n\nGood work is like cooking food. You pour resources and work into something that exists ephemerally, is gone soon and devoured because it's always needed in that moment and rarely goes to waste. There's nothing left to do but clean up and do it again. So yes, that's why I'd say 'productive' where at the end of the day you have more than you began is not necessarily fulfilling to the soul. Give things away that are of value to create meaning.", "permalink": "/r/DecidingToBeBetter/comments/fwz68k/take_that_perfectionism_changing_my_language_to/fms6dbn/"}