{"id": "t5_2tand_t3_pm88xu_t1_hcghdxd", "creation": 1631381505, "origin": "t5_2tand_t3_pm88xu", "height": 1, "replied_to": "t5_2tand_t3_pm88xu", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "spookiecrimes", "text": "Heyyyy hey now. First of all, progress is never linear. No matter what your goal is, no matter how far along on your journey you are, you are 10000% going to have days (even weeks) where you feel like you've made no progress, that it's all a big scam, that you are never going to get there. That \"there\" doesn't exist. I find it helps to look at these periods as a useful reminder that change is not easy, or pleasant, or always apparent. Take it as a reminder that you are human and being human is not meant to be easy, no matter how much we have accomplished. \n\nAlso, I was about to try and paraphrase this podcast I listened to that I think addresses some of what you're experiencing, but I know I'll butcher it so I will just share the name and a link. The podcast is called \"Unf\\*ck Your Brain\" and the episode is \"171: Greatest Hits Vol 1. Perfectionist Fantasies + Tomorrow Thinking\" It basically talks about the way we set goals, and how we sometimes inadvertently make our lives more difficult by setting our expectations too high, and not preparing for the very real, mundane road blocks we will inevitably hit along the way. It draws a comparison between real goals, and what she refers to as \"perfectionist fantasies\" which SEEM like goals, but they're missing the stuff that makes goals seem daunting and scary. It's a very common tendency (especially for women, I think) to idealize the end goal while downplaying the process of getting there. So, basically we don't factor in all the unpleasant, mundane, \"two steps forward one step back\" parts of working toward a goal. When we don't factor in the potential challenges and setbacks while setting a goal, we do our future selves a disservice, because when those days (or periods of time) which inevitably crop up where we feel the way you feel right now, we immediately begin to criticize ourselves or feel like we are \"fucking up\" or \"failing.\" Not true! \n\nAnyway, I'll stop rambling because the podcast does a way better job of explaining it. Honestly, all of her episodes are amazing and have really helped me get out of my head and back into a positive (or practical) mindset, especially when I'm feeling the way you're feeling right now.  Just know that you're not alone and what you're feeling and describing is a very normal part of achieving any goal. It's part of the package, in fact. So try not to be too hard on yourself. You'll have more days like this, even once you've achieved your goals. Trust me...\n\n&#x200B;\n\n8 years ago I made a list of goals. I achieved them all without realizing it, and now my goals are much different. I still have the same exact moments of feeling like I'm not good enough, that changes aren't happening, that it's all hopeless. And then I wake up with renewed energy and motivation. It's just being human, man. We are going to feel bad a certain amount of the time, and the sooner we accept this reality, the sooner we can stop judging ourselves. \n\n&#x200B;\n\nLove ya, hope you feel better soon! You got this!", "permalink": "/r/DecidingToBeBetter/comments/pm88xu/i_thought_i_was_getting_better/hcghdxd/"}