{"id": "t5_2tand_t3_pwfh8w_t1_heh9qa8", "creation": 1632755291, "origin": "t5_2tand_t3_pwfh8w", "height": 1, "replied_to": "t5_2tand_t3_pwfh8w", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mamaMAOricia", "text": "I know this is difficult but finding a reason why I want or why I keep doing what I hate (such as watching YouTube videos) made me reflect on many things.\n\nIn my part I thought I was watching Youtube because it was fun. But later on it was because I was escaping from reality.\n\nI have been dealing with so many difficulties in my life and my Youtube was the only thing that had comforted me. Little by little this comfort turned into addiction. This made me realized that I was not really seeking comfort but rather seeking for an escape to think of solutions to my problems. \n\nThe addiction made me more miserable. So miserable that I just lie down and watch Youtube videos from morning till evening. \n\nAfter that realization. I finally decided that I will not watch anymore. I can survive without TV. What more if its Youtube?\n\nIts almost 3rd week of my no more  Youtube videos (for my own entertainment and comfort) and these are some of my exceptions (because I still need to watch sometimes)\n1. A love one asking me to join watching some Youtube videos\n2. Educational videos and work related videos (im a teacher so this matters)\n\nSo far so good.\nToday something very stressful happened to me and my mind just trying to push me to watch Youtube to escape from stress. I am rewiring my brain to not give in (i had realized that I trained myself mentally to watch whenever I am so stressed out). Instead of watching, I hug my husband and went home to visit my family.\n\nDear OP, I am optimistic that you can get through this. I know that it will be difficult at first. For me, it takes years to cope up and find ways and realizations to deal with it.", "permalink": "/r/DecidingToBeBetter/comments/pwfh8w/i_want_to_ditch_my_youtube_addiction_but_i_dont/heh9qa8/"}