{"id": "t5_2tand_t3_mylvz1_t1_gwsdg22", "creation": 1620052887, "origin": "t5_2tand_t3_mylvz1", "height": 1, "replied_to": "t5_2tand_t3_mylvz1", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "triplenac", "text": "Hey, sorry I took a while to respond (I have ADHD :)). \n\nFirst off, I need to state again that I am not an expert, and my opinions are based only on my personal experience. Secondly, there are different subtypes of ADHD and it would be worthwhile to identify which type you fall into in order to figure out the best treatment plan for yourself. \n\nI began taking 20mg Vyvanse, but I try not to take it every day and instead build habits which support my ability to focus. For example, I realized that I am able to focus much better when there is someone working in my vicinity. For example, in a library or at the office. Since Covid, that has been a huge problem for me since I live alone and all work/study is remote. So I began asking friends, family and colleagues if they would FaceTime/Zoom with me throughout the day to simulate co-working. I was a bit embarrassed to ask at first, since I have barely told anyone about my diagnosis (shame around that is a whole other kettle of fish), but eventually it became normal and now there are about 10 people who I regularly have online co-working sessions with. We don't \"work together\", per se, but having someone around is super helpful for me for some reason. I believe this is called \"body doubling\" - I heard about it on a podcast about ADHD (of which there are several - for example: \"[Hacking your ADHD](https://www.hackingyouradhd.com/)\" and \"[All things ADHD](https://allthethingsadhd.com/)\").\n\nI have also used the [pomodoro technique](https://francescocirillo.com/pages/pomodoro-technique), which is essentially working for 25 minutes and then taking a 5 minute break (or other variations of time blocks). I use a [Time Timer](https://www.timetimer.com/)for this, and really like it. \n\nI also find that finding the right workspace has been super helpful. It's tough because I live in a tiny apartment and I can't afford fancy office equipment, but I noticed that having my desk by my window and working in natural light helps me be more productive (not sure this is related to ADHD at all, but it's been helpful for me). \n\n**One thing that can't be overstated is the value of learning self-compassion.** For my whole life I had an internal monologue of how I was fucking up my life, and how I was wasting my potential because I couldn't focus on tasks, and how I would inevitably end up on the streets because I couldn't get my shit together. Over 30 years that can really wear-down your self worth, and it has caused me to have a tendency towards self-sabotage. Learning that this struggle was not my fault and not some sort of personal failure has helped immensely. Getting lost in a downward spiral of self-hate and frustration has never helped me work more efficiently, but I didn't have the tools to be compassionate or patient with myself in the past. Now I try to be more gentle with myself, which helps me get things done (disclaimer: key word here is try, I still tend to be quite mean to myself a lot of the time - it's going to be a long process to get out of that habit). \n\n**A few one offs that might help:** \n\n* **Break things up into small tasks** (rather than saying \"write paper\" - break that into \"brainstorm for 15 minutes\", \"draft outline\", \"populate one section with research\", etc.). Mentally that makes things a lot more approachable. \n* **Make a list of tasks for the day** and check off a few easy ones right off the bat (\"walk the dog\", \"take out garbage\"), and that can help create momentum. \n* Some people find using a more structured approach to lists helpful, I found this helpful while studying for the bar exam, but my use has since dropped off. For example, there is this [productivity journal](https://www.intelligentchange.com/products/the-productivity-planner) which many people I know use and find helpful. \n* [The connection between dopamine and ADHD](https://jamanetwork.com/journals/jama/fullarticle/184547) is still being studied, but some researchers maintain that a deficiency in dopamine transmitters is related to incidence of ADHD. What that means is that people with ADHD are often \"seeking more dopamine\" and it interferes with their executive function on a day-to-day basis. This can be treated with medication, but also exercise and good diet. I know it sounds like broken record when people say \"just go outside, get exercise and eat healthy - then you're cured!\" - like please fuck off with your preachy bullshit. That's definitely not the only solution, but I have found that it really helps. With ADHD, I often find cooking a balanced meal or sticking to a workout routine to be too overwhelming, so I have found hacks for myself. [Things that are quick](https://www.delish.com/cooking/nutrition/g600/healthy-snacks-for-work/) when I don't have the brain power to organize something more involved - a bike ride or walk for the length of my favourite podcast, and an egg with avocado on a piece of hearty rye bread. \n\n**TLDR:** There are many approaches to dealing with ADHD and everyone needs to find what is best suited to them, but at the end of the day the most important thing is to learn to be patient with yourself and realize that ADHD is not a personal failure on your part. \n\nSending hugs and wishing you much success!", "permalink": "/r/DecidingToBeBetter/comments/mylvz1/i_finally_found_a_book_about_cognitive_behavioral/gwsdg22/"}