{"id": "t5_2tand_t3_mylvz1_t1_gvw5sip", "creation": 1619408994, "origin": "t5_2tand_t3_mylvz1", "height": 1, "replied_to": "t5_2tand_t3_mylvz1", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "HomiesTrismegistus", "text": "Thank you for this. I suffer from this too and it has kept me from dating as with my ex, all of it came true and she made me feel crazy. I was already paranoid about that, but she entirely fucked up my entire compass on the situation. \n\nI have stayed out of a relationship and ghosted two women since her, only messaging them a year or so later to explain, because I was literally too scared and I also don't want to put any girl through the stress of dealing with me and my constant insecurity. I'll read this book the second it gets here and just know that I deeply appreciate your post. \n\nThere has to be a way out of this. It's been like this even since my very first girlfriend in middle school. It also seems like it causes jealousy with girls who I'm not even with in the first place. It doesn't affect my life other than me forcing myself to stay alone. I have some close friends that are girls and it's not unhealthy friendships.\n\nBut dating, I don't know if I ever will again. Because of how I already was and how much my ex seriously fucked up every single bit of work I had done on the issue.. now I know that people actually do this, even if they entirely convince you that there's nothing there. And that fucks me up even more. \n\nIt seems like this book will do good at other aspects of my life too. I was actually diagnosed with OCD a long time ago because the psychiatrist saw I compulsively bit my nails and ate the skin on the edges making myself bleed all the time. And for other reasons as well but I have never taken OCD seriously. I do notice the better in doing at life, the less I bite my nails though. There is a lot to be said for being mentally healthy. My mind races, constantly. I mean, constantly. I love it because I think it's unique and that most people don't think that much, I could be wrong but it really does seem like I am different and worry about different things that other people pay literally no mind to. And I love that, I wouldn't rather be anyone else. But it's also the death of my well being", "permalink": "/r/DecidingToBeBetter/comments/mylvz1/i_finally_found_a_book_about_cognitive_behavioral/gvw5sip/"}