{"id": "t5_2tand_t3_mylvz1_t1_gvyneqy", "creation": 1619463469, "origin": "t5_2tand_t3_mylvz1", "height": 1, "replied_to": "t5_2tand_t3_mylvz1", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "triplenac", "text": "I’m not an expert by any means, and I’m not sure how one could get a diagnosis other than seeing a psychiatrist, but one thing to keep in mind is that there are various types of ADHD, so it doesn’t present the same in everyone. \n\nFor example, I had the misconception that everyone with ADHD was rambunctious, loud, hyperactive, etc. but that’s not true. I also told my psychiatrist there was no way I could have ADHD because sometimes I was able to focus very hard on something for a long time - well it turns out that “hyper focus” can also be a symptom of ADHD. Another problem I had was an OCD tendency of having to “check” things multiple times - I would leave my apartment and then have to go back a few times to assure myself that I had turned off the stove, even though I knew I did. It made (makes) me feel crazy. I still have a lot of these behaviours. \n\nDifferent people find different treatments helpful for their diagnosis, but one thing that seems universally helpful is simply learning more about ADHD and how it can look in different people. Then you can start learning about various coping mechanisms and tools to help. When you begin to understand the mechanisms behind how you’re behaving, it’s easier to have a bit more self compassion instead of beating yourself up all the time. I used to get so frustrated and angry with myself for self-sabotaging. It was like I knew I had it in me to do better, work harder, apply myself more, etc. but I always seemed to procrastinate and never reach my full potential. This caused me a lot of self-esteem issues and depression, but now that I understand that it’s not just a question of being lazy or unmotivated, I can start to heal my relationship to myself and build a lifestyle in which I can succeed.\n\nWishing you all the best!", "permalink": "/r/DecidingToBeBetter/comments/mylvz1/i_finally_found_a_book_about_cognitive_behavioral/gvyneqy/"}