{"id": "t5_2tand_t3_mylvz1_t1_gvw519k", "creation": 1619408519, "origin": "t5_2tand_t3_mylvz1", "height": 1, "replied_to": "t5_2tand_t3_mylvz1", "down_vote": 0, "up_vote": 39, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheGuyWithTheSI", "text": "Congratulations! I'm happy for you. For me, the jealousy stemmed from insecurity. With my ex-girlfriend, I was extremely jealous and invading her privacy gave me a false sense of security. It's kind of funny because when we went on a \"break,\" I came across a conversation with her best friend on Facebook with a word attachment on the pros and cons to being with me, so by the time she called me to talk about how she feels, I all ready knew her bullet points so I had counter-arguments. I pretended like I was hearing all these things for the first time, and I was convinced that she wasn't going to break up with me. I thought I could convince her to stay with me, but the counter-arguments made her realize that breaking up was the best option at that point.\n\nNeedless to say, it was a real wake up call for me because it made me question my mind. All this time, I thought I had control of the relationship but that was so much from the truth. The relationship was falling apart and I had no fucking idea. There weren't any emails, no browser history, no sort of indication that she was falling out of love with me. The evidence was always there in our physical interactions, but I was so focused on what goes on behind the curtain that I didn't think about what was in front of me. It just really rocked the foundation of what I had built and I learned that, in the end, I know jack dick. \n\nSo I had just learned to be my best self, or work towards being my best self. I don't have control over whether my wife wants to leave me or not, but I do have control over how I will deal with the divorce if it ever comes to that. The amount of freedom I feel is fucking *liberating*. She cheats? I tried. She falls out of love with me? I tried. I could actually do better, so I know that if she does then I acknowledge that yeah, I need some work. I do love differently, but it's a much healthier kind of love. While I do miss the butterflies and the powerful emotions that no woman will ever make me feel again, I don't miss the vulnerability and the sleepless nights from worrying about shit that hasn't even happened.", "permalink": "/r/DecidingToBeBetter/comments/mylvz1/i_finally_found_a_book_about_cognitive_behavioral/gvw519k/"}