{"id": "t5_2tand_t3_pij8qp_t1_hbq205h", "creation": 1630871319, "origin": "t5_2tand_t3_pij8qp", "height": 1, "replied_to": "t5_2tand_t3_pij8qp", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dissociationplaybook", "text": "Can you apologize to those you have wronged? In person, in a letter ? If not can you write the letter anyway and write it good long pour your heart into it. Put it under your pillow for a week and reflect on it. If you are musical, write a song about your regrets and how you wish it had gone down differently. If you are religious pray for those you have wronged. \n\nIt sounds like you have tried to push it away but the guilt keeps coming back up. So maybe you need to succumb completely to the guilt. Light a candle and say out loud a blessing for the lives of those people you were angry at. Post on social media a blanket statement of apology, and write to Individuals also, with no expectation of forgiveness or acknowledgment on their part.\n\nSet aside the rest of this week or two weeks to fully exorcise those feelings. Do all the things you need to do to free yourself. \n\nThen let it go and be done with it. Once you have written all the letters and sent or didn’t send them, move on. \n\nIn the future if you feel the guilt coming back write another letter. But please try not to dwell. If you can do therapy do that. Definitely get some books or read articles online moving forward about how to manage anger. Practice management of anger in every social situation. Maintenance moving forward after your purge is ideally therapy, practicing self control, reading about anger management and finding joy in life. You cannot beat yourself up forever. If you need to have a go at yourself limit it to a week or two of dull on dwelling and feelings coming out that need to, and then from then on try to move forward. Small maintenance purges may be needed in the future but hopefully they get smaller and longer in between as time goes by.\n\nYou can leave this in the past, but if you deep down feel you should apologize DO IT. Who care if they laugh at you or rebuff you or don’t believe you. You are doing this so they know you are truly sorry. An apology can seem insurmountable but it is just a few minutes of your life that may bring you peace. And may also bring peace to those you have wronged", "permalink": "/r/DecidingToBeBetter/comments/pij8qp/how_do_i_deal_with_the_guilt/hbq205h/"}