{"id": "t5_2tand_t3_oxij67_t1_h7p7cvd", "creation": 1628097363, "origin": "t5_2tand_t3_oxij67", "height": 1, "replied_to": "t5_2tand_t3_oxij67", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "epozzo", "text": "Thank you for sharing this. That is very courageous of you.\n\nIt is clear to me that you love your girlfriend deeply. Otherwise you would not have these thoughts. (It could also be that you chronically criticize yourself. I can respond to that too if that is the case.)\n\nIt sounds to me that you disclosed to your girlfriend what you did during your time apart. If not, that contributes to the discomfort. In that case the only thing to do is to be honest with her no matter what the consequences are. You do not want to live a relationship based upon falsehoods.\n\nRegarding her feelings about you, it is your job to trust her in what she sees in you. It is not for you to decide. Most of us do not feel good enough. How could we? We know every time we fall short in every aspect of life!!! Others are much more likely to forgive us than we ourselves!\n\nHowever, it is important to hear and honor her Love for you. It is so hard to tell someone you love them and that you think the world of them while that person is trying to prove they are not worthy of Love.  Relax and trust her!!!\n\nAnd if it doesn't work out? You will discover that you are going to be OK too!!!  I was in a relationship once for 4 years, engaged with her and it was really clear to me that I wanted to spend the rest of my life with her.  One day she came home and said: \"I cannot be with you anymore. I am with someone else.\"\n\nI was devastated. I could not even imagine my life without her. I lost 30 lbs in a month and had frequent thoughts that suicide was a good idea. Fortunately I was able to let those thoughts go and not attach myself to them. I had great friends that fed me soup and made sure I ate something. \n\nNow I am married for 20 years and have an amazing son and a lovely wife. I kiss the ground every morning for them. If I could have foreseen that with my ex, it would have been so easy to let her go. However, we cannot see the future.\n\nWhen we are forced to let go, let go. It just means that life has something better in store for us. Life is one beautiful mysterious adventure full of amazing lessons for us to learn and to grow from them.\n\nThank you again for sharing yourself so openly and courageously.", "permalink": "/r/DecidingToBeBetter/comments/oxij67/you_are_not_your_thoughts_you_are_not_your/h7p7cvd/"}