{"id": "t5_2tand_t3_q4f2tk_t1_hg06ylc", "creation": 1633801524, "origin": "t5_2tand_t3_q4f2tk", "height": 1, "replied_to": "t5_2tand_t3_q4f2tk", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "crumblenaut", "text": "You already know what's up and what to do. I'll just add that your thirties are SO much better than your twenties. \n\nIn regards to your never asked a woman out bit, is day that the thirties are ESPECIALLY better for dudes who may be, let's say, more \"inclined towards stability\". \n\nI'm generalizing broadly here so forgive me if this offends, but overall I've found that women's priorities change. The underlying biology is fundamentally unfair, but if they want kids and haven't had them yet, then stable partnership becomes a MUCH more significant goal than it was in their twenties. Sounds like that's something you may be able to provide in the right circumstances to the right person.\n\nA lot of folks have either sampled the wares at this point and have a better idea if what they're looking for in a partner, and others - like yourself - have reached a point where they're more inclined to take initiative than before. \n\nThe years your have ahead are a  prime time for you to attract and manifest awesome things in your world. Not saying that in a super woo sort of The Secret way, but insomuch that fundamentally the more you know what you want with clarity, the more you'll be able to automatically, unconsciously notice it, and then with some courageous choices and actions  interface with it and see where it takes you. This goes for people, careers, experiences, and so on. Think about what you want, put yourself in a physical or digital space where it might be, open your eyes, and the opportunities will be yours to explore before you know it.\n\nAnd dude, life is LONG. Almost terrifyingly long. At 30, you've really been \"alive\" as a semi-adult consciousness for like fifteen years at most. You will effectively double the amount of life you've lived by the time you make it to 45, and that's just speaking temporally - in terms of content, chances are that the next fifteen years will be MUCH richer per unit of time. People reinvent themselves and start virtually entirely new lives in their fifties and sixties ALL THE TIME. \n\nGet out there. Find something that is genuinely fun for you. If you haven't yet and there's any interest or call to you at all, maaaaaaaybe do some research and consider whether or not a psychedelic experience or two could contribute usefully to your personal growth. The resources available to you in that regard are fantastic nowadays.\n\nLife IS a blessing but it sure as hell can come off like a curse, especially when you feel like you're stuck in \"you\" for the entire fucking ride. I can REALLY relate to that sense. But I've been learning more and more that who \"you\" are is far more malleable with far more possibilities than I would have imagined.\n\nI'm proud of you for making this post and sharing this wisdom. It was a brave act with salience for a LOT of folks. And I'm excited for what the next several years of your life will look like for you.  There's really good stuff to come.\n\nFeel free to DM me if you're so inclined. I'm not sure that I'll be able to respond immediately but if you have questions or what to chat I and others from this community will be here for you.\n\nHigh fives and hearts all around.  ;)  Best luck, my dude!", "permalink": "/r/DecidingToBeBetter/comments/q4f2tk/my_wasted_youth_please_dont_make_the_same_mistake/hg06ylc/"}