{"id": "t5_2tand_t3_q4f2tk_t1_hg1yk6b", "creation": 1633831088, "origin": "t5_2tand_t3_q4f2tk", "height": 1, "replied_to": "t5_2tand_t3_q4f2tk", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rocksteady2R", "text": "not sure if you're asking for advice, but a few thoughts and options come to my head - \n\n* what're you doing with your day?   i mean, no hobbies, just loneliness and work.  so that sort of tells me you have a few other empty hours of the day.  So I'll make an assumption or two and say - \n* cut the power cord on your TV.   if you're sitting watching the tube go by... fuck man... i'm susceptible too, but you gotta know it's a hypno-suck and isn't any good for you.   how much do you really need to re-watch old episodes of Matlock?  cut the power cord and if you need to plug it back in sometime, go to home depot and by a screwdriver and a coupler and learn how to fix it.   Or, if that's too much for you, drape a towel over the TV, and learn to put a timer on yourself.  avoid the reflexive turn-on when you get up or get home, if that's a thing.  I see that all the fucking time in peoples lives.... folks don't even intend to watch, just turn it on for the noise of it... \n* /r/thexeffect.  maybe you can work with this, maybe you can't.  pretty well saved my life, but i don't expect it to do that for everyone, but it can be a powerful motivator and organizer for those of us who started off without those traits.  \n* consider putting together a \"3-5 year life plan\" - you can google that phrase and get some ideas how to do it.   take 2 weeks to gather your ideas.   It's hard to aim at bettering yourself if you don't have specific, clear ideas on what you're aiming at.  even if you don't go crazy with adopting a \"Life-Plan Attack Plan\", doing the thought-organization exercises that create it can be wildly illuminating.\n* Start walking/exercising/biking.  just learning to get outdoors for a while can shake up the brain-pan.  I speak from personal experience; I'm at 3mile minimum/daily.   I ain't super-fit, but I ain't as sloth-like as i used to be. \n* risks are over-rated, a lot of times.  I think America buys 'risk-taking' like they used to by the American dream.  It is often sold as a panacea to our insecurities.   Here's a fun one - start  asking yourself the question, \"what's at risk?\" and then follow it up with \"Why is that a risk?\" My mens group will do this occasionally, and it's an incredibly valuable perspective.   Regardless - there is plenty of valuable, healthy, honest living well within 'safe boundaries' - no risk necessary.  Why gamble with your happiness when you can easily take safe, valuable steps towards it?  \n* join a mens group.   totally google-able.  if you're in a moderate sized city, there's a few to choose from.  some focus on emotions, others business, others life.   most allow surfing/visiting without too many catches, but sometimes - for emotional reasons - there's a safety net for some.  Seeing how other men deal with and talk about their struggles is invaluable, and for some dumb reason, we shy away from it and give it a stigma.   seriously - plenty of other men have the same fears as you, and we'd love to have you sit in with us. \n\nanyhow.  there you go.  good luck out there bubba.", "permalink": "/r/DecidingToBeBetter/comments/q4f2tk/my_wasted_youth_please_dont_make_the_same_mistake/hg1yk6b/"}