{"id": "t5_2tand_t3_q4f2tk_t1_hg2jhrv", "creation": 1633842469, "origin": "t5_2tand_t3_q4f2tk", "height": 1, "replied_to": "t5_2tand_t3_q4f2tk", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JMarieSimz34", "text": "This is probably terrible advice...but If ur already at this point..maybe do some experimenting with reality jumping. (2 cup method for ex.)\nI mean it would give u the adventure u are looking for, and imagine waking up in a reality you love :)\nWhere u r married or have a great career, family and friends. What have u got to lose?\nIf that's a little too far... get yourself a pet companion at least! I suggest a pure bred maine coon cat. Very loyal and highly intelligent, mystifying in appearance and they act very dog like. \nOh yea they can reach up to 4 feet in size, but don't worry. They are low energy, and are called gentle giants. \nAs far as Chics go...if u get a pet...go to the pet stores and practice flirting w them!\nSounds like an easy way to strike up a convo w a stranger :)\nSuper markets are another great spot to meet women. \nAs far as ur appearance...u feeling average....\nI personally am a hot milf lol...and all I was really looking for in a man was a funny guy w good morals and held a job/career. \nAs we get older...its not all about looks anymore. Looks aren't always a make it or break it right away, there are more important things we r looking for. \nDon't forget u can convince any woman u r a confident strong male just by faking it. \nDon't be insecure around women, be a man.\nThis is a must have for women. \nAnd when ur personality is confident... we become more attracted to you. So many times I wasn't attracted to a guy initially, but then their personality would turn it completely around for me and I would feel like I was dating the most handsome man, regardless of what anyone else thinks. \nWomen are easy....I think lol...don't be nervous or scared...make her laugh, be charming, and release that strong inner male  so she will feel protected, and attracted:)\nHope this helps a bit. \n\nP.s.\nI'm a domestic violence survivor recovering from a brain injury, which I lost my career and my life to. \nI have complex ptsd and live in fear for my safety now so I barely leave my home. \nMy depression hits such a scary rock bottom...that I understand how u feel. Sad we even think about suicide. \n\nOkey dokey pokey\nLata", "permalink": "/r/DecidingToBeBetter/comments/q4f2tk/my_wasted_youth_please_dont_make_the_same_mistake/hg2jhrv/"}