{"id": "t5_2tand_t3_a9ddb2_t1_ecjh87a", "creation": 1545770660, "origin": "t5_2tand_t3_a9ddb2", "height": 1, "replied_to": "t5_2tand_t3_a9ddb2", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "catalyticfizz", "text": "Came across this post on r/all so I’m not a usual in this sub but I work in the mental health field and in particular have worked with a lot of folks trying to reach sobriety goals. Hope you don’t mind me dropping a few suggestions you can take or leave! like u/freecooching said above and a few others throughout this thread as well, take a good look at your support system and stack the deck in your favor! Unfortunately this sometimes means stepping away from people still actively using but maybe think of how you can fill in those new social gaps..some suggestions: \n\n- AA or NA (AA because they tend to be more readily available, depending on your location NA/CA can be harder to find. All groups develop their own culture but many are open to people who use substances other than alcohol)\n- there are also a number of non-denominational 12-step support groups like Celebrate Recovery and SMART recovery (there’s more out there! These were the first two that came to mind for me)\n- don’t be afraid to look into getting a therapist! Psychologytoday.com is an easy way to find someone in your insurance network, zip code, and with a verified license. No insurance? Still go to psych today, look for ppl who offer sliding scale fees who may be able to work with you in a manageable out of pocket payment.\n- they may also recommend a psychiatrist evaluation for a number of reasons...there’s some relapse prevention meds available, not specifically for meth but should you find yourself trying to abstain and struggling in other ways like with alcohol which could threaten your overall sobriety. But also there’s a very high rate of mental health issues that go hand in hand with substance use, that probably both drive some people to use but also can develop through the recovery process. \n- last thing I’ll say, if you’re a reader or audiobook fan, Allen Carr and Annie Grace are two authors who have books on dealing with addiction (written towards alcohol and smoking but I’ve had people say they’ve found them helpful for other addictions as well). Both get really strong reviews and offer practical skills and approaches. Carr’s books are “a Easy Way To Control Alcohol/Smoking” and Grace’s is “This Naked Mind.”\n\nAlright, this got way longer than I anticipated, I guess I’ve had a few too many days off work already for the holiday. ☺️ Best of luck to you!! ", "permalink": "/r/DecidingToBeBetter/comments/a9ddb2/day_1_of_quitting_meth_wish_me_luck/ecjh87a/"}