{"id": "t5_2tand_t3_ggebo8_t1_fq0xmho", "creation": 1589038888, "origin": "t5_2tand_t3_ggebo8", "height": 1, "replied_to": "t5_2tand_t3_ggebo8", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Teech-me-something", "text": "My dad told me in passing once he was a jack of all trades, master of none. That quote haunted me all through high school, college, and partially still doesn’t. But he never knew there was more to it... “A jack of all trades is a master of none, but oftentimes better than a master of one.”\n\nBeing passionate about a number of things is a benefit, NOT a downfall. At 17 it sucks because everyone seemingly has a passion and is passing you. They’re dedicating hours upon hours to be the best at something and you’re just a jack of all trades. But! When your 20’s and 30’s start, al of those skills you’ve picked up on will show themselves. Continue being a jack, learn everything you can about everything because it’s ALL interesting and it’s ALL important.\n\nIn the end, I’ve realized I have a ton of passions and skills. I may not get a Nobel prize in a specific category, but that’s not my passion. \n\nI enjoyed building computers as a kid so my first job as a customer service rep for an electronic store turned into a computer technician because I knew enough for them to train me up. I went to college for psych because I wanted explanations for behaviors I saw/experienced. I’m not doing anything in that field but I use the knowledge I learned, literally everyday. I learned ASL because it looked interesting. Then I taught it part time for awhile, now I just know sign language. 2 different jobs have given me an interview because ASL stood out to them. Those jobs set me up for my current career. I attended a dog training academy because i wanted to understand more about dog behavior. Now I have the best trained dog on the block and get asked (sometimes hired) for help. \n\nI love real estate now, I guess that’s kind of my passion at the moment. I’m interested in creating a non-profit to help low income families get access to a variety of social services but on site at my real estate development. \n\nI’m sorry this got so long. I guess I’m saying there is no right way to approach life. It’s a huge journey with twists that you’ll never see coming. Learn as much as you can and you’ll be better for it. That saying just destroyed my confidence as a teen/young adult but it didn’t have to. I think you’ll be okay :)", "permalink": "/r/DecidingToBeBetter/comments/ggebo8/i_cant_find_my_passion_and_im_stuck/fq0xmho/"}