{"id": "t5_2tand_t3_lj2cbc_t1_gn8rcqx", "creation": 1613235258, "origin": "t5_2tand_t3_lj2cbc", "height": 1, "replied_to": "t5_2tand_t3_lj2cbc", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "zukos-turtleduck", "text": "Real talk: I don’t know. I’m early20sF and I would have panic attacks at your age because ‘my life was going no where’ and I wasn’t doing productive. A lot of it came from my “delusions of grandeur” mother that made all of her children feel like if we weren’t started a successful side business every other week, we were wasting our time on earth, despite never having worked for longer two weeks at a job. The only thing that really actually helped was being done with my associates degree, getting a well paying job, and actually being able to see the fruits of my labor growing. At 16, your labor is largely ignored and downplayed as less serious than that of an adult. I’m not far from 16 but I was homeschooled and not really on like Instagram and stuff (hell Instagram wasn’t even pretty back then, all your friends posted overstaturated selfies and pictures of flowers outside their houses, it was a peak at someone’s regular life, not a curated portfolio of their best photos) and I still felt like that, I can’t imagine how overwhelming life is for the average 16 year old today. My advice is do your very best to relax. You’re only 16 once and even tho being 16 wasn’t awesome for me, I wish I could go back, pat my head, and tell myself to take a chill pill. Use this time to figure out what hobbies you like, chitchat with friends, and maybe plan out a few places you really want to visit when you’re older. I don’t want to sound callous, I mean this earnestly, but the ‘productivity’ you create at 16 outside of not making terrible grades isn’t going to mean very much in even just 4 years. Even ‘not making terrible grades’ only counts so far into making sure you have a diploma and then getting you to college if you want to go that route. I don’t remember shit about being productive at 16 but I do still have the paintings I made then, the trinkets from that road trip with my friends, and dvds of the movies I loved at the time. I know it’s hard but you’ll feel better once you have more control over your life and when you can see a better return on your productivity but those things come with age and it takes time to get there. Good luck OP, I know this probably isn’t the answer you were looking for but it’s what I would tell myself at that age so I think it’s worth telling you. sending good vibes❤️", "permalink": "/r/DecidingToBeBetter/comments/lj2cbc/how_to_stop_constantly_feeling_like_youre_wasting/gn8rcqx/"}