{"id": "t5_2tand_t3_lj2cbc_t1_gn96z5n", "creation": 1613239399, "origin": "t5_2tand_t3_lj2cbc", "height": 1, "replied_to": "t5_2tand_t3_lj2cbc", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "weepyonion", "text": "The media likes to showcase young people who are doing it all. 30 under 30 lists, platforms like YouTube/Tik Tok which are so easily accessible to teens, etc. This is not the norm, and many of the people who reach those levels of notoriety by that young age do so because they were given a big leg up by a parent or have been trying to be noticed forever.\n\nI did a lot of waiting around as a teenager and felt badly for it... but how much could I have done? I was reliant on my parent to facilitate a lot of hobbies and projects, and they had their own obligations. I didn't have the money to get certain things I wanted, and to be honest, I didn't have a clear idea of what I wanted. I don't know many people now, at 28, who are still doing what they were doing as a teenager.\n\nYou aren't obligated to build your life yet. You're also 16 in a pandemic, and there is a lot of time you're spending at home now. The best thing you can do is invest time in yourself, and let your interests come naturally. Make an effort to cut down your phone time. Nothing makes me more confused about who I am and what I like than scrolling through the thoughts and photos of other people. And if you feel like your day is empty, fill it. Anything that engages your mind or helps develop a sense of self is time well spent. Even if that means watching a movie that is meaningful to you, or different than you'd normally watch. As an adult, if something makes me feel better about life or myself, I consider it productive. And sometimes I do hard shit that is productive, and nobody sees it. Don't let what other people are SHOWING you influence your opinion of how busy they are.\n\nYou might also like looking into basic mindfulness exercises. The pressure you put on your development is likely due to outside pressure, and if you can learn to quiet those pressures at 16, your entire adult life is going to be easier. Tara Brach is a good author to start with, if you want to read something on it.", "permalink": "/r/DecidingToBeBetter/comments/lj2cbc/how_to_stop_constantly_feeling_like_youre_wasting/gn96z5n/"}