{"id": "t5_2tand_t3_krxu7s_t1_gid7ffj", "creation": 1609978857, "origin": "t5_2tand_t3_krxu7s", "height": 1, "replied_to": "t5_2tand_t3_krxu7s", "down_vote": 0, "up_vote": 29, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Professional-Ad-2031", "text": "So this will depend on your exposure to music in the past. I played percussion throughout all of high school so was familiar with music theory and could roughly read music, though I hadn’t done it in a long time. I also took a physics of music class this last year in college which resurfaced a lot of that for me.\n\nIf you can’t read music, do not worry too much. I still read very, very slowly but have managed to learn a lot nonetheless. I would recommend just downloading an app that “quizzes” you on notes to start, I remember doing that to get better at sight reading in High School. Might take a bit of googling to find the right one.\n\nFrom there try starting with an easy but expressive song, Beethoven’s moonlight Sonata 1st movement is a great one. You can play with dynamics (how loud or quiet), tempo, rhythm, etc. while still holding the general shape of the piece. This gives you a lot to work with while keeping things simple.\n\nWhen you first start learning a measure, after figuring out the notes and everything, always practice with both hands together. Only split up your practice with hands once you can solidly play them together and you feel that one hand in particular is the limiting you. It will be much harder to put them together after you’ve practiced them apart for a while. \n\nEven if you don’t have previous measures down perfectly, keep going onward with the song while making sure to revisit those other trouble areas. It is easy to get stuck in a place where you are only playing what you are comfortable with. Work on learning as much of the song as you can, going sections at a time, and then work on bringing it up to speed, and then adjust your dynamics and tempo.\n\nOne thing that is critical is playing correctly even when you are playing slowly. Make sure that you are fingering correctly, i.e. each set of notes you play allows you to comfortably place your fingers for the next set. You should try for good dynamics and tempo too, even if slow, so that you are not too hamfisted once you speed up. This is something I am still struggling with quite a bit and the main focus of my practice now.\n\nWatch some YouTube videos like “top ten beginner mistakes” or something along those lines.\n\nI think it is good to start with a song because it is entertaining and keeps you in it, but see about buying Scales, Chords, Arpeggios & Cadences off Amazon. It is a $10 book that will help hone more generic skills on the piano transferable to any song.\n\nI would also recommend just listening to pieces you like on YouTube, Rousseau is a great channel for it. If you really like one and it feels just challenging enough that you could learn it, but not so hard as to demotivate you, go for it.\n\nOnce you have found a piece you want to learn, I highly recommend the app MuseScore for finding sheet music. \n\nIf a piece in a song ever sounds off to you even after you have practiced it a lot and once had it sounding good, listen to someone else perform it. I find this often automatically improves my style just by giving me something to subconsciously emulate. \n\nWhen you watch someone play a really difficult piece that you love, use that as motivation. You will play that piece one day for your family or loved ones, imagine it, and practice to make it happen. My song is Liebesleid by Kreisler, for example. I put adequately learning it about 5 years out. It is really great to have a long term goal like that.\n\nThat is most of my advice, you will find lots of other advice on YouTube and Internet forums, and maybe someone else here can chime in. Best of luck to you.", "permalink": "/r/DecidingToBeBetter/comments/krxu7s/i_started_learning_to_play_the_piano_earlier_this/gid7ffj/"}