{"id": "t5_2tand_t3_lxeatb_t1_gpqb556", "creation": 1614912372, "origin": "t5_2tand_t3_lxeatb", "height": 1, "replied_to": "t5_2tand_t3_lxeatb", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "maybemaddy", "text": "I understand your hesitation here, however the suicidal thoughts is not always a side effect but it is possible in the first week or so but it does not last in most cases. Depending on your age, parents may not have the power to stop you from taking them and would not need to be informed if you are not a minor. If you are, then you can always go to your GP and discuss with them and they should assist you in talking with parents/next steps. In terms of other side effects, I am not aware of any diseases; these medications are well researched and their use has been improved over many many years. Emotional side effects again, are possible but generally don’t last for very long and they don’t mess with your mind per say. That is a stigma that is around meds due to old narratives from the way medication in the past (historically) affected people but no longer does due to improved research and also from the lack of distinction between certain meds. I.e an SSRI anti depressant is very different from say medication used for personality disorders or things like schizophrenia which do have more obvious side affects but the two are very very different. 100% respect your choice not to take them but I would not rely on the info you have seen on TV/past preconceptions. Medication can be extremely useful and helpful. Treating “emotions” with an antidepressant may seem strange until you reframe the perspective - you are not actually treating emotions, you are treating a medical condition caused often by biological factors and environmental factors that are completely out of your control (emotions are just the things we see as a result of these mental health conditions which can have an impactf on our ability to regulate emotions). With all that said, you are 100% in control of what u feel is best for you.", "permalink": "/r/DecidingToBeBetter/comments/lxeatb/how_do_you_overcome_depression/gpqb556/"}