{"id": "t5_2tand_t3_gcfkff_t1_fpb787r", "creation": 1588463584, "origin": "t5_2tand_t3_gcfkff", "height": 1, "replied_to": "t5_2tand_t3_gcfkff", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "noshittysubreddits", "text": "I can 100% relate. One big aha moment for me was the realization that, 95% of the time, we don't indulge in our vices like social media because we enjoy them or because they entertain us or whatever, we indulge because they are simply good at relieving or distracting away bad feelings. This is true for all vices, from today's technology based, dopamine drive apps and media, to yesterday's substances and illicit indulgences.\n\nWhat kind of bad feelings?\n\nFor more traditional addictive and obviously dangerous substances like smoking or alcohol, it could be the fear and anxiety of what its doing to your health (and pocket). That fear feels bad, the vice distracts away the fear for a moment, but then it returns, causing more cravings, so you get stuck in this nasty endless feedback loop. Ditto for gambling: nothing relieves away a tough beat than another rush of a bet. The medication both causes and cures the disease, which is a hallmark of addiction.\n\nIt's similar with our new modern vices like social media. The bad feeling could be the guilt you'd feel after breaking the promise you made to have a distraction free day. It could negative self-esteem emotions, like feeling useless, and feeling unmotivated. It could be some background issues of anxieties, stress, disappointments, regrets... the kind of stuff that that has you constantly experiencing a refrigerator hum of cortisol. All of these is precisely exasperated by the use of technology and time wasting. Plus social media is notorious for showcasing people's fantastic lives, leaving us feeling like duds in comparison. \n\nSo... we waste time, time that could be spent getting out of our rut and achieving out dreams, so we feel bad, so we get an itch for relief then we grab our nearest vice (or maybe we just grab our phone mindlessly as you described), which distracts away the pain, but then it returns and it's worst, so more vice, etc. Again, the medication both cures and causes the disease.\n\nSo that's the problem. The solution, in my personal experience, requires a thorough change in perspective. It begins with learning to cultivate kindness and self-compassion in yourself when you falter, which is inevitable. This issue came up last week in another sub and I ended up writing up a 4 part method I use which was well received. If you are interest (OP or others) I can link to it. It might help :)", "permalink": "/r/DecidingToBeBetter/comments/gcfkff/social_media_doesnt_give_me_satisfaction_or/fpb787r/"}