{"id": "t5_2tand_t3_ha8y3l_t1_fv1ehf8", "creation": 1592331903, "origin": "t5_2tand_t3_ha8y3l", "height": 1, "replied_to": "t5_2tand_t3_ha8y3l", "down_vote": 0, "up_vote": 77, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ThreeLeftsGoesRight", "text": "It sounds like you're afraid of your writing. You're making every single excuse to not focus on your writing so you can justify why you're avoiding it. I've been here, so I'll try to give you my relatable story:\n\n\nWhen I was learning how to be a software engineer I was in way over my head. I felt like I wasn't cut out to be an engineer because my skills weren't very good. I knew the only way I was going to get better was to practice. But then I would make every excuse not to practice--I don't have time, these guys are just naturally talented, my room/computer is a mess, it's not gonna be good. It wasn't until I just started practicing, working, writing code, making stupid mistakes, embarrassing myself, searching through stack overflow with overwhelming frustration did I start to get better. Not only did I get better, it got easier. All of it. Not just the writing code part, but the process of sitting down and getting to work. It became a routine. Now I love what I do, but I wouldn't be where I am now if I hadn't done the difficult part of getting started.\n\n\nNow put yourself into my position. I don't know your skills as a writer, but your position could be similar to mine. Overcoming inertia can be incredibly difficult, but my goodness is it rewarding. Every day you sit on your hands making excuses is a day you'll never get back. Each day is a gift, a blessing, and an opportunity to do good for yourself. Remember, in the end you're either doing yourself a service or harm.\n\n\nAlign your stars, get your head right, get rid of the excuses, and get in the game. It's already in you to do this. You know what you want and it's waiting for you. Best of luck.", "permalink": "/r/DecidingToBeBetter/comments/ha8y3l/im_so_fucking_lazy_i_wasted_this_whole_quarantine/fv1ehf8/"}