{"id": "t5_2tand_t3_ha8y3l_t1_fv4n0yk", "creation": 1592406237, "origin": "t5_2tand_t3_ha8y3l", "height": 1, "replied_to": "t5_2tand_t3_ha8y3l", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Benzecri", "text": "It can be really hard to tackle big side projects while you have a full time job. Work is draining. You’re spending 8 hours of your day doing it and maybe a couple more commuting to it and thinking about it. Not to mention that life has upkeep (errands, being active, dealing with whatever, cooking, etc.) It really sounds like you weren’t able to get started because you just didn’t have the energy. We all need down time to recover and you did that my playing video games and hanging out with your friends.\n\nI used to struggle all the time with wanting to do more during my down time after work and after a while I realized that having free time does not mean having free head space or infinite energy. Keep that in mind when you go back to work.\n\nRe: not writing with all the free time in quarantine - I think it’s worth acknowledging that quarantine wasn’t exaaaactly the ideal time to be productive. It was the death of a normal we knew and loved; deaths require time and energy to grieve. I’m sure if you reflect on the initial month or two, you’ll see that the worry, anxiety, and insecurity about the future and the sinking feeling that the past was long gone didn’t exactly lend itself to being uber productive.\n\nWriting a book is a massive undertaking, and I think you would benefit from seeing that undertaking as a skill and not a big task. Skills take time and practice and they feel crummy and unrewarding until you get somewhat good at them. It honestly sounds like you can’t get started because you’re not really sure how to even begin to chip away at this big project. So my best advice is read about how to get started, set tiny writing goals that slowly grow, acknowledge that you may not find it rewarding for a while, and be kind to yourself about it. This is important to you and like any skill you need to give yourself room for error or the desire for perfection will eat you alive. With practice (not time), you will learn how to weave writing into the fabric of your daily life.\n\nI wish you the best of luck!!", "permalink": "/r/DecidingToBeBetter/comments/ha8y3l/im_so_fucking_lazy_i_wasted_this_whole_quarantine/fv4n0yk/"}