{"id": "t5_2tand_t3_ha8y3l_t1_fv4pqgg", "creation": 1592407619, "origin": "t5_2tand_t3_ha8y3l", "height": 1, "replied_to": "t5_2tand_t3_ha8y3l", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "1silversword", "text": "Going straight to novel writing is tough.\n\nWhy not try writing some short stories? Or just write some scenes from your story?\n\nIt's much easier to think of a scene and write it than 'starting a book'.\n\nAlso keep in mind it doesn't have to be perfect at all.\nLike if you're trying to write a scene but you've not worked out the names of the characters, where they are exactly - just don't give a shit. Write it anyway. Give them names like 'man with beard' 'short woman' , describe only the parts of the room you have to.\n\nThe hardest part of writing is always the start but once you have something down its easy to just read through and fix stuff, you'll be like oh this bit could be better.\n\nIf that doesn't work for you try planning everything out. The more of an idea you have the easier it will be to write it, so come up with names, backgrounds of characters, places etc. Maybe one character a day.\n\nReddit is great for gettingyourself writing too. I used to read /r/writingprompts a lot and started writing stories for it.go through new posts, find ones you like and write something for it. This really helped me because I knew the faster I got the piece written and posted it, the more chance of getting to the top of the comments for that sweet, sweet karma. Plus since others would read it I was much more focused and really edited as well as I could. \n\nFinally keep in mind that even if you had done loads of writing in these 3 months you wouldn't be done. Writing a book/becoming a writer is a long term thing. Just because you've not done it in quarantine doesn't mean you never will. You gotta look at your schedule and make time for it. All you really need is to spend 30min every evening writing and you'll be pumping out a few thousand words a week.\n\nI'd recommend reading '5000 words an hour' by Chris fox (I think) which is a self help book on how to write faster, but personally I found it really useful because a large part of the method is not to second guess yourself but just write, no fixing or correcting just writing and once you have stuff you can go back and fix it. Personally think that's the most important thing. Also has lots of tips for sorting a routine and making the whole writing process as easy as possible.\n\n'Take your pants off' is another good one explains how to outline well.", "permalink": "/r/DecidingToBeBetter/comments/ha8y3l/im_so_fucking_lazy_i_wasted_this_whole_quarantine/fv4pqgg/"}