{"id": "t5_2tand_t3_qh07c0_t1_hiawotk", "creation": 1635371397, "origin": "t5_2tand_t3_qh07c0", "height": 1, "replied_to": "t5_2tand_t3_qh07c0", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bigjoerona", "text": "That's awesome, I'm genuinely happy for you as that is a life-changing decision (i'm not being dramatic).\n\nI deleted mine in February and recently wrote about my experience on another sub (find it [here](https://www.reddit.com/r/getdisciplined/comments/qdf77e/discussion_how_quitting_social_media_made_me_more/))\n\nA few tips that'll help you out:\n\n1) The first month or so is HARD. Your brain tries to replace the source of quick dopamine that was social media with just about everything. If you have kept a social media (like facebook) you might find yourself abusing that more. I personally found myself mindlessly scrolling through my emails as my brain was desperately searching for a dopamine fix. If you're aware that is this a possibility it is easier to recognise when you're doing it. A voice in your head will try and tell you \"since i'm still wasting time on my phone, maybe i should just get instagram back, at least that was entertaining)\" - Do not listen to it. The mindless scrolling naturally reduces when your brain realises it can't get the same dopamine rush it used to.\n\n2)Try and replace your pre-sleep phone scrolling with reading. It's a great way to retrain your brain away from instant intense dopamine spikes. Start with 5 minutes a night and aim for at least 20\n\n3)It kinda sucks at first not being able to stay up to date with memes, especially if you're mates reference them. If you find them talking about a meme or an online reference you don't understand then just ask them, they'll get more enjoyment out of showing you for the first time than they would have from the meme itself.\n\n4) Everything gets easier after the first month", "permalink": "/r/DecidingToBeBetter/comments/qh07c0/i_have_deleted_twitter_and_instagram_from_my_phone/hiawotk/"}