{"id": "t5_2tand_t3_qh07c0_t1_hiak70z", "creation": 1635366495, "origin": "t5_2tand_t3_qh07c0", "height": 1, "replied_to": "t5_2tand_t3_qh07c0", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "babyimmacoolcat", "text": "Idk how old u are or if ur school but being in college definitely was a good incentive to get off social media for me!! I wanted to do well, but I would hyperfocus on my phone for hours on end (adhd, lol) and so I would never get shit done until the last possible minute. I hated how I felt when I had to rush my assignments like that, so I would tell myself if I have time to stay on my phone all day, I have time to do at least ONE assignment. (I try not to be mean to myself about it though bc that makes me want to do it even less). So basically what I’m trying to say is if ur in school or what not, just focus ur energy on that. If you’re not, then find something else you like to do or something you can constantly work on/towards that can keep you busy. \n\nThis helped me when I went thru a bad breakup and when I went thru one of those complicated relationships that still felt like a breakup even tho it wasn’t official lmfao. It’s not that I ignored my feelings and worked it away (I’m a crybaby so I had no problem crying through those emotions I felt) but once I really thought about what I want and where I want to be, i kinda told myself that I can’t do that w all these distractions I got going on, ya know??? \n\nAlso block ur ex on all accs if u haven’t already. I made that mistake of not doing that for the first few months after the breakup, and i would stay checking his profile and story and it made me miserable bc I was looking for signs that he still wanted me, when objectively and respectively, he didn’t deserve me. But I was going thru a rough patch so I had my rose colored glasses on. And just make a promise to urself you won’t check on them anymore (if u haven’t stopped doing so already 😭 my bad if u have gotten past that phase by now) because what will u gain other than overthinking and misery????? \n\nI think till the end of the year is a good and doable goal. And by that point comes, once u reactivate ur accs, you’ll wonder why you cared so much about those accs in the first place, at least that’s how I feel. I mostly just like the attention I get for being funny, but I’m working on not needing validation from outside sources like that. Also another important thing I tried to keep in mind (and still do try to keep in mind) is that all the romantic love you wish you could give to that person or anyone really, try to give that to yourself in little ways. Idk if that is something you struggle with or anything, but your post reminded me of how I was when I had my first break up a couple years back. Even now I’m still struggling with it, but I’m trying to be patient w my self especially since I wouldn’t treat other ppl the way I do myself, you know? And if there’s days you miss them, it’s okay and you’re allowed to. I remember back then I thought it was bad that I still missed my ex even after I realized how bad he treated me. Like why should I miss a bad person? But I think it’s okay to feel it but not do anything with that feeling I think. Idk. That’s just my thoughts, but I hope something out of this helps :(( I think I talked about my own experiences too much but I just wanted to explain how I got through that process, so I hope it wasn’t too much.", "permalink": "/r/DecidingToBeBetter/comments/qh07c0/i_have_deleted_twitter_and_instagram_from_my_phone/hiak70z/"}