{"id": "t5_2qh5i_t3_cysbca_t1_eyukpuj", "creation": 1567464775, "origin": "t5_2qh5i_t3_cysbca", "height": 1, "replied_to": "t5_2qh5i_t3_cysbca", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "honeybear003", "text": "The thing about partying sober vs fucked up is just that if you're sober, you can discover whether you actually love and enjoy spending time with the people around you, or if they're really just relatively interchangeable fixtures in a setting that's only fun because of the intoxicants.\n\n It's not as fun to be around a bunch of people you don't know very well who are shouting at each other over loud music if you're sober, no. But if you don't spend any time, energy, or money getting fucked up, you can actually spend all that getting involved in a much broader range of activities that are a lot more interesting, emotionally rewarding, and likely to be the source of genuine friendships. Making friends at a bar, club, or party is just sheer luck, it's not like you form meaningful bonds over the fact you both enjoy drinking. If you pick up an actual hobby and take classes, join clubs, etc. (which you can now afford with the money you once spent on booze/drugs) you'll end up around other people working toward similar goals and sharing a common interest. You can have actual adult, coherent conversations with these people, without ever getting into fights or making an ass of yourself. You can actually remember your interactions and build upon them. You have consistent energy levels and can remain active for hours. You can actually process your emotions and learn how to relax and have fun *with life itself*, and basically overall just end up being *far* more rewarded by getting together with your *real* friends to go SCUBA diving/play D&D/climb a mountain/make art/put on community theater/whatever (not to mention just any old thing people do while drinking, like dance, karaoke, darts, grill, and talk) than you ever did with the old standby of \"long week, time to spend a lot of money turning tonight into a blur and wake up tomorrow feeling like shit, if I'm lucky I'll fuck someone\". \n\nIf you have your life in a positive balance and drinking or getting high is just one small part of it then it certainly can have its place, but for a lot of people (even many who don't have a serious problem) the fun they have from getting fucked up is more a barrier to a deeply fulfilling and authentic life than anything else. If you literally can't imagine being able to have a ton of fun unless you were on something, that's definitely true of you.", "permalink": "/r/happy/comments/cysbca/18_months_sober_from_alcohol_and_cocaine_today_i/eyukpuj/"}