{"id": "t5_2qh5i_t3_cysbca_t1_eyz8nqi", "creation": 1567612106, "origin": "t5_2qh5i_t3_cysbca", "height": 1, "replied_to": "t5_2qh5i_t3_cysbca", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "crescojamboree", "text": "There’s a period of time in early sobriety (like the first 6 months) where you pretty much just have to put your nose to the grindstone and be disciplined. I it’s not what you wanna hear right now but the first 6 months are uncomfortable, boring, lackluster, bland, and overall you’ll just kinda feel like shit. In addition to those fun things, you’ll also have bouts of depression, loneliness, anger, frustration, and you’ll feel sorry for yourself a lot. You’ll feel left out, like everyone on earth is having a great time except for you. AND if you’re doing it right, you’ll feel a deep and present guilt about how shitty you’ve treated everyone in your life up until this point. It sucks. But you can do it. \n\nI will make you one very big promise: you’re discipline through this tough time will be rewarded. Things will start to get better. You’ll slowly start to feel better. Good coincidences may start to happen that you weren’t expecting (don’t rule out the possibility that these coincidences may be coming from something spiritual that wants you to succeed). Set some goals and work on them when you feel up to it. Do as much as you possibly can for other people (start with family members) it’ll make you happy and it’ll make the people you help out happy too. Make it a rule to do something nice for someone you love every day. It’s a great thing to do and a good way to fill up time you’d otherwise spend feeling sorry for yourself. Slowly slowly slowly but surely things will get better and one day you’ll realize that you have new peace inside that you’ve never felt before. That peace will continue to grow and turn into joy. And that joy will foster itself into a deep contentment. \n\nIt all starts with discipline. It’s a sacrifice, and sacrifices are hard. You’ll see later that it’s the pain in life that makes you grow, and you’ll realize that’s a beautiful thing. I wish you the best of luck. You can do this! You owe it to yourself and the people around you! You’re life can become better than you can even imagine. I wish you peace and sobriety my friend.", "permalink": "/r/happy/comments/cysbca/18_months_sober_from_alcohol_and_cocaine_today_i/eyz8nqi/"}