{"id": "t5_2tand_t3_jryx9r_t1_gc76sp9", "creation": 1605307503, "origin": "t5_2tand_t3_jryx9r", "height": 1, "replied_to": "t5_2tand_t3_jryx9r", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Primatheratrix", "text": "I've been feeling similar lately. I am unabashedly a Christian, but the way American Christians have been behaving lately has been downright embarrassing to me. The hatred and the unwillingness to be sacrificial and kind to one another is so antithetical to everything I've come to believe to be true. By no means am I perfect. I suck just as much as everyone else. But when the people who I previously called family start behaving so badly it makes me question whether I even belong to that culture anymore. It's been a real existential crisis for me lately. \n\nThe pandemic right now is a once in a hundred year occurrence, so it's not exactly a reflection of reality. But reality will resume eventually (historically, it won't be longer than three years max). When it starts to resume, my best piece of advice for you is to try to be part of group activities. It doesn't really matter what the activity is: board game groups, volunteering at a food pantry, a cycling class, even a part time job doing some meaningless work. \n\nYou're going to suck at interacting with people, but the first step to not sucking at something is attempting it in the first place. Eventually you will get better. Eventually you will make friends and if they're the good sort of friends they will accept that you're a terrible person like the rest of us. \n\nReally important note, the quality of friends you make will be entirely dependent on the type of activity you choose to do. People who hang out at dive bars, are very different from people that define their existence through exercise, who are also very different than people who play videogames all day or people who devote themselves to their careers.\n\nDecide what type of person you want to be and try to participate in the activities they do.  If nothing is interesting to you at all, it's likely the depression talking and the best way of dealing with depression is sleep, eating well, exercise, and medication if needed.", "permalink": "/r/DecidingToBeBetter/comments/jryx9r/at_18_years_old_i_was_a_depressed_introvert/gc76sp9/"}