{"id": "t5_2tand_t3_mpqpoj_t1_gubi4vx", "creation": 1618274833, "origin": "t5_2tand_t3_mpqpoj", "height": 1, "replied_to": "t5_2tand_t3_mpqpoj", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "adhme2", "text": "First off, super fkn congrats on taking the steps to take care of yourself. A really hard part, for me, was accepting I was being a, and causing problem(s) in my life. \n\nAs far as the past goes, there are two main points that helped me let go of some things, although not right away, were:\n1. Think it through objectively, and accepting the faults on both sides. Acknowledge how and what you did, then ask why. Example from my last relationship. My entire attitude would change on a dime. I never noticed it though. Not till I went back through, slowed down, and objectively tried to figure out where those feelings, I felt like I couldn’t share, were coming from. My shoulders would rotate forward in a more aggressive stance. My eyebrows would turn to a scowl. My tone of voice would shift. When asked what was wrong, I would immediately get defensive which would make her get an attitude which would make me get an attitude and it would keep escalating till we were screaming and throwing things. Looking back, I can see how I instigated and perpetuated those fights. But I also can acknowledge that she didn’t make it easy. Rather than both of us trying to communicate from a place of understanding, we tried to force our own narratives.\n\n2. You don’t have to please everyone, and no one is obligated to please you. When I started to accepting that I didn’t have to be everyone’s friend, that I didn’t have to feel bad that someone didn’t like my personality, it helped me let go of the past relationships I tainted. We can only say sorry and fix the material things we broke, but just like the past emotion haunts you, they are also reminded by it. If you’re actively trying to do better, and you’ve tried to make amends, that’s literally all you can do. Just like it’s your job to handle your own emotions, it’s their job to handle theirs. If they hold resentment, then that’s on them. My best friend from college did a lot for me. He lent me like $2k to help me get on my feet, lent me his car countless times, and always checked in on me but I always ignored him till I needed someone to talk to. One day he just stopped. I took time to think about what he had done for me and how I treated him. It took me 2years to fully pay him back, yet I still had $100 every week to buy an OZ. I reached out to him and apologized. Tried to do the best I could, and all I got was an ok thanks. I tried to reach out a few more times, just to see if we could reconnect, but I get ignored. I understand that I was a bad friend. I understand that I disrespected him in more ways than one. But now that I’m actively trying to work through my issues, it’s not my job to work through his too. As a matter of fact, I can’t work through his issues. All I can say is sorry, and this is who I am now, I hope you can accept that.\n\nI’ve struggled with CPTSD and BPD for years, but only recently started seeking professional help. I will always suggest going to a professional as they are trained to see the fallacies we delude ourselves with. It’s a lot easier to untangle things with help from someone that isn’t tangled, or rather someone that has the tools and detangling spray. Read books in the mean time. I try to remember not to take everything for face value, because some of these self help books are written by crocks. Read through the tools and keep the ones you like. I hope this helps and I hope things work out exactly how they need to for you!\n\nBook suggestion \nCPTSD: From surviving to thriving by Pete Walker", "permalink": "/r/DecidingToBeBetter/comments/mpqpoj/how_can_i_forgive_myself_without_feeling_guilty/gubi4vx/"}