{"id": "t5_2tand_t3_54jqnk_t1_d83x16l", "creation": 1474970241, "origin": "t5_2tand_t3_54jqnk", "height": 1, "replied_to": "t5_2tand_t3_54jqnk", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bastc", "text": "When asking people to self report by using multiple choice answers, they will often answer according to their expectations of the outcome of the test and try to even out certain answers that don't fully describe their own situation. People are also less likely to pick one of the extremes (the 'never' and 'always' answers). Look at the following question:\n\nOver the last 2 weeks, how often have I been bothered by any of the following problems?\nLittle interest or pleasure in doing things\n- Not at all \n- Several days \n- More than half the days \n- Nearly every day\n\n'Not at all' and 'Nearly every day' are the extremes. People will try to avoid these answers and pick one of the remaining two. But in this case the two middle answers both seem to indicate some form of depression, which might lead people to pick 'Not at all', even though they don't really agree with it. Now the person taking the test feels like he has shifted the eventual results in a certain direction, and needs to correct this in a following question. The headings showing exactly what is being tested helps the person taking the test to select which question he can use to correct the unbalance created by a previous answer. This way of testing leads to under diagnosing symptoms the person doesn't know he has, and over diagnosing symptoms he knows about. \n\nYou should try to avoid situations like these. Don't group questions so clearly by subject, don't show exactly how many questions are left for the current subject and give people the option for a less extreme answer than always or never, like 'almost always' or 'almost never'. You can usually count these the same way you count the always and never answers, they are just there to prevent people from trying to correct a previous extreme answer.\n\nAn even better way would be to give someone a yes or no option in the above question. You would then give them a follow-up question if the answer is yes, asking them if this happened once or more than once, and the 'more than once' answer could be followed up again until you get to answer that fits in one of the four categories.", "permalink": "/r/DecidingToBeBetter/comments/54jqnk/with_this_inventory_you_can_test_your_mental_and/d83x16l/"}