{"id": "t5_2tand_t3_ob4xja_t1_h3nolhe", "creation": 1625123711, "origin": "t5_2tand_t3_ob4xja", "height": 1, "replied_to": "t5_2tand_t3_ob4xja", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Da_Real_CeReaL", "text": "Hello DTBB! Just a heads up, I am going to disagree with the OP, it appears about 75% of the time. If you can't hang, or are triggered, leave now. I decided to make my response public, for the benefit of others. So that you all might see what a healthy dialog looks like. The OP and I are obviously open minded people. I look forward to OP's response.\n\n&#x200B;\n\n1. I can't tell you what to do, just provide options, and even then my limited knowledge of what your vision is, hinders me from even suggesting good options. I guess in reference to my first paragraph could be summed up as me encouraging you to broaden your horizons. That's all. But if your happy doing what your doing for your own reasons, then there's no need to expand your horizons. I analyzed what it appeared you were doing, then sought ways to do it bigger.\n2. I see, so your writing is many things, but one thing it is not is to \"sell out\" to big business. It sounds like you have a solid understanding of what you do, and don't want to do, with your writing. Nice job!\n3. Incorporating motivation was a faulty assumption of mine. I didn't know about your paragraph 2 until afterward. Motivation really doesn't have any involvement here. Best I can tell is your writings comes from experience and vetted sources. There's really no need to motivate people, if they don't want to face the facts, you should have to exhaust yourself trying to convince them that facts matter. In response to me being in group D, as a professional analyst I have to be objective in my job. Red-flags go up for me when someone uses their experiences as proof of something. Memories of experiences can be incomplete, or altered, or whatever. Think about this, my company has already figured out they want to expand with a new office. They've come to my team to figure out what state the new office should be. What do you think the results would be if I reported back with, \"Well I grew up in CA, and i've done some fantastic business transactions there, plus the weather is great, and good weather is said to make people happy.\" Lol, they'd show me the door. So lets see, for 12 dating principles... Personally, I'm done with dating, I'm looking for something more serious. So, if you wrote about 12 relationship principles, I'd probably seek out the Harvard Business Review on conflict management and mediation. I think their program has been going on for about 20 years. By trade, I have no interest in emotional intelligence, other than for myself. The little time I have invested, I have used it for private personal introspection.\n\n4)Ok, you got me started on Emotional health. The zero-sum game for my profession. In direct response to your writing on the topic.\n\n1. All emotions are equal. I would turn and say, if that is true, then emotions are also neither good or bad, right or wrong. Which leads to the requirement that emotions are simply to be understood. What makes a person happy in America, could make a person sad in Canada. There's no judging it, it just is. However, by understanding another, trust is born, and the more understanding there is, the more trust forms. Very slippery slope, because what happens when a person begins to have mis-understandings, is trust not lost then? That doesn't seem fair. How does making an honest mistake turn me into a less trustful person.\n2. In response to not chasing happiness. Agreed. I would add that basing happiness on achieving goals is short sided. Once the goal is attained, the happiness is short lived. I would quote Steve Jobs here, \"The only way to be truly satisfied in work/life, is to do great work. And the only way to do great work, is to love what you do.\"\n\n3)Don't argue with irrational people. I would turn and say, don't argue, and further don't debate with irrational people. Emotional people fall under the category of irrational people. With this line of thinking, one shouldn't get into a relationship with an emotional person, because differences will arise, and in the end, the emotional person will do more harm than good via inconsistencies. One day I look good, the next day I don't. What changed? Trends come and go, but classic's never change. I've never known a man who wears a suit as unattractive.\n\n4)Become healthy in other areas of life too. Here's my questions, how do you define \"well\" Normally, well is a state of being. So what I hear is, eat in a well state of being, sleep in a well state of being, socialize in a well state of being. I think what you mean instead of well, is good. Which begs the question, how do you define good? The moral debate contines.  In addition, the seritonin/dopamine release is conditional on external factors, exercise, other people.. An addictive personality like myself would take these things to the extreme. Some say it's a deficit, some say it's a gift. However, in my case, I threw myself into my industry to be the best, all other areas of my life followed suit. I made work friends(social), there is a gym on-site(physical), benefits include all the major/minor health benefits, for example, I see a chiropractor once a week. Is he really doing anything for my health? Probably not, but I feel better, and I know it's a placibo, but whatever.\n\n5)Conditional agreement on repressing emotions. I am a strong advocate that not every emotion needs a public debut, I'd go so far as to say, 95% of emotions don't need a public debut. I am not saying to repress them, I am saying my emotions are of no business to others, except under exceptional circumstances. I am fully capable of privately dealing/controlling my emotions and then privately letting them go.\n\n&#x200B;\n\n6) According to who is it important to express myself and let off steam that is healthy and socially acceptable? According to you? Letting off steam imply's I am not in control of my emotions; that is, anger. AND if I am not in control of my anger, it means someone other than myself has control over my anger, therefore controlling me. In my book, that's embarrassing when I unintentionally allow someone to control my emotions.\n\n7) Minimize stress. Actually no. For me, I used to live in this safe little bubble. Everything \"out there\" was scary. Ya know what, I never grew. One day I decided to take a step out, and my comfort zone grew. Then I got to a point where getting past my next comfort zone was climbing over a chain-link fence with barb-wire on top(metaphorically). That was a hard zone to pass. The day I did it, I no longer had a comfort zone, except for the things that made me uncomfortable. I felt suffocated by the things that once made me comfortable. I have a speech impediment that is aggravated under stressful situations. Like lifting weights, the harder I pushed myself, the greater my stress threshold. All of a sudden, metaphorically speaking, benching 250lbs is a walk in the park.\n\n&#x200B;\n\n8) Spot on. Perfect!\n\n9) This is just a little bit too much reality for me. If you can do it, you're a better person than me. Like i said, i'm not a spiritual person. Sometimes I just need an escape, I just want to forget about life. A reprieve if you will. I'll be the first to admit I'm not perfect.\n\n10) Agreed, a therapist can be a good starting point. In the end you are responsible for your life. I was diagnosed at the age of 26ish with high functioning autism. This may be still true, but instead of looking at it as who I am, I used it as a baseline for getting better. And here I stand a professional analyst.", "permalink": "/r/DecidingToBeBetter/comments/ob4xja/the_8020_principle/h3nolhe/"}