{"id": "t5_2tand_t3_pjquy2_t1_hbzi1ic", "creation": 1631052531, "origin": "t5_2tand_t3_pjquy2", "height": 1, "replied_to": "t5_2tand_t3_pjquy2", "down_vote": 0, "up_vote": 21, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "relationship_tom", "text": "This. I didn't have stay in bed all day and do nothing for months, emotionless, depression. But mine persisted for years, along with anxiety. It fucked up a lot of things in my life. It was also to the point where I knew I wasn't anxious at that moment because my chest hurt (Nothing heart related or serious as per tests by a specialist and my GP). I was running on anxiety adrenaline constantly so when I relaxed, my muscles hurt. \n\nFour medications later, I found one that works. ACT with a therapist and my MD helped me to accept that I can't reframe or wish away the negative thoughts and fears, but become a casual observer of them. This helped me to let them pass through without judgement. Took about 6 months of constant practice before I got good at it. Rational emotive therapy, CBT, none of them worked. ACT was the key (With my brain now balanced and a guide). I'm now on the lowest dose of the meds and feeling great. I sometimes cry at the time it took from me. My late 20's and early 30's from me. I had it since late teens but I could live a productive life with it before then. \n\nOthers are much worse off than me and I truly feel for what they have to face. Luckily there are quick fixes that are proving valuable to a good portion of resistant cases, so that you can then at least get up and meet with a therapist and do the work needed. I've done two and can attest to them (Low dose mushrooms and TMS especially), even though mine wasn't resistant. It's a great addition if your doctors think so. Of course I couldn't do the former with approval, but I've done them for years before and so I was accustomed with 1/10th the dose. But TMS is the cat's ass.", "permalink": "/r/DecidingToBeBetter/comments/pjquy2/overcoming_depression_we_are_who_we_choose_to_be/hbzi1ic/"}