{"id": "t5_2tand_t3_9bpkag_t1_e55khiy", "creation": 1535721932, "origin": "t5_2tand_t3_9bpkag", "height": 1, "replied_to": "t5_2tand_t3_9bpkag", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NetScr1be", "text": "The thing that struck me about the question is that it operates on a fairly low level. It parses out to '_What_ should I change?'.\n\nConsidering the concept of levels of change, what is often missed is if we effect change on a higher level it ripples down to all the lower levels essentially for free.\n\nThis is one explanation of the concept (not necessarily the best):\n\n> Logical Levels of Change:\n\n> Spirituality (AKA mission, community) – Change for whom and/or what purpose?\n\n> Identity – Does change reflect who I am?\n\n> Values and beliefs– Why make the change?\n\n> Capabilities and Skills- Change how\n\n> Behaviours – Change what?\n\n> Environment – Where to change?\n\nSource: https://excellenceassured.com/nlp-training/nlp-certification/logical-levels\n\nIt shows 'what to change' almost at the bottom.\n\nNot saying it won't work just not the most efficient.\n\nMoving up a few levels and working on identity (defining who we are (not)) changes everything below that.\n\nSomeone I mentor changed their principal identity to athlete and became one of the top-rated Stand-Up Paddleboarders in North America for their age group.\n\nMaking that changed pushed their negative identity aspects aside so his family benefits from the fact his focus is on fitness. He realized he can't be his (true?) identity and engage in behaviours that are detrimental or contrary to that identity.\n\nBasic things like taking care of his obligations and responsibilities need to be taken care of first to create the opportunity to be who he really wants to be.\n\nThis last is goes to 'ecologically sound' goal setting and getting.\n\nIt's pretty hard to get in the zone if your SO is mad at you and/or you're filled with guilt and shame for ignoring your kids.\n\nThat explains why Community is the highest level. Making choices that impact your community (think family, friends) positively are most likely to be successful long term.", "permalink": "/r/DecidingToBeBetter/comments/9bpkag/key_areas_of_life_to_improve_on_suggestions/e55khiy/"}