{"id": "t5_2tand_t3_2z7eta_t1_cpgosdq", "creation": 1426524044, "origin": "t5_2tand_t3_2z7eta", "height": 1, "replied_to": "t5_2tand_t3_2z7eta", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "vanish1383", "text": "Alright this might be a bit of a long post, but I see you're making your points on many other people's posts, so I'll have to take exception with some of what you're saying. \n\nFirst of all, I've wasted a significant portion of my life playing games. In high school, it's basically all I did outside of schoolwork and social life. In my first couple years of university, it was also a huge problem, as I had more free time so I'd play for longer. I quit at the beginning of last summer once I took up DJing and now will only play a couple of games of DOTA every week. \n\nWhen you're saying that \"you can just as easily get addicted to books and movies as gaming\", you're objectively wrong - look at the relevant brain science. The reward systems in video games are much stronger than in books or movies. Movies and books are more 'time-sinks' than anything, with little addictive power. Video games on the other hand are able to 'hijack' your brain to keep you coming back for more, just as a drug does - you seek the dopamine reward of completing a quest/level/boss kill/etc. Moreover, depending on what you're reading, books can be a good source of applicable knowledge that you can bring into everyday life. Video games on the other hand rarely have this benefit. \n\nThe *biggest* thing to bring up here is that you should be trying to incorporate more activities into your daily life that pay dividends in the real world, not just deriving pleasure from them. For me, it's DJing and school work because there are practical avenues I can pursue in life by putting time into these things. Gaming doesn't offer that (and don't say \"oh I can become a pro-gamer\"). \n\nSure, gaming can be a fun past-time, but *far* too many people take it to the extreme and allow it to, for the most part, dominate their life and influence them way too much. \n\n> Something that bothers me in this subreddit is, that there are few general things that people take as \"good\" (fitness, books, clean eating) and they try to do them no matter how they like it, with blind hope, that when they will follow these things, they will be happy. I just don´t believe it is like that.\n\nWhat you say here is simply your opinion, and obviously you're speaking from experience. The good posts in this subreddit will contain information that are generally applicable to people across a wide range of personality types. For most people most of the time, personal fitness, reading, and healthy eating are beneficial and productive things to be pursuing. You simply have no ground to stand on when you're claiming that video games are just a matter of preference or are in any way comparable to 'real-life' activities such as the ones mentioned above. The fact that I may not like going for runs or the soreness I wake up with after a work out says nothing about the objective, long term benefits that such activities provide.", "permalink": "/r/DecidingToBeBetter/comments/2z7eta/the_easy_way_is_so_much_more_difficult_than_the/cpgosdq/"}