{"id": "t5_2tand_t3_aameom_t1_ectxw1e", "creation": 1546123061, "origin": "t5_2tand_t3_aameom", "height": 1, "replied_to": "t5_2tand_t3_aameom", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tgaz", "text": "> It is not that the advice is not helpful, it is wonderful,\n\nDon't worry. I'm a stranger on the Internet. I can tell you what I'd do in a situation similar to what you described, but I don't know all the details.\n\n> If I phone the cops or someone else does he isn't going to stick around in all likelihood,\n\nSorry, my point is not to have him arrested and locked away. The point is that you want him to behave, and if you can't make him leave when he misbehaves, you may have to escalate to someone who can. If he respects the police in the area, then just putting this on the table might be enough to make him realize he's not in charge at your doorstep. You are.\n\n> It is just hard emotionally. Him not getting help for example.\n\nI once saw a therapist, after going through a rough period with a childhood friend. I was trying to help my friend get his economy in order, but his new girlfriend was dragging him into a bad spiral. The therapist simply said \"maybe he needs to make his own mistakes.\" Of course, that was probably just him saying what I deep down wanted to hear, but we have to respect that everyone is different. If your uncle does not take your help directly, then maybe find some other way of helping that isn't direct. Whatever that might be. Don't do the same thing over and over and hoping for a different result.\n\n> He likes this social worker for example, but they have only met 4 times, I have no reason to think that will last.\n\nCan you get ideas and help from the social worker, who knows both of you and your uncle?\n\n> they simply see him as a hopeless case pretty often, and it is hard not to see their point\n\nDo you see him as hopeless? What is it you want from him? Again; back to allowing everyone make their own mistakes. Some see it as freedom. It feels like this is a bigger concern and issue than just tantrums during iPhone repairs.\n\n> I am sympathetic, but I am making excuses for him.\n\nYepp, you can offer help, but not force it. Do what makes you sleep well at night, but don't tie your own being to his. You are independent people for a good reason. Don't let the world lose two people at the same time. (That might sound cold, I know. I cut all contact with my childhood friend. I still feel -- ambivalent -- about it years later, but I refused to go into that bad spiral. He was heading down and chose not to listen to me. *Mais c'est la vie*.)\n\n> This needs to stop, at least to a serious extent.\n\nYes, you probably posted to Reddit because it has already passed your boundary. You've identified that this is too far. The question is how far you have to step back to feel comfortable, knowing that pushing back will probably cause tension with your uncle in itself.\n\n> not likely to help him if I burn out completely in 6 months or a year.\n\nIf there is one thing I'm glad you're taking away, it's that. :)\n\n> I hope so much things are good for you, and that your day can be so awesome. :)\n\n:) And I hope you get this sorted in a way that you both benefit from.", "permalink": "/r/DecidingToBeBetter/comments/aameom/looking_for_advice_on_how_to_handle_a_relative/ectxw1e/"}