{"id": "t5_2tand_t3_q3u097_t1_hfuyph4", "creation": 1633704456, "origin": "t5_2tand_t3_q3u097", "height": 1, "replied_to": "t5_2tand_t3_q3u097", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "moonmanmula", "text": "Take it from me, it’s extremely difficult to adjust to your new life even though you know letting go of toxic people is the best thing you can do for yourself. I started a year ago and I’m just beginning to accept my mixed emotions surrounding creating a better life for myself, which required remodelling my entire social life. It’s a bit like saving and budgeting. It might radically change your daily experience, you won’t experience certain things you’ve been comfortable with etc… but after a while, you’ll see you have more of yourself in order to afford the life you deserve. \n\nIn my case, I’m a musician and I had to let go of so many working relationships which were also my social circle, saying no to income and socializing all in the name of saving myself for a better future. Let go and keep faith. These people can still be in your life to some capacity. Be loving towards them but don’t waste your time and energy. Be the person you envision yourself being consistently and you’ll have less time for them. Eventually they’ll move on because like attracts like and they’ll probably won’t want to hang out with you either. \n\nWhen confronting anyone, don’t talk about what they do that you don’t like, talk about what you need to do for yourself. Example, don’t tell your friend she’s a Debbie downer, but say you need to spend more time working on your passions and being with like minded people.\n\nYou know instinctively that you need to let go. The sooner you do it, the sooner you’ll start living the life you deserve.\n\nGood luck!", "permalink": "/r/DecidingToBeBetter/comments/q3u097/im_realizing_that_my_best_friend_of_65_years_is_a/hfuyph4/"}