{"id": "t5_2tand_t3_neyegw_t1_gyixm8d", "creation": 1621306736, "origin": "t5_2tand_t3_neyegw", "height": 1, "replied_to": "t5_2tand_t3_neyegw", "down_vote": 0, "up_vote": 22, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pseudocultist", "text": "As an older Millennial I built a buisiness off social media back when no one understood it.  I was the guy coming up with brand voice back when Twitter wasn't even a thing, convincing my friends to get on the platforms, getting my whole life into them.  I built this public persona for myself which I could not live up to, but everyone thought I was so popular, and none of them realized how deeply I was creeping or what it was doing to me.  Stalking exes, comparing my life to people I hadn't seen in ages, never being nearly as good as I was pretending.  Not enjoying things because I was doing them for my timeline, not myself.  I went through this particular craziness a decade ago and totally quit social media (except Reddit, my anti-social network).  I just went dark one day.  Helped that I was moving to a different city, but I decided to change the rules for myself.  No more accumulating useless \"friends\" just because I met them.  If I wanted to be friends with someone, I had to put effort into it.  If I want to remember a birthday, I have to learn it and then write it down.  If I want to know how someone is doing, I text or call or hang out with them.  Friendships are SO much more real now.  And because I do things for myself, with no cares about who sees me doing it, I've gotten to know myself better.  At the time I thought I was very happy because I was so \"popular\" which I had always wanted.  But looking back, it was fake and it was making me so unhappy.  I'll definitely never go back.  Kudos to you for taking this step, if you manage to avoid temptation and FOMO (which can be CRUSHING at times) you'll eventually realize real life was waiting for you all along.", "permalink": "/r/DecidingToBeBetter/comments/neyegw/deleted_my_socials/gyixm8d/"}