{"id": "t5_2tand_t3_q8rxbm_t1_hi6ozig", "creation": 1635294162, "origin": "t5_2tand_t3_q8rxbm", "height": 1, "replied_to": "t5_2tand_t3_q8rxbm", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "3throwaway137", "text": "I was really depressed a few years back. Took lsd with some of my friends. It starts off fun and giggly, then it starts getting more intense, you think about deeper things but in a much simpler way. I started thinking in a different way about my life, the world, and everything around me. It became too intense at a point and I started freaking out. Thinking intensely about every negative thing that bothered me or worried me or freaked me out. I spent a decent amount of time in this place until my friend pointed out that it was all in my head.  I realized I could be happier if I wanted to and that most of it was simply all in my head and that I was choosing to feel sorry for myself and choosing to not enjoy life.  I felt all of the worry, fear, and sadness wash away to a new perspective. I realized there was nothing too serious to be sad about and i felt an almost childlike feeling of happiness and adventure. I had a deeper appreciation for life. I realized how powerful the mind can be. I came out of the dark part of the trip enjoying the rest of the day in a great mindset just living and laughing with my friends listening to music. I woke up the next day with the \"afterglow\" feeling an excitement and motivation for life moving forward. I could describe it as multiple therapy sessions with yourself and solving your problems but in one day. The afterglow of course fades, but the lessons and choices you make from the trip will stay with you. A year later, trip again and you might learn something new about yourself or solve another personal problem. Or you won't learn anything but will be reminded that life is awesome and to enjoy your time", "permalink": "/r/DecidingToBeBetter/comments/q8rxbm/how_can_i_be_more_enthusiastic_about_life/hi6ozig/"}