{"id": "t5_2tand_t3_q8rxbm_t1_hgupv3k", "creation": 1634387037, "origin": "t5_2tand_t3_q8rxbm", "height": 1, "replied_to": "t5_2tand_t3_q8rxbm", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Aranel_snow", "text": "TLDR: If you don't care about my story you can skip to the lessons I learned, the first sentence of every lessons sums it up.\n\nI recognize myself in your words, I'd also add that I'm pretty creative and with a very developed imagination. I always day-dreamed a lot, but I never connected my dreams (most of the time really unrealistic) to real ambitions. I always struggled socially, also because I suffer social anxiety and shyness. After my bachelor degree I started suffering depression, I didn't have a path to follow anymore and I was lost. I studied Chinese language because I liked it, but didn't know what to do with my life, I was lost. Ended up being a waitress for few years, almost giving up to the idea of ever feeling realized. That \"fuck it\" feeling you talk about. At 27 I started gathering my shit, started a new path of self growth and realization. It took time, many ups and downs, but I'm every day closer to my new and realistic dreams. I'm 32 now, not a kid and not there yet, but I'm highly motivated and work hard every day to reach my goals. Sorry for taking so much time talking about me, but I thought it was important to tell my journey. \n\n\n\nHere are some LESSONS I LEARNED (they could not apply to everyone):\n\n1- You don't need to start a journey already knowing where you want to go: I started just doing what I liked, little by little I discovered new interests and talents I didn't know I had. I changed my route many times, made mistakes, \"wasted\" time, but it all brought me where I am and helped me enrich my baggage of experience. \n\n2- You can create the job of your dream. Don't stick to traditional career's paths if they don't appeal to you, or at least personalize them. Take two things you like and think how you can combine them. We live in a time of specialization, being unique is a plus today.\n\n3- You don't need to aim for a constant productive life. I learned to consider my life like a succession of cicles, some are positive, happy, with high energy and motivation, other times I feel sad, unmotivated, tired and very lazy. I learned this observing the moon phases, the seasons and my female body, why shouldn't I work like this too? I try to use the down moments for reflection, gathering my thoughts and set some goals and intentions. I try to act when I'm more energized. Probably sometime you'll have push you a little to come out of the down moment, but with time it will get easier and motivation. Learn your patterns and act in advance. \n\n4- We sometime confuse fear with laziness. It not easy to tell and I personally don't think I ever learned, but I learned to put myself in situations I fear, to grow stronger and bolder. Not too much, I don't want to be overwhelmed, but I'm learning not to fear failure. And one of my motto now is \"you learn more from failure than from things that went well\".\n\nSorry for the long post, I'd love any kind of feedback and opinion about my \"philosophy\".", "permalink": "/r/DecidingToBeBetter/comments/q8rxbm/how_can_i_be_more_enthusiastic_about_life/hgupv3k/"}