{"id": "t5_2tand_t3_pgr8sa_t1_hbdpd15", "creation": 1630625627, "origin": "t5_2tand_t3_pgr8sa", "height": 1, "replied_to": "t5_2tand_t3_pgr8sa", "down_vote": 0, "up_vote": 196, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "The_Dude_of_Pala", "text": "I've most certainly been there, I was clinically depressed  for 40 years of my life. 40 years of abuse, neglect, anger, resentment and every negative thing you can imagine. At the deepest point of my depression in my 30's I could barely get out of bed, went from 230lbs to 130lbs, drank a quart of rot-gut whiskey a night and lived in a cyclic hell of panic attacks followed by crippling depression where I couldn't get out bed for days. I hated myself, my life, and what I was putting my family through. Eventually I gave in and a failed suicide attempt hospitalized me for over a month. It took several years to physically recover, but mentally and emotionally I didn't get much better. I was medicated and \"functional\" even getting promoted and such, just hollow and empty inside.\n\nSo, how did I move forward... first of all, I struggled and failed many times, I simply didn't know how to be happy or loving, I was never showed or taught these things. Therapy was ok, but I didn't help the sessions much. I tried to figure out myself, my life, my issues intellectually. Since I didn't know how to \"feel\" I overcompensated by thinking. Eventually, I just gave up on trying to think my way out of IT, out of my funk. I felt numb for a long time, literally and physically numb, from my face to my feet. Then, I just accepted IT, as it was, I accepted life as it was, without judgement, for the first time in 40 years I wasn't ashamed of the past and wasn't afraid for my future. It was in that sliver of a moment I got a glimpse and a taste of a different perspective, how life could be lived without guilt, shame or depression. \n\nFrom that point on the philosophy of Taoism and Zen Buddhism resonated deeply with me. I've learned to resist the dualistic thinking of good vs bad, guilt and judgment and live in the moment with loving kindness and compassion. Most importantly to myself and then to others. Simple living, simple practices, simple philosophies have made my life simple, but enriched and fulfilling.", "permalink": "/r/DecidingToBeBetter/comments/pgr8sa/what_to_do_if_you_dont_want_to_live/hbdpd15/"}