{"id": "t5_2tand_t3_pgr8sa_t1_hc8wsu2", "creation": 1631231796, "origin": "t5_2tand_t3_pgr8sa", "height": 1, "replied_to": "t5_2tand_t3_pgr8sa", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Horoshimamaiden", "text": "I really appreciate your thoughtful response especially since you didn’t have any information. \nI know what you mean by not picking up the load. Also, my mother wouldn’t let me do chores. She always said I do them wrong. Once I washed the dishes for her. She made me go back into the cupboard and put them all back I. The sink. She said there’s no way I could have done them right. \nThat’s silly since I used to wash dishes at a cafe and I’m a college grad I can handle dishes!! \nAnyway, at 19 I would escape a lot into RPG’s haha! Good call. \nEventually, I was sick of wasting time playing video games with nothing to show for it.\n\nI started to take long walks, I forced myself to hang out with people even if I was being boring, and I began to play music and read a lot. That’s when I went to college. When I started doing well there I think my family had some fantasy that doing well in college means you will do well in the outside world. I repeatedly reminded them that it’s a free market out there and there’s no guarantees. \nMy films had played on television and at festivals. My dad started to try to micromanage my life and I was a really solitary person with my work and emotions. He really didn’t understand the work I was doing nor did he seem to care about my health. \nEventually he started to get mad at me. I came home to find all my equipment trashed and my clothes outside in the backyard. Everything else I ever owned since I was a child including my class ring were thrown into the alley. \n\nI was absolutely too old to be living at home but it was 2009 and the freelance jobs started to disappear. I couldn’t afford to move out and that was very shameful to them.", "permalink": "/r/DecidingToBeBetter/comments/pgr8sa/what_to_do_if_you_dont_want_to_live/hc8wsu2/"}