{"id": "t5_2tand_t3_pgr8sa_t1_hbgcecx", "creation": 1630681040, "origin": "t5_2tand_t3_pgr8sa", "height": 1, "replied_to": "t5_2tand_t3_pgr8sa", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "twinkiesnketchup", "text": "Life can be one cycle after another. While often it seems as if the same cycle goes on forever we do have control. What we focus our attention on is what we have around us. If you see the negative, you attract more negative. And while it is more complicated than simply thinking positive it is where you need to start. \n\nPutting personal boundaries on yourself on what you think about. \n\nTaking time to analyze what is right in your life \n\nMake a habit to Hope. \n\nThese are the first steps. I know that you are treating your depression but treatment plans are very tricky and are often changing. What worked 6 months ago may not be appropriate now. A good counselor is imperative and even though most counselors study similar curriculum no two are alike. If who you are seeing isn’t helping you to the point that you look forward to your visit then you need to find someone else. Even though it is stifling at times finding a counselor, scheduling an appointment, paying for it - having a life worthwhile is so worth the effort. \n\nIf you can visualize a happy person or even notice someone who is happy then you can hope for the same for yourself. \n\nIf all that I have mentioned seems to overwhelming for you then you need help today from a very specific crisis team. While you may be able to recognize that you are not suicidal (which is good) if the steps I outlined above is overwhelming then you need intervention today. Think of yourself as being in the eye of a storm, it feels safe but all the ingredients are around you that can be dangerous. Go to a church and ask for help and explain your situation and the advice I gave you. Call a crisis hotline in your community or even go to a firehouse or police station. They will treat you with compassion and know what resources are available for you. \n\nLife can be very harsh and cruel but it can also be amazing and fun. You are important for more than just your immediate circle of family and friends. You have a place here and a purpose and it is my hope that you get the care you need to thrive.", "permalink": "/r/DecidingToBeBetter/comments/pgr8sa/what_to_do_if_you_dont_want_to_live/hbgcecx/"}