{"id": "t5_2tand_t3_olziey_t1_h5korq4", "creation": 1626568513, "origin": "t5_2tand_t3_olziey", "height": 1, "replied_to": "t5_2tand_t3_olziey", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Amazing-Simple5547", "text": "I know where your coming from when you say you have put a lot of time into a relationship. I have been in a so called relationship for over 2 and a half yrs.\nPretty much the entire time my boyfriend was screwing a little bitch.\nYou see i had to have a 22pd cyst removed right after we got together.And that lead to a full hsterectomy.We tried having sex to soon and it did damage to my vaginal cup and had  to have another surgery.That made it to where I couldn't have sex for a long while.He  drifted off to screw someone he had known from before.As time went by he continued with sneaking around and screwing her.When I got to where I could have sex again he still screwed around thinking I didn't know.He told me so many times he was done with it.But it never ended.He thinks its ok to cheat on me and doesn't care.Ive tried over the months to suck it all up and try and  make it work with us.But i cant do it alone and he's not helping. \nHe wants her around more than me so what does that say ?It says he don't want me or us cause he's not doing anything to make it happen.Im at my Witt's end with all this and ready to give up and walk away and go be with someone that does want me.Its been way to long to wait for someone that says he loves you but really doesn't.Ive  came to accept it and im ready to move on and start a happy time with someone else.I love this man more than words can say and  its hard as hell trying to let go.\n I know im not gonna be happy with him .He wants his cake and eat it to.Im not someone that can sit around and take my partner screwing around on me.I want  true love or I don't want nothing.Good luck with your relationship.Mine has been nothing but hell.", "permalink": "/r/DecidingToBeBetter/comments/olziey/tips_on_how_to_live_life_while_waiting_for_your/h5korq4/"}