{"id": "t5_2tand_t3_fet7j3_t1_fjt36x4", "creation": 1583603284, "origin": "t5_2tand_t3_fet7j3", "height": 1, "replied_to": "t5_2tand_t3_fet7j3", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "jacemez", "text": "Baby steps. Try rekindling or focusing on a relationship with someone you've had in the past. Whether that be a family member or old friend. Talk and hang out more with them, 1 on 1 in an environment u feel comfortable with (like your room) and work on improving your social skills (or confidence with them). Work on your jokes - humor is the most effective way in creating new friendships, but also focus on being able to share your interests confidently. People bond stronger over negative emotion, but i find that positive emotion is often better to bond over initially when you don't know them (and stating your negative feelings a lot can make you seem like a complainer). So humor and taking about stuff that you enjoy is a good first step, before eventually progressing to the deeper negative emotion - things you dont like. Then, when you feel comfortable enough with this person, invite another or ask that person to invite their friend to hang out with you guys. Do the same with the 3rd person: work on your social confidence and humor but this time in a group setting (keep the place where you guys hang out the same). Once that becomes comfortable enough, try hanging out with this same group but in a different place - a more public place like a restaurant or mall or something. Dont focus on meeting new people at this point, stick with your squad of 3 and focus on maintaining the social skills you worked on, this time in a public place (this is so you can improve your confidence in being yourself in public). Then rinse and repeat - add another person to the group, change the setting and eventually, try meeting new people. You should find that it gets easier to make connections with strangers every time you try, and that should help you become less afraid of unfamiliar situations, because if you catch yourself uncomfortable in an environment you dont know, simply talk to someone new and make a friend - that should make the environment seem more friendly and familiar to you.", "permalink": "/r/DecidingToBeBetter/comments/fet7j3/except_for_therapy_too_scared_to_go_does_anyone/fjt36x4/"}