{"id": "t5_2tand_t3_fet7j3_t1_fjs10at", "creation": 1583592547, "origin": "t5_2tand_t3_fet7j3", "height": 1, "replied_to": "t5_2tand_t3_fet7j3", "down_vote": 0, "up_vote": 19, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "4_Alice_4", "text": "As a person struggling with the same thing, I think the most important thing is having someone to help you with it who feels safe and does not get judgemental/pressuring when you're not doing what you're \"supposed\"  to do. The moment I feel pressure I pull back in my shell of safety. \nSomeone that tells you that it's allright that you feel scared, it's human, and it probably originates from somewhere and can definitely be worked on. Also someone that helps you notice when you're in this state of avoidance, helping you to focus on why exactly you're doing it. What are the automatical thoughts that trigger this fear and avoidance? When you're on your own it's so easy to even avoid thinking about it, because even that is scary.\n\nAfter two years of avoiding my studies, where I kept convincing myself it was going to be all right and I would be fine doing it on my own, trying all sorts of tips I found on the internet to feel more happy and productive, I came to the conclusion that I probably won't get out of this vicious cycle myself. If I hadn't managed to find a way to get out of it in 2 years, it was probably not gonna come.\n\nI was disappointed in myself all the time, also avoiding friends because I didn't deserve to have fun if I didn't finish my responsibilities first, and because it really sucks to having to tell them you're still at the same place you were last year, two years ago, or longer. \"How you're doing, now?\" \"Fine, same old same old, you know, under the circumstances.\" Ugh. Seeing their life go forward while you feel trapped in your own fears. (While it's also not a helpful thought to assume it matters that some people move quicker in life than others, because it really doesn't.)\n\nIt sucks to want to do so much in life, to be curious and interested in the world, and to be too scared to do anything. Not daring to ask people to hang out with you, not daring to go traveling, not daring to begin working or anything socially demanding. Not really living. Fuck that.\n\nI would still advice therapy. I was also scared as fuck, but luckily I had some great family members giving me that final push and a student therapists that was very approachable. If there is anyone you feel comfortable around (your mom, a good friend, a partner), tell them you need help with this. You know what you want: to not be scared anymore. To get your life back. Tell him/her this and that you're terrified to make the first step, and terrified of everything that comes after. Tell him/her you need help to break down this initial fear. You don't need pressure, you just need someone to take your hand in this first step. They could call for you, they could write an email for you, fuck the shame, you want to go forward.\n\nIt could really help if you could get some insight on what kind of therapies there are, so you know how to respond when something is suggested. It is also always all right to say you need to think about it. It is also always all right to say you'd rather email than call. Make it as easy as possible for yourself.\nFor me and my fear of judgement group therapy was just horrifying, would not recommend. But now I'm doing one-on-one Schema-Therapy (look up Young's Schema Questionnaire if interested) and I feel really safe with the therapist and I feel really listened to.\n\nIf you really can't get yourself to call/email/ask for help, or you can't think of someone you feel comfortable enough with, than I would advice you to look into Cognitive Behaviour Therapy. The gist is that you start to notice more and more when you're avoiding (it took me so long to even being aware of it, and how many facets of my life it influences), and why you do it. Are your feelings of fear legit? Are the thoughts behind them  100% true? \n\nThere are formats you could fill in that look as follows:\nThink of a moment where you had strong emotions or where you were avoiding. You can also be in that moment.\n1. What emotions did you feel, and how would you rate them (fear, anger, happy, sad, and all subversions you can think of like jealousy, awkwardness, hopelessness)\n2. What are the thoughts that might be triggering these emotions (sometimes you're not sure, just try to put something on paper, it doesn't matter if it's right the first time)\n3. Are these thoughts 100% true? If a friend was thinking this about his/her life how would you respond to him/her? Try to think about arguments why these thoughts would not necessarily be the reality. Are you filling in someone else's thoughts? Are you predicting the future? \n4. What could be an alternative, more positive reality than the one you have in your head?\n5. Again write down your emotions (the idea is that they would go down. I kinda disliked this step, because of course it won't immediately work, so you feel like you failed the assignment. You can just ignore this one in the beginning. It's not yet about being successful. It's about becoming aware of what happens in your brain.)\n\nI always got a bit sceptic when doing these things, but I notice now that I actually am able to stop myself sometimes when I feel stressed about doing something and am able to talk to myself in a promoting way (why am I scared now? When I think about it, the idea behind it is not really legit. Hmm, I might actually just do want I wanted to do).\n\nFinal advice is: keep in contact with friends. Try to make clear to yourself which ones really feel safe and nice. It really helps me feel more human and ok when I'm able to share fears and thoughts and people are able to respond with their own struggles (there are also a lot of people that are not able to share their own insecurities while you just opened up to them, and only try to give you advice and always show the world how good they're doing themselves. Avoid those :p They're probably good people, but not helpful for you at the moment.)\n\nHope this helps you out! \nIt's ok to feel like you do :)\nDon't feel guilty when you are easy on yourself. It's all self protection. But try to remember yourself now and again about long-term advantages as opposed to the short-term safety. Sit down, write down, be aware what you're doing. \n\nFeel free to message me if you have any questions or just want to talk :) if that's scary, think of it as someone asking you for help and how you'd also be happy to lend a hand. Most people are actually quite sweet.", "permalink": "/r/DecidingToBeBetter/comments/fet7j3/except_for_therapy_too_scared_to_go_does_anyone/fjs10at/"}