{"id": "t5_2tand_t3_jffw98_t1_g9lnx5y", "creation": 1603328052, "origin": "t5_2tand_t3_jffw98", "height": 1, "replied_to": "t5_2tand_t3_jffw98", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "leetheguy", "text": "As I said, I wish I could gift it to you.  \n\"Flip the switch\" really was a bad choice of words.  \nThere really is no magic bullet.  \nBut figuring out the puzzle felt like flipping a switch for me.  \nLike having an AHA! moment and the lights come on.\n\nEverybody is different and has to find their own path.  \nWhy do you think psychologists ask so many questions?  \nOf course they know the answers, but telling someone just doesn't work.\n\nAnd I shared the three most effective tools that I've used to help me on my own path - mindfulness, strong desire, and personal honesty.\n\n[mindful.org](https://mindful.org) is great for mindfulness info  \nI don't use meditation, just focus.  \nBut many people find meditation to help with mindfulness.  \nI like the Headspace app for that.\n\nStrong desire is just that.  \nI wanted more than anything to stop being depressed.  \nI was sick to fucking death of being miserable all the time.  \nSo I started using mindfulness to hear my depressive thoughts.  \nThen I made an unrevokable decision to stop letting them affect me.  \nI did the same thing with the self-sabotage last week.\n\nAs for personal honesty, I will take the hard truth over a comforting lie every day.  \nThat doesn't mean that I beat myself over the head with what I currently believe to be true about myself.  \nBut I don't squirm away from reality either.  \nI stay aware that every aspect of me is in flux and I use understanding to help me know what I need to work on.  \nI view problems as things that need solutions, not things that cause me to suffer.\n\nI hope that helps.", "permalink": "/r/DecidingToBeBetter/comments/jffw98/after_25_years_of_procrastination_and_unfulfilled/g9lnx5y/"}