{"id": "t5_2tand_t3_l2n40i_t1_gk6ullv", "creation": 1611329830, "origin": "t5_2tand_t3_l2n40i", "height": 1, "replied_to": "t5_2tand_t3_l2n40i", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "welliamwallace", "text": "SO TRUE. I wrote this elsewhere on reddit, it really aligns with your thoughts:\n\nI’m pretty convinced that much of the depression and **ennui\\*** felt by people in western culture is due to *not living how we evolved*. I think a satisfying, fulfilling life is characterized by the following:\n\n* Working with your hands: trim trees, burn wood, move rocks, install a washing machine, build a shed. Physical work, solving puzzles, overcoming challenges, making-do. And at the end, sitting back and admiring a physical object that you improved.\n* Relationships: a few close, platonic male friends. Ideally guys you can work on physical projects with (like those mentioned above). Run or lift together. Talk about life. Our ancestors would go out in a small group of men on a 24 hour persistence hunt, talking, stalking, sweating together. They’d get a kill and celebrate and cheer and carry it back to camp.\n* Outside of your close friends, nurture a set of acquaintances that you run into in real life, serendipitously. The barista, the dude next to you at the gym. The person you recognize on the subway. Force yourself to have small talk with them. [Research shows](https://www.npr.org/sections/health-shots/2019/07/26/744267015/want-to-feel-happier-today-try-talking-to-a-stranger) that we assume we will feel *worse after* interacting with strangers, but in actuality it greatly improves our well-being.\n* Physical fitness: a lean and strong body that gets plenty of sunshine. walking barefoot, and callused hands from work.\n* Sunshine + time spent outdoors. We evolved near trees, water, and the sound of insects and birds.\n* Ideally some sort of cultural, musical rituals. I grew up as an evangelical christian, and there was something about the worship services, and camp-fire sing-alongs that was amazing. Now I’m an atheist, but love going to music festivals and EDM concerts where I can let loose and dance. Maybe not for everyone.\n* Go to sleep a few hours after sunset. Wake-up at sunrise.\n* Help people. with work projects, home projects, baby sitting.\n* Eat meat and vegetables. Nuts & berries. Fast intermittently. Eat organ meat if you can (I struggle with this one! trying to eat more liver)\n\nI don’t have all of these things all the time. My job is 8 hours of work on the computer, and I also enjoy video games and making youtube videos. But the more of the items on the list above that I incorporate into my life, the better I feel.\n\n\\*ennui: noun – a feeling of utter weariness and discontent resulting from satiety or lack of interest; boredom:", "permalink": "/r/DecidingToBeBetter/comments/l2n40i/understanding_our_evolutionary_context_in_the/gk6ullv/"}