{"id": "t5_2tand_t3_jjwo3f_t1_gafenwn", "creation": 1603922473, "origin": "t5_2tand_t3_jjwo3f", "height": 1, "replied_to": "t5_2tand_t3_jjwo3f", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "notdorisday", "text": "I don’t think the person you are describing exists, it’s a very romanticised ideal of who people are.\n\nThe reality is that not everyone will like you - and that is OK. I don’t like everyone, I’m still kind and respectful to them, why wouldn’t I be? My choice to be kind and respectful is about who I am not about who anyone else is.\n\nMany people don’t like me. I’m also OK with that. I accept there’s parts of me that aren’t that likeable and while for many people those aren’t dealbreakers (hell, my friends even find those parts endearing), for some people they are intolerable. That’s also OK. It doesn’t make me or the other person a bad person. Neither of us need to change. \n\nYou will always feel disappointed and distressed if your goal is to be liked because the reality is no one is liked all the time. It is also a fools errand because to try and be that person you will have to compromise yourself with everyone. I don’t mean you’ll have to make compromises, I mean you will fundamentally have to compromise yourself. \n\nWhen I was younger, due to the way I grew up, with a lot of dysfunction and abuse, I didn’t know how to make friends or interact with others. As a child and then a teenager I would try to be everything to everyone, I would try to buy friendships with gifts, I would compromise myself trying to be all the things you describe. \n\nAs I grew older and had more experience I started to really reevaluate who I was and who I wanted to be. I realised that what I wanted was to be accepted for who I am. \n\nI also realised what other people want is largely the same thing - when you meet them they want to feel like who they are now is enough. Not that they need different things materially or to be more “interesting” or “clever” or “successful”.\n\nAccepting people as who they are now doesn’t mean you think they’re perfect or you even like them, but it means recognising their intrinsic value as a fellow person on this journey. It means acknowledging their personhood. It also doesn’t mean you have to accept their behaviour without question, some behaviour is unacceptable and part of respecting yourself and them is being able to articulate when you find behaviour unacceptable. But fundamentally we need to just accept others for who they are and when we do that people do tend to be more drawn to us. \n\nIt’s funny now because as a child I desperately wanted friends and couldn’t make a single one. Now as someone in my forties, older and with far more sagging parts, people comment on how great my friendship circle is, how supportive, interesting, successful and kind they are - and they are. I’m often blown away by the difference between little me and adult me in this way - but the key was never to be more open, social, intelligent, beautiful, helpful, useful, social, or interesting - the key was accepting who I was and, as importantly, accepting others as who they are and where they are now. \n\nOnce you do that life will still have its challenges but you’ll find you always have people around you to share the challenges with.", "permalink": "/r/DecidingToBeBetter/comments/jjwo3f/how_can_i_become_that_person_who_everyone/gafenwn/"}