{"id": "t5_2tand_t3_ml398i_t1_gtke8u6", "creation": 1617715089, "origin": "t5_2tand_t3_ml398i", "height": 1, "replied_to": "t5_2tand_t3_ml398i", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cataclystic", "text": "This was another can of worms that I didn't open because the post was already 100 pages long. \n\nThe day I turned in my 2 weeks notice was the best and worst day. Some background here, I did not want to leave that job because people were rude to me - they were all nice people they just didn't know how to function as a small company or function professionally with each other. I remember exactly where I was, in a parking lot outside of our field office (usually nobody around) I called my boss, and told him \"you and me having to have a conversation neither of us are going to like\" I gave him my two weeks notice, and then immediately started crying - I started crying because this was the guy that helped me when I needed it most, the car and the wedding. I know the funds came from the company but it felt like I was betraying him personally. It was tough, I was happy I was leaving the environment and the depression and anger, and I think that all came crashing down and because I had to be professional about me leaving I couldn't just blurt it out and tell him how I thought he was a incompetent leader and how everyone is unhappy because they aren't appreciated. It was kept to the idea that I felt like my potential had been maxed out, and by this point in my career here I was only doing splicing because I could not keep up with the other work, because it was too much.\n\nOnce that information went public, it was really mixed. Some people were really mad at me because they knew it was more work for them (tough shit was my response) others were really, really happy for me. These are the ones I still talk to. I would say out of the 12 people 9 were happy for me. The others either being my boss or someone that had to inherit my work. \n\nTL;DR Boss wasn't very happy, didn't say much because he kept it professional. \n\nDon't let work relationships become so personal that you feel bad about quitting an abusive environment.", "permalink": "/r/DecidingToBeBetter/comments/ml398i/i_quit_an_abusive_job_and_now_normal_jobs_seem/gtke8u6/"}