{"id": "t5_2tand_t3_b2oc60_t1_eiu5bln", "creation": 1552949916, "origin": "t5_2tand_t3_b2oc60", "height": 1, "replied_to": "t5_2tand_t3_b2oc60", "down_vote": 0, "up_vote": 103, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rocksteady2R", "text": "I was about to start this with \"you didn't ask for it, so here's some free advice...\" then i got to the very last line ...\n\n\nSo - you seem you might be a good candidate for a method of habit-building i am a HUGE fan of.  Maybe yes, maybe no, i will let you decided, obviously.  /r/theXeffect .  go take a look through and see what some folks are doing over there.\n\nBasically the notion is that you give yourself an easy-to-achieve task, and then \"just\" (easier than it sounds) do that thing one day at a time and build up a long and valuable string of successes.\n\nCleaning and hygiene are common cards over there in that sub.  For you, i would tackle it with 2 piecemeal cards to start- you decide, but let's say \"10 minute clean-up when i get home\", and \"laundry in the hamper, no floor, at night\".\n\nboom.  that's it.  you do those two things and you don't concern yourself with more.  if \"more\" happens, great.  if you clean for 20, great, but that's not the goal, and you need to be cautious about not burning yourself out.  \n\nyou're *building a habit*, not \"performing a singular act of cleaning the house\".  so don't take on too much and constantly try to do 50 minutes a day.  50 minutes of cleaning a day is BS, even for clean households.\n\nOnce you've got a 49-day cycle down (a simple grid of squares), even with some Zero's on it - you either re-start it, or say you've graduated and move on to the next habit to build.   you could do things like \"dishes when you come home from work\", or \"garbage out daily\", or \"trouble-spot clean bathroom before bed\", or \"keep kitchen counter clean by bedtime\".  whatever kind of hurdle you think needs jumping.\n\nA great day of purging is a good  clean start, but as I'm sure you know it's hard to maintain.   little, simple success lay the foundation for a habit worth having down the road.   \n\nTake a look through that sub, ask some questions, get some suggestions.   I've been doing it for 2-3 years and it's pretty well changed my life.  It won't solve everything, but it can be a damn useful tool to help you solve some.\n\nGood luck out there.  wish you the best.", "permalink": "/r/DecidingToBeBetter/comments/b2oc60/im_cleaning_my_apartment_for_the_first_time_in_a/eiu5bln/"}