{"id": "t5_2tand_t3_b2oc60_t1_eiucudl", "creation": 1552955676, "origin": "t5_2tand_t3_b2oc60", "height": 1, "replied_to": "t5_2tand_t3_b2oc60", "down_vote": 0, "up_vote": 27, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "OodalollyOodalolly", "text": "Typically, when people are asked to describe a perfectionist, they think of a person who is meticulous in every way. Everything clean and orderly- every t crossed and every i dotted. \n\nThey don’t realize the flipside of perfectionism which is complete and utter **paralyzation** because you can’t find the perfect place to start, the perfect time to start, and the perfect amount of time to complete the task available. You may also be afraid you won’t be able to KEEP it perfect every day so why start? Your motto might be, “If you can’t do it right, then don’t do it at all”\n\n**You are not a hoarder and you are not lazy. You are a paralyzed perfectionist.**\n\nThere are a few ways to combat this so that the stuff doesn’t creep back in.\n\n1. Add a little tidying/cleaning to your other routines that you already do.\n2. Consistent, few times a day, short bursts of tidying (2-15 minutes-**Use a timer**). Before you leave, when you come home, before you eat, after you eat, before you shower, before bed etc.\n3. Wipe something down in the bathroom every morning when you are in there (not all of it!). Keep cleaning spray and paper towels or rags in there.\n4. Take some trash out whenever you leave the apartment, never go empty handed.\n5. Pick a laundry day and time. For a household of one person you should be able to do this once a week but twice might be easier to lug everything.\n6. Always have a donation box or bag going. Find your local donation center or perhaps you live in a place where people will take stuff from the curb... even better!\n7. Whenever you leave a room look around to see if there is an item you can take with you to put away. A glass, shoes, trash etc. never go empty handed.\n\nHousework is not like other kinds of work. Doing a little bit is better than perfect (in part because perfect doesn’t exist). It’s good. And as you know- perfect is the enemy of good.\n\nProgress and Process NOT Perfection.", "permalink": "/r/DecidingToBeBetter/comments/b2oc60/im_cleaning_my_apartment_for_the_first_time_in_a/eiucudl/"}