{"id": "t5_2tand_t3_kw6bfz_t1_gj5a7oh", "creation": 1610567070, "origin": "t5_2tand_t3_kw6bfz", "height": 1, "replied_to": "t5_2tand_t3_kw6bfz", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "make_me_a_good_girl", "text": "> Your story is similar to mine.\n\nI am both saddened to hear that, and buoyed by the knowledge that I am not alone. Conflicting emotions are tricky, and misery loves someone to commiserate with. Glad we are both moving forward!\n\n> I realized that everything—the high, the confidence, the sexy messages—was hollow.\n\nThe person that I mentioned that makes me want to be better told me early in our chats that:\n\"There’s a major gap between your neglectful ex and horny, random Reddit commenters. Neither is truly healthy.\"\n\nI knew that, but I hadn't figured out what to do about it yet. I was still trapped in the quicksand, in that need for validation that you mention also feeling. I guess I'm slowly learning to step into my own self-worth instead of tying it to validation from others, though someone else pointed out that I have moved from seeking validation from a group to seeking it from selected individuals. I still need to work on that, but I think I have the emotional and mental space for that now.\n\nI've always surfed my subscriptions, and never really bothered with the popular feeds. I see things crossposted from other places and that's how I learn about other subs that might be interesting, beyond the hobbies that I already actively follow. Haha. I'm one of those weird people that REALLY digs into their own bubble. lol.\n\nI'm glad that you are making time for your mental health. That is so incredibly important these days, though it is always a good thing to invest in even when there isn't a plague!\n\nBe well, and thank you for taking the time to respond with your own story. I appreciate all of your details, they sound familiar to me in more ways than I can express.\n\nHealing is a process, and it always leaves scars. Do what you can. Desiderata the rest. ;)", "permalink": "/r/DecidingToBeBetter/comments/kw6bfz/today_i_unsubscribed_from_over_400_nsfw/gj5a7oh/"}