{"id": "t5_2tand_t3_g4bvol_t1_fnx44zd", "creation": 1587331112, "origin": "t5_2tand_t3_g4bvol", "height": 1, "replied_to": "t5_2tand_t3_g4bvol", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "meatballsub22", "text": "Hello! 23F here. I struggle with the same thing as you on and off. There are moments, which can last as short as a day to the span of years, where I just don't feel as excited anymore about my \"passion\". It really bothered. For example, I've always loved singing and everyone around me always complimented me and supported my ambitions to pursue a music career. I loved the validation, however, I didn't do much with my talents and my passion withered away over time. I felt so lost and eventually stopped identifying myself as a musician or a singer due to the guilt of not doing anything. When I got tired of feeling aimless, I then took a risk of starting over and transferred to a university in another city with the help of student loans. I approached everything with a beginner's mentality, and my life has improved immensely since then. After almost 2 years of excelling in something entirely different, that \"fire\" for   \nsinging eventually came back, and I decided to hold on to it with a different perspective. \n\nHere's what I learned:\n\n1. Motivation or passion will not be there every single moment of your life, so don't rely on it. \n2. When motivation fails, focus on the logistics. Just set a goal and break it down. Create a cycle that works for you that results in a finished product. Just for the hell of it. \n3. Just start. Show up and figure it out from there. Sit down on at your desk or workspace with the intention of starting something. Just start. \n4. Everyone approaches their goals and dreams differently. While some people have a burning passion that guides them every step of the way, pay in mind that there are people that had a vague thought of an idea and just decided to run with it, simply bc they wanted to. A burning passion isn't necessary, just makes things easier. \n5. Do not rely or wait for other people's validation or rejection to do what you want to do. Value expression over impression. \n6. Quit being so hard on yourself. It's okay to outgrow old hobbies or fall out of love. It's okay to take a break. It's okay to have different priorities. We are not robots and we have to decide what is best for us considering the state and circumstance we are in. \n\nAlso, I recommend the book \"Big Magic: How to Live a Creative Life, and Let Go of Your Fear\" By Elizabeth Gilbert. She explains a lot about her writing journey and creative process. I found it extremely insightful and inspiring. :-)", "permalink": "/r/DecidingToBeBetter/comments/g4bvol/apathetic_looking_for_my_spark_again/fnx44zd/"}