{"id": "t5_2tand_t3_qgj92e_t1_hi8zv7n", "creation": 1635344223, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "yarpyorp", "text": "Like you legitimately need some therapy, it sounds like you're having a trauma response and feeling under threat or like boundaries are being crossed when they're not now. Your little brother feeling like a threat to be shouted down is indicative of this. I wouldn't listen to other folks who say just stop dating and make dude friends. There's a chance you'll meet an asshole and the possibility that you'll be abusive towards others neither of which is good  worst case scenario is you getting entangled in a weird shitty abusive situation with someone and just multiplying the trauma. I say this as a trans person with a lot of trauma from similar experiences with AFAB folks (lots of flagrant violations of sexual boundaries, in public around others with no one seeming to care or be concerned about my safety, ended up deeply on edge around AFAB folks and becoming the problem myself) if you try to carry on like normal there's a chance you'll simply become the problem. Get help, try a local woman's centre ir even a women's shelter (they may have resources and/or at least know of relevant resources), do some thinking and try to understand what your triggers are and how to be more aware of them and responsible for them.\n\nSexism, exists and I don't think making a dude friend is much of a solution if you're starting to shout down children (little bro). Continue to take it seriously, find help/resources, avoid places that inflame your sense of fear (even if they are simultaneously supportive of it, as it can become a cycle of being terrified, going to a place that accepts that feeling while simultaneously topping it up and then having a harder and harder time functioning outside of said spaces) and yeah keep on being self reflective. Recognizing abusive behavior in ourselves is important and it is legitimately good that you have recognized it seemingly unprompted by others to boot!", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi8zv7n/"}