{"id": "t5_2tand_t3_qgj92e_t1_hi9fsx1", "creation": 1635350773, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bestofescher", "text": "Unfortunately, college can be a tough place for opposite-sex, safe, genuine, platonically engaging friendships. It's possible, but I made more male friends after college. Could you decrease your current interactions with male peers and identify a super-safe environment to test out some basic interactions? Go to your town's farmer's market and talk to the old man selling garlic. Ask about the garlic. Talk about the weather. Maybe buy garlic. Then leave after 2 minutes. Identify another super-safe social situation and try again. Go to the library and ask a male librarian where the Reference section is. Maybe ask for help, ask where to find X-book. Done, leave. If you have a male professor that seems like a good person, ask for a meeting and come to them with questions about a homework assignment. Done.\n\nStarting with extremely low-risk situations low expectations can set the foundation for better interactions. What is the worst case scenario with the farmer selling garlic? He's rude? Fine, forget him. You never have to interact with him again. Very low chance he'll try to make it sexual. (If he does, definitely report him to the farmer's market organizer because that's unacceptable.)\n\nOnce you are having positive interactions with the low-risk situations, you can try to move forward into higher-risk situations. Boyfriends of your friends, gay men, a supervisor at work: people who are generally not going to hit on you (and if they do, there is someone else who you can tell and they will hold them accountable). Interact in public, keep it brief, and even act a little distant if you want. You don't owe them a warm friendship (of course you can get a reputation for being cold, but that's honestly not a big deal and can be convenient sometimes lol). Similarly, these men don't owe you a warm, friendly interaction so if they act distant towards you, that's fine. At least they're not trying to use you for sex.\n\nI would forget about trying to befriend your classmates and peers for now. If they are disrespectful, you can quit talking to them. College for many people means a time to have casual sex and it will be very hard to weed through the masses of young men and find one who wants a platonic friendship with a woman. As you get older, you'll find it's easier to find those men. But I would use my time in college to try micro-interactions in super safe environments.  You can always stop. You can always go backwards. You can always tell yourself that this weekend is for self-care and not leave your house. Or have a girls day. You'd be surprised how many of your female peers are tired of fending off sexual advances, too. If your female friends only want to meet men, try meeting some new female friends. At this point, it's more important you stop having negative interactions with men and start baby steps with positive interactions. In future years, you can try for male friendship. I have not retained one male friendship from college. You're not missing anything. Also therapy would probably help.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi9fsx1/"}