{"id": "t5_2tand_t3_qgj92e_t1_hiawogk", "creation": 1635371393, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "yarf13", "text": "Since you want to change the subject so much from the fact OP openly stated they hate people based on their sex, let's try the sexist pig comment. That was used in reference to anyone who hates people based on sex. If you're \"determining\" that I called you that, is that an admittance to hating people because of their sex as well? \n\nAnd as for OP having a natural human response to negative reinforcement, yes I understand that too. It's why I don't road rage, go into dark alleys at night, or generally want to talk to people who seem more focused on Instagram than reality. I understand it's natural for people to feel negatively towards recurring patterns and develop a scar. I think it's natural. But I also think it's wrong to accept hate as an okay standard. I'm not the type to say \"I can't believe you did this!\" But I'm the type to say... \"If you succumb to this position forever, my empathy will shift away from you as the victim over time.\" Because I believe truly that people have the ability to evolve. \n\nYou can ask anyone of my friends, my least favorite demographic to deal with is young men. In my personal experience they have been the most aggressive, violent, selfish, and ignorant people I've had to deal with. But that doesn't stop me from giving people a chance, or justify me saying I hate all young men. \n\nLastly, I don't follow any schools of feminism or masculinism at that. I just subscribe to big picture ideas like... All people are equal and have the right to pursue happiness. It's pretty easy to ask myself in a scenario whether the situation is hurting someone's pursuit of happiness or their equality. \n\nI do feel (again sperate subject than hate speech and sexism) that OPs experience is potentially a result of social inequality between two genders or sexes. However, I don't think it's relevant in this post to talk about it except for, \"As always we should be working to fix that.\" \n\nThis post is about an individual who has been a victim, transformed a little beyond the line of ethics, and is seeking resolution. To me that's about evolving as a person to accept the line was crossed. Understand why it happened. Work on the perspective of what it means to allow those experiences to control you. Probably decide it would be better to become uninfluenced by others so that they cannot force you to cross that line or feel miserable or incapacitate you from getting what you want: a great working relationship.\n\nI'm a practical guy. And for the record, I think everyone in here just about assumed OPs gender. Interesting you're waving the flag of feminism without really knowing that.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hiawogk/"}