{"id": "t5_2tand_t3_qgj92e_t1_hi8qzgg", "creation": 1635340080, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "just_change_it", "text": "* Where are you meeting men? \n\nDating apps are for romantic relationships. Romantic relationships and platonic relationships differ in one huge way - sex and intimacy. You talk about dating so I assume that's one source.\n\n* What kind of discussions and activities are you engaging in?\n\nIf you hang out alone one on one and don't particularly do anything, well, a mom I used to know once told me \"There ain't much to do beyond eating, working and fucking.\" If your hobbies don't get you out there and doing anything and meeting people with activities and discussions... well yeah.\n\nI used to do board game meetups that were totally platonic. I've done fitness groups that are totally platonic. Movie and book discussion clubs.\n\n\n\n* Porn, Video games\n\nFrom your OP:\n> I always feel like men are horrible and most of them have porn addictions and do nothing but play video games all day.\n\nAgain... where are you meeting your men? This makes me assume you start dating and then just hang out 1:1. You need to meet people doing things you want to do. If you have no hobbies that get you away from a TV, in the house etc, you are going to share next to no platonic hobbies with men that allow you to meet ones that are more or less normal.\n\nWhat do you want in life? what do you enjoy doing? if neither of them get you out there meeting others who like those things I don't know what you really expect.\n\nWhen I tried to brute force dating (worked, married!) I met a lot of women who had zero interests aside from family and domestic stuff. Everyone wants to travel!!! but that's not a full time hobby. That's a week or two a year. That's not enough. Most people love movies and TV! but that's a thing you passively do, often on a couch with someone today, not something that is a hobby that gets you to meet people. \n\nAnyway, I hope you don't take this as an attack. I'm just pointing out a few things I assume based on the experiences i've had and what you've said in here. You want to self improve (that's what this sub is for) - so i'm offering this advice on the basis that you want to change yourself. \n\nThe sex thing goes both ways. If you don't want a sex focused relationship find people who aren't that into sex. Plenty of men and women out there that have zero interest.  If you want a huge rich relationship that has much rich interactions and lots of sex because you have the typical healthy sex drive... find someone who is doing something, while doing the thing you want to do. Let that help build the foundation.\n\nDon't want to do anything? well... you don't change by doing nothing.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi8qzgg/"}