{"id": "t5_2tand_t3_qgj92e_t1_hi8rifg", "creation": 1635340357, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "White_Ender", "text": "I mean...get a gay male friend?\n\nMore seriously tho. I kinda understand you, you had bad experiences with bad people, who can be put in a group, and it's easier to avoid the entire group of  poeple, and not even bothering to find out which is normal and which is not. I was the same with gypsies. I as a kid, had a lot of bad experience with other gypsy kids who beat me up and stuff. However, I learned that in middleschool that not all of them are bad. I was lucky, because this guy found me tho, not the other way around. I had a gypsy friend, who aparently hated gypsies. (I won't go into deep details why)\n\nI mean yeah saying that find a person from the group that you hate that hates the bad part of the group, could be helpfull. I could even say that find a feminist man I guess. There is probably some dangers to that too, but it's less likely I think.\n\nIs this a good advice? I'm not sure. Also I know that judging a person by their look is somewhat stupid, but so far it worked out for me, when I based it on how the person has dressed themself. People try to express themselves with that, and with that a lot of personality comes out too. So yeah people who dress good, but kinda in a asshole-ish lookin' way, there's gonna be like a 20% chance that person, will be an asshole, so I should be more...carefull, when I talk to them. Only one way to truly find it out, and that's talking.\n\nAltho I may have to warn you, that based on your post, I am litterally the kinda man that you would hate. I play computergames all day, and I do watch a lot of porn. I'm also antisocial, and I know I never gonna find anyone, so I don't even try. And before you think I try to make you feel sad for me, or something idk no. It's my decision. I don't think that I am good enough yet to be a bf matterial, so I don't bother women. That's it.\n\nI Hope I helped. Also sorry for bad english. I Hope it was understandable.\n\nSorry if I was dumb, but do tell me what you think, if you think I was dumb, so I can learn from my mistakes.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi8rifg/"}