{"id": "t5_2tand_t3_qgj92e_t1_hi875yh", "creation": 1635327127, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Chris6632", "text": "At risk of repeating the same thing everyone else has said.\n\nA healthy mindset really helps and talking to people who also \"hate men\" won't help how you feel and it'll just re-enforce those beliefs. \n\nDon't look to make friends or find a partner, just meet people whenever and wherever and make friends with them regardless of their gender, don't get along? Don't force it, just let the relationship fade out. \nUnfortunately if you're meeting people at clubs or on dating sites like tinder you're at risk of finding people who are all after the same thing, and the same goes for both genders.\n \nSomething I was told by a friend and that I think rings true is that assholes are more likely to be too forward, catcall and just get in your face at a party/club, the nicer people generally stick to themselves so you're less likely to experience any nice behaviour. \n\nIt's not an easy view to break especially if the experiences have been consistent with people you meet, though having an open mind and just remembering that when it comes down to it men and woman think very similarly, but you're just going to hear the loud ones.\n\nOut of my 2 long term relationships I've managed to date 2 pretty horrible people, Almost 2 years ago I came out of a 5 year relationship after my partner turned up the pace from being emotionally abusive to physically abusive, I felt very relieved to be out thinking I was done and I could move on, but in reality, 2 years later I'm in still left with seeing these red flags in everyone I meet which has made making friends and dating woman difficult as I essentially drop someone when I see a negative trait my ex had. \nI know it's generally frowned upon to speak about your own experiences when consoling and giving advice because you don't want to take away from the subject at hand, though I think its also important that you understand where my opinions/advice comes from as I feel I used to have a similar mindset.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi875yh/"}