{"id": "t5_2tand_t3_qgj92e_t1_hi8u7s4", "creation": 1635341678, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "just_change_it", "text": "So you didn't do anything wrong, but in this case I don't think he did anything wrong either.\n\nYou approached a stranger, complimented them, exchanged numbers, then after days of talking he asks you over to cuddle. Clearly he got the impression you were interested in him. I've never, ever had someone just approach me in a library and compliment me. If someone walks up to me and compliments me and exchanges number with me, I do assume there is a physical attraction as there would be no other reason for someone to approach me like that.\n\nIt would have been another story if he was reading a book that you loved and wanted to talk to him about it and had a lengthy discussion about the book, and then other books you both like and suggestions went back and forth - and then you exchanged numbers because you both loved talking about books and authors and wanted to have a book meetup/club together. \n\nYou didn't use a dating app, but you still weren't doing something that is likely to lead to a long term friendship. If you want platonic relationships you need something in common. Going to school doesn't count- that is temporary and it ends. You need more. \n\n* What hobbies do you have that you can share with others?\n\n* What activities that you do are going to be something that leads to conversations and other shared interests or activities? School is a necessary thing but it prepares you for the working world typically. \n\nIf you join a board game meetup and go there to play, you would meet people who want to hang out and play board games in groups and talk about stuff.\n\nYou could join an athletic meetup to walk, run, bike etc and then cool off at a cafe (November Project in boston is amazing for this.)\n\nUltimately what you do is up to you. If you approach someone and sit next to them and compliment them without anything else going on though, I suspect you will have this kind of interaction with the opposite sex. \n\nEarly 20s are also probably the worst time to try and make friends from a casual conversation prompted by nothing. At that age I was so full of hormones and energy. When the setting is a college... the general atmosphere is quite literally casual relationships.\n\nAlso it's exceedingly rare in my experience for men and women to just be friends and spend a lot of time together 1 on 1. In a group it's common and once you get to late 20s and have couples dynamics usually people are too jealous of their partner spending much time alone with someone of the opposite sex.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi8u7s4/"}