{"id": "t5_2tand_t3_qgj92e_t1_hi81bx8", "creation": 1635322000, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JGWol", "text": "I’ve written into extreme detail about my ex. She and I were a great team In the beginning but over time she became horrible to be around and “resented me” over things I had no knowledge of. She had done wrong with other relationships in the past. She had a common theme of being with men for a little over a year before she would cut and run. I helped her cheat on her husband of seven years (whom she had separated from twice before).\n\nI thought she is an amazing, kind, talented person. But at a certain point I realized there was no forgiving how dark she became towards men. She *truly* held deep seated hatred. I recall telling her several times towards the end how much it hurt me to hear her make generalized comments about my gender and things men do— which I found SEVERELY hurtful because I didn’t subscribe to her skewed perception of men.\n\nShe was also very good at creating self fulfilling prophecy’s. For example\n\nFor months I was helping her start a business and we were working really well together. I also worked for her for free. We also had a strong sexual relationship (you hope so when you’re dating) and at this point several months in we were solid together. When we were struggling to have sex and I asked what was going on, she told me I “didn’t appreciate her”. I told her I didnt understand, because I had just got done working for her for free for months. Even spending my own money on her supplies. Her response? “‘Men always think they deserve credit for being a good person”. Like what the fuck.\n\nThis was the same woman that ghosted her husband for a man she barely knew (me) and ignored him for most of the pandemic. Or watching her sigh heavily every time her dad called to check in on her. He was the sweetest man I’ve ever met, yet she found a reason to resent him. Or her step dad who loved her like his own, but she would find a reason to dislike him too. \n\nThe comments she would make about other men we knew in our friend circles, too. There was always something wrong with them even though they were perfect, kind people we never had problems with. She would twist whatever aspect of their personality to *create* a monster of her own. And it was disgusting.\n\nAnd this came out of *nowhere*. Suddenly she was reading stacks of books about feminism. she suddenly tells me she’s no longer attracted to me, and that I’m crazy for thinking we should have regular sex after six months together. That I need to stop expecting so much from her and keep my hands to myself.\n\nThe night I break up with her six months after this fact, she tells me she has no idea why she acted the way she did other than that she thinks she hates men. I asked her why, and she couldn’t tell me.\n\nIt’s terrifying. And I think OP is in the same boat. It’s understandable why women can hate men. We are physically strong. The most rich and powerful are men, and they get away with terrible shit. We start wars. We rape, we kill.\n\nBut that’s.. not all men. We write songs that touch the hearts of the misunderstood and love sick. We work hard to provide comfort for our families, to buy a retirement home for our mother. We work late nights to moonlight a new business so our kids can do better. We cry when we see our first born. We fight our own battles as men, we feel alone and hurt just as women do. \n\nWe don’t fear the same. But we feel the same.\n\nPlease understand this OP, from someone who had to deal with  so much heart break and sorrow watching the person I love turn me into her worst enemy.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi81bx8/"}