{"id": "t5_2qh1i_t3_au7xdd_t1_eh6ei3d", "creation": 1551021925, "origin": "t5_2qh1i_t3_au7xdd", "height": 1, "replied_to": "t5_2qh1i_t3_au7xdd", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "theoriginaldandan", "text": "I didn’t wake up, I didn’t pull the trigger either time. \n\nThe first time I didn’t because I realized that my dad especially wouldn’t be able to deal with losing me and his dad so close together. Life gradually improved and I do I didn’t feel the need kill myself.\n.\nThe second time wasn’t due to depression,I just thought I was going to die a lot worse death. I was hunting and it was getting dark and I have night blindness. I started out of the stand I was in when one of the steps broke and I took a hard fall. Landed on an Oak root and hurt worse than I ever had. That’s when I considered it, I live in bear, coyote , and wild boar country. I normally don’t really have to worry about any of them though, the bears are docile, coyotes avoid anything larger than them, and boars aren’t very smart, but any of them could have gotten me that day.\n\nI don’t know why but I decided to crawl, and crawled home where I was able to stand. I spent a few days in bed and then went to a doctor. Permanent nerve damage and my nerve was so inflamed it was pinching my spine. They put me on a mild painkillers and steroids to get it to heal as much as possible.\n\n\n\n\n\nAs far as actually what has changed since the first time \n\nI finished high school, started college for my dream job, found out I’m medically DQ’ed in state from doing it. lot of time and money wasted there. Tried to find something else I wanted to do, finally did but my family has actively tried to stop me every step of the way and sabotaged me from trying.\n\n\n\n\n\nSince the second time I’m still working on that dream job, trying my hardest to get in shape for it. That set me back and will probably stop me from achieving it. Made a few great friends in that time. Don’t hurt as much anymore.  ", "permalink": "/r/AskReddit/comments/au7xdd/serious_suicide_survivors_of_reddit_how_has_your/eh6ei3d/"}