{"id": "t5_2tand_t3_o3x5ei_t1_h2f2wtp", "creation": 1624188628, "origin": "t5_2tand_t3_o3x5ei", "height": 1, "replied_to": "t5_2tand_t3_o3x5ei", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LiberatedDolphin", "text": "I think one important part of the process is to gradually lose feelings of resentment. When I was in a similar situation, I found that comparing myself to my ex's new partner (or the way they were described) would make me feel terrible about myself and hateful towards them both. It's natural to feel this way initially, but eventually, holding onto these feelings just makes it impossible to move past that negative headspace even if the circumstances around you change for the better.\n\nI had to stop seeing my ex as evil for finding someone new and stop feeling like this wasn't supposed to happen. I had to realize that they found someone better suited to them, which is a *good* thing in the grand scheme of things. It says nothing about me or my value. They're happier together, and that leaves space open for me to find someone who is better suited to me. Everyone ends up happy this way, even if it takes a bit of time to realize it.\n\nRight now all your anxiety and overthinking takes *effort* and is *exhausting*, and at the very least, you don't need to waste any more effort on a person who you're no longer with. You carry it around and it burdens only you, which is such a shame because it keeps you from enjoying how far you've come since. Your aim is to simply not care, not waste any effort and be unaffected by your ex. Feel nothing, *not even negativity*. And in time, ideally, you may even feel happy for them in a detached way. But the key is to realize that both you and your ex can be happier now in an authentic way (without anyone feeling incompatible), and that is a good thing.", "permalink": "/r/DecidingToBeBetter/comments/o3x5ei/i_want_to_learn_how_to_love_myself_and_being_alone/h2f2wtp/"}