{"id": "t5_2tand_t3_nirfzs_t1_gz4dm8i", "creation": 1621736833, "origin": "t5_2tand_t3_nirfzs", "height": 1, "replied_to": "t5_2tand_t3_nirfzs", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pseudocultist", "text": "You just described why.  Negative motivation is a brutal cycle, at very best, you're training yourself to respond positively to punishment, even *requiring* it for normal motivation.  Who would want that?  All stick, no carrot.  Finding positive motivation is a journey in itself - you need healthy ego, a belief in your ability to succeed (self efficacy) in your task, healthy self-talk, etc.  It's not something that just happens.  \n\nPut another way:  failure is one of the best teachers in life.  Everyone fails at something.  Successful people usually fail a TON.  The whole Abe Lincoln thing.  The best ones learn to suck out the negative emotion, examine the mistake, learn from it, and move on better for the experience.  If we treat failure as a negative thing, and try to avoid it, we will inevitably grow less and experience more pain because we perceive it to be painful.  So, by instead embracing failure, embracing your own human nature, learning to dust yourself off and try again, you'll counterintuitively succeed more *and* be happier in life.  Again this is a journey.  It's very tough to be faced with actual failure and not feel bad.  But you practice it.  And it gets easier.\n\nI'm personally trying to align myself with the principles of [stoicism](https://youtu.be/R9OCA6UFE-0) for these reasons.  If we see life as less \"oh my god this thing happened to me\" and more \"what do I do now,\" our lives become so much less negative just by switching our attitude.  Quite a powerful concept.  So you're a 27 year old virgin living at home.  Those are your cards.  You have a choice, OP.  Feel bad, or change things.  You can't really simultaneously do both.  You have limited resources.  Choose one.  Live in yesterday, or live in today, making decisions for a different tomorrow.", "permalink": "/r/DecidingToBeBetter/comments/nirfzs/im_not_a_good_person_im_a_27_yo_college_grad/gz4dm8i/"}