{"id": "t5_2tand_t3_qd8sas_t1_hhme25b", "creation": 1634911631, "origin": "t5_2tand_t3_qd8sas", "height": 1, "replied_to": "t5_2tand_t3_qd8sas", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "alexfromspygirls", "text": "How do you change? You change by not being lazy. The answer is already in your question if you think about it\n\nTake over some chores in the house and show appreciation that way, cook some dinners, learn to be independent, find a job you like, volunteer, make new friends, invest more time into your hobby, spend time with family,  learn a new language….\n\nThere’s a lot you can do with your time, as you’ve read.\n\nIf you want to develop a new version of yourself, learn from what you got. Your parents who are hard workers. They have it in them, you have it in yourself somewhere, you just have to ignite that flame and thrive. \n\nTo me, it seems like could be depressed. In no way am I a doctor, but what you’re describing in this post almost seems like you’re underlying depressed. \n\nI can understand why because of what you’ve written. You feel lazy. You aren’t interested in video games or computers right now. You want to just lay and look out the window outside. \n\nPretending to be someone you’re not? \n\nI felt upset and disappointed I didn’t have the luxury of certain things my friends had or other people. My brother gave me this piece of advice and I fixed my mindset right away.\n\nHe said something along the lines of….\n\n“You shouldn’t wish you are someone else. You are not them. Their situation is not the same as yours. Work with what you have and figure out the rest.”\n\n\nYou will figure this out. Ignite that flame! You have it in you, you just have to start somewhere. The first step is believing in yourself. The next step is executing it. \n\nYou can do it!!!", "permalink": "/r/DecidingToBeBetter/comments/qd8sas/why_am_i_such_a_lazy_pos_and_how_can_i_change/hhme25b/"}