{"id": "t5_2tand_t3_qd8sas_t1_hhlk9t8", "creation": 1634893498, "origin": "t5_2tand_t3_qd8sas", "height": 1, "replied_to": "t5_2tand_t3_qd8sas", "down_vote": 0, "up_vote": 143, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pknuts", "text": "Hey, I’m currently going through the same thing (and also 25). I live with my partner but have worked from home for the past two years.\n\nI could literally feel myself zoning out and losing attachment/responsibility with my job over the past 6-12 months. I’d wake up sometimes and could feel the grip of ‘you’re not going do anything today’ and although I felt the pressure in my chest/somehow (deep down) understood I was literally fucking this career opportunity up, I flipped some sort of switch and could sit there playing a game or zoning out forever. It was an endless cycle of feeling too low to work/having constant anxiety attacks about doing badly at work. \n\nI never told anyone because it just sounded like laziness, which is still hard to fathom that it isn’t. Like you, I didn’t (and still don’t really) know how to break out of it. When my partner left for work and I was alone, I would sink into such a shit routine. My parents are also super work-orientated as yours are - I don’t know when this happened to me or how to talk about it.\n\nI know how hard it is to actually do this, but getting outside helps SO much. If I start my day eating something (anything) and take my dog for a walk, I’ll usually have a much better day. Accountability has also worked wonders - I’ve never shared the full extent of my ‘laziness’ with my partner, but he knows that I’m not having a great mental health week, and therefore work week, if I haven’t been outside. It really helps that sometimes he’ll encourage me to do something active but enjoyable with him. You might not feel comfortable sharing all the details with your parents, but it’ll def help having someone to share a lunchtime walk with.\n \nYou’re not lazy, and you’re already actively trying by posting this. I’ve only recently started talking to my Doctor about it, but he’s advised this motivation rut is likely dissociation stemming from depression. There’s lots you can do to keep the brain fog away, but I’d suggest talking to your doc and seeing what feels good to you. I really hope ANY of my above ramblings fit your feels and help in some sort of way.", "permalink": "/r/DecidingToBeBetter/comments/qd8sas/why_am_i_such_a_lazy_pos_and_how_can_i_change/hhlk9t8/"}