{"id": "t5_2tand_t3_fjj8a3_t1_fknsy9m", "creation": 1584373262, "origin": "t5_2tand_t3_fjj8a3", "height": 1, "replied_to": "t5_2tand_t3_fjj8a3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BrimstoneDiogenes", "text": "I personally believe that there are many viable ways to tackle the issue of not feeling good enough. First of all, I feel like it would be really useful to challenge the idea that you will never be good enough. A person can't feel perfect all the time, but they should do their best not to hold onto the idea that they will always be terrible. \n\nYou should definitely take the time to celebrate the fact that you're committed to self-development and growth even when you're currently dealing with the weight of your depression. That's no small feat. That's actually something to be proud of. \n\nIt has been a long and arduous struggle. I haven't yet healed myself (and I don't know if I will ever be completely healed) but I realised that self-loathing wasn't getting me anywhere good. There's a statement by a philosopher called Alan Watts that I'm very fond of: “The alternative to self-love is self-destruction. Because you won’t take the risk of loving yourself properly, you will be compelled instead to destroy yourself. So which would you rather have?”\n\nThe terrible irony of depression is that it takes away the very things that you need to defeat it — and it also makes reclaiming those things feel impossibly difficult. I also feel that some paths are better taken directly (without hesitation or digression). The best way to love is to love. The best way to heal is to heal. I admit that there are some things that need to be done before someone is able to love themselves correctly, but I don't think someone should dwell on theory/plans/ambitions for too long. Sometimes the only way to do a thing is to do it.", "permalink": "/r/DecidingToBeBetter/comments/fjj8a3/never_forget_that_selflove_is_critical/fknsy9m/"}