{"id": "t5_2tand_t3_p4l62d_t1_h9047ac", "creation": 1629008565, "origin": "t5_2tand_t3_p4l62d", "height": 1, "replied_to": "t5_2tand_t3_p4l62d", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "alternate_ending", "text": "Thank you so much for sharing this, you sound like a great example of the impact sobriety can have on people. So many quotes and messages I've heard & read over the years are coming to mind, particularly \"You can give up *everything* to have **one** thing, or you can give up that **one** thing to have *everything*\", and the 9th step promises:\n\n>If we are painstaking about this phase of our development, we  \n>  \n>will be amazed before we are half way through. *We are going to*  \n>  \n>*know a new freedom and a new happiness. We will not regret the*  \n>  \n>*past nor wish to shut the door on it. We will comprehend the*  \n>  \n>*word serenity and we will know peace. No matter how far down*  \n>  \n>*the scale we have gone, we will see how our experience can*  \n>  \n>*benefit others. That feeling of uselessness and self-pity will*  \n>  \n>*disappear. We will lose interest in selfish things and gain interest*  \n>  \n>*in our fellows. Self-seeking will slip away. Our whole attitude*  \n>  \n>*and outlook upon life will change. Fear of people and of*  \n>  \n>*economic insecurity will leave us. We will intuitively know how*  \n>  \n>*to handle situations which used to baffle us. We will suddenly*  \n>  \n>*realize that God is doing for us what we could not do for*  \n>  \n>*ourselves.*  \n>  \n>Are these extravagant promises? We think not. They are being  \n>  \n>fulfilled among us-sometimes quickly, sometimes slowly. They  \n>  \n>will always materialize if we work for them.\n\nI feel like your brief testimony here embodies so much of this. I'd be interested to read more. Keep it up, m'dude!", "permalink": "/r/DecidingToBeBetter/comments/p4l62d/i_robbed_a_walgreens_pharmacy_with_a_knife_and/h9047ac/"}