{"id": "t5_2tand_t3_qgus7h_t1_hia1n2m", "creation": 1635359351, "origin": "t5_2tand_t3_qgus7h", "height": 1, "replied_to": "t5_2tand_t3_qgus7h", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Tangurena", "text": "That's what I had trouble with as well. \n\nI'm sorry for all you are going through. It hits me hard because I have been through some of the same stuff. I wish I could reach out and give you a hug. This is all I can do at this time. \n\n> *RAINN (Rape, Abuse & Incest National Network) is the nation's largest anti-sexual violence organization. RAINN created and operates the National Sexual Assault Hotline (800.656.HOPE, online.rainn.org) in partnership with more than 1,000 local sexual assault service providers across the country and operates the DoD Safe Helpline for the Department of Defense.*  \n\nThey have an online chat if you want, or a toll-free number if you would rather talk:  \nhttps://hotline.rainn.org/online   \n\n> *Short-term/Long-term effects [of childhood sexual abuse]:*\n\n> *Emotional Problems: Many abused children may exhibit emotions that signal stress including anger, shame, guilt, fear, anxiety, confusion, and depression. When a child reaches adulthood, they may experience panic attacks, depression, PTSD, anxiety, and fear.*\n\n> *Self-Perception: Children who have experienced abuse may have difficulty believing that they are deserving of support and worthy of love when they are in a hurtful, betraying situation. They may see their caregivers as untrustworthy and unsafe which affects the early development of a child. This may also be carried in adulthood where adults may feel dirty, unlovable, or worthless. They may still feel alone in the world and feel that it is their fault as an adult.*  \n\n> *Interpersonal Relationships: Those who have experienced child sexual abuse may have damaged trust in caregivers and adults. The breaking of trust early in a child’s developmental stages can create difficulties in feeling secure in their relationships moving forwards in life.* \n\n> *Other Effects: When a child is sexually abused, they may experience numbing, avoidance, dissociation, denial, minimizing, and forgetting which ultimately create problems in adulthood. This can lead to drug and alcohol abuse, addictions, eating disorders, intimacy issues, and trouble maintaining interpersonal relationships as survivors grow older.* \n\nhttps://www.rainn.org/news/child-sexual-abuse \n\nI found therapy helped. I also found that I felt much safer with woman therapists than with men therapists. And that feeling of safety helped me open up more. \n\n> *as I grew up I felt it was normal to be called names & to be picked on even hit on certain occasions. I would keep it all to myself because I was just a kid what the fuck did I know about that shit?*  \n\nI was 20 before I understood why I got picked on, called names and bullied in middle school. Our family lived overseas (dad was in the oil business) until the last month or 2 of 4th grade. The bullying didn't exist where we had been living and it was a total shock to me. And my parents felt it was my own fault: somehow I provoked the incidents. The essay [Why Nerds Are Unpopular](http://www.paulgraham.com/nerds.html) helped me understand things, but it was written about 33 years too late to have helped my childhood. Like the author, I am a programmer.  \n\n> *Plus my mom probably wouldn’t have believed me*   \n\nMy parents never believed me when bad things happened. I didn't know there was a name for it (victim blaming) until I was in my 30s and met other survivors of CSA. I never told my parents about the CSA. I only told my sister in my 50s. \n\n> *He told me something similar happened to him while we were in the car with his mom who was disappointed to hear what her other son had done to people.*  \n\nIt is very common for partners of abuse to take the side of the abuser. The cognitive dissonance with recognizing that your partner is a monster is just too much for most people. \n\n> *I noticed big changes he’s now more feminine acting, I think to myself maybe he thinks I’ll be mad he’s gay or something*  \n\nLet him know that whatever he's going through, you still love and care for him (you do, right?). Could he be so hurt and wounded by adult men that he doesn't want to be a man? Could it be that when men are raped, they're seen as \"gay\" because they were penetrated, and the rapist is still seen as \"the heterosexual/man\" of that event (this messed up thinking has been mentioned in cases of prison rape - the rapist is seen as \"the straight one\" ugh). Could that be a response to that? \n\nIf you feel your therapist isn't helping, it is time for a new one. Ask them for a referral for a specialist with CSA. If your therapist doesn't know one, perhaps the folks at RAINN know of one in your area.", "permalink": "/r/DecidingToBeBetter/comments/qgus7h/im_at_the_point_where_quitting_seems_to_be_the/hia1n2m/"}