{"id": "t5_2tand_t3_kie5h4_t1_ggu5epp", "creation": 1608760295, "origin": "t5_2tand_t3_kie5h4", "height": 1, "replied_to": "t5_2tand_t3_kie5h4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Korroboro", "text": "If you think about it thoroughly, you might come to the conclusion that what you need is motivation.  \n\nThen, later, if you think about it thoroughly, you might come to the conclusion that motivation doesn’t help much. It does help at times, but it is not an on-demand thing.  \n\nAnd you have already discovered that waiting for something to happen doesn’t give the expected results.\n\nSo what, then?  \n\nFrom what I understand, what you do need is discipline.  \n\nPart of your problem, right now, is that you can’t trust yourself to do what you know needs to be done. You don’t trust yourself because you know that it is very probable that you won’t do much.  \n\nYou can raise that trust by demonstrating, day by day, that you can achieve things.  \n\nFor this, you need to start a new habit. But for the new habit to stick, you have to be careful because your brain doesn’t like sudden changes.  \n\nSo my recommendation is to be sneaky. Make small changes in your daily routine. These changes have to be small enough to don’t matter.  \n\nStart with a goal. As an example, let’s say studying.  \n\nStudy for five minutes a day. This won’t achieve much knowledge-wise, but it will achieve the first step in believing in yourself. Five minutes is nothing. And that’s the purpose: that it matters so little that you cannot not do it.  \n\nDo your best to keep your new daily habit. You will probably fail, but that’s fine. When you fail, just keep on. Don’t strive for perfection.  \n\nAfter two weeks or so, increase your daily task to ten minutes and keep at it for another two weeks.  \n\nThen fifteen minutes and so on.  \n\nThe objective of all this is to train yourself, little by little, to trust that you will act on your plan.  \n\nI hope this helps.", "permalink": "/r/DecidingToBeBetter/comments/kie5h4/i_need_to_change_my_life_but_i_have_no_idea_where/ggu5epp/"}