{"id": "t5_2tand_t3_pao0tx_t1_ha8oz2v", "creation": 1629856747, "origin": "t5_2tand_t3_pao0tx", "height": 1, "replied_to": "t5_2tand_t3_pao0tx", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "woadsky", "text": "On computer or paper, pinpoint exactly what the stressors are, the effect each has, and what you can do to make it better. List them all out and take small steps to remedy them. For instance, \"When I get home from work I'm overly hungry and grumpy and take it out on my girlfriend\". The stressor is hunger. The effect is irritability and being short with your girlfriend, who understandably doesn't like it. Remedies include keeping snacks in the car, eating a snack during the last hour of work, having an earlier dinner, etc.\n\nWhat is stressing you out?  Perhaps you need a job change?  Decompression in a park for 15 minutes before arriving home? I'll never forget how overworked and stressed I felt at one job (in a large business). I applied for and got a job in a related department with increased pay and LESS responsibility and stress. Go figure. Life can be funny that way.\n\nOne thing that really helps me at the end of the day (though you may want to do this before arriving home):  I think of three things that made me happy that day/that I loved/appreciated. Not things I think SHOULD make me happy, but really do make me smile. Big or small. My list may look something like this:  Saw a red cardinal and his female mate flitting about in a tree;  so-and-so made a joke that was really funny; I love my new hiking shoes and can't wait to try them. This puts me in a content mood before I go to sleep and helps me be more attuned throughout the day to what really makes my heart leap.  I'll leave you with a quote I recently found. I wish I knew who to attribute it to:\n\n\"The shit that makes your heart beat faster and your eyes glow when you do it or talk about it, no matter if it's hiking, yoga, gardening, painting, sex, meditation, photography, going for walks, helping others -- do that. Do it as often as you can. Because that's what life is about. Creating as many passionate, happy moments as possible. Don't let anyone stop you from doing the things you love -- not even yourself.\"", "permalink": "/r/DecidingToBeBetter/comments/pao0tx/how_can_i_handle_my_stress_better_so_that_i_dont/ha8oz2v/"}