{"id": "t5_2qh5i_t3_8hxuph_t1_dyo8mhy", "creation": 1525826227, "origin": "t5_2qh5i_t3_8hxuph", "height": 1, "replied_to": "t5_2qh5i_t3_8hxuph", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Hylanos", "text": "I've never been anywhere slimier.\n\nFirstly, no rainchecks. I know you make a lot of money on tickets and day passes, Kemah, and having no rainchecks on day passes is excusable. But if I live in Canada and bought 100 dollars of tickets for my family, and it rains, and I'm never coming back, I'm not going to listen to you tell me that the tickets never expire and to come back next week. Same thing goes for when a ride goes down. Want a refund? Unless you were one of the six people on it when it broke down, good fucking luck.\n\nSecond off, pricing. Imagine Mr Krabs. He's not a billionaire for nothing. Want to pay 7 dollars for a greasy kid to slap a greasy frozen pizza into a microwave? I sure hope you do, because the only other option is to pay 20 dollars for a plate of \"fresh\" seafood at one of his many convenient chain restaurants located on the boardwalk, or leave the boardwalk entirely and come back when your kids start to whine you've been gone too long. Speaking of which, god forbid if you're paying for more than just yourself. You and your family won't leave satisfied without spending 500 dollars. I used to beg my parents to go to the Kemah Boardwalk. I guess the choice would have been between Kemah or college. (My stupidity of squandering college is another story altogether). To cap this point off, Kemah Boardwalk gives movie theaters a run for their money when it comes to paying double or triple the price for a daily commodity.\n\nThirdly, and finally, because I want to wrap up my rant, the employee environment is awful. Management did a very poor job in regards to the treatment of employees, which lead to a terrible turnover rate, which lead to poorer treatment and overworked conditions, which eventually lead to the previously mentioned lax hiring standards, which lead to poor treatment because the employees hired were poor.\n\nThe main problem with management was their decision to go with a favorites system instead of a seniority system. Dont look as this as me getting cucked by a manager and trying to get revenge, either. I was a favorite. Im not proud. But a seniority system should have been in place. Why was I there only a month, two write ups, and already knew how to operate the only rollercoaster, and then why was Barry there three years and didnt know it? Why does Danny not get to learn another zone because he makes cringy jokes sometimes but follows every rule to the T, but Samantha is a lead after a few months?\n\nI could go on all day. Just take it from me. The Boardwalk sucks and you should not give it money", "permalink": "/r/happy/comments/8hxuph/obsessed_with_theme_parks_my_whole_life_my_dream/dyo8mhy/"}