{"id": "t5_2tand_t3_dvlf9e_t1_f7g153r", "creation": 1573691860, "origin": "t5_2tand_t3_dvlf9e", "height": 1, "replied_to": "t5_2tand_t3_dvlf9e", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "northcoastian", "text": "You have to almost literally rewire your brain. We become used to certain thought patterns in the same way we develop muscle memory. You have to catch yourself when you’re berating yourself, overthinking, focusing on the negative, or having self-harmful thoughts, and force yourself to think the OPPOSITE of what you’re so comfortable telling yourself (look up cognitive distortions, it describes all the ways that your mind can twist reality into seeming so fucked). \n\nIt’s uncomfortable because you have internalized that you don’t deserve to be happy and fulfilled. When you say to yourself things like “I am enough,” “I deserve happiness,” and “I can be better,” it’s like doing a new exercise. It’s uncomfortable, painful even, and you won’t be good at it. It takes practice (and the right medication if that’s what you need) but you CAN do it. Even if you don’t believe it yet, you will. Everything you are feeling right now is temporary, this is one of the many valleys in life but you will have your peaks even if you can’t see them now. Practice self care, practice positivity, and it will get easier and easier.\n\nAs for the guilt, let it go. You can’t support anyone else if you can’t support yourself, and that’s okay. The people who love you will understand. It’s okay to need help. And if you love your parents which I’m sure you do, use that as your motivation. Get better so that you can be the son/daughter you know you can be, for them if not for yourself. That’s how you can truly help them. \n\nThis may be a little dark but it’s the only way I was able to convince myself that I no longer wanted to die; Imagine you have just failed a suicide attempt. You wake up in the hospital, sick from the overdose, cold from the water you almost drowned in, or like me, covered from head to toe in burns, scrapes, blood, and asphalt. You’re immediately hit with overwhelming guilt and sadness as you turn your head to see your father embracing your mother as she weeps. They are feeling upset, terrified, sad, but more than anything, relieved. They come to your side as your eyes well up with tears. You can’t believe you actually almost did it. \n\nYou almost did the unthinkable, and I don’t mean killing yourself, I mean you almost chose to leave everything and everyone you have ever and will ever love behind. You almost made those closest to you suffer on this earth and deal with the trauma of losing someone as important to them as you. It starts to hurt and I don’t mean physically. You’re bawling now, your parents are bawling. Your phone is blowing up with friends, other family members, even acquaintances who just want to know if you’re alright. Your best friend bursts in the room and you fucking lose it. “How could I do this to them? I love them so much. How did I end up here in the darkest of places” you think but all you can manage to cry out is “I’m sorry” over and over and over again. But the thing is, no matter how many times you apologize or try to explain how fucked up you are, everyone says the same thing: “it’s okay.” \n\nAs more people come to see you during your physical recovery, you begin to realize how much you actually matter, because why else would these people you thought you could leave behind come and see you? The guilt is still there but it gets better, because you realize that the only way you could possibly show your love and appreciation is to make sure that you never ever end up in that place again. They say “it’s okay” because you are still on this earth and still have so many places to go, people to meet, goals to achieve, and that’s all it really takes. You can show those people you care about them too by caring about yourself again.  They will love you even more than they already do.", "permalink": "/r/DecidingToBeBetter/comments/dvlf9e/take_control_of_your_life_and_decide_to_be_better/f7g153r/"}