{"id": "t5_2tand_t3_qcebrc_t1_hhhvsog", "creation": 1634827675, "origin": "t5_2tand_t3_qcebrc", "height": 1, "replied_to": "t5_2tand_t3_qcebrc", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AMusingMystic", "text": "After your college graduation, your first job ended shortly (for whatever reasons). That can be quite shocking for people and it can derail many. But you didn’t give up on yourself. YOU ARE SOMEONE WHO DOESN’T JUST GIVE UP WHEN DISAPPOINTED. \n\nDespite battling many things, you graduated with honors and 2 publications. How many people can do that even without those challenges, let alone with them? Seriously, think about it. \nYOU ARE SOMEONE WHO WILL GIVE THEIR BEST IRRESPECTIVE OF WHATS GOING ON WITH YOU OR YOUR LIFE AND GET THE JOB DONE. A huge plus that employers would want in their employees. Many people take a sick leave because 3 hair fell off. \n\nOne of the best lawyers in the country saw your work and asked you to interview with him. Any chances he saw something outstanding for him to do it? I am sure he knew that for a person like him, candidates would line up to work with him. But he thought he wanted to give you that opportunity. When it comes to measuring your employability, would you trust your own judgement or someone like his. YOU HAVE BEEN CERTIFIED AS HIGHLY EMPLOYABLE BY SOMEONE THAT SUCCESSFUL. \n\nYou mistake about not asking for a day off is exactly what it is. A mistake of judgement. That’s how we learn. No need to make conclusions about your personality based on that. \n\nYou cleared another interview with one of the largest law firms in the world. Why would 6 managers be willing to interview you if you hadn’t done well. \n\n\nYou still have ambitions of living a great life. Which means you will work hard to make that happen. Doesn’t that sound great for your employer? TRY ASKING SOMEONE WHO HAS HIRED A NON AMBITIOUS PERSON (not my manager though, he doesn’t know what an ambitious person looks like)\n\nYou are willing to do your homework before the interview. \n\nI think any employer would want someone like you. Your judgement of yourself is clouding your vision. You don’t need to ace anything because you already are an ACE. \n\nI might have not answered specific behavioral interview questions but I see exceptional behavior traits and if any of their brains are working and you can just be honest and be yourself in these interviews, you should have it. \nThe key is not to want it a certain way. The key is to be a certain way and let the opportunities wade into your life. \nBest wishes for your interview. You already have the qualifications. Make sure to stay calm, be earnest and have a good time. They just want to know if you will be an asset to their culture, which I think you will be.", "permalink": "/r/DecidingToBeBetter/comments/qcebrc/been_poor_my_whole_life_passed_phone_screen_to/hhhvsog/"}