{"id": "t5_2tand_t3_qcebrc_t1_hhibgne", "creation": 1634834140, "origin": "t5_2tand_t3_qcebrc", "height": 1, "replied_to": "t5_2tand_t3_qcebrc", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TA_Schpock", "text": "I'm gonna say something harsh because this sounds like the start to a sad story I've seen play out many times.\n\nYou've made a terrible decision and you're probably fucked. Corporate law firms burn through naive hopefuls like tissue paper. The interviews are nice and lovely and then they bend you over when you actually start working. You'll work hard and long hours and in return they'll give you harder work and longer hours for no extra pay. Then they'll expect you at your best at all times so when you happen not to be able to read their minds and do a task to their unspoken expectations they'll treat you like trash despite everything. \n\nPeople like you come, burn out quickly, and either slog through a few more years or leave the sector. Or, you happen to be a very unusual person who can take all the shit without hating their life. That does happen too, in a small proportion of cases.\n\nAnyway, learn to value yourself and set your boundaries early or else you're going to have a terrible time, and the good money you make will be spent on stupid shit you don't have enough free time to even enjoy. This story happens to most people in law, banking, and consulting... all those high paying corporate jobs, yet people always come in thinking the money will make it all worth it, before burning out and realizing they  saved little because they spent it on luxury food items, furniture, and other nothings.\n\nYou probably have a good brain, perhaps unpolished at times but still good; don't let them convince you otherwise. And if you don't make the cut on the first place, take it as a compliment because these partners and senior lawyers are pretty much all scumbags, and try something else.", "permalink": "/r/DecidingToBeBetter/comments/qcebrc/been_poor_my_whole_life_passed_phone_screen_to/hhibgne/"}