{"id": "t5_2tand_t3_p1t5cx_t1_h8gkbai", "creation": 1628631089, "origin": "t5_2tand_t3_p1t5cx", "height": 1, "replied_to": "t5_2tand_t3_p1t5cx", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SonderDNG", "text": "Thank you for writing out such a meaningful post!\n\nRemember that you can't determine that you are lazy without even trying! Take initiative for whatever it is you want to achieve and if you don't know what it is you want in life, that is 1000% okay. I am also a university student, who is close to graduating, and I can truly tell you that I felt exactly what you described, 2 years back, which led me to fall into a dark path. What helped me find purpose and keep positive was to understand that life was not meant to be easy.\n\nLife is always a mystery and that's what makes it so much more interesting. Life is always going to throw opportunities at you, whether that be good or bad, but when they do seize it. Every opportunity is an experience so don't hesitate to take the first step. I don't know what major you're studying but try building connections with people across the world with similar interests. Also, don't stress out about your worries, make the most out of it instead. Worrying just means that you are human and that is such a beautiful gift. You have a talent as well, whether you choose to acknowledge it or not. No one in this world can be like you, so take ownership of your life. \n\nGaming and watching videos on YouTube is NOT a bad thing. Of course how much you're getting out of it, and what you're learning is important as well. Instead of telling yourself that you're being \"hopeless\" or \"useless,\" utilize your hobbies as a catalyst to break out of your misery. Your hobbies may seem stupid to someone else but who cares what they think. As long as you believe in yourself, no one can tell you otherwise. As long as you feel comfortable under your skin doing what you want, nothing else matters.  If you commit one hour a day to what you want for a year, you would become a professional at that, whether it be building a business, reading, or gaming. It doesn't matter if everyone is against you, as long as you put your efforts and continue to build your dreams into reality. No one has to leave a legacy, all that should be done is to live a life that you'd be proud of. Create memories that you'd be willing to tell to people and say that those memories are what shaped you as a person. \n\nTry watching some motivational/inspirational videos on YouTube from time to time when you feel like you need the extra push. College is not an easy experience so make use of all the resources you have, even if that means emailing your professors. \n\nI came from a fairly wealthy family so initially I was very complacent with my life. It was until when my father threatened to send me to the military I slowly started to change my mindset haha. But really, don't be like me. Try to encourage yourself often, tell yourself that you are on the right path, and rely on other people who are likeminded. But also do not be afraid to exit your comfort zone because when someone is uncomfortable it is when change is most effective.\n\nWhat you do now will directly affect your future. The future is unknown but if you put all your effort into making an organized daily lifestyle, I guarantee that even if your dream is a 1 in a million odds, you'll still achieve your dreams.\n\nLiving under a household that makes you feel that way must be difficult but know that when you show love/positivity (being understanding) to others it is considered one of the greatest gifts of the world because of how affective it is. Of course I don't fully understand your situation but know that it'll get better. All things recover from damages. \n\nCovid-19 has been a struggle for millions across the world and I can confidently relate to what you've written in this post. Home can be considered a place where you relax or a place you escape because it's suffocating. Our world will never fully recover from this pandemic but after you take your last 4 classes, it will be worth all the troubles. \n\nGoing to the university you wanted to attend is a dream come true, so when it feels all too unreal, take advantage of that emotion. Take the next step to applying to your dream job. Make it happen because it is possible, and take every loss as a blessing that you'll learn from. There is nothing wrong with losing. The most known people in the world have taken thousands of losses before reaching their goal. You can do the same! \n\nMuch love goes out to you!", "permalink": "/r/DecidingToBeBetter/comments/p1t5cx/struggling_to_find_a_meaningful_something_to_live/h8gkbai/"}