{"id": "t5_2tand_t3_nnkakj_t1_gzver1w", "creation": 1622297159, "origin": "t5_2tand_t3_nnkakj", "height": 1, "replied_to": "t5_2tand_t3_nnkakj", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "petrus4", "text": "In a way, my own story is similar.  Not in terms of money; I'm not wealthy.  I'm on welfare.\n\nI have stayed with a family who are not good for me in many respects, though.  My parents are kind, which makes it difficult because it's the sort of thing that people can say is all in my head; but it's not.\n\nI'm afraid of death.  I'm afraid of going to Hell.  In order to try as hard as I could not to do the wrong thing, I've hardly ever done anything in life.  I've hardly lived at all.  The stupid thing is, I've been on psychedelics and I've had the sorts of experiences which usually remove this sort of fear from people, but with me it's still there.  I'm just hard headed I guess.\n\nI am almost completely socially isolated.  My younger brother and mother are the only two people I have regular contact with offline, and my mother is over 75.  I am 44 now, and I have had panic attacks where I've had to honestly talk myself out of deliberately inducing a heart attack, because of the idea that I am now too old to do anything and all my life is ever going to consist of, is a repeat of what I currently do every day, over and over again, so there's no point in my being alive any more.\n\nI've recently read self-determination theory; the idea that meaning in life is based on having a sense of autonomy, competence, relatedness, (being in a group) and beneficence.  (The idea that we are contributing positively to a collective society)\n\nI made the mistake of trying to use World of Warcraft as a means of getting those needs met; although the irony is that there was a period nearly 15 years ago now, where it actually worked.  I felt happier than I've ever been.  I was also living in my own house at the time though, and I was still young enough that I felt that I had time to actually do something in life.\n\nWoW has changed now, though.  Everyone is afflicted with FOMO and only cares about maintaining the same level of progression with the fastest speedrunners in the game, and those people are some of the most vindictive I've ever seen anywhere.  I wanted to play the game more slowly, and enjoy it for its' own sake; not for trying to impress anyone else in the same sense, and not to speedrun, and that has caused conflict.  Classic was good, but with TBC the game is being flooded by people from retail, and the atmosphere is becoming the same; where in 5 man instances no one talks to each other, and with everyone it's just rush, rush, rush as fast as possible.  The fact that the current developers very obviously also don't care about doing anything other than milking the game economically until it dies, rather than maintaining it, also really does not help.  \n\nI also know that this is making everyone else sound guilty and me innocent, but people from my server would tell you that a lot of them wanted me to leave, as well; I left every guild that tried to invite me, and also complained constantly about the speedrunning social dynamic.\n\nI don't know what to do.  I've wished for a long time that I could live in a completely different reality.  I can't stand 21st century society, for so many reasons.  I genuinely believe that the current period is the apocalypse.  I don't use a smartphone because I think they're honestly spiritually evil.\n\nI just have to live one day at a time, and hope that maybe, eventually, Covid 19 will pass, and the Chinese Communist party will stop trying to take over the rest of the planet.", "permalink": "/r/DecidingToBeBetter/comments/nnkakj/life_lessons_from_the_black_sheep_of_society/gzver1w/"}