{"id": "t5_2qh1i_t3_4e8oip_t1_d1yk8nu", "creation": 1460390205, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Bad-Science", "text": "Thank you for your reply. I'm surprised how many replies I got to my post. I'm replying to yours because I think of all the ones I got,  yours is the one that hits closest to home. \n\nI do get your point about finding something good to balance the bad, but I'm in deeper than that.  I don't want to dump on you here, but this is what has been in my head for a few years now, and why I feel like I'm in such a deep pit. Below are things I have not shared with anybody, which makes it even harder because I can't unburden myself in any way.  In fact, since this isn't a 'throw away' account I'll probably end up deleting this post in a few days so nobody I know in real life sees it. In the last 3 years:\n\nI got into an accident and got a head injury. 3 years later I'm still dealing with it (headaches, memory issues, etc)\n\nI lost my sister to cancer after a long illness\n\nI lost my dad just a few months ago and am dealing with that loss and his 'estate' stuff. \n\nMy mom in in a nursing home, slowly forgetting who she is and who I am. \n\nMy wife is battling something (some form of dementia or very early Alzheimers?) that she will more than likely never get better from. It effects us both every single day now that I feel like her caretaker, not her partner. \n\nWork is very very stressful right now, made harder because of side effects of my head injury. \n\nThe only social contact I have (had?) was based on a sport I like to take part in. But since my injury, I can't do that anymore so I'm slowly drifting away from people since all I can do is stand on the sidelines now. \n\nSo I don't see any light at the end of the tunnel.  I'm happy for maybe 1 minute each morning when I wake up, then I remember my life and the weight descends. \n\nSo a few good days are not going to pull me out of this. \n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yk8nu/"}