{"id": "t5_2qh1i_t3_4e8oip_t1_d1y779y", "creation": 1460357759, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Bacon_is_power", "text": "\"OH MY GOD! Weenie and piglet almost got hit by the truck! I need to save them!\"\n\nSeriously, I haven't watch much about weenie the pooh or read much, but that's the first and only hallucination I had after overdosing my dad's high blood pressure pills at 16.\n\nComparing to others, I feel like I attempted for the most ridiculous reason, which was I'm so insecure about my parents' feelings to me, or I was so NEEDY. They were decent parents, just busy with work constantly. (both programmers...) I've only been to a park and a zoo with them during my childhood, and every summer in elementary school, I got sent to my babu's place, and they rarely called since they were busy with work.\n\n They provide me with everything except for emotional communications. They are not incapable of showing affection, because during family get-togethers, they always play and care for my cousins, and would even gift them novelties that I never had. (Well... mostly just small stuff like Japanese candies/chocolates they bought as souvenirs when they were on business trips, and I was spoiled so much that I took my parents' money, that had been spent on xboxes, play stations, psps, overseas vacations or other things I wanted, for granted, but still... I failed to realise that and got so jealous about their affection towards my cousins.) And I was constantly trying to get their praise and approval, so stressed out that I'd had depression from junior high to half way through high school. \n\nStruggling to get out of bed to save piglet (frankly weenie died in my hallucination), I vomited uncontrollably on the ground, and my mom heard and rushed to my room, and called off work to took care of me the whole night and the following three months since the overdoes had some side effects on me...had a fever for about a week, and then pneumonia, which I guess it's caused by the fever, and then my left ear started to act up.. can't hear things at times, so went to see the doctor and ended up having a paracentesis tympani.\n\nBut I was glad besides the hospital visits for physical health problems, my parents didn't miss to recognize my mental illness, and acted in time to book a really good psychiatrist for our family, and we did counseling for about a year, talking through a lot of things, solving the problems in our family. \n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y779y/"}