{"id": "t5_2qh1i_t3_4e8oip_t1_d1y72ei", "creation": 1460357312, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "-Throatcoat-", "text": "You know I am actually going to add onto your story because I have had some recent similar events.  About three years ago, my friend passed away when he was working construction on the freeway and someone hit him and went home to sober up before turning himself in.  The family as well as all of our friends were devastated.  The mother was the most devastated and kind of secluded herself for a while seeked help and was put on all sorts of medication to help get numb.  \n\nFast forward about two more years and the family is crumbling apart. They were Getting a divorce. Now through the heat of all of this the brother decides to commit suicide. Another tough time for mom, and the pills just couldn't keep up with the depression. We all knew there wasn't much we could do. When you visited, You would find her curled up on the younger brothers bed, with a cloud of depression looming over her. \n\n A short little while goes by and she drops her daughter off at school and visits the place that the younger brother committed suicide.  The father caught wind of it, and high tails it to the location and stops her with a gun in her mouth  He talked some brief sense into her that her daughter would be devastated and that the daughter really needs her as well. After some words and what presumed to be an agreement they parted ways. He took the gun and called the cops for suicide watch because he knows first hand the depression she was going through.  The cops were too late, as she was driving back home, she found a tree at the school near her house and shot herself with a different gun.  Three deaths in one family over the course of three years.  \n\nYou see, the mom had support. We were sure to be there and made sure that she was well loved. But you can't break a mothers bond, and when 2/3 of your children pass away. It was just far too much to bare for her.  Shit we even called her mom to help relieve some of that pain as much as we could. She had many children in my eyes.  But depression was what got the best part of her.  Sorry if I made any spelling mistakes, this is still fairly recent.  Also there a lot of plot holes I'm missing.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y72ei/"}