{"id": "t5_2qh1i_t3_4e8oip_t1_d1y5b2c", "creation": 1460352294, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 125, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "musicartandcpus", "text": "\"What the fuck??\"\n\nI put a revolver to my head and pulled the trigger but the round never went off. And yes I made sure it all worked before I tried. I proceeded to try two more times, none of the rounds ever went off. I still am near broke, still have debt that cant get paid, have no job currently, and almost no food left. I'll never understand why the rounds never went off, but I'm glad they didn't despite the fact right now my life hasn't gotten any easier. The gun is gone now, and so are the rounds.\n\n\n\n**Update**: 3 months later, and though chances are most wont go back and see my post in the chaos, I figured I should give an update for those who get curious and check back. Thanks for your words of wisdom to those who responded with such, you were a great help and thanks as well for the kind words of support. I am thankfully back working and slowly and surely recovering from my situation. All hope was not lost despite how dark an hour it was. Oddly enough I recieved that job offer a week after I posted the comment. Onwards and upwards, I wont stop or settle, I hit rock bottom and now it is time make my climb up. Alright world, lets see what you got, I am up for it! \n\nWord of wisdom for you lurkers that just so happen to pass by and read this: Don't lose hope no matter how bleak or alone you feel at the time. It could take days. It could take months. Shit, it could even take years before you see the light again, but just don't stop just because you are in a period of suffering or depression. \nAnd for those who say oh thats just bs, I have this problem or this problem and I have never been able to escape it, I feel for you and understand your pain. I am open to admit I have dyslexia and bipolar disorder. I know what its like cuz I live it myself daily. It just means we have to fight harder then most, and keep pushing regardless; everyday you complete is a victory. \n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y5b2c/"}