{"id": "t5_2qh1i_t3_4e8oip_t1_d1yasoo", "creation": 1460371569, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "sonnymojo", "text": "Woke up in a hospital with my parents next to me. They didn't say a word but I felt so ashamed and realised how selfish I was when I saw the torment in my mom's eyes. When you have your heart ripped out by your ex its it's hard to think of the people you'll hurt when you kill yourself.\n\nI had a fight with my parents and ran away all while going through a tough breakup with my ex who had already posted pics of her and her new man. My friend was out of town and on vacation so he let me stay in his empty house. I'm not a smart man. First I tried using a steak knife to saw through my wrist which was a very slow blood flow so that was fail number one. I then rummaged through their cabinets eating all and any pills I could find. I was watching the movie pitch black as my mind started to fade to black. In my last moments I remember having a neverending itch on my balls and I just couldnt stop scratching. I guess my friends girlfriend decided to go grab some stuff and found a dude with pills around him passed out on the floor with my pants down. Not sure how she got me conscious but I have little memory flashes of hallucinating at her house. Her dog licking my face woke me for a few moments when I look down and see spiders and centipedes crawling all over me, it was beautiful. What really sucked was the dream (I hope is was a dream) of being in hell. It was so vivid and scary I regretted everything instantly. My parents said on the way to the hospital I was telling my dad to stop running over people on the freeway and when we were at the hospital I was speaking perfect spanish and telling the nurse I was trying to gift him that buttless robe thing they put on me. When I came to, the guilt set in though. I had covered my wrist wound with my favorite checkered sweat band after I had failed the night before and it was still on there. Im sure they knew and figured they wouldn't make it any worse by pretending they didn't know what was under it, but I have a scar to this day.\n\nSo I guess they pumped my stomach and yet again I had failed. I got a lot of weird attention from people afterwards. My friends seemed distant and quiet. One girl told me I suck at life so much I cant even kill myself. Honesty it never went away I still don't want to live in this shitty world but it's the people who love me who I don't want to let down. I drink til I black out most nights but I keep myself alive enough so my mommy doesn't worry about me. I have a decent job but I live paycheck to paycheck trying to enjoy what little I can until hopefully one day I wake up loving the world again. But I will definitely never hurt my family by going through with suicide again. What really helped was my parents acting like it never happened. I dont know if thats what the doctors recommended or something. I flat out refused any pills over the years when they diagnosed me with depression and being bipolar. I figured I'd just stop being a little bitch and get through it on my own from then on. They helped me move to a new city, new highschool, new problems but there will always be problems cause life is a battle and quite the roller coaster ride. Virtual reality finally getting decent and possibly starting a colony on mars has sparked an ember of hope deep down inside me. Ive also adopted a puppy which helps a lot for anyone going through anything similar. Thanks for whoever gets to read this I know I got here late but been wanting to tell my story for some time. If not for yourself, do it for the ones who love you.\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yasoo/"}