{"id": "t5_2qh1i_t3_4e8oip_t1_d1y3swc", "creation": 1460348726, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1076, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "arcadebee", "text": "I really hope so. I'd like it if something good came of all that because it really was a horrible time. At the time I didn't think there was \"another side\", I just thought it was my whole life. Looking back, it was actually a very tiny portion of my life, even though it was significant in shaping me. I don't think I would be such a positive person now if I hadn't gone through it. I don't think I would try so hard to be kind to strangers.\n\n&nbsp;\n\nI've definitely found that the happiest and most relaxed people I meet tend to be people who suffered depression or anxiety in the past. Once you get out of it the positivity stays with you. Maybe it comes from having to work so hard for it at one point, I don't know. I used to spend every day listing things I would miss if I died. \n\n&nbsp;\n\nAt first I would list things like \"my family and friends\" but those things made me feel very guilty because I still wanted to die. Eventually I started listing really silly things like \"lemonade, comfy socks, hedgehogs, this exact cupcake, that stranger who just helped me with my shopping, cherry tomatoes\" I made sure to add to the list every single day, kind of like writing a diary. Some days it was really difficult to think of anything to start with, but eventually it got easier and then I realised I had too many to list each day. I just had so much love for everything, and I found out that's what makes me happy. I don't care how small or insignificant some of the things are because they kept me alive, and now they make me happy. \n\n&nbsp;\n\nI really encourage anyone to start a list like that. It forces you to think of something positive at least once a day. And then if your whole day is painful, and sad, and apathetic, at least you have one moment of brightness where you get to love something. I don't write my list anymore, because I don't think I need to. It was a good kickstart to get me thinking about it daily though. This is going to sound incredibly cheesy and stupid, but one of the last things I listed was \"myself\". I never thought I'd get to a place where I like my own company, but here I am and I think it's my proudest achievement. If I could do it then anyone can, and I really want everyone to know that. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y3swc/"}