{"id": "t5_2qh1i_t3_4e8oip_t1_d1y7tcu", "creation": 1460359865, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "after months (years?) of lurking, I finally created an account just to answer this one (english is not my native language and now I'm also pretty tired so I won't consider myself responsible for grammatical atrocities...)\n\n26yo here.\nwell...a little bit more than a year ago, I think it was mid-february (2015), I tried to hang myself at home. It was a tough time both for me and for my family, and I had decided to come back home some months before to try and fix things, or so I thought.\nneedless to say, I didn't manage to fix shit, and everything went all downward spiral on me and my parents (and brother and sister).\nso, one night of mid-february, I had enough. enough of bad luck, enough of things always going downhill, enough of myself and my stupid inability to solve problems.\nyears before, with my father, we had built a home gym in a empty room, it was fun and a great father-son experience. the gym had basically everything: a bench, squat stands, a barbell, three pairs of dumbbells, a jumping rope, a friggin' homemade punching bag! and of course, there was a pullup-bar mounted on the ceiling.\nnow you can see where the story's going. I sat on the bench, took the jumping rope, set up a slipknot on the pullup-bar, stepped on the bench, arranged the noose around my neck, and put my feet off the bench.\none second, two second, X seconds. I don't remember exactly.\nit started to feel tight and I couldn't breath.\ninstinctively, my hands gripped the rope. there's one particular feeling I will always remember:\nthe fabric of the rope.\nit was so strong, so real, so intricate, so beautiful. there was a lot of work behind it, for sure. so much marvellous complex simplicity and simple complexity at the same time. I was able to feel it, finally I was able to feel *something*, after months and months of nothing.\nand it hit me.\nI don't know exactly what hit me, but it did.\nmaybe the realization that it was a shame to waste a life in such a useless and pointless way, the realization that if the fabric of the rope was so beautiful, what could be said about a human being, the very expression of nature's (and maybe the entire universe's) fathomless power?\nI kicked my feet back and forth, and I was able to step on the bench again. I untied the knot, took a looooong breath, the longest of my whole life. I stepped off the bench again and sat on a chair.\nand...I started laughing. like goddamn fucking crazy. like the Joker himself. I couldn't help it. at all. I think I laughed for 10 minutes straight, or maybe more. then I fell asleep on the chair, and the sun woke me up at dawn.\nso that's it. I never said anything to my parents, even though in the following months I told the story to pretty much everyone I know, 'cause I felt the compulsive need to share it to get it off my chest.\nI'm not sure if this qualifies as an answer to your question, since the conscious thought happened before and not after my suicide attempt.\nbut yeah...I always wanted to share it with some strangers on the internet, and maybe now it was the right time to do it, I don't know.\nnow my life is better, in the end I sort of managed to solve my family's problems, even though it pretty much drained my mind and I had to stop my academic career for a while.\nI plan to resume it in the future, next year, or maybe not.\nbut I feel fine, all things considered I managed to keep fighting pretty well after that episode, and most importantly, I'm still here.\nnever stop fighting, no matter the shit your life throws at you.\nnever yield to circumstances. NEVER surrender.\npeace to you all.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y7tcu/"}