{"id": "t5_2qh1i_t3_4e8oip_t1_d1y3uq0", "creation": 1460348835, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 67, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GremlynzGBP", "text": "Oh man... I was very suicidal and had a few near death overdoses. One I woke up and pulled my iv's out and walked off, I got pretty far and got arrested and sent to psych. That was memorable because I got down the street.\n\nOne was very surreal. I woke up in hospital and the strangest feeling come over me. I slowly came back online starting with hearing and sight, then I could move my feet and hands. I was so shocked to be alive, not in a bad way at all. Sort of dumbfounded but relieved because I had insane night terrors. You're memory of events can trick you, especially with drugs, but in the darkness I felt something pushing me, trying to drown me and I couldn't breath but I was fighting it and didn't have strength. Like a dream when you can't clench your fist. I felt myself dying in the realest way, i was in the complete darkness, just 'okay, heart, beat, breath, you can do it, beat again and breath and you'll be fine' for what felt like days. It felt like 50 years, I swear on my life. I knew I was surrounded by lots of people in my house at one point. I was awake and talking to a doctor for half an hour before I touched my head and realized I had stitches all over and I had blood all over me. They'd cleaned it off my head and chest but sort of smeared it all over, I saw myself in the mirror and it was like a horror movie. Just in the sense it was so shocking and didn't feel real and the stitches just looked like make up.\n\nIt still doesn't feel real and I don't have too many people to talk about it with, without sounding like a kook. I'll open up more about my life one day but it's too soon and it got so dark for me for a little bit.\n\nI didn't start learning to love myself until the very moment I lay dying, what happened that day and in the months following was nothing short of life changing for me. It made me a believer in some kind of love energy that most people seem oblivious to, I feel enlightened in a way. I rearranged my priorities and I've been healthy and good to people around me for the last two years.\n\nI'm really happy with myself but I have a lot of issues, you would never guess though, I'm doing really well and look great. I feel a lot more alienated from society, just in that I felt something and feel I know a secret I can't share. I want to help other people but you can't make them feel. Sometimes I feel like some sort of little godling and wonder how I've been so lucky my whole life, skirting death. I think when you grow up surrounded by tragedy, it's easier to find beauty in life, so I can't say this is due to my experience but a reflection on my life when I got sober.\n\nIve got tears in my eyes. Anyone can do it. Anyone can change their life around and you don't need to die! You will find love or you will find a way and I promise, if you want to die young you can change your attitude/behavior and start to feel younger everyday! You'll hope to die younger than you are! Life can be meaningless but it doesnt mean it isn't beautiful and you aren't a tiny piece of this energy we all share. Most of us will die screaming, no matter how nice we are on this earth, is the reality. You don't get to choose your death, I've probably been saved for a much slower/violent one, but I'll sure as fuck use newfound control over my life to choose to smile, maybe if I don't even feel like it, and try to be good while I can. This thing on earth is too short to be a shitty example.\n\nI've lost a lot of friends to this darkness and I wish they knew that the darker it got, the higher the potential. You don't see the good without the bad, when you've seen the worst you'll be able to find happiness very easily in the things and people around you if you can learn to bend your willpower and change your ways. If you try with all your heart, you will come out a well rounded person. You will be told this by people close to you, which feels so relieving. When you take care of yourself, people take care of you. When you put good energy out and trust in yourself and your decisions good things will just flow into your life. \n\nI elaborated on the question, I wanted to tell a bit of my story in case someone out there is looking for some hope. A lot of the responses were pretty negative and these people are still afraid, we are all better than that.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y3uq0/"}