{"id": "t5_2qh1i_t3_4e8oip_t1_d1y7ykv", "creation": 1460360383, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Wombatdelicatessen", "text": "\"Damn, I'm still here. Next time- it has to work next time\"\n\nLike some other people on here, waking up didn't change my mind, I thought it was just putting off the inevitable. I took a whole bunch of pills and my grandparents found me, called 000 and saved my life. Not that I appreciated it then, but I do now.  \n\nAfter that I spent 2 weeks in a psychiatric ward until I convinced everyone I was no longer a threat to myself. A few days after I got home I thought I was alone so I tried to slit my wrists, but my sister walked in on me and I was back in the psychiatric ward for another 3 weeks. I don't know why this time was different, maybe the medication was starting to work, or the intense therapy or seeing the impact it had on my family (initially I thought they were faking it because they would obviously be better off without me) but when I left hospital for the 2nd time I still wanted to die but I no longer had the will to commit suicide. \n\nI'm very lucky that I have such a supportive and strong family, who helped me through the next few years (I was 16 at the time), got me into see a really good psychiatrist and spoke to school so that the teachers gave me a little more support so I wasn't overwhelmed by the stress. I also had 4 months off school when it first happened to heal and get strong enough to go back. \n\nIt took around a year to be happy I didn't die and a couple of years to get longer stretches of happiness. I stopped therapy after 3-4 years and every couple of years I have a couple of sessions when I have a bit of a setback but they are less frequent now. \n\nI'm now in a really good place, it has been 15 years and I'm still on medication but I had a major setback when I tried to reduce the dose so if I need meds to stay healthy i figure its a small price to pay. I have travelled extensively alone and am strong enpugh now to live on the other side of the world to my family though we are still very close.\n\nSorry for the long post but if anyone is going through a difficult time, please PM me, I have been through it and am happy to be a sounding board or support if you need it.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y7ykv/"}