{"id": "t5_2qh1i_t3_4e8oip_t1_d1y15l5", "creation": 1460343510, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 15, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "throwawaymylife111", "text": "Throw away because my family knows my reddit and they think i'm doing well.  The first real thought was confusion.  Confusion in where the plan had gone wrong, and confusion is where I was now.  I jumped off the tallest bridge around, honestly there was no reason why I should still be alive.  It was the world's cruel long con against me and gravity was it's method of torture.  After the first thought, the second was anger.  Angry because the entire point was to end my family's suffering because of me, and here I was in an obviously expensive hospital room.  \n\nThe next thought was actually quite peaceful.  Yes, there were new problems, quite immediate problems to deal with, somehow the older ones had gone to the back of my mind.  Things felt calm, and for a few brief moments, I could listen to the silence and not hear it laughing at me.  \n\nTrying to kill yourself isn't fun.  It isn't a first option either, not a second, third fourth or fifth.  It's the last option.  It's like being trapped on the top floor of a building that's burning slowly beneath you.  You try to deal with i, try as long as you can.  Then it starts consuming you and clouds up everything else you are doing, and sooner or later all you can do is think about the fire, see the fire, feel the fire.  Any other plan you might have had soon disappears, and the only option in front of you is your very last option: jump.  It's not because you think you will survive the fall, it's because you accept death and understand that jumping is the easier way to go.  Either stay and suffocate, or jump and feel a few brief moments of peace.\n\nIt was the highest fucking bridge around and it wasn't high enough.  Maybe next time I'll just try and find a gun.  ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y15l5/"}