{"id": "t5_2qh1i_t3_4e8oip_t1_d1yiaaj", "creation": 1460387428, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DevilishDreamer", "text": "16 year old me had severe emotional issues and was on a ridiculous amount of bipolar, depression, and antipsychotic medications. One particular day, I was walking home with thoughts flooding my brain, normal high school drama shit, family turmoil, various other things. I don't remember much. I got home, no one was there. I overdosed on all my medications. I paced around the house for a while, then I started puking everywhere. I got scared, I called my neighbor and told her I needed help. She came, called my grandparents, called 911. I don't remember a whole lot of my grandparents, but I vaguely remember combating the EMTs. They got me strapped down, eventually. I was taken to the hospital in a helicopter, which I remember absolutely nothing of. \n\nWhen I woke up, who knows how long later, my estranged dad was the only person there. I don't remember any conversation or even hugging or anything at all, just that he was there. It meant a lot, still. My dad had a tough upbringing with several suicide attempts of his own. He never had anyone to wake up to, and he wanted to make sure I never felt that. It's a small moment I still cherish. I spent the next several weeks in a behavioral clinic with other kids of varying ages. A 13 year old girl who stole her grandma's car, a seven year old who physically attacked her mom, biting, kicking, and most sad of all, a 5 year old boy who had tried to hang himself from a ceiling fan. There were plenty of others, anorexic girls, self mutilaters (myself included), repeat visitors, \"delinquents.\" I never wanted to see another place like that. I finished my program, took my pills, tried to be happy. \n\nMy Grampa had a heart attack a few months later and needed a quadruple bypass. I was so numbed on these meds, I was unable to respond with appropriate emotions, or any emotions at that. I decided that day to stop taking my medications. I worked hard to get my head in a stable place, but I got there. Some years later, I had a psychological evaluation that determined I had been misdiagnosed several times over and under treated for the actual problem I had. So, I had spent years on all kinds of medications that I knew were fucking me up, and they turned out to be completely unnecessary.\n\nIt will be ten years since that attempt in just a few months. I've been with my husband for 7 of those years. We have two daughters together, one is three and one is a month old. My battles with depression have never gone away, but life has value to me and I won't stop trying to get better. This year, I'm hoping to find medications that actually do something helpful for me. I desperately want to be well.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yiaaj/"}