{"id": "t5_2qh1i_t3_4e8oip_t1_d1yi7tt", "creation": 1460387327, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "andsoitgoes42", "text": "Thank you for sharing. \n\nDon't give up. Please. I've thought about suicide during my down times ever since I was a teen. I was just so alone and felt empty, it was just... It just seemed right. \n\nI also, probably since my early 20s, fought and fought with antidepressants. I literally tried everything that they could offer, going as far as trying Lithium when nothing else seemed to work. \n\nIt wasn't until a few years ago that I made some dramatic changes in my diet, cutting out a lot of crap and such, and then later went on some older antidepressants (amitriptyline) that I found some answers. \n\nMy advice, from someone who is in his 40s, is just to not stop trying. Your comment about suicide being selfish, and staying alive is also selfish, rings very true. I have kids and those times where I've been really down the thought about what it could do to them has really put perspective on the situation. \n\nBut would I even if I didn't have kids? I'd like to think not. I contemplated it a lot before they were around. A *lot*, I mean a real lot. But something kept me from doing it. Had I done it then, I wouldn't have helped create two of the most amazing and frustrating people I've ever met, and they wouldn't even exist if I'd have gone through it. \n\nAnd things are far from perfect now. I have a truckload of health issues that I fight with daily, and there are bad days where it is decidedly not easy, but I get through. \n\nI don't know if you've seen anyone to get help, a doctor, a counsellor, anyone - but it sounds like you might be at a turning point. I know the drugs you're taking now aren't working, nor have the ones you've taken in the past, but I cannot stress the importance of trying. Try more. And if those don't work, try more. But counselling of some sort might really be what you need, even maybe as an adjunct to your current medication. \n\nBut again, from someone who has been through it, and still has moments of those dark thoughts, don't give up. Try *everything*, because while I don't fully agree with suicide being selfish, you owe it to yourself and the people in your life to give 100% to try and find a solution, or at least exhaust every option that's available.  Maybe it still won't help right away. Maybe it'll take a few years to find the right therapist and maybe after all that, you still won't. But if you don't give it your all, you'll never know. \n\nAnd from someone who has been on both sides, and still slips, I'm very thankful I pushed forward. Maybe some days I'm less thankful, but I find those days come less and less and are easier to manage as time goes on. \n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yi7tt/"}