{"id": "t5_2qh1i_t3_4e8oip_t1_d1y86b2", "creation": 1460361165, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ShakeBunny100489", "text": "\"What the hell is going on! Why are there spiders everywhere?\"\n\nMy first attempt was with two full bottles of Tylenol. I knew over the counter stuff was less likely to work so I took a lot. I woke up in my room like 18 hours later. I could understand people, but there was this sort of a delay in my reaction time. The worst part is I was so messed up I was hallucinating that my skin was covered in small spiders, and so was the floor. I stayed curled up in the corner of my bed for another full 24 hours until the hallucinations stopped. Fucking terrible.\n\nI remember feeling this weird mix of guilt, fear, and disappointment. How did that not work? Why did I do something so stupid? Am I going to be okay? What will actually work next time?\n\nI'm ashamed to say it (and honestly I have never told anyone), but I've tried a total of 26 times to kill myself. Most of them were in the span of just a few years when I was at my lowest. I've tried hanging, drowning, asphyxiation, rat poison, bug poison, alcohol, cutting, and more over the counter stuff than I care to admit. Every time I came to I had this sort of sense like, \"better luck next time,\" or something to that effect. It's like I wasn't even sad or scared anymore. I just wasn't anything, and that's why I kept trying.\n\nI'm transgender. It took me a very long time to accept who I am, and not feel like I should be dead because I'll never be \"normal\". Three years since my last attempt, and I'm proud to say I'm glad I'm not normal. I am a stronger, more compassionate person than I ever thought I would be back then, and I'm so elated I'm here to experience life as a happy healthy version of me. I'm in love, i have a great job, and a huge network of people who i know genuinely care about me. I'm even finally gearing up for my surgery! Just working on saving some more of the money I need and I'll be all set!\n\nBy this point I'm pretty sure I'm immortal, so I might as well so everything I can to make the best of things. Anyway, thanks for letting me share. I feel better.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y86b2/"}