{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8rgy", "creation": 1460363465, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "taintosaurus_rex", "text": "She has been to hospital many times. They sent her to a rehab for like 5 days but it didn't help. She keeps trying to OD on meds. She is far from the healthiest person on earth and after the first time she tried we went over and took all her pills. Ended up with like 20 to 30 prescriptions. She's the type of person who fixes everything with a pill and if there isn't a pill then she freaks out, aka addiction. She needs to be under constant watch but my gf and I work and have a life of our own to keep up with and her younger siblings (who live with her) won't stay home for longer that 5 mins before running off with friends. Her mother can't because she's to busy raising her grandchildren(my gf's cousins) to stay with her. And I don't know why her [gf's mother's] siblings won't help. \n\nWe have tried to force her to stay with someone but she throws fits and finds some medical reason she can't stay there (e.g. she can't stay here because out dogs trigger her anxiety). We suggested she move to Kansas to stay with her father but she won't because my gf's younger sister is still in school.\n\nI've suggested a therapist but she said she can't afford it. The divorce is a pretty messy one and both sides are acting childish, So lawyers are needed. In the past couple months since all this started there has been constant fighting, my gf's dad threatened suicide, her mom attempted suicide atleast twice and has been in the hospital just about weekly, and her brother went to the ER for alcohol poisoning after drinking like a quart of moonshine. I can see my gf at her breaking point and I do everything I can to keep her sane but I've run out of helpful advice. \n\nI want to help but my family is completely different from my gf's family. We are very thick skinned and how I would deal with a similar situation in my family would be sit them down and kind of yell at them but her family is very soft and if I yell at her it'll probably break her. My mom went through 2 divorces, raising 4 boys by herself, and then a 5 year battle with cancer. Never once did she complain or think about giving up, so the whole \"I can't take this\" mind set is all new for me and I don't know how to help.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8rgy/"}