{"id": "t5_2qh1i_t3_4e8oip_t1_d1ycbiu", "creation": 1460376314, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I guess the first thought was how I would explain it. What excuse would I make up to make it seem like an accident.\n\nOnly attempt my parents got wind of was when I slit my wrists. They got home earlier than I thought. I was really scared and in pain both emotional and physical. Of course they rushed me to the ER. Then to a psych hospital. Where I was wrongfully diagnosed with bipolar disorder and given medication for it. Which just fucked me up more.\n\nSecond attempt I went out on new years all alone and drank myself into a stupor and walked around the shitty parts of town hoping someone did my dirty work for me. I'm a coward. I eventually passed out and a group of kids found me, took my phone and called my parents. They waited with me until they arrived.\n\nMost attempts after that involved pill overdoses but I always got scared and threw them up.\n\nThe last attempt involved an allergic reaction. I knew I was allergic to THC and smart shops had just started popping up. I convinced this douchebag friend of my so that I was imune to weed. He went out of his way to prove me wrong, mixed a whole bunch of shit in a pipe and gave it to me. It was probably the most terrifying attempt to date. I started hallucinating and couldn't stand. My stomach was churning and I felt like I was losing my sight. I don't remember the hospital ride. I hardly remember anything other than blacking out a lot and being conscious for a few minutes at a time. My body hurt a lot, I had tubes and IVs all over me. My parents were there staring at me like I was a criminal.\n\nApparently I had a series of cardiac arrests. It was the closest I got. All I could think of was on what was I going to pin this on this time.\n\nI'm too much of a coward to do anything anymore. The depression and anxiety medication I got also helps.\n\nI still think I don't belong. Hopefully lung cancer is in my future and does what I'm too chicken to do.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ycbiu/"}