{"id": "t5_2qh1i_t3_4e8oip_t1_d1y6hkx", "creation": 1460355523, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 16, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MajoranaF", "text": "\"This is gonna be a bitch to clean up.\"\n\nI will share my experiences as candidly as possible.\n\nI've only tried to go in a private way, if that makes sense. No gory mess, no hanging, no splat. I know if I survived that, that overwhelming felling would be unbearable. \n\nThe first thing that always comes to my mind is the overwhelming feeling of shame, humiliation, and failure. I had one job and I fucked up. I wake up and this feeling washes over me and I lay there shaking, crying, and ripping away at my skin. After shaking comes the vomiting. Anything and everything comes up. I beg myself to keep it in. I am convinced that if it stays in, perhaps even for a few moments longer that I will die. I beg and plea, covering my mouth and forcing myself to keep swallowing. Just swallow, breathe, swallow, breathe.... I hold my breath. 30 seconds go by and I begin to feel pain, 60 seconds and my face is turning red, 2 minutes the pain is becoming unbearable. I am determined to keep it in. 3 minutes, 4 minues I break. I gasp for air and continue swallowing. At some point the act of swallowing becomes too laborious, too painful to continue that everything comes gushing out. In that moment I wish I had more resolve, to continue swallowing, persisting through the tearing of my throat and the blood trickling into my stomach. I wish enough of the pills and alcohol were absorbed into my body to finish the job. I have struggled enough to get here, I want it all to end. I lay soaked in a pool of my own blood, bile, and tears. I think if I can lick up even one pill I will die. Eventually more gushes out of me. I am defeated. I have failed. A second wave of shame washes o er me as I lay weeping, begging every god that I've never believed in to have mercy and end my suffering. Every minute crawls by, eventually turning into an unknown number of hours before I am even capable of moving. I wake up again. Every joyous memory floods through my mind. I smile. I am thankful I have failed. I think of times I've spend at work or with friends, times that I've laughed and smiled. I think of times that have been rough and I realize that there is some way to get through it, there is something that is perhaps better at the end of the road. Maybe it won't be better, maybe if will just be over and that will suffice. A few months, perhaps years later I am at the beginning again. It's maybe that I don't want to die, it's that dying would solve everything. I wouldn't have to deal with anything, I wouldn't have to go through this again.\n\nFor those that might be wondering. I have attempted 17 times. I have been taking medications for the past 19 months, seeing a psychologist and phychiatrist monthly. I might go through electro-convulsive therapy in the future. I have not attempted since seeking help. \n\nTo anyone else who is suffering, all I can say is that things will get better. Not today, not tomorrow, maybe not for a few years. They won't get better instantly. It is a slow progress towards 'better', whatever that is for you. There will inevitably be slip ups and falls along the journey, but you will get there. When you are in a suicidal and major depressive state remember that whatever circumstances you are going through can be resolved or taken care of in one form or another. You are not weak. Seeking help is not weakness. It is simply seeking help. It is acknowledging you need help beyond what you can provide yourself with. If you choose to take medication, it will take a very long time. Not only do you have to find a medication that works well for you, with minimal to zero side effects, you have to get the right dosage. You might have to try upwards of 10 medications, and perhaps even combinations. It takes time, you have to slowly build up the dosage. Believe in yourself. Believe that some day you can get to a place that is 'better', whatever that means for you.\n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y6hkx/"}