{"id": "t5_2qh1i_t3_4e8oip_t1_d1y5hei", "creation": 1460352744, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 35, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "The_Real_dubbedbass", "text": "I'm glad you didn't succeed. And I'm glad your folks caught you. Especially because I'm almost certain you would more likely have been paralyzed than killed. I knew a girl in my elementary school who fell out of a window that was in kind of a loft/attic part of her house so basically it was the third floor of the house, because it had two full floors plus this kind of loft thing and she leaned against the window and the glass popped out. She lived but boy did that fuck her up good. Nothing permanent IIRC but she broke like three vertebrae, cracked a couple of ribs, broke her pelvis and a leg and fractured her skull. When she finally came back to school it was like seeing someone return from the dead.  \n\nThen later, when I was in college a friend living in a co-op house was telling me about a guy who lived there who sold acid from a binaka bottle. So with a few maybe three or four doses left he decides to pop the bottle in his mouth and crush the plastic so he can basically get all the acid off the sides of the bottle in his mouth. So he ends up with something probably close to like 6 hits of acid (not that a hit has a standard measurement) but generally speaking he did a dose about 6 times what most users would consider average. Somewhere in time later that evening he goes on the roof. He brings a guitar. There's a noise complaint from neighbors. Cops show up and tell him to come down. He yells something about them not catching him if he flies away. Then he jumps. Building is two stories high an a frame ceiling with an attic. So basically like two and s half storeys up. He leaps. Briken tailbone and a dislocated kneecap. Not as severe as the girl I knew but still definietly painful.  \n\nI also new a guy who was at a party when the cops show up to bust kids for underage drinking. He had a warrant for failure to appear on a POM so he freaked and jumped off a third storey balcony. Sprained his ankle but otherwise fine (and got away).  \n\nSo I've known at least three people who either jumped or fell from at least two and a half storeys up. Varying degrees of injure to all of them but none of them died. Not saying it's not possible. Hell dudes have died from falling over and hitting their head right at ground level. But as a probability I think a two storey fall is probably not a good suicide attempt in that it's probably way more likely to leave you with pain and not solve the underlying depression at all. So I'm glad they caught you. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y5hei/"}