{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8ycd", "creation": 1460364240, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Monstromart", "text": "I woke up in the hospital feeling something like a hangover. It was basically because my body was overtired since I had fought like an animal when they were forcing the coals down my throat. For those that don't know what that is it is standard procedure to put coals into the patients system if he is admitted to the ICU because of attemted suicide through pain medication, so he will vomit up anything inside his stomach. Apparently the coals also work like a sponge while they are inside you, sucking up whatever it is you ingested. But to get them inside you they have to force a tube down your neck and into your stomach. I don't remember much of what happened in while this was happening. But I had vague memories of me screaming my lungs out like I had experienced a nightmare. I also had rashes all over my body that formed because I over exerted myself while wrestling with the doctors. But the first thing that came to my mind when I regained full consciousness was shame. I was deeply ashamed of myself for having done something so stupid. The way my family looked at me was something I wont forget. I was 18 at the time and had never really dealt with my depression or told anyone about it so it came as a huge surprise to them. I felt alienated from them because of my actions. \n\nI had to see a psychiatrist after the incident (understandably). That really helped me get a better perspective on how I had hurt my family and that what I had done was a deeply selfish act. I am not trying to shame people that try suicide or tell anyone that he is a bad person for thinking about it. But if you go through with what you are thinking about you are saying goodbye to everyone that loves you permanently. You are taking a fully self centered decision to end your life and to me it is probably the most selfish thing you can do. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8ycd/"}