{"id": "t5_2qh1i_t3_4e8oip_t1_d1yb1hl", "creation": 1460372426, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "cerebralbleach", "text": "I thought long and hard about whether I wanted to answer this, but I have massive scars on my wrists that tell (a) the story itself, or in some cases simply (b) the one that people are going to infer and predicate judgments on. I'm not ashamed of going to battle and having come out scathed anymore, though, so here's hoping this brings something of value to someone else caught in the trenches.\n\nI sliced my wrist in two lines down to the last dermal layer; I drank myself numb and capped the sensation with painkillers. I went punch-drunk on oxygen loss as I bled out and stumbled back to bed, hysterically crying out what I figured would be my last few hours to reflect on the desperate and scared loser I'd degenerated into over the last few years.\n\nI woke up about 12 hours later, still swimming in blood and dizzy. As many chances as I've had to say and think the same words, they've still never rode in on the same kind of panic that they did that afternoon.\n\n*Oh, no.*\n\nI had no idea what to do. I didn't expect this. I panicked as I considered the next step; I was too weak, too exhausted, and just too scared to try and finish the job. I was *terrified* to go out into the world, though, because my injuries were impossible to hide; I'd either bleed through my clothes or have to wear an incredibly obvious and makeshift splint. I tried to just shake it off and press on as I had in recent days; I wasn't going outside much anyway. I could lay low for a while and put off deciding anything, I told myself.\n\nI showered, guarding my gaping-open wrist from the water. I sent an email politely excusing myself from work that day due to a personal emergency. I tried to spend the day hiding at home and processing out all the frightened and confused feelings. It didn't work out. It culminated in the police coming to check on me when my absence drew concern and me getting taken off to the hospital.\n\nThat wasn't the last time I'd ever sink that low, but it is still the last time I'd ever attempt to end my life. This life is at times very dark, and *very* scary, but if you're reading this and you feel that same sense of despair and panic, for God's sake, don't do it. If nothing else carries you through the next few days, just believe, because it's true, that you will end your life suffering harder than you ever have if that's how you choose to go. If you fail, then that's what you'll get to carry around for ages after. There may be no immediate fix to the things that bind you, but it will cost you so much less to have the courage to live through these next few days than it will to abandon the fight. Even if you have to remind yourself of that every few days, you're doing a wonderful thing for yourself and everyone who loves you.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yb1hl/"}