{"id": "t5_2qh1i_t3_4e8oip_t1_d1yidw6", "creation": 1460387578, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "P33J", "text": "I was 19 and a Freshman in College. \n\nMy whole life I'd been the best. The best student, the best athlete, the best whatever... I'd never experienced a situation when I didn't rise to the top. \n\nIn college, while I was good, I wasn't the best and it ate at me. Then my girlfriend back home broke up with me. I got depressed, I started gaining weight, I was insulin dependent and quit taking my shots. I quit going to classes, hanging out with friends, I quit doing really anything other than drinking, eating and playing video games. \n\nAs the semester came to an end, I realized I was on the verge of flunking out of school. I'd been a part of a group in the University that represented the top 5% of incoming freshman at a school that was top 3 in the nation for Engineering, and I was going to flunk out.\n\nI couldn't take it, my pride, my self identity, all had been thrown away. \n\nI decided to kill myself by overdosing on Insulin. But I didn't want people to know I'd killed myself, that was too shameful to me at the time. So I poured out a 1/5th of whiskey down the drain of sink in the bathroom and put it on the floor next to my bed. I then drew up 100 units of fast-acting insulin and stuck it in my thigh. It would make it look like I'd just gotten drunk and tried to take my insulin and in my stupor used too much. As I prepared to push the plunger down, my roommate walked in. He was home early from class. \n\nI took the needle out, and figured I'd wait until he left for dinner, but instead he sat and talked with me. Told me he was worried about me, and thought I should go get some help. He knew I'd been skipping classes and was upset about my girlfriend and said I should talk to someone, that he thought I might be depressed and I could get a waiver from my semester, so I wouldn't flunk out.\n\nThen he insisted I go take a shower and go have dinner with him.\n\nI told him, I needed to take my insulin and he looked at the needle and said \"P33J, that's a lot of insulin.\" \n\nI pretended to be shocked and made some excuse about being distracted by the TV or something and I threw the old needle away and drew up the insulin I actually needed. \n\nThings slowly got better after that, I eventually graduated, got married had kids, started a good career. I've been living with depression for 15 years, and when I get stressed out or if my blood sugar gets out of whack, it gets worse, but I've resolved myself to talk to someone when that happens, rather than trying to handle it on my own.\n\nIt makes a difference. Life's precious, fragile and ultimately short, but fuck if it hasn't been worth it. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yidw6/"}