{"id": "t5_2qh1i_t3_4e8oip_t1_d1yc2gn", "creation": 1460375616, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "eldonkr", "text": "I went to Catholic school during middle school. The church has a wall full of different pamphlets. One day I saw one on suicide and picked it up because I'll read pretty much anything. Some kids saw me reading it, your my step-mom, a teacher there,  who told my dad. I got a big lecture that night. I had never even considered suicide before that. But if they all thought I was capable of it, maybe I was. Do I tried drowning myself a free times over the next month, couldn't do it. I didn't know why I was doing it. I have just always felt like there was something wrong with me. \n\nMy first year of highschool, I was depressed for a reason I no longer remember. After months of feeling empty I chased a bottle of over the counter sleeping pills with half a bottle of crown. \n\nI woke up a little more or less than three days later in my tub, covered in whiskey scented vomit. \n\nTo this day, I have no clue why I survived. Maybe there wasn't enough pills left in the bottle. To this day I still wretch when I rake pills. \n\nMy first thought was \"why the fuck hasn't my mom been home yet? \"\n\nI didn't have any missed calls or emails from anyone. \n\nAbout five years ago I was running errands or something. I was at an intersection and saw a semi coming. I took my foot of the brake to roll in front of it, and stopped myself because I was in my moms car. \n\nA couple weeks ago, I had the barrel of my 20 gauge in mouth, lips wrapped around the choke, racked a shell into the barrel. \n\nThought to myself do it, do it, come on, it'll only hurt for a second if at all. DO IT!  \n\nI took the safety off with my heel, and my next thought was that if I went through with it, when my grandma or someone came to clean the house out after I'm gone, they're going to find my fleshlights, and I didn't want to be remembered that way. So I spent the next hour throwing myself in front of cars in GTA V until the urge passed. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yc2gn/"}