{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8ti5", "creation": 1460363694, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Imjusta_pug", "text": "So when I was 14 I was constantly bullied for being heavier than kids my age, and for having an eye tic (hard blinking) that ive had as long as I can remember. I was bullied pretty much from 2nd or 3rd grade until 9th grade. I had originally seeked help from a counselor but it was your typical, \"they'll stop doing it, just ignore them\" that they give you even though we all know it doesn't work 99.99% of the time. So after multiple attempts at talking to my counselor I was done trying to get help. So one day at summer camp Iwalked into a room that had a bunch of tennis rackets and other sports equipment in it and came to the bright Idea to try and beat myself in the head to death with a tennis racket. I smacked myself a good 5-6 times until I went unconscious. I remember waking up to my mom, and a counselor in the shed. They asked me what the hell happened and i tried saying i just slipped and fell but the bloody forehead/tennis racket told a different story. I ended up going to a real counselor who really helped me and helped me boost my self confidence. A few months after seeing this counselor my parents decided it would be best for us to move out of this town for my sake. I ended up completely turning my life around and went into high school pretty confident and became friends with a lot of people there. I was a class clown so that kind of helped as well. I always look back on this and am so glad I didn't take my life that day because i'm now married, have my own apartment, work for a decent company making decent pay and am trying to have a baby. \n\nLong story short for those of you going through this still remember there are 1000's of us out there who have been in your shoes and are in your shoes. We can all get through this together, if you ever get the feeling that your life isn't worth it please seek help as I can promise you that you will get through this and you will learn to enjoy life. There are too many wonderful things to experience in our lifetime to throw it all away.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8ti5/"}