{"id": "t5_2qh1i_t3_4e8oip_t1_d1zfz9l", "creation": 1460435916, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nivlag1040", "text": "I think this needs to be a related post not a direct reply- but I'm a lurker and not sure how to post this in a different place??  SORRY GUYS- no suicide attempts here- just slow possible death from T1 diabetes... (bad joke- sorry). \n\nAnd truly, I'm sorry that it gets this bad for anyone, much less fellow T1's.  It is a shitty shitty disease, and you are not supposed to handle it all on your own.  T1's are some crazy percent more likely to suffer from depression than other adults. (or other adults with chronic diseases?)\n\n Insulin dependent diabetes does weird things to your brain- extreme high and low blood glucose levels do weird things to your brain chemistry, fighting to stay alive on a daily basis does wacky things to your head and heart.  TALK TO SOMEONE who is experienced with T1.  Or at the very least chronic diseases.  Ask for a referral from your endocrinologist.  Talk to other T1's but not on those stupid Diabetic support sites- those can make you want to beat someone because they're filled with \"natural cure posts\" or Type 2's that post in the wrong place.  (no matter what people say, T1 and T2 is NOT the same disease or the same psychological issues). \n\nPM me if you would like.  \n--------------------------------------------------\nHoly crackers.  I've been a T1 for 35 years, and I've only had to do the EAT ALL THE FOODS IN THE HOUSE run a few times; usually truly because I'm sleep deprived and take a bolus for a big meal I'm planning, then get side tracked and not eat when I had planned to, then as the shakes start I realize what I've done and panic.  OR sleep deprived, plan on a meal high in carbs, take the insulin to cover it, get sidetracked, then start to plan again and take the insulin AGAIN not realizing that I DID ALREADY take the insulin.  shit shit shit- gotta cover by eating 300 grams of carbs. shit. \n\nPoint is, after being a T1 for so long (and thank God no real huge problems) and going through severe hypoglycemic episodes enough times (avg one every 6-8 months), you get to the point where you are on a hyper sensitive alert to not mess up your insulin intake.  The recovery time after you've gone so low that you've blacked out, and come to in the ambulance / in the ER / in bed surrounded by paramedics...never a good time.  \n\nI also am weirdly lucky (?) enough to still be conscious even though my blood glucose is 26, and I'm seizing; I can hear and see and feel and even talk.  While seizing. And when you wake up at 2am from some weird ass dream and you are covered in sweat (in a cold room) and your arm is twitching, and you realize OH SHIT it is happening and I don't have the time or ability to stand up or crawl to kitchen or roll over to get the tube of icing off the nightstand and now I'm actually seizing and now my 8 year old daughter is awake and she's trying to get the icing into my mouth and my teeth are clamped shut and oh shit now I can hear that she is on the phone with my Mom and if I could just relax, just relax, just relax, it'll be over really soon and I can say, \"it's ok, i'm ok, no 911, get juice, good job, it's ok\".... well, that's enough to make you think that THIS is NOT the way to go.  Or, realize that I'm running out of luck.  What if some day I mess up, or I'm just too stressed out from work and stupid shit, and I'm sick, and SURPRISE my glucose level tanks, but this time no one is home.  \nThis time I don't wake up covered in sweat.  \nThis time the neighbors didn't hear me crash out of bed at 3 am and call the paramedics when I wouldn't answer the door.  \nThis time I couldn't remember to dial 911- so I leave messages of garbled spit sputtering on voice mail for my brother- because he's the last number I dialed so of course my limited brain tries to call him for help...but he's in a meeting and has his ringer off, so has no idea I've called 8 times in 10 minutes.  \nThis time my 3.5 year old didn't dial 911 for help. \nThis time I got hit by a car when I was out walking down the street in my pajamas and bare feet mumbling about needing someone to 'just help'.  \nThis time the gas station attendant didn't see the medic alert bracelet and didn't have a diabetic aunt, and so didn't call 911 to come help the girl in the store that just fell over three displays and can't talk.  \n\nThis time I died.  \n\n\nAnd you know what, no matter how shitty this disease is, I don't want my baby girl to ever think that if she had only been here, had only waken up sooner, had only called 911 faster- that I'd be alive.  \n\nSo please, talk to someone in your diabetic care life who can get you to someone to talk to.  Even if it's just to make stupid jokes about the fact that your entire life is littered with test strips...{they are literally all over the place}, or commiserate over the feeling when you just figured out that your pump line must be blocked because you've been high for most of the day- just didn't realize it because you were really busy at work... It's like ADD but only because you are so high that you're brain literally cannot make the synapses snap.  Or being low in the grocery store and not being able to actually put it together enough to reach into the case for a thing of juice...but then getting the juice and just standing mid isle and downing it.  Then paying for an empty bottle.  Good times, good times.  \n\nOk, so hit me up if you want to talk.  My older brother is also a T1, but that is all in my family.  Keep fighting the good fight all you peoples!  We're here....so me MUST be smarter than the average bears!!!  :)  \n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1zfz9l/"}