{"id": "t5_2qh1i_t3_4e8oip_t1_d1yc4uk", "creation": 1460375802, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "The only time I had actually almost succeeded had put me in a coma for a couple of days, and then, at some point, I had coded, so they put me on life support. I was in and out during the beginning of it, as I could feel them placing the electrodes(?) on my scalp (the monitors). I thought they were getting ready to perform some kind of brain surgery on me. *Maybe I had died and they were just getting ready to harvest organs.*\n\nThen I sank into a place where I didn't exist and nothing around me existed and there I wasn't in this nonexistence, just kind of *being* and *not being*.\n\nThe first thing I heard upon resurfacing was the clock on the wall. Just kind *tick.tick.tick.tick.*'ing it's way forward. It was very loud. Then that faded somewhat behind the sounds of footsteps. And then those footsteps faded behind the sounds of voices. And then those voices faded behind the sounds of machines. And then those machines faded behind the rest of the noises coming from the area of the hospital I was in.\n\nThere was a pain in my throat, and I was unable to move. And then I remembered the last thing I heard when I had begun to black out in the beginning.\n\n*He's pissed himself.*\n\nAnd then I knew where I was and what was going on. And this machine was breathing for me, and there was a tube coming out of my dickhole, and there was a steady, rhythmic beeping going on beside me, and my dad was there, looking tired, and this whole scene was familiar.\n\nAnd I wished I had succeeded *this* time because I ***hated*** coming to in hospitals and I ***hated*** seeing the aftermath of my pisspoor decision making, and I ***hated*** having to explain myself to people who were just going through the motions of *what did you take* and *how much did you take of it* and *why did you take it*, and I ***hated*** not having what I thought they wanted me to have in the way of answers because depression and psychosis and attempting suicide don't make sense and the reasons don't make sense and there aren't always reasons to begin with. \n\nI left two days later after spending a day in the psychiatric unit and being of sound enough mind to do what I always did best: talk my way out of anything. It's been 11 years and I haven't thought about suicide seriously since. I consider that chapter in my life closed.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yc4uk/"}