{"id": "t5_2qh1i_t3_4e8oip_t1_d1y1xq8", "creation": 1460344982, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 519, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Clockw0rk", "text": "The first time I was rather young, so when I cut myself and didn't bleed, I freaked out and decided 'the universe' wasn't going to let me kill myself. Turns out, you can totally cut yourself and not bleed for a variety of reasons; but I thought I had tried to cheat some divine plan and not bleeding out was the cosmos saying \"nice try, but not today\".\n\nThe second time was a few years later with a handful of pills. I woke up two days later. I was super groggy and dehydrated, took me a few minutes to figure out my muscles again to stand. First thought after I stood up and realized it was a completely different time of day was definitely \"Well... fuck.\" And then, of course, remembering the first time, and this time thinking that the universe was rather cruel for not letting me die, again.\n\nI've made plans twice since. A few years ago when I had been abandoned by my father and abused by his most recent girlfriend, I had decided on a method and had begun writing final goodbye letters. After sending out the first one, my grandparents called me up and 'talked me off the ledge'. I had a deep, heavy, ugly cry. I couldn't do it, knowing someone actually cared about me.\n\nLast month, I started planning again. Things have been hard. This is all very upsetting for my shrink, who hasn't been much help. She pleaded with me not to go through with it, so... I've been self medicating pretty hard on top of my anti-depressants. \n\nIt keeps the demons at bay. \n\nEdit: Well this got much, much bigger than anticipated. I had a good cry over all the incredibly positive feedback. I don't really have it in me to give meaningful replies to everyone, but thank you.\n\nMy last session with my current shrink is tomorrow, but I don't have anything else lined up yet. Mental health care isn't cheap, even in some nationalized systems, and living in the US... well, if you can't afford to be healthy, you aren't.\n\nI'm not actively planning to kill myself anymore. Like I said, I've just.. stepped up the drugs. Weed is legal in this state, but I still feel like a useless addict because it's one of the only things that can make me immune to despair for a few hours.\n\nI can't afford school anymore, and I've accepted that, once more sweeping my broken dreams into the box of things best not dwelt upon. I'm just going to find a job I can get by on, and hopefully get a cat; and maybe having something to love and love me back will help fill the void a bit.\n\nThank you all for your rare kindness.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y1xq8/"}