{"id": "t5_2qh1i_t3_4e8oip_t1_d1yk0pk", "creation": 1460389905, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Phylar", "text": "I have not attempted suicide but I do feel that I should respond with something because of own experience and the experience of those who have passed through my life:\n\nSuicide is a means to an end. People who consider or try have had their life wrought with pain, depression, or a great loss. Often all they want is for that pain to recede or, looking at it a different way, to finally feel better. Many of you who read this do not know what true depression is like, how crippling it can truly be. Many more, myself included, are largely unaware how debilitating certain conditions or disorders can be for the individual experiencing them.\n\nAll of this is just on the surface.\n\nThe pain, doubt, fear, loathing, and possible hatred of oneself or one's situation can bring about the darkest moments in a person's life. Suicide is often the way to stop all of that, to not feel like absolute shit any longer. I ask you all that if anyone even mentions suicide *take it seriously*. Do **not** try to talk them out of it, just stay with them and be there. Be a part of their life for the short time it takes for them to realize that maybe there are other ways.\n\nNow I won't lie, you cannot save everyone. If someone wants to commit suicide and is absolutely set on doing so, there is not much you can do. But nor should you walk away. It may not be your responsibility, you may not even feel right doing it, but if you can save a life please do not hesitate.\n\nIf you feel like you may be at risk or know someone who is at risk you can join the community over at /r/suicidewatch or get them help from family and professionals with their permission. People have a right to live. We should reinforce that right through our own kindness and our own compassion. Be a hero, you may never get the chance again.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yk0pk/"}