{"id": "t5_2qh1i_t3_4e8oip_t1_d1yfukp", "creation": 1460383677, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "veptavis", "text": "Tl;dr: \"A wordless, seething shame, \" as another user in this thread so accurately and eloquently described. \n\nTo keep backgrounds short, I was a high-schooler facing neglect by my parents. My main supports were my friends, who I'd kept since elementary school (a few of which are still my closest friends to this day.) These people, who had kept me around at my best and worse times when others wouldn't, became the family I didn't have at home. \n\nI had a very specific suicide plan in place. I planned to OD on my sleeping meds at school an hour before lunch (since it took an hour and a half for my normal doses to kick in) so that I would be able to spend my last bit of time with my friends (my *family*.) I'd then break away during lunch to walk a nearby path that led to a rock overlooking the Penobscot river. That was where I planned on peacefully falling asleep and dying. \n\nI'm sure anybody even marginally smarter than I was is able to see the flaws in my plan.\n\nTo keep things basic, medications don't work that way. I OD'd when I'd planned to, but having taken 16 times my average dose, it only took about 15 minutes for the effects to kick in as opposed to the hour and a half I had been expecting.. and there's not a peaceful fucking thing about overdosing. \n\nI was in the middle of English class, my last class before lunch, when I began to feel the effects of my overdose. I tried playing it off, believing I could make it the last half an hour. I thought I had been maintaining composure well enough to appear fine, but the people around me kept looking at me and asking me if I was okay. I felt light-headed, nauseous, and was weak to the point where it was hard to lift my head. That's when I became scared. \n\nI felt like absolute shit. I could hardly move, but felt extremely nauseous. I knew I'd be laying on my desk, in the middle of class, soaked in my own sick very soon. I'd OD'd to chase away the pain, not to find myself humiliated and scared in the middle of a room filled with people, the majority of which I hardly knew. I'm not sure I regretted wanting to die, but I surely regretted the details. \n\nI remember interrupting the teacher mid-lecture, slurring that I needed to go to the nurse's office before stumbling out of the room and puking in the middle of the hallway. I remember crying, knowing everyone I'd left behind in class knew I was fucked up. Everything is hazy afterwards, but I eventually found myself waiting for an ambulance on a cot in the nurse's office, with the school officer and my mother both present. \n\nI don't remember feeling disappointed or grateful for being alive - all I can remember is the overwhelming shame that I felt. \n\nMy mother stared at me for awhile without saying a word. The officer left the room for a moment, and I took the opportunity to ask her what she was thinking. Looking straight into my eyes, the one sentence she spared me was to let me know how disappointed she was in me. In that moment, I wished I could have been given a do-over. I doubt that's a memory that will ever stop hurting. I wish I could say that I had some big \"aha!\" moment in this, but unless we're talking about the realization that my mother is a huge ass, it just wasn't there. \n\nTo anybody who may be reading my post and feeling suicidal - don't be discouraged by this. There may not have been a huge life-changing epiphany for me in the experience, however, it's been five years and I'm still alive. This only proves that the big learning moments come through trying to live, not trying to die. When you're at your lowest is when you've got to work your hardest. Know that you **CAN** do it,  you **ARE** worth it, and that finding happiness **IS** possible. It's been five years for me, and honestly I still feel bad just as often as I feel good, but even so, I'm so proud of myself. I've worked hard every day, and even though I've slipped and fallen back into old habits during my journey, I still know that I'm capable of progressing towards something better than what I am now. Anyone and everyone is, but it's on the individual to take those hard and rewarding steps. If you can't do it yourself, remember to seek out professional help, or at the very least support from your loved ones. \n\nIf anybody needs a listening ear or would like some advice, please feel free to message me. You deserve to be heard and I would be just fine being the person to listen. I'm sure many people here would. Stay strong. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yfukp/"}