{"id": "t5_2qh1i_t3_4e8oip_t1_d1ypver", "creation": 1460397605, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "avapoet", "text": "> Not trying to be snarky, just being honest.\n\nMe too.\n\n> 54%\n\nThe majority of Reddit users are also white, male, under-40, heterosexual, etc. etc. Just because a slim majority of people fit a particular demographic doesn't mean that the use of the word \"we\" will always be unambiguous! Yes, you're certainly right that you *can* use \"we\" to refer to your nationality or indeed any other grouping that you consider yourself part of. But if you say it in conversation with somebody *not* of that grouping then, well, you also shouldn't be surprised when they say \"actually, I'm [a woman/black/55/asexual/French/whatever]\". ;-)\n\nWhen you said \"we\", I was of the opinion that you meant we as a civilisation, rather than we as a specific individual nation: I genuinely thought that you might not be aware that the USA is a bit of an anomaly in its naming of laws (and I reckoned that even if you did know that - good for you, by the way! - there'd be plenty of others who didn't!). Because only about half of Redditors come from your country, it provides you with an incredible platform to learn about other cultures: I've certainly enjoyed learning about the ways in which different parts of the world (even just the Anglophone world) differ from my own!\n\nAlso, and this is just me being a pedant - you might be wrong: [SnooSecret reports that only 45.3% of Reddit's visitors come from the USA](http://www.snoosecret.com/uploads/5/1/5/2/5152628/7073189_orig.jpg?387), which would make there be no majority nationality (and, moreover, mean that there were more non-Americans than Americans on Reddit).\n\nBut anyway - sorry I misunderstood you when you said \"we\".", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ypver/"}