{"id": "t5_2qh1i_t3_4e8oip_t1_d1yeepr", "creation": 1460381077, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "moondeli", "text": "I understand, it feels like some people just don't belong here, like there's just too many people on this damn earth and some were born so miserable that all they want is to die.\n\nIts hard to get over feeling like you just don't belong with the living. \n\nI've gathered the courage to admit my problems, and try to seek help through professionals twice. The first time I was 16 and she called my house number, after I specifically wrote not to, which scared me off. I felt that if she couldn't listen to such a simple instruction, she wouldn't be able to listen to my problems and help me with them. I never saw her again. \n\nTo add, she was just calling so I would send in a review of her services. \n\nThe second time was just recently, probably a full month ago now.  \n\nMy boyfriend and I got in a huge fight because I was being ridiculous. We both decided it would be best for me to seek help, and of course he was just trying to help so he came with me. \n\nThe first thing she asked me when I sat down, was what kind of income do I make. I did my best to answer her questions, naively confused, before I realized all she cared about was money. All she wanted was a paycheck. She didn't want to help me. \n\nI still need help. I'm in Canada, but I sure as fuck don't have the money for a therapist, and my job benefits are nothing. \n\nBut I fucking manage. Life isn't easy, I still don't feel like I belong. My boyfriend makes me feel okay, and my only source of depression in our relationship is just when I feel like I'm asking too much of him. My family even makes me feel like I don't belong. \n\nI just want you to know I understand where you're at, I want you to know I think you're really brave; for attempting suicide, for surviving, and for seeing a therapist. And I want you to know that you can message me anytime, and we can just chat, and hopefully I can help you feel like there's a little part of the world that doesn't need you to change into some happy go lucky fuck twat to really truly be happy inside.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yeepr/"}