{"id": "t5_2qh1i_t3_4e8oip_t1_d1z69os", "creation": 1460420381, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "A_curious_tale", "text": "Hmm, if I remember right it was: \"...I'm thinking. That means I'm alive. Goddammit, my stepmom's yelling at me to get ready for school. I'll have to try again later.\"\n\nI somehow managed to stagger into the shower and get dressed. Couldn't speak, and had a hell of a time getting down the stairs. I had previously ended up in the hospital after taking 16 Coricidin HBP cold and cough pills. (Wasn't trying to kill myself at the time, it was recreational.) Since that had *almost* killed me before, I figured that 32 of those and and 72 Tylenol would do the trick. I can't describe just how beaten I felt at that moment. I mean fuck, I couldn't even *die* right. \n\nI won't get into the explicit details, but after getting out of the hospital I spent the better part of 1 1/2 years in residential psych care. Apparently they didn't really know what to do with someone who broke down their reasoning for suicide the way I did.\n\nIt's always been a pretty simple equation in my mind. If the sum of my negative and neutral experiences has greater weight than the value of my positive experiences, it was my preference to not exist, rather than to exist. There is no meaning or purpose to life beyond that which the person experiencing it assigns to it. If the person experiencing life feels there is no value in it, then there is no reason to continue experiencing it.\n\nIt's been 15 years since then, and I still hold that opinion. My experience with life has been amusing at best, and pretty horrible at worst. I have obligations to meet and promises to keep though, so I continue to wake up in the morning. Do I have depression? Certainly. But I've been dealing with that for twenty years or so, I can deal with it a few more. Who knows, maybe I'll find something worth living for.\n\nFinally, if *you* are feeling depressed or suicidal, talk to someone. It may just help. My understanding is that for many people medication, therapy or trusted friends can help. You owe it to yourself to give it a shot. If it's an event or series of events that has made you consider ending things, try giving it some time. Cliché as it sounds, time does make the pain fade. It sucks. I know, I've spent a long time there. I've also had friends that have been there and now seem truly happy. It's possibly the most important decision you can possibly make, so at least take the time to consider it properly.\n\nSince this post has gone on for longer than I planned, thanks to those of you that read it and I hope it provided some form of insight. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1z69os/"}