{"id": "t5_2qh1i_t3_4e8oip_t1_d2pppo5", "creation": 1462203147, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "We had one in our family.  He married in.  On thanksgiving day, someone told someone else something that got a pow-wow going in the house while most of the people are out in the yard playing with the dogs.\n\nThey came to me as the computer guy to get proof.  I told them if there's any doubt, divorce him.  They convinced me on grounds that they would go to the police & he would go to jail.  \n\nSo I pulled up the files on the laptop.  No history.  He knew she'd be bringing it.  Expected it to be blank.  We pop some temp files, nothing...but it's weird that he set the temp file size slider down to 20mb or whatever it was back then.  This is before most people paid attention to such details.  I have my linux 3.5\" floppy and boot into that to go over the empty recycling bin. \n\nThere's stuff in there.  He's a dead man, sitting out on the porch.  Most of my moms family is marine/navy/army & has some sort of bargained down felony assault - this guy isn't going to make it off the porch, much less out of the yard - the neighbors 50yards away be damned.\n\nI close the laptop down, pull the battery & stick them in the bag.  I give it to her & tell her only the police's tech should turn it on - have them check the deleted bin once my disk finishes starting it.  She's crying.  \n\nSomeone decides to round up his kids upstairs, their mom is crying & from the looks on the kids faces - they must have expected something, maybe for awhile.  \n\nThe police arrived to take him into custody.  \n\nMy little cousins from my mom's sister were 10 years behind me.  The oldest was born to play world of warcraft - he learned on his dads lap.  Never played again.  Walked around like a corpse for a few years.  Quietest kid ever.  Years later, he got married, has a baby on the way now.  \n\nMy mother, stepfather & I weren't welcome for years...for not letting the family kill him that day.  Lots of mixed feelings.  I recall the adrenaline making my hands shaky & controlling my breathing so I didn't lose it myself.  I'm still not sure letting him live was the right decision - as the guy was already covering shit up & would have skated if not for my higher than average computer knowledge & his wife who's no longer there to watch him...", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d2pppo5/"}