{"id": "t5_2qh1i_t3_4e8oip_t1_d1ygulp", "creation": 1460385284, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "draculabakula", "text": "As a high school teacher, this thread is very inspiring to me. I have only had a full time schedule as a teacher for 1 semester and I had a student tell me he attempted suicide and another that apparently was going to commit suicide but my phone call home was enough to make her feel valued. \n\nI was shocked when the person told me they attempted suicide and all I could say to respond was \"that's not good.\" After he left, I immediately did my job and called his counselor and the school physiologist but I still felt like I should have handled the situation better. I try to have a great and trusting relationship with my students and this student felt comfortable enough with me to tell me he committed suicide and I was not ready to help him in that moment.\n\nAs a teacher, you can kind of chose to me as close or as far from your students as you want. Being closer makes you a more effective teacher but is extremely draining emotionally and physically so most teachers do not do it. \n\nA lot of schools are developing programs to create emotional support and understanding in high school now. For instance, freshman at the place I work go to multiple assemblies every year where older students talk about their lives (being gay, transgender, having drug addict parents, being drug addicts themselves, former gang members, sexually abused) and it really helps younger students have people to connect with and reach out to.\n\nI have suffered through anxiety and depression and I feel a duty to put myself in a position to help people going through the same thing. It sometimes is easy to write students off as being assholes, especially as I am currently a substitute that gets shit on constantly but this thread is inspiring me to take the time to reach out and find a level of understanding with students.\n\nThank you.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ygulp/"}