{"id": "t5_2qh1i_t3_4e8oip_t1_d1ye2wj", "creation": 1460380422, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pizzafordesert", "text": "When I was a sophmore in high school I overdosed between midnight and 3am. I wasn't afraid of bullies or the pressure to do well, I was just tired of the rat race and didn't feel like doing it anymore. I was completely disenchanted. \n\nI woke up, in time to catch the bus, and I kicked into autopilot. My primary thought was \"where is my fucking iPod?\"\n\nI ended up passing out in one of the hallways of my school. I don't know who found me. I vaguely remember being on a gurney in the nurse's office and the nurse 'tsk tsk'ing me. \n\nIn the ER they pumped my stomach. I remember fighting, biting the charcoal tube and a nurse holding my face still so hard she bruised my face. They ended up shoving a tube down my nose, which bled like crazy. \n\nThe next thing I remember the ambulance ride to psych. I became fully conscious then and had what I still consider to be the worst panic attack of my life. I hyperventilated for the solid hour and a half ride to the bigger hospital. The paramedic who rode in the back with me, strapped me to the gurney and berated me the whole ride. She told me I was being dramatic and obviously faking the panic attack, though I could hear my heart monitor going nuts.\n\nThe nurses in psych were more sympathetic and one of them gave me a cordless phone to call my then girlfriend.it turns out that was against a bunch of rules bc I was a minor and the nurse got in trouble. \n\n I was released into my parents care and sat through the longest, quietest, most awkward car ride home. My siblings met me at the door and the whole bizarre scene was like a living wake. Later that week my mother literally threw the medical bills in my face. \n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ye2wj/"}