{"id": "t5_2qh1i_t3_4e8oip_t1_d1y7n4n", "creation": 1460359257, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mullak33", "text": "I've only attempted suicide once, although I did and do still think about it all the time, however, it's for a different reason than most people, and it'll happen at random times. Like when I actually attempted it, I was just walking along and I started slipping into the mindset I do when I get thoughts like this. In a simple way, I just figure 'what's the point in dicking around through life for ages not doing anything remotely meaningful, just to die at the end anyway, may as well just do it now' and one time I tried, I was walking through this place called the quarry and there's a big cliff.  I sat at the top for around an hour, thinking about stuff, the just got up and jumped.\n\nEven the entire way down (which wasn't that long, but felt like ages) I was just thinking so this is what free fall is like, pretty cool. Then I was knocked Unconscious.\n\nWhen I woke up, before anything else, my first thought was, maybe now I'll get to try Taco Bell (I'm from the uk where there are a total of 4 taco bells), then I was in a lot of pain and then I realised I now have to walk to the ER.\n\nAnyway, my point in trying to make here, is that even little things in life make it worth living. Stop doing bullshit you don't want to do, and live a bit. Even if living a bit means talking to that cute guy/girl in the line ahead of you, or doing something extreme like moving somewhere entirely new! \n\nSince then I have since been to Taco Bell and thoroughly enjoyed it, although, like I said, I still do think about suicide, but I think I've got it cracked, if I don't do anything interesting for a while, I start to drift down a dark path, so I always try to do something different and spontaneous everyday. \n\nI'm not going to sit here and talk you to s better place, I'm just some random dude online, only you are responsible for your own happiness, so if you ever come close to suicide again, don't think about all the big things, just try and think of little things that make you happy, (eg, oh the McRib is back, or, I've still got a few points on my Starbucks card) don't take life all at once, because it'll be over sooner than you think. Just take it step by step day by day, always think short term where possible", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y7n4n/"}