{"id": "t5_2qh1i_t3_4e8oip_t1_d1ybt93", "creation": 1460374882, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PalpableMe", "text": "This will probably be buried, but while I have had suicidal urges for as long as I can remember, I didn't make an attempt until I was 32. That was in December. I really didn't want to fail or to make a mess, or have to go to the hospital if I were found. These were all things I considered because even in suicide, I over think things.\n\nI didn't have a good place for hanging, and since I'm quite overweight, I didn't want to risk the mess of decapitation. I don't own a gun, and that would also be messy. Poison is usually ineffective, and I knew I would probably get scared and call for help. Gas is dangerous and could harm others.\n\nI finally decided on aphxiation through helium. Most people who choose to go this way have to do a lot of research and planning to be effective. If I had had to leave my house, I knew I would lose the nerve. Because of my line of work, I was able to cobble together an apparatus that I thought would work in about an hour.\n\nI knew my husband would be devastated, but my mind convinced me that he would be better off without me. He was getting quite handsome, he has an adorable dog, and I felt like women would be throwing themselves at him if I weren't in the picture. \n\nI felt like I failed my clients, and even though I knew a lot of people and was even a little famous in my line of work, I looked through my contacts and couldn't think of anyone who I'd feel comfortable calling. I look somewhat professional and can put on an incredibly happy face, but that has only been through years of training and enormous mental effort. I had come to the point where I just couldn't pretend anymore.\n\nA sick brain can rationalize anything. Anyway, when I actually made my attempt, I choose to do it in my garage so that my husband wouldn't have to find me on our couch. I got everything set up, turned on the gas and very quickly faded into darkness.\n\nWhen I came to, for one of the first times in my life, I wasn't thinking. I was just feeling. I felt terrible; my head ached and I was drenched in sweat. I stumbled inside, threw up and just sat on the floor of the bathroom. My legs did not want to work, but I forced myself.\n\nThe my phone rang. It was one of my clients calling to make sure I'd be there in 3 hours. That put me on a mission. Somehow I decided that I could do my job and I started preparing to do so, even though I felt like shit. I took a shower, got dressed and did everything else I had to do for work.\n\nI told my husband later that night and he's helped me to get help. I was really careful to choose method that didn't leave physical scars, but my body was achy for about a week. Id never been actually treated for depression, but I had been non-compliant for several months for a thyroid condition. I really dislike going to the doctor, so I would avoid going at all costs, which was why I just stopped taking my medicine when it ran out.\n\nI actually just recently found a word that describes how I was feeling: acedia. Its basically a 4th century monastic word for 1st world problems. Part of my despair had been guilt for my own success, and the feeling that I wasn't doing enough for the world, since I knew I was capable of more. It's a hard headspace to describe, but it's nice to know there's a word for it.\n\nMy doctor got me back on my medication and prescribed me zoloft. Nothing really changed, but my husband and I started making little changes. We started walking every night, eating healthier and talking to each other. The biggest thing that happened was that I actually wanted to take care of myself. I started looking for a more meaningful job.\n\nThe biggest change for me happened when I started doing yoga and meditating. I never have been very successful at turning off my brain, but there really is something to the breathing patterns that works. I need to do this alone, to music to be effective, but I'm incredibly energized and focused by doing this. I'm not saying that yoga is right for everyone, but I really believe that connecting with my body has helped immensely. I've lost about 20 lbs so far with no real effort, but I still have a long ways to go.\n\nAnyway, this is long. But my real lesson that I learned was that it's okay to ask for help. I'm incredibly fortunate to have a lot of freedom, so I need to take advantage of that and do more. I'm making big plans again and it feels amazing. I might fail, but nothing that happens to me can be any worse than what I tried to do to myself. Yes, I failed at suicide, but it was almost like I killed that inner voice that was constantly telling me that I was worthless and didn't deserve what I had in life.\n\nI know this is long, but I hope it helps someone else. TL:DR failed suicide, got help and a new outlook on life. Edit-spelling ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ybt93/"}