{"id": "t5_2qh1i_t3_4e8oip_t1_d20k6i7", "creation": 1460507918, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "For what may arguably have been my most serious attempt: \"Why are there bees everywhere?\" \n\nI was in a psychiatric hospital and decided that my treatment wasn't going to work, and I just couldn't stand living for another minute. The hospital I was in was designed for long stays and people who were not at immediate risk of suicide (people who became acutely suicidal  while admitted were transferred to a locked SCU ward for a few days, before returning to the clinic). As a result of this, the rules about what you could have in your room weren't as strict as on a typical locked ward, so nobody had taken my dressing gown sash away from me. I went into my bathroom and rigged up a setup for ligature strangulation - which I won't describe in detail - and strangled myself. I remember losing consciousness very quickly, and the last thing I remember feeling was a sense of warmth and safety and peace that I hadn't felt in years. \n\nI don't know how much time passed (felt like forever, was probably not too long or the nurse would have come in for checks), but I just remember suddenly hearing...bees. Like, a loud intense buzzing, like there was a hive in the room. I wondered why there were bees, and then I remember clawing at myself and I must have been pulling the ligature off, because next thing I knew I was coughing my guts out on the floor. When I got a bit of sense back and realised that there were no bees, I was panicking - I had a big bruise on my neck and was terrified that if the nurse saw it they would send me off to the SCU place and that felt like a fate worse than death at the time. I also remember crying because I remembered the warm and safe feeling and wanted to go back to it and not be alive and trapped. I eventually covered my neck with my hair and took my dressing gown sash down to the nurse's station and asked them to hold onto it for me, and then asked for my prn meds because I felt anxious. Idk what they thought, but I didn't get sent to the SCU, so.\n\nEqual to that attempt was the time I tried to drown myself, but that was a lot less deliberate. It was about five months after the attempt I described above, and this time I was dissociated out of my brain, and in said dissociated state I absconded from the hospital and wandered away, apparently eventually jumping in the nearby river in some weird suicide attempt (I say weird because I would definitely plan a self-drowning a lot more carefully than jumping in a river on impulse while dissociated). I have very little memory of any of this and really only \"woke up\" from the dissociation when I hit the (cold) water, which was a shock - I guess my first thought was really \"what the fuck?\". After swallowing and gagging on some filthy river water, I tried my best to hold on to rocks and things  and swim to the bank to get out, but the current was strong and by the time I got to the river bank I was exhausted. The river bank was incredibly steep - it was like...a four foot high stone wall, kind of? the river is in a city area - and even though I tried to haul myself up onto the pavement a few times, I couldn't do it. I was clinging to this pipe thing and crying, and I remember looking up at the river bank and thinking \"I could just let go. If I let the current take me I would probably drown. I should just give up on all this and let go.\" I remember thinking about that warm/safe feeling from my previous attempt and desperately wanting to go back to that because I was so tired. I decided to try a few more times and then give up - and on the second to last try I managed to throw my leg up over the top of the bank and like...roll up onto the pavement. And when I realised that I had fucked up/chickened out from killing myself *again*, I remember just....panicking and not knowing what to do. I ended up calling my (long-term, trusted) outpatient therapist, who - bless him - drove out in the middle of the night and somehow found me based on my extremely fuzzy and incoherent description of where I was (I didn't remember how I'd gotten there), and he calmed me down and convinced me to go back to the hospital. \n\nThere were also a handful of overdoses when I was younger, because I didn't really know what I was doing, and my first thought on waking up from most of those was \"Goddamnit\", or something similar - I just basically felt pissed off and really sick. Once I attempted to give myself sleeping pills and go down to the river to drown myself (this was years before the river incident above), but I passed out on the street on my way there and ended up staggering home when I woke up several hours later. I was pissed off and fucked up about that one too, but I do remember thinking some darkly amused thoughts about how absurdly incompetent the attempt had been.\n\nWow, that comment got long. Idk if this is what you wanted OP, but thank you for making this post. I don't really talk about my suicide attempts at length with anyone - not even my therapist. I had a friend who I used to talk about this stuff with, but we kind of mutually uncoupled a while ago, and nowdays...I guess I pretend none of it ever happened, for the sake of the people who care about me. But it did happen, and these were huge horrible life events, and it feels kind of cleansing to really just...get it out of my head and tell someone. \n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d20k6i7/"}