{"id": "t5_2qh1i_t3_4e8oip_t1_d1ytbjn", "creation": 1460402050, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "deadlybydsgn", "text": "> How did your parents discipline you, and how often?\n\nEither a verbal correction or eventual spanking. It was only on the bottom, they made sure I knew what I'd done was wrong and why, and followed it up with a hug. I never felt abused or unloved.  I  never got random smacks or slaps, and it was always done in private.  How often?  I would guess that depended on how often I was doing something wrong.  On the whole, though, I and don't recall getting spanked after age 4.  Other consequences usually involved being grounded or having the related activity or item taken away for a time.\n\n> Were you put in daycare as a child? From what age, and for how long?\n\nNope. My Grandmother was around when I was too young for school.\n\n> Do you talk to your parents often?\n\nIf I had to average it out: We text a little throughout the week, call maybe every two weeks, and get together roughly once a month. That'll likely increase when my wife gives birth. Relevant friend and I both live about an hour from our parents, if that factors.\n\n> What do your parents think of your friend cutting out his own parent? If you haven't discussed it, what would they think?\n\nThey think it's sad, but they haven't talked to my friend about it as much as I have.\n\n> If your friend were talking about an abusive ex instead, would you feel differently?\n\nI view family differently than past relationships, because we choose the latter.  It's funny you should mention exes, though, because I'm very much opposed to the trend of \"let's still be friends\" or casually hanging on for bedroom benefits. If people are truly interested in moving on, I think most cases call for 100% cutting off for a period of time.  Being friends *can* eventually happen, but that doesn't mean it necessarily should.  When it does, making intentional changes over a period of time is required for that happen.\n\nNone of my immediate or secondary family members have grudges or feuds -- we all get along well.  One of my cousins had a fiancé who thought we were all faking.  She came from such a dysfunctional family that she couldn't conceive that we weren't at each other's throats at Christmas parties.  It was sad.\n\n/edit/  Added extra info - probably more than you cared for.\n\nShould I feel bad about liking my parents yet?  I can't tell whether you're just curious or suspect I'm an adult trapped under their thumb.  :p", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ytbjn/"}