{"id": "t5_2qh1i_t3_4e8oip_t1_d1yk7vu", "creation": 1460390176, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lemadhatterx3", "text": "There were two different times I had tried to commit suicide and actually came close to dying.\n\nMy boyfriend at the time was very emotionally and verbally abusive and I felt so low that I couldn't bring myself out of it. I felt that nothing I did ever mattered. At this point I had lost all my friends because of him telling me they were no good for me. The first time I had taken roughly 120 OTC pills (generic sleep aids, tylenol, advil combo) and realized \"OH FUCK HOW IS MY SISTER GOING TO BE. THIS IS WEIRD STOP IT.\" I ended up just riding out the effects and somehow managed to survive it (Guys, please don't ever do this.) And tried to live for another year until it happened again. For the next year I had thought about what it would do to my younger sister (12 at the time) and that kept me going strong until I went to college. Unfortunately, I became addicted to them and ended up using them as a means for dealing with life.\n\nThe second time, I took roughly 100 pills over the course of two days. By this time I was living at college, had a different boyfriend who was as sweet as could be, and removed physically from my family. Being in a new environment with distant conversations about how I wasn't doing everything right with my family, extremely low self esteem, and not having any friends led me to just binge on sleep aids for two days. I had gotten really upset with my boyfriend for that second night and ended up taking the rest of the bottle I had started the night previously at his dorm room. Ended up blacking out and waking up in a psych ward bed having the vaguest idea of how I got there and why it happened. I started thinking \"Where the fuck am I? Who the fuck... oh fuck I'm screwed.\" I remember being really upset that I hadn't succeeded, but also relieved because I found out mycollege roommates had been coming every day to see me and make sure I was okay (the hospital was a 20 minute car ride, hour walk. They walked every day to the hospital after classes to see how I was doing.) And I realized I had reasons to live and that I will always have people there for me.\n\nNow I'm a full time Barista and going to school, own a car, and looking at apartments with a really cool coworker. My marks are all extremely high and I've learned how to cope with life and have an amazing support system.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yk7vu/"}