{"id": "t5_2qh1i_t3_4e8oip_t1_d40njqc", "creation": 1465376638, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Elacular", "text": "I was 18 at the time. This was in 2013.\n\nI'd just come home for summer vacation from college. I'd been out as trans at the campus, and accepted by everyone there. So coming back home to my conservative catholic family...piled on top of years of untreated mental illness and the creeping fear that I'd never be a good enough adult. Something had to give.\n\nI'd told a friend that I would run away that night and be homeless. But I was to afraid to. So, I looked up every possible way to die, then decided the easiest would be hanging.\n\nLuckily, there wasn't any fucking rope. But I was fucked up enough to try anyway. What I did have was some really strong thickish string that I just tied into a noose and prayed would last long enough.\n\nNow, you say first conscious thought. And that, honestly, makes this question really hard to answer. Because I was probably slipping in and out of consciousness for a while, and I don't know how \"conscious\" one of the most memorable parts could be considered. So I suppose I'll write down the play-by-play.\n\nI remember finally working up the nerve to jump off of the chair, then clawing at the shelves I tied myself to. The next thing I remember is gasping for breath. For a little bit, that was the only sensation I had, just forcing air into my lungs. I was on the ground at this point, the rope had broke. But I couldn't feel it at all. I only realized I'd hit the ground later, and only because...well, I must have.\n\nI don't know how long the gasping lasted. But at some point, I started hallucinating. Or something. I don't know what I would call the experience. But it's incredibly sharp in my mind.I remember I was absolutely certain that there were two other people in the room with me. I didn't know who or what they were, but I didn't feel unsafe or scared. Well, not by them at least. I remember I thought I had to breathe to talk to them, and I forced myself to gasp in air so I could get out the words. I begged them to go downstairs to the kitchen, because there were scissors there, and they could save me. And one of them told me that they couldn't do that...that I had to save myself.\n\nI managed to worm my fingers between the swollen skin of my neck and the broken noose, and ripped it off of me.\n\nThe first completely rational thought I had after my attempt, after managing to pull myself onto my bed, was \"Why the fuck can't I open my eyes?\" Turned out the reason was that my face was swollen up like a balloon.\n\nAnd my last \"first\" thought, when I woke up the next morning, was \"how the fuck do I get to the hospital without my parents knowing?\"", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d40njqc/"}