{"id": "t5_2qh1i_t3_4e8oip_t1_d1ydkxv", "creation": 1460379369, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "my_little_mutation", "text": "The closest I ever came to truly doing myself in,  it was my cat who saved me.  I had just gone through a terrible week after several terrible years.. Still the darkest period of my life thus far.  I was wasted,  I was fed up with never cutting deep enough,  I was so tired...  I was finishing off what was left in my bottle and \"saying goodbyes\"  to the few people I thought would want to hear it and he just came over and sat in my lap and wouldn't let go.  I'd try to get up and he'd just dig his claws in deeper...  I like to think he knew what he was doing.  It made me realise that I was needed,  and as much as I hurt I couldn't just abandon the ones who depend on me.  I called a hotline and was taken to a crisis center instead.  \n\nThree years later and I'm so glad I made that call.  It took me all of these years to really recover..  In truth I still am.  I slip up sometimes but in the last 3 years I've only truly cut myself twice,  I have a wonderful boyfriend who constantly inspires me,  and while a lot of things are still tough I'm sucking  as much joy out of life as a 26 year old almost graduate can..  I fucked up my life and my education because of ptsd  and depression and still worry I'll never get to where I could have been before I stopped going to classes...  But I'm trying every day to get myself to something more.  \n\nI hope that everyone else in this thread can do the same.  There is so much beauty in this world..  And so much pain.  But when I think of what I wanted then..  Even the pain feels beautiful.  It means I'm still alive,  and as long as I can breathe,  I can hope.  ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ydkxv/"}