{"id": "t5_2qh1i_t3_4e8oip_t1_d1ydub2", "creation": 1460379933, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I took 34 paracetamol tablets, had a glass of orange juice, and went to bed hoping to not wake up around about 10pm, of course I didn't realize at the time how long and painful death by liver failure is, I woke up around 6am with what I can only describe as the worst pain I had ever felt in my abdomen, I stumbled to the toilet and proceed to vomit for the next hour, I woke my parents up due to the vomiting and they demanded to know what was up because I was puking not sick but bright yellow bile, I told them the truth and I was ashamed, I felt relief I guess that all my bottled feelings were out in the open, it was just after a rough breakup and my life just kept tumbling down hill, this was in November 2015 when I attempted it, I spent the next week and a half on an infusion and vomiting any food or drink straight back up after an hour, that beeping noise is one I'll never get out my head, to say the least the whole experience was trans-formative for me, I had a week on a ward to think about life and where I went from there, ontop of that for the first time in a long time I no longer felt alone, my friends and family came in to rally around me and pick me up from the dirt and bring me in from the cold, then just after christmas I met a wonderful new girlfriend and I never knew life could get this good, things have turned around, to anyone whose thinking about it, reach out to those around you, they are not your enemies they can help! as cliche as this sounds, it gets fucking better! \n\nanother piece of advice don't let others drag you down and make you feel like your life is worthless whoever they may be, my case was my ex and her new boyfriend who harassed me while I was in hospital and tried to drag me through the dirt, fuck em!", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ydub2/"}