{"id": "t5_2qh1i_t3_4e8oip_t1_d1yk1ui", "creation": 1460389948, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Architeal", "text": "I had just been told via public Facebook post that my ex, who raped me, was HIV+. It was snowing that day, and I was too early to get into work, so I thought I would treat myself to a nice, hot breakfast nearby. After ordering, my phone buzzed. I was that person eating alone in a crowded restaurant who burst out into tears out of fear, confusion, frustration. I decided to rush to work.\n\nThe bus depot is the last road I needed to cross to get there. There was a bus coming. I thought, it's snowy, I might as well \"slip\" and end this. \n\nMiraculously, the bus was able to stop quickly even on the slick pavement. The bus driver rushed out and helped me up, saying that I was lucky to be alive.\n\nBut my only thought was that I wasn't. They were lucky to not have to witness that; I could have ruined that bus driver's life, and the lives of the other passengers. Sure, it would have been a mistake in their minds. \n\nThen I thought about what would happen if it didn't kill me. I could be paralyzed, brain dead, or comatose. I could have made my life worse. \n\nI finished work that day, and went to get tested. Over a year later, and my results are still negative; I don't have HIV. I still struggle with the events that led up to the scare. I've since lost two people to suicide; a coworker's daughter who was brought into work with us several times, and my second boyfriend. The fact that I opened myself up to dating again after the first experience, only to lose my closest friend two days after he had the courage to ask me out, was devastating. But the pain I still carry with me to this very moment is keeping me here. I can't do that to anyone, strangers or family. And I'm too afraid I'll mess it up and live. It's bad either way. When you aren't sure whether to call your result a \"success\" or a \"failure,\" maybe it's not worth doing at all.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yk1ui/"}