{"id": "t5_2qh1i_t3_4e8oip_t1_d1y62gj", "creation": 1460354316, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "unanimous_anonymous", "text": "This is about a friend of mine who i helped. I suppose it's loosely relevant but it might help any of you going through this or if you need to help someone. \n\nBasically around about 10pm i got a call from my friend. She sounded upset and sad and just wanted someone to talk to. \n\nWe talked for a bit, and i don't remember exactly what sparked my comment, but it apparently helped her out immensely. She was talking about how she just seemed like a burden on people, and that she couldnt find anything going well in her life. I told her something along the lines of \"at the moment, yes. You are sad and you are latching onto people who don't want to hang out with a depressed person. It is draining. But i remember when you were happy and had goals and things you wanted to learn and do.  I don't keep hanging out with you because i like how you are now. I keep trying to help you get get back to where you were before. Happy and full of life. I want to help you become your old self. One who inspired others by being herself.\"\n\nBasically i wanted to explain to her that in order for people to like you, you need to like yourself. I remembered when she wasnt moping around and instead was helping others push themselves. I wanted the old her back, and i knew she could do it. \n\nI found out about 2 or 3 months later, after she started seeing a therapist, that when she called me she was in the bathtub with two razor blades aside her. The phone conversation was one of of a few i got from her, but that time seemed different to me. \n\nShe now works for Microsoft and while not completely happy with her job, is working on being happy. I think she has finally gotten to a stable part in her life, and it is still part of my life where I was happy that she called someone before she did anything. I guess I'll leave with this.\n\nIf you are going to try anything, call someone who cares about you. If they are close enough, they can help you. They know you and will help let you live another day. There is no need to give up. Someone put there wants you to live again.\n\nIf you think you are getting one of these calls, think back to why you care about that person.  Think back to when you said  \" hey, you're someone i want to be around\". Give that back. Be there for them.\n\nAnd finally, if you or anyone you know seems to be slipping down that abyss, ask for help. For women, you tend to have friends there for you. Hold on to those friends. For guys, talk. Say something to someone. Most men feel like they will be seen as weak for expressing anything important emotionally. My personal take. Suicide is for the weak. It is for people who couldnt find a way out and they felt they had no other options. No other way of ending this sorrow. There is always another way, and you need to find another way. You only get one life. Don't throw it away in a rash decision or some \"well\" thought out plan to release the burden. There are tens of options. Call a friend, call a help line, seek some help. There is always a person who will listen and who will care. Take fives minutes, and anyone can find someone to talk to about anything. We have the entire internet to help us, and we have people a phone number a way who will listen to any shit you throw at them. Hell, message me and ill see what i can do. Dont throw away this one chance you have to live your life and be happy.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y62gj/"}