{"id": "t5_2qh1i_t3_4e8oip_t1_d1ya5hp", "creation": 1460369131, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Poetek", "text": "I've been in twice under watch. I had tried many more times than that. And I must side with the thing that sounds like fantasy that it will get better. I remember hearing it like \"sure it will /s\" but one day you find a reason to stop. Times are fuckin shit and even though people tell you otherwise you know it. But what changed me was that sure everything shit. But there is stuff out there that makes it all better. People, conversations, things, activities, hell even food. Life is there to be loved. There isn't going to be some divine intervention (well there wasn't for me), some moment when it all just works. It's not easy either, you have to work every fuckin day and do whatever you can to make it better. You might have to put your life on hold, stop working, stop doing university or college, move back in with family. But I promise if you try it will be better one day. And trying doesn't mean thinking \"I'm gonna try\" and then feeling shit when u don't. You need to get up and do things, all the shit you know must be bullshit, like exercise and talk to people and all the things you really don't want to. Because that's the shit part of your brain that's making u feel bad. My girlfriend went through it again recently and as much as I tried to help and do whatever it doesn't work. I can literally get her out of bed and make her do things and eat properly and take her medication then she will just feel useless and like shit. The way you sort this out is with others help sure. But 95% is up to you. And it's so fucking hard. But you can get there. If you ever need to talk or message or fuckin Skype random stranger I will get up at god damn 3am the night before an exam or even walk out of one of my final exams or a job interview if that's what you need. Even if it's just to talk or rant or just to hear someone else's voice that isn't the one in your head. I am always available to help anyone that needs it. Always", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ya5hp/"}