{"id": "t5_2qh1i_t3_4e8oip_t1_d1ya02k", "creation": 1460368534, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 18, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheBathCave", "text": "I have felt this way too! In the grip of my worst depression and anxiety, my brain has me convinced that anyone who says that they love or care about me is either lying to me and secretly hates me, or that they actually do love me and I feel so guilty and insecure that I have nothing to offer them emotionally and not wanting to participate socially and I start to resent them for what I imagine are their expectations of me. I become convinced that I'm letting everyone down and making them hate me, and I hate myself even more for disappointing them. Then I start distancing myself from them because I feel guilty about being a bad unavailable friend and want to avoid situations where I do it again.  \n\nThen later when I'm back on track and thinking and feeling clearly again, I realize that everything was actually fine and nobody was pissed at me and everyone still wanted to be my friend. Most everyone completely understood that I was going through a hard time and needed space to heal, but they still wanted to be supportive and invite me to stuff and let me know that I was welcome and included even if I said no. \n\nMental illness is a fucking bitch. It sneaks up on you and slowly convinces you that you are not only a shit person for feeling bad and that your feelings are shameful, but also plants the seeds of doubt and sabotages the relationships with the support system you need to get better, convinces you that you are so shitty don't deserve anyone's love and that nobody gives a shit about how you feel and seeking help is a stupid idea because there are people out there with \"real\" problems. The stigma of mental illness in society doesn't help either, although there have been some better dialogues about it recently. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ya02k/"}