{"id": "t5_2qh1i_t3_4e8oip_t1_d1y5zdr", "creation": 1460354079, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thisdesignup", "text": "> Currently the thought of thinking differently about the world seems as rational as trying to convince myself that moon is made of brie.\n\nlol, that's a funny way to put it. Just curious if you've tried thinking different about yourself instead of your surroundings? Of course this is just from my own experience but whenever I've gone through depression it always went away when I forced myself to deal with my own thoughts and see why they were appearing, e.g. the cause. Then I had to figure figure out how I could control my thoughts and not worry about the outside world effecting my thoughts, even if the world did a bit. Less about why the situation was so bad and I didn't fit in with it and more about how I handled myself. When you have no control over the world, or very little as we all really do, I found the best is to figure out how to control one self.\n\nI gotta say at the same time the biggest thing that helped was a change in lifestyle, how I did things. First time I got depression I ended up leaving a school I was at and moving back home to get away from the place I was used to having such attitude in. The second time I ended up having to take control of many aspects of my life that were hectic.\n\nThen again everyone's experience with depression is different and you said you've gone through all this. So I hope these thoughts don't come off as deragatory(?).\n\n>Things like schizophrenia and bipolar disorder won't be helped by talking it out.\n\nFor sure, there's much more to changing things then just talking. Lifestyle changes need to be involved too but those can be hard. I guess it's just my personal preference to not use medicine for those kinds of things. Especially when often it seems like those mental \"issues\" are not fully understood yet.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y5zdr/"}