{"id": "t5_2qh1i_t3_4e8oip_t1_d1yiaoe", "creation": 1460387444, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Wrinklestiltskin", "text": "Loss never truly goes away, it only gets easier to manage. I haven't lost a partner and I know it must be different, but I watched my father's condition gradually deteriorate until he died when I was a kid. I was 8, almost 9 when it happened. I'm 24 now and I still miss him terribly. I don't have that crippling anxiety and depression surrounding his death anymore, but the pain is still there.\n\nSometimes I just breakdown or there's a trigger, like sometimes the song \"doesn't remind me\" by Audioslave just gets to me as I realize that I can hardly remember his voice, his personality, his essence. But despite the fact that the pain of loss still exists, it is much easier to deal with at this point. I've gotten to the mindset that it is good that I still feel it in this way because it's a testament to how fortunate I was to have this person in my life, and to care about them this much\n\nI feel I owe it to him to honor him in still being emotionally invested in his existence. I know he wouldn't want me to be depressed and that has been a driving force in combating depression all these years. It's going to be really hard for you for a while and the lingering thought of your life with this person will resurface, but you have to try to stay strong, for yourself and them.\n\nAs difficult and miserable as it is, there is a light at the end of the tunnel and that is the point in which you realize that you really do have control over your outlook. Events like loss of a loved one have an unstoppable depressive force, but how severe and long lasting it is, and how long you let it restrict your life truly is in your control. It takes time to realize it though. The biggest thing to remember is that they wouldn't want you to stop living on their behalf.\n\nIt will definitely take time and will be a struggle but in the end you will come out a stronger person. The most impactful educator I have experienced (one of my psych professors) always said \"You can't grow as a person without struggle and loss.\" I whole heartedly believe that.\n\nI know this is not a satisfying or absolute answer, but I hope my perspective and experiences can help you in some way. If you ever want a stranger to talk to, even to rant to, you can pm me at any time. I truly wish you the best of luck.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yiaoe/"}