{"id": "t5_2qh1i_t3_4e8oip_t1_d1zpt9a", "creation": 1460465381, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "louisbullock", "text": "Hey — bud — I'm talking in an understanding tone to ya, I've said I've heard your points and so on, you don't need to speak in such a retorting manner.\n\nNo I'm not in the same boat, but I'm trying to understand, I'm sure you can see I'm trying. You're spot on, there's folk who do say platitudes, and say things that seem empty — believe me I get it, I've got struggles in areas you're not aware of and its a similar frustration.\n\nYou feel irritated that another person doesn't get your own experience to the exact detail that you do, I can completely get you on that, and all I can offer is sympathy, understanding and do my best to get on your level and others.\n\nNothing can change that except going through the exact experience. When you think long and hard about it, thats about the only thing that stops me fully understanding you and the other way around, so please, I get where you're coming from, but I can't go any further with understanding the specifics, so your comments make sense, but won't make me feel your pain any more, you get what I mean?\n\nSimply put, I won't be able to get where you're coming from exactly, so I can only say a few things that seem very on the surface.\n\nAdditionally I thought you meant something different about the word spite, I misunderstood what you meant there.\n\nIt doesn't help necessarily to point fingers at people for not understanding a difficult situation they haven't experienced.\n\nI'll tell ya something short here, I have Asperger's Syndrome. Hell. Absolute hell sometimes, and yet I put up with the experience because its my only *default*, I wake up, and I've still got it.\n\nY'know what though? I don't complain to others that they don't *get* it too often, because I know that doesn't change much. I educate where necessary, but don't blame others for not knowing.\n\nWho's to know? Also, who's to know someone is suicidal as a passerby? Who's to know if a passerby has AS? Pick a condition, an affliction, a mental state, an anything.\n\nI can't get on your level completely but I can try, and honestly I'm trying my best, that's all I can do. Believe me when I say I am, there's no negative intentions behind what I'm saying, there's no real malice, nothing too terrible.\n\nJust poor wording, I'm trying to communicate, but it doesn't come across well sometimes, I'm sure you can feel me on that point.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1zpt9a/"}