{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8unk", "creation": 1460363824, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "HMW3", "text": "Basically, \"fuck.\"\n\nIt wasn't a anger that I didn't succeed, it was probably because I think I knew from that point forward I knew my life would be different from that point forward.\n\nMy family would never fully trust me again.\n\nI took a whole bottle of gravol and downed it with whiskey, i tried to find as many pills as I could and when I was about to pass out I realized I didn't wanna die, I had been contemplating it for some time before going ahead with it.\n\nI texted my cousin I said, \"I just took a bunch of pills and alcohol, I dont wanna die anymore\"\n\nlast thing I remember was passing out as they picked me up and lugged me into the car.\n\nI woke up in the hospital with the taste of tar, I think? Whatever it was they use to pump stomachs.\n\nThey kept me in the hospital for about 2 weeks, being in the psych ward was the major convincing piece as to why I smartened up about the whole ordeal, my father ended up passing 2 years later and then I was forced to sort of go back to another hospital for a month and a bit, I wasn't taking his death very well and dropped out of college.\n\nI'm 26 now and though I've had some personal struggles, i've become a much more resilient individual because of it, I have no patience for superficiality, and anyone who may artificially make their lives harder on themselves.\n\nMy philosophy is that everyone has their own personal struggle, and you shouldn't use those as a crutch, in fact I believe you should use your struggle as motivation.\n\nIt's not easy of course, and I still get down on myself. But literature and dreams are what keep me going. I may never get to the point in my life where i'm completely satisfied with what I've accomplished, but I know that i've experienced so much in life, I've traveled so far and done so many things, I could die happy. \n\nI will not stop experiencing these things, I will keep pushing and striving to be a better individual, to be there for others if they need someone to listen to them. \n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8unk/"}