{"id": "t5_2qh1i_t3_4e8oip_t1_d1yz3q5", "creation": 1460409624, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Juzkiddin", "text": "When I was 14 I tried to slit my wrists with a piece of broken glass. I didn't want to die, I just didn't want to live how I was. I sawed into my wrist with tears and fury and sat there behind my Jr high school in an alley waiting to die. It never happened. I was disappointed but relieved after half an hour. I was bleeding but nothing life threatening apparently. I went home after that, back to the life I hated but with a slightly different outlook because I knew I didn't want to die, I couldn't. My brother and sister needed me. Years later I was the one who had to sit in my brothers apartment with clorox wipes and rags cleaning his belongings so they could be removed after his shotgun suicide. We couldn't afford to have someone else do it, I hung sheets on the walls so I didn't have to look at the mess and put towels on the globs of brain matter and skull fragments that sat in piles on the floor next to me, since the sofa was where he sat and it was dripping with his remnants. As I went around cleaning I saw what I thought were fillings from teeth but turned out to be the pellets from the shotgun that had lodged into the drywall and fallen out coated in white powder. There was not one area that wasn't covered in matter. And dutifully I sat there for hours cleaning it all up. I'm grateful that I lived to be able to save my mom from having to do that. I'm so angry at my brother for having done this but I also understand how low you have to feel to get to that point. I no longer have many memories of my brother other than what I had to do for him that day. My psyche couldn't take it, everything else except for a few limited memories and thoughts has been blocked and muddied by the sheer act of scrubbing bits of skull and brain off his belongings. Sadly I can talk about that with great detail and be so numb that I don't notice the revolted look on peoples faces. The smell is with me always, sometimes it will overpower me and make me sick. And through all of it I still feel as if it was my fault.  \n I share all of this in hopes that if someone is feeling suicidal just remember that almost every person that has been there and gotten past the feeling or survived an attempt has been glad that they didn't do it. Times will get tough. People are assholes. Feelings suck. But its the people that are left behind will never be the same. Once its done, its done. There's no reversal. The only thing that it resolves is the temporary pain that you are in but it creates a permanent pain for those of us that are left to think about it every day. You may not feel it now but you are more important than you think and loved by more people than you realize. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yz3q5/"}