{"id": "t5_2qh1i_t3_4e8oip_t1_d1y1o97", "creation": 1460344486, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 18007, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "arcadebee", "text": "\"Fuck I'm still here\" \n\n&nbsp;\n\nI almost don't want to share this because I don't know if it's helpful for people who are going through it right now. But I've seen and read so many accounts of people who changed their mind when it seemed to be too late, or realised all their problems were insignificant once they were almost dead. But that didn't happen to me.\n\n&nbsp;\n\nWhen I started vomiting blood and bile, all I could think was \"I really hope I'm not throwing up the pills right now\". I also felt disgusting and ashamed, but I didn't want to live and I didn't change my mind. When I woke up I was covered in blood (some from vomit, but a lot from my arms and legs which I'd absolutely shredded with a blade.) there was sick all over the floor and in my hair, and my clothes and face were wet with tears. I was a mess, and I felt like I'd fucked up my life in every possible way, and I have never felt so disappointed or disgusted with myself than when I properly realised it hadn't worked. \n\n&nbsp;\n\nAnd honestly I would've loved that to be a wake up call or the moment I changed, but it wasn't. I felt that same disgust for some years afterwards. To me, that was confirmation that I'd never be happy, and that I'd never settle into life in the way that everyone else seemed to. I just accepted that I'd never be happy, and that I'd never stop wanting to die. I can't really explain why I thought this. I just believed there was something inherently wrong with me, an illness, or something about who I am as a person, which meant I would always feel suicidal. \n\n&nbsp;\n\nIf I could go back and meet this younger version of myself, I would give her such a huge hug. But I don't really know what I would tell her. I don't know what it was that made everything finally click. I don't know what is happening in my brain now that wasn't happening then. I think I just finally realised that it's down to me. Of course you can't think your way out of depression, but you can learn how to cope with it better, and eventually how to combat it. Over time I completely changed my attitude. Depression still plagued me, it was still there in my head, but I found ways to make it quieter, and ways to make it hurt less. Very, very, slowly, I even found ways to be happy. I realised that my happiness was my responsibility, and I couldn't just sit there waiting for depression to leave me. And I can honestly say now that I'm a very happy person, I enjoy life, and even during stressful times I'm ok and I can dea with it while still being happy in myself. It took a long time to get here but it was the most worthwhile thing I ever worked on. Being happy is pretty much the best thing you'll ever be. \n\n&nbsp;\n\nThere's a quote I found during that time which I really like: \"no matter how far from the truth we are led by histrionics and lies, the truly, objectively beautiful remains untainted.\" I thought about that a lot and I still do. No matter how bad things get, no matter what awful things my brain throws at me, there is objective beauty in this world which can never be taken away. I worked really hard to see it everywhere. Flowers, the moon, my cat, my mum, strawberries, anything at all. I just reminded myself that to me, these things will always be beautiful, and my depression couldn't stop that. Eventually it was less hard work to find beautiful things. I saw them everywhere, and I still do. \n\n&nbsp;\n\nAnother is from Oscar Wilde \"the only reason for a useless thing is that one admires it intensely. All art is quite useless.\" When I first discovered that quote I believed myself to be useless. This quote made me smile. Everything here is useless really. The only point is to love things and sometimes to let them love you.\n\n&nbsp;\n\nI'm happy to be alive. Im happy to be here with all these beautiful things and people. If anyone out there is having a difficult time with suicidal thoughts, or depression, please know that it can get better. Please know that I love you very much and you are a beautiful thing that I'm proud to share a planet with. \n\n&nbsp;\n\n&nbsp;\n\n**EDIT:** I really didn't expect such a huge response to this. I'm honestly overwhelmed by it and I don't know what to say. To know that a really awful time in my life has ended up helping people a little bit is really humbling. Those years of my life were pretty much wasted, but now it feels like they were worth something. Thank you so much to the people who shared your stories with me. I will be responding to everyone personally because this has all affected me a lot. You really are all amazing, and it made me cry to see so much love being shared in the comments. It's so lovely that such a negative premise has created so much positivity. Thank you all!\n\n&nbsp;\n\n**EDIT AGAIN:** I'm sorry to keep adding to this but I really am blown away by all of this. Thank you for the anonymous gold. I really hope that means it helped you in some way. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y1o97/"}