{"id": "t5_2qh1i_t3_4e8oip_t1_d1ympqc", "creation": 1460393501, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Saith_Cassus", "text": "It's incredibly rough, isn't it?\n\nI got pretty far in my own process toward the end of college-- had to graduate late, had shitty grades and no work experience and nowhere to live, girlfriend had just broken up with me and I was watching her get into another relationship from afar-- all around rough. I ordered a bottle of sleeping pills to overdose on. I picked them up from campus mail and planned to kill myself that night. \n\nI was crying and struggling to do it, and out of nowhere my mom knew that something was up. I was a shitty kid and didn't call, email, or text often at all. I was too cool for that, dammit!\n\nBut somehow, from a literal thousand miles away, with no warning whatsoever, my mother just *knew* that I was struggling and called and texted and convinced me that I should get help that next morning from the school's counseling office. \n\nI didn't get better from one trip, but it was fantastically healthy to talk to someone who knew what the hell they were doing/talking about (college students collectively have no idea what they're doing when they try to help-- myself very much included) and to just tell someone how godawful terrified I was of the future and how sad I was that I was alone and how much of a massive waste of my parents's time and money I felt like I was, and how I didn't feel like I was even allowed to feel this way with all of the advantages my family has given me that other people struggled to earn. \n\nIt took about another two years before I finally balanced stuff out, and I still struggle with it sometimes. But I think that it really was a definitive turning point in my life when my mother just had that impossible psychic knowledge of what was going wrong and was able to reach out to me from so far away and save my life like that. \n\nI've never admitted to her just how far things got. I want to, but I also know I'll drive her mad with worry if I do, and I don't want to do that to her. Now I just try to call and show how much I love her. \n\nI remember once I almost said, \"I love you so much more than you can know,\" and then stopped because that was stupid. I told her, \"I love you as much as you love me.\" Because that was, I think, more than I'll ever know. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ympqc/"}