{"id": "t5_2qh1i_t3_4e8oip_t1_d1zgdl7", "creation": 1460436762, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "djsb801", "text": "Never shared to anyone, but partially anonymously on Reddit is actually quite fine for some reason. That or it's because it's 5am.\n\nBorn in 92, growing up was really bad. I was like, 4 or 5 or something and both parents would beat me daily. Separately too. Half of it was me doing something. Other half is legit still a mystery to me. Dad left when I was 9, so it made it just mom to keep beating my ass til i was like 12-14, i dont even remember when it stopped. Slippers, belts, sometimes the buckle of the belt. Kneeling on salt, arms sideways up. Proper lashing. Facing the altar, forced to ask the Lord for forgiveness. I don't know if that's where I get my faith or I just have it in me. All that time as a kid, planning to end it, but selfishly finding ways for it not to hurt. Tried slitting the wrists. Ended up a coward that couldn't go beyond outer skin level. Brother was a big torture. Everything he did, I get blamed. Had severe anxiety and fear throughout the whole thing and even had some moments after my mother calmed down (after 12-14). She started to calm down when she took a strike with the belt buckle and I just grabbed the buckle mid air and stared at her.  Happy I didn't end it because when I was 14-15, I met my group. My squad. The Men. These guys got me over whatever the fuck was bothering me at home and just got me out of there without even intending to. We just go to internet cafes and played games after school every single day. Affected my grades, didn't give 2 shits, I'd get beath either way, but I didn't because I didn't realise that's when my mother calmed herself. Graduated high school with these guys with the last year the best year of my life. Met the love of my life because of them. She was their childhood friend, a batchmate of ours in school, different section because we were in this school that had sections segregating boys and girls. Somehow convinced her I was boyfriend material after high scool, around 2010 and still together to this day. I didn't think I'd get emotional typing this. I thought this was behind me. I ended up moving to London around 2013, long distance relationship with the girlfriend. Brother and other families in Switzerland, mother still in The Philippines, where I was, now that I mention it, I never said that yet. My aunt from Switzerland gives me support when I need it, I work McD and it's depressing lately too. Hoping to attend college here this year since it'll be my 3rd year after residing in the United Kingdom, so I dont have to pay no \"overseas fee\" and I can get support from my brother and/or my aunt. It's still a little overwhelming at times that I'm alone here in London, but not as bad as the first few months. Currently love my mother and my brother, despite all of that happened to me. I was mostly a coward in my suicide attempts, but almost happened and that scares me today. I still appreciate what my friends did for me despite them barely knowing a thing about my situation at the time. I still chat with them, have voice calls on the internet while we play separate games or occasionally play together. Somehow getting this off my chest was good. Kinda hurts for some reason. But it does give me will to move forward. I did a lot of things and been through a lot as well. I guess this is as much as I can share. Luckily none of my circle and nor my girlfriend go to Reddit aside from how-to stuff. xD ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1zgdl7/"}