{"id": "t5_2qh1i_t3_4e8oip_t1_d1z2tza", "creation": 1460415067, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Aerroon", "text": "Really? Because you definitely can for many diseases. Mental illnesses often not so much, but there's strong correlation between being abused and developing those etc so you definitely can cause someone those illnesses.\n\nThe fact is that people close to that person always get sympathy but nobody actually looks at the fact that they're the ones that could've needed the person up in the first place. You don't need one traumatic or bad experience for that. Small things add up and can lead to bad things. You can be close to someone and still treat them poorly in a way that causes great harm to them and not even realize that. Nobody even mentions it though. Everyone's always either \"oh i don't understand why they did it, they had a great life!\" or \"yeah it must have been that one traumatic event\", but often it's just small things adding up. \n\nIt's like making someone angry. You don't usually do it by one big action but several small ones. You can't then claim that \" oh I didn't do anything bad \".\n\nAnd I said I'm not blaming anyone, but they could definitely do better. Especially parents. If I ever had those ideas I would definitely put some blame on them. Not because they ever treated me poorly or abused me or something but because of the things they didn't do. They're great people and all and I wouldn't mind being their friend but it's not the same if you're the kid. But you can't blame someone for that kind of inaction. Doesn't mean that they couldn't have done a better job at it.\n\nAll in all it just pisses me off when people do poor actions and then are later surprised why there are consequences later. Somehow many people seem to be under the impression that small things don't add up because if you point it out to them they s say you're over reacting.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1z2tza/"}