{"id": "t5_2qh1i_t3_4e8oip_t1_d1ykwvc", "creation": 1460391115, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lespaul166", "text": "You think you're the only insignificant speck? In the grand scheme of things EVERYONE is an insignificant speck. The universe doesn't give fuck all about Einstein or Obama or Socrates. Life is about being significant in your own life, and the lives of those close to you. You're only truly insignificant if you make yourself insignificant.\n\nI had the same outlook. Here I am, a single, boring old mechanic. All my classmates and friends are at big companies. Then I realized that I'm not insignificant. To the old lady who brings her Buick in, I am significant. She may not know my name, or my face, but what are those? Point is, to her I am significant. Without me she would still be nervously hearing that clunk. If not me, who? The dishonest mechanic next to me, who would make it out to be bigger than a loose engine mount, and wring her money out of her? The jackass who uses cheap parts so he gets a comeback?\n\nMake yourself significant. \n\nThink of the butterfly effect. Step on a butterfly 10,000 years ago, and it could lead to catastrophic events in the future. Everything is significant in it's own way. By scope it seems insignificant, but you have to narrow your scope. \n\nA nice phrase can mean the world to a stranger. They may not remember you in 30 years, but for that day, you were significant, and you bet your goddamn arse they were thinking about you.\n\nHell 3 years ago a girl ran up to me, yelled \"Coke me!\" So I threw her my coke, she took a big swing, over handed it back to me, and took off running. Weird, but I'll be damned if that's not my favorite story to tell 3 years later. The time I sumo wrestled a fat black midget in an Earth Crisis show. Great story. The girls who wanted to draw Groucho glasses in sharpie on my Mandalorian tattoo. All significant little bits of my life in their own way. For as long as I live, their legacies of coke swigging, sumo wrestling and Groucho drawing will live on.\n\nI know it sometimes feels like you're caught in a loop, with no way out. I can't help that. Suicide can't help that. Only you can help that. \n\nYou have 60+ years to make yourself significant to someone, somewhere. Now if that isn't a fuckload (3.8 Shitloads, as estimated by another jackwad I remember fondly) of time I don't know what is. Suicide? You'll never be significant. And maybe you are already significant and just for know it. Well now you've gon. And made yourself insignificant. Those you are significant to will be too pained to remember you. \n\nJust don't homes. Say something nice, do something weird/stupid. Even just smile at someone. it not hard. You're making yourself think it's hard.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ykwvc/"}