{"id": "t5_2qh1i_t3_4e8oip_t1_d203mbj", "creation": 1460484707, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "loony_what", "text": "As a counsellor, and someone who's been dealing with depression for years, I have a few ideas that could help. \nFirst of all, change the shrink. We are trained to understand if a client doesn't connect well with us, and accept that. It happens a lot. For her peace of mind, you can have her assist you in the process so she'll know someone follows you, and you're not alone. Trust me, that matters to us more than an ego battle or some cash.\nSecond, look at the people around you. Name them, know who's helpful, in what situation. Toxic people, pillars of support, people who crack you up, people who will answer your calls no matter the time, all of those need to be very clear to your head, and remember, they can't all be the same person. You have someone who can ease your pain and have a long chat with but isn't always available, someone who gives you support, someone who dishes out tough love, you see where I'm going with this. It helped me so much in the darkest of times to have a few friends on whom I could count on. Knowledge is power. \nThird of all, name your demons. That's the hardest, because they're elusive and they bite back hard when you're prying at them. But oh my god I can't stress this enough. Try your best to avoid wrapping everything up in a blanket of darkness and instead see exactly what and how makes you tick. After enormous suffering I learned that I have a greater problem with loss than with anything. Once you do learn this, it's easier to build an armor against it. Depression feels like a toxic smoke that smothers your energy away, so it helped me to sort of... materialize the demons in something I can grab by the horns. \nBe brave, I hope you'll pull through with a few scars but a fuckton of mental power. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d203mbj/"}