{"id": "t5_2qh1i_t3_4e8oip_t1_d1z415i", "creation": 1460416919, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Warrkitten", "text": "When I woke up from overdosing on every pill I had in the house (I created an overdose basket and put it under my sink in preparation for another low), I felt angry that my mother was in the same room because we didn't have a relationship at that time and I didn't understand why she was there. I was angry that I was hooked up to machines. I remember getting up at one point and going to the bathroom against the doctors orders. Im not usually angry and Im not usually defiant. \n\nAfter the dizziness and anger wore off, I was extremely sad. Sadder than I ever was. I felt like I failed and living, and also failed at dying. I wanted to die so much. At the point I was in, thinking about dying was the only thing that made me smile. I tried to negotiate my way out of hospital care but I was stuck.\n\nI got out of the hospital early because my insurance didn't approve the stay. They offered to let me transfer to a different facility or release me to see a counselor daily. Of course I elected to leave. I should have went to the other facility.\n\nI went home to an empty house and I was lost. I tried to overdose again but just fell asleep and woke up much later. I figured if I had to live, I needed to learn how to do it.\n\nI was assigned a psychiatrist that didn't really treat me. She gave me way to many prescriptions and didn't choose to listen. I gave up going to her and tried to just learn to be happy.\n\nHere I am, 8 years later, now going to therapy and finally recovering. I know looking back, my progress stalled because I didnt take the right steps to getting better. I needed to create a web of support and the right kind of support for me. Im still going through highs and lows, but its been about 4 years since my last attempt. Ive found things to live for and Im starting to love myself.\n\nIt isnt easy, and it isnt fun at times. I catch myself planning things around the house or putting limits on how long Im going to live. Im married now and he is very understanding without accepting. His brother recently committed suicide so I was able to see how the pain transfers. It has been one of the hardest things we have gone through together. \n\nPlease reach out. If you dont like your therapist, try a new one that may fit your needs better. Never give up on yourself. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1z415i/"}