{"id": "t5_2qh1i_t3_4e8oip_t1_d1yb0ts", "creation": 1460372358, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Kiwi-kies", "text": "I have DID so sometimes I \"lose control\" of my body, 1 of 3 identity's are \"in control\" of my body at any time, me, a suicidal/attention seeking one, and a pointless one, I'm not able to recall any events that happen so sometimes it's quite the surprise.\n\nMost of the time I'm in control, once a day the pointless one takes control and it tends to just carry on as I would with small differences, the suicidal one takes control about once a fortnight, when it's in control it'll put me in a dangerous position, stand in the middle of a road, hold a knife to my body, last week it climbed out of a window and stood on the window ledge, then It just gives up on the control and I'm back in control, left in the dangerous situation.\n\nThe first time the suicidal one took control I was walking towards a shopping centre, lost control along the way and when I was back in control I was standing on a train track with a train coming at me about 50 foot away, It was the first time I'd lost control and I wasn't fully aware of what was happening and I just stood there for what seemed like forever thankfully a guy grabbed me and yanked me from the tracks saving me, then he swore at me got up and walked off saying \"Fucking idiots can't even kill themselves properly\" such a nice guy.\n\nI've gotten to understand what's happening now so I'm able to react to these dangerous situations quicker and I'm rarely hurt any more.\n\nThough it's not exactly suicide it would of been and what are the personalities if not my own stray thoughts, though I have never wanted to commit suicide.\n\nThe first time it happened my only though was \"What the fuck just happened\" after I'd figured out what was happening my first though is usually \"For fucks sake would you fuck off trying to hurt me.\"", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yb0ts/"}