{"id": "t5_2qh1i_t3_4e8oip_t1_d1yi5gm", "creation": 1460387230, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "\"Fuck\"\n\nI knew I was in for a world of hurt on top of everything I was already struggling with in my life. I was so horribly unhappy about surviving that I spent months trying to work out a plan that would work, but I had to be super awesome international spy secretive about it because of having just made it through once. I was watched like a hawk, and not in the caring supportive way, in the fuck you you little shit you're not doing anything kind of way. Nobody was loving or caring or supportive in the way you'd think they'd be. Honestly, they all treated it as a cry for attention and they were beyond furious with me for it. I still wish they knew it wasn't \"acting out\" or attention-seeking.\n\nAnyways, in those months where I planned very carefully, I started to come out of my depression. There were a few brief, fleeting moments where I was glad I failed. Those moments are still very rare, but at this point, it's too much work and causes too many problems to off myself. I also got a few degrees in psychology, which doesn't do much from a theoretical background, but rather in a practical sense. Being a therapist is one of the few things in life that makes me feel like I'm not a total waste of elements. My dog is the primary thing that keeps me going. He turns 10 in five days. I'm planning a party for him. Nobody will come, but I'll plan it anyway. Planning for the future is difficult, but sometimes, just the right plans can be really helpful for keeping hope alive. \n\nI still keep the option of suicide in my back pocket. It's comforting. It does arise as my go-to first choice when things start going wrong, but I've learned to acknowledge it then put it back in the pocket. Maybe someday it will be the right option, but not today. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yi5gm/"}