{"id": "t5_2qh1i_t3_4e8oip_t1_d1y6ni2", "creation": 1460356014, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cripplor", "text": "I just saved this so I can read it again in the future.  \n\nThank you for sharing your story.\n\nI've been battling pretty terrible depression for about the last 6 years now.  I wouldn't say I'm suicidal, but I barely have the drive to get out of bed any more.  \n\nI'm 36, and was born with a rare bone disorder that makes me very fragile (think \"Unbreakable\" starring Bruce Willis).  I have been confined exclusively to a wheelchair since I was about 8 years old.  My parents were 17 and 18 years old when I was born, and they both struggled with severe addiction issues (putting it mildly) as well as a litany of other undiagnosed mental disorders.  I basically feared for my life every day as a child. My father died in 2002 from an alcohol related accident in our home, he was 42. \n\nI married and divorced in my early 20's, then lived alone for the first time in my life at 26.  That's when all the insane shit from my past started catching up with me.  \n\nI sought therapy for a couple of years, and tried anti-depressants for about 6 months.  They just made me feel more internally wound-up than I did before.  My insurance won't cover therapy any more due to a jurisdiction issue. \n\nIn 2011, I met someone new online.  We fell in love, and moved in together a year later.  I was happier than I've ever been between 2011 and 2012.  We're still together, and I couldn't be more content with our relationship.  We're living in a nicer apartment than I've ever lived in, pretty much, and our situation is great.  \n\nYet the depression lingers.  It's gotten worse, in fact.  I stay awake all night doing bullshit on the internet, sleep quite literally all day, rinse, repeat. I've become reliant on OTC sleep medication to help shut my brain off enough to fall asleep.  It doesn't really work anymore.\n\nThe reason I'm even vomiting all of this onto Reddit is because of what you said about feeling useless.  I feel extraordinarily useless, all of the time.  I don't work, and feel like I contribute absolutely nothing to the universe.  That Oscar Wilde quote really struck me.\n\nYour advice about making sure to see beauty, to FORCE YOURSELF to see beauty, spoke to me as well.  I hope I'm strong enough to do it more often, because I'm afraid the void has its tendrils rooted pretty deeply in me at this point. \n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y6ni2/"}