{"id": "t5_2qh1i_t3_4e8oip_t1_d1ym3xy", "creation": 1460392706, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thief425", "text": "I have to take medicine every day, too. Mine isn't an anti-depressant, though, it's anti-anxiety. I have asperger's, and I can't sleep properly. And my circadian rhythm is out of whack, so I also have to take medicine to stay awake during the day because my body thinks it's 12 hours earlier/later. It sucks. \n\nBut, here's the kicker. It's our society that makes the pills necessary. We have to work to make money, and we have to interact with society to function. If I worked night shifts, the sleep issue probably wouldn't be a thing, but I like seeing my wife and kids, which I wouldn't do much working nights.\n\nAnd the pressure and stress of having to work to live, to pay bills, to have medical care, and to make sure that we keep those things over time make it where we can't take risks to have jobs we love instead of jobs we do to survive.\n\nI have a friend who talks about the unfairness of work all the time. He would really like to be a grounds keeper of sports fields and paint chairs for Mexican restaurants. But, he couldn't afford to live doing that because he has to pay child support and afford a reasonable place to live when his daughter visits. We work doing jobs we hate because we lack the financial security to take risks. So we remain underpaid and overworked, prevented from taking chances that we would probably enjoy more in the long run.\n\nIt's the rat race. I'd love to teach computer programming to kids, to help them learn a skill that will change their lives, but there isn't a practical path to that in my life. I missed that opportunity train after making some uninformed choices at 18 years old. \n\nIf you have the chance to go to California, do it. If you don't yet have a family or financial obligations, take a chance, but recognize that it will be harder than your mind imagines it will be. The brain minimizes external difficulties and maximizes internal ones. Balance those two forces, and live your life. You only get one, so get everything you can out of it, No ragrets 😉", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ym3xy/"}