{"id": "t5_2qh1i_t3_4e8oip_t1_d4eai53", "creation": 1466259518, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Twistedbl4ck", "text": "Commenting on this late so my reply will most likely get buried. Happens to also be my first comment. Anyway, I'm not a survivor of suicide but I am a first hand account of a survivor of suicide from the beginning. \nI woke up on the morning of June 1st, 2014. It was a Sunday and I had work so I would have usually just gone straight into the bathroom but this day, this day was different. I could've never known on this day my life would be changed forever. when I woke up I had an overwhelming urge to check on my older brother(D) . House was too empty, both of my parents gone. It wasn't a panic sort of feeling but more of intuition that guided me through my house and straight downstairs. Now if you knew me you'd know I don't really go down into our basement ever because that's kind of part of my dads living space. When I walked down there my worst nightmare came true, something no sister, mother, father or loved one should ever see. It was surreal as I saw My brother laying face down on the floor. I ran to him to turn him over and there was no pulse. I shot into panic mode, when the ambulance got there they rushed him to the hospital. Where he laid in the same bed for a week. I couldn't ever describe the pain I went through as I went to the hospital every day to see my brother. Seeing him laid up in a hospital bed with a machine that was breathing for him and all these tunes and wires that were helping him live. You see the thing is, he slipped into coma and no one knew how long he was going to be gone for. That week lasted a thousand years. I've never seen or felt the pain I experienced in that hospital room ever in my life and I hope to never feel it again. When the day came that he woke up, I happened to be walking into the room. He was already semi awake with a nurse in the room. The nurse told him \"your sisters here to see you\" and I think that's when he came back to reality. He was very confused at first about what happened, not remembering anything or how long he had been there. He seemed upset at the fact that he was in coma but he just kept saying \"I wish I would have never lived\" \"why did you have to find me\" I felt an immense feeling at that moment. It really does something to you when you find someone you love no longer breathing, when they wake up and tell you they still don't want to live is even harder. Good news is to this day he's still here. Bad news is, it still effects me And our family will never be the same. He still says things like \"I wish you would have never found me\" suicide hurts the ones you love more then anyone could ever begin to comprehend. I don't wish it on anyone.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d4eai53/"}