{"id": "t5_2qh1i_t3_4e8oip_t1_d1yasae", "creation": 1460371530, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CheshireCatEyes", "text": "I'm not one of those impulsive suicide attempters, I planned waaay in advance, and also did a lot of prep. Not that that's any better, just different. \n\nI acquired lots of Xanax, Oxycodone, GHB and also bought some vodka and ciders. The ciders were mainly just to add more alcohol into my system because I can't really stand spirits.\n\nMy intention was to overload my system on CNS depressants (all of which the above are), so that I could just stop breathing. I didn't even care if I aspirated vomit, I just wanted to leave. So I took 14mg Xanax, a quarter litre of vodka, three ciders, 3-5ml GHB and snorted 40mg Oxycodone to be exact. Obviously, do not ever do this, it's awful. \n\nWell, I felt high for about a minute but then I was wretching over the sink. I don't think I've ever vomited in my life, it's weird, but when I drink too much or whatever, I usually just get extremely nauseous but hold it in. \n\nThen immediately after it was just like complete darkness. I was completely unconscious, and it was just...nothing. I'm 100% certain if I had succeeded, that would be what death is. Just nothing. I mean, who knows if you're reborn or if there really is an afterlife or something but that was my experience. \n\nI time travelled a couple of hours into the future, so it seemed like only a couple seconds had passed when I awoke in a hospital bed with an IV and my parents plus lots of medical staff stood around. Apparently, I had told my flatmates that I was going for a walk and managed to get pretty far away before collapsing. I had no memory or awareness of that, and that is the scariest part to me; drugs can really mess you up, especially the ones I mentioned. Someone found me just in time; much later and my breathing could have completely stopped, and worst case scenario I would've been brain damaged. Yes, that would be worse than death imo.\n\nSo I was lucky, well, depending on your perspective. To be brutally honest, when I woke up my only regret was that it didn't work. I spent the night in the hospital, they told me to speak to a mental health team and let me go. I'm not sure if they thought my overdose was accidental or not, so they might not have considered me a suicide risk.\n\nI spent the next couple of weeks recovering, sleeping days away, and I'm pretty sure I've done some kind of damage to myself. Sometimes I feel drunk, I slur my words, my concentration has deteriorated, my thinking has blurred, but I only have myself to blame. \n\nReflecting on it now, I kind of think that I was just desperate and wanting to relieve the intense suffering I was going through. But there is a lot life has to offer. I want to see the world, I have so many experiences awaiting and I would've squandered that.\n\n I'm only 21, so regardless of your past or your situation, any death at that age is a complete waste. The only constant in life is change. I'm sure I'll have even higher highs and even lower lows, but I can also be sure that I won't be doomed to feeling miserable constantly. The average life span is only around 70-80 years old anyway, which is just a tiny blip in time. Cutting it short is like flipping an hourglass when there are only a few grains of sand left to fall...if that analogy makes sense!\n\nIf you're feeling suicidal yourself, my advice is to really dig deep into those feelings. Sounds counter intuitive, but by letting yourself experience those emotions and seeing what is causing them through meditation and such really helped me. You could come to realise that it is purely a chemical imbalance, which is easily treatable. Or that it's purely situational, and like I said, that will change in time. Or a mix of both, which is still manageable.\n\nSomeone cares about you, and your life is precious. Keep going.\n\n\n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yasae/"}