{"id": "t5_2qh1i_t3_4e8oip_t1_d1yk9ig", "creation": 1460390237, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ramaloke", "text": "Wow this is ridiculous. I absolutely hate bullying but I'm so happy you're still here bud. I'm 26 now but back in the high school days I also had people who would bully me. I would usually just brush it off and keep it all inside, feelings and all. Its kinda still like that to this day, I've come to the realization that I might be in the top 10 worldwide at hiding emotions and tells. I still remember the day that I snapped, mind you I've had countless thoughts of suicide even times where I've had the rope or knives in hand. The day that I snapped though was the day I realized that I'm living for myself first and the people I love second. Everyone else is a fuck and I could care less what happens to people around me. Well I snapped and turned to the kid bullying me and started to yell at the top of my lungs, many things, I was ready to beat the shit out of him and anyone else that dared intervene. What did he do? Jumps up and runs off like a pussy to tell the in school cop and principle and I was the one that got the punishments. Sitting in those punishments I think was what truly made me realize that it wasn't me that truly had problems, it was the people around me. \n\nWhere I am now I'm a lot different than when I was a youngin. I rarely think about suicide anymore and if the thought somehow seeps into my mind I kinda chuckle and throw it out. Because I know that living for myself and the people I love is enough to make me happy and certain material things of course. Fuck everyone else, I'm am not a kind person to strangers and I guess one could say I was molded this way but no. I choose to be this way and I **love** it. Call me remorseless, call me heartless, it Is what it is and I welcome you to call me that because that is how I personally find a way to get by and enjoy life. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yk9ig/"}