{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8s60", "creation": 1460363546, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "knittingquark", "text": "\"I can't even do this right.\" \n\nTurns out, as I discovered much later in life, that the overdoses I took likely weren't lethal because of a genetic condition I have which affects how I metabolise some painkillers. I woke up with abdominal pain each time, but it faded. \n\nAfter the first two times, I considered other methods. The benefit of wrist slashing was that I found out, for me, self-harm is a protective mechanism - it shocks me out of the fugue state I get into when I am suicidal. That helped me survive a good few years.\n\nI was genuinely trying to die, but my core reasoning - that it was to protect the people I loved who would be sad for a while but overall the balance would mean their lives would be infinitely better without me - meant that consideration of who would find me and how traumatic that would be was a primary concern. \n\nI'm convinced that this accounts for a major part of the discrepancy between men and women's suicidal behaviour - women try more, men complete more. Women are socialised to be continually aware of the people around us and how our existence affects them. The much more certainly lethal methods are also the most traumatic for others. Scenarios I dismissed: hanging, because people do not look just peacefully asleep after that; cliff-jumping, because of the possibility of washing up on a shore or landing on rocks and having children find me; train/bus, because including someone else in the trauma would be cruel. \n\nI just wanted to be gone, and for the people I loved to be able to pick up the pieces and move on rather than deal with a lifetime of my catastrophic impact. Waking up to find I had failed at dying reinforced many of my beliefs about myself and how useless I was. \n\n(*touch wood* I'm in a much better place now, though I still get bouts of suicidal ideation.) ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8s60/"}