{"id": "t5_2qh1i_t3_4e8oip_t1_d1y9shp", "creation": 1460367684, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thenorthwesterner", "text": "\"How much longer do I have to keep pretending...until I can try again?\"\n\nI tried to over dose in my teens.  I had high grades at school, a group of friends, parents who were supportive, a job that had great coworkers... On the outside, I pretended that everything was fine. No one ever knew or suspected that at the end of the day, I was kept awake at night  by thoughts of how useless I was, how I was a disappointment, how nobody would care if I disappeared, how great it would be to die in my sleep...  I would lather, rinse and repeat the daily cycle of pretending and self loathing for months until I made a plan.\n\nI was going to go home from school in the middle of the day when no one was home. I was going to over dose and cut myself. \n\nAfter consuming bottles and bottles of Tylenol and who know what else, I started to throw up. I laid on the bed and waited. \n\n\nMy little sister showed up. I don't know how. Or why. I told her I was sick. She stayed in my room with me and brought me a bowl to puke in. I felt like a sack of shit for putting her in that position, but was happy that it was going to be the end. I kept puking and and drifting, puking and drifting waiting and waiting. \n\nAt 10 years old she called 911 to get me help after she noticed all the empty bottles and cuts all over my wrists. \n\nThe next bit is fuzzy: the ambulance picked me up, I was taken to a hospital, one of my parents' friends who worked in The ER recognized me and called them... I was shocked and amazed that I wasn't dead yet. I kept telling them not to bother calling my parents, because I would be dead soon anyway. \n\nMy parents came and were devastated. I drifted. I guess they pumped my stomach and whatever else they had to - because I woke up. What the hell was I still doing here. \n\nI finally told my family my thoughts, how it had been months and they didn't notice. I wanted to pretend to seek help long enough so that I could make another plan and try again. Until my sister walked in the room and threw her arms around me. I couldn't believe I was going to do that to my sister, let alone anyone else.  I got help after that. \n\nThe next few years were hard. I struggled as hard as I could to never do that to my family again. Some days were good. Lots were bad: many days I couldn't wake up, Many sleepless nights of self hatred.\n\nDuring that time, everyone around me told me they loved me, that they were happy I was still there, and a lot of other caring words. I filtered them all out. I couldn't hear them. They were not true words. They didn't really mean it. \n\nI tried a lot of treatments and prescriptions before I finally started to feel better about myself again. I\nI'm here today with a beautiful family. A home and a car that we own. Another great job. \n\nIf you are going through a hard time, keep trying. It's so easy to stay the same and hate yourself. It's even easier to end it. Just remember that there is always going to be someone devastated of your passing, even if you don't know it right now. \n\nSorry for any weird formatting. I'm on mobile and it's quite late where I am. PS: Reddit helps to keep the midnight blues away. Thanks for reading. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y9shp/"}