{"id": "t5_2qh1i_t3_4e8oip_t1_d1y9gyp", "creation": 1460366367, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Murazama", "text": "I had a rough breakup. Was sitting in my bathtub sobbing with a loaded .45 1911 in my mouth. Pulled the trigger but for some reason it didn't fire, I ended up dropping the gun, texting my mom to come pick me up and to check me into a hospital. Ended up spending 5 days in the psych ward, crying at night as all the thoughts haunted me, how I would never hear my dad's laugh again, or feel the unconditional love that my mom exudes. Or holding my cat at night when I'm having a terrible day. I'm glad that the gun malfunctioned, and I'm glad to still be here today even though I still have days where I wish things were different, and I'm slowly changing them for the better. \n\nThe worst thing through out the experience was the countless times how I had to tell different doctors how I planned to kill myself. At the time I had 5 different ways, all of which involved not being found by my mother; parents are divorced so no chance my dad would find me as he lives in another state; and all the while seeing the hurt on my mom's face, that look of her baby hurting as bad as he was... that was utter gut wrenching and I feel horrible for putting her through all of that but I'm glad she was there for me. The other hard part was when my dad would call me at the psych ward before the visitor hours were over just to talk to me for a little bit, I broke down in tears every single time just because I would hear his voice and feel safe, that maybe everything will ultimately work out in the long run.\n\nThat was 7 months ago today it still hurts to think about, but I rather people know that they aren't alone, nothing is worth ending your life for, no matter how shitty of a situation you are in, it's not the end of the world, someone loves you out there unconditionally.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y9gyp/"}