{"id": "t5_2qh1i_t3_4e8oip_t1_d2ih5ss", "creation": 1461705669, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rozkovaka", "text": "I tried to kill myself with 3 boxes of paracetamol which are meds for \"basic pain\" but I learned that it could even kill somebody. I planned it well through. I was at the lowest in my life. Being only 17 years old I was feeling kind of \"dramatical\" but I didn't care. \n\n\nBut when I actually did it, I didn't feel anything, I was taking the pills in doses and I wasn't looking back or feel bad. I didn't feel bad about leaving my twin sister or leaving my parents. \nAfter about 3 hours my parents came home and unusually entered my room to me looking weird and not responding. I wasn't unconsious but just didn't know what to say. \nAfter I told them they took me to the hospital right away. But the process and the behavior of some doctor resulted in making it another 3 hours before I had my stomach pumped out. \nMeanwhile my parents being told that the pumping will not save me and that they can't tell If I will be alive in the morning or not.\n\n\nI spent the whole night throwing up black water and didn't sleep at all. I was in the intense care unit and I hated the thought that I was still alive. And I hated that thought week later when I was finally leaving the ICU and moving to the children unit. And week later I still hated that thought when they moved into the psychiatric institution where I saw crazy girl banging her head and loudly yelling over and over that she want to go home(19y.o?) where I spent one week before I was moved to the children unit once again since there was no space. But to my suprise to this day, I didn't proceed to do anything else.. I guess the one try \"weared\" me out and I didn't want to do in it a public place. \n\n\nBut today, I can say, that the experience had changed my alot. Sometimes I think I'm completely different and feel different. I'm more confident, outgoing and don't feel ashamed of me as I did. Of course it wasn't over night, it took a year to feel better and till this day I suffer depression stages and asocial feelings and ashamed of myself. But I am really happy I am here and if anybody want to speak, I'm always here and I do not intend to leave. You will get better and one day you will be proud of yourself that you didn't actually attempted any suicide or survived.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d2ih5ss/"}