{"id": "t5_2qh1i_t3_4e8oip_t1_d1ybzow", "creation": 1460375397, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "anoifeel", "text": "On 12/12/12 (easiest day to remember) I overdosed on 40 Tylenol with codeine. I had a really bad eating disorder in highschool, so bad that I ended up getting an ulcer (excessive stomach acid from bulimia) and got a prescription for the Tylenol. I was being reckless at school and smoked some pot and got in trouble so my dad had to pick me up.  decided I couldn't fuck up anymore than I had so I went home and took all the pills I had left in the bottle. As an aside, I'd been cutting and burning my arms for a while and had been in and out of different psych hospitals for a few years so my dad figured I'd do something reckless after the suspension. He noticed I was twitching and looked not like myself and immediately knew I had done something stupid. Either way one thing led to another and I was at the hospital fighting a nurse who tried to give me Pepcid (medicine to counteract the OD) and I remember screaming and telling them to just let me die, things were all a bit fuzzy from this day. Then it got worse because as it turns out I'm deathly allergic to Pepcid and I went into anaphylactic shock right infront of my parents after they'd just watched me scream about wanting to die. So this was a shitshow. Just a mess where 16 year old me is ruining everything. I faded out of consciousness and woke up with a headache but saw my parents at the end of the bed. My first thought was \"fuck. I can't even kill myself.\" So of course I was put into intensive care and four years later I'm doing really well at college and don't deal with the same issues anymore. I think what changed things was seeing how distraught my parents were at the end of the bed watching me hopelessly. I'm really good at a lot of stuff I do, I can run 10 miles and I have a 4.0 and in general am doing really well, but I can't fucking kill myself. Today, I'm pretty glad I'm bad at suicide and I'm even more thankful that I was given parents who never ever even thought of giving up on me. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ybzow/"}