{"id": "t5_2qh1i_t3_4e8oip_t1_d1yxxhp", "creation": 1460408038, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "fuggahmo_mofuhgga", "text": "This will get buried, but I feel obligated to share my story.\n\nI was 14 at the time and a lot was going on. I was a freshman in high school and just broke up with my then gf who I adored. My parents were going through a brutal divorce and weren't ashamed of throwing my brothers and I in the middle of it. We were crammed up--all 7 of us-- in a 900 sq ft house. My mother was a crackhead back then. So one day I get a call to go to my gf's house at like 8-9pm to try to mend things. I get there after walking in the pouring rain and stood at her door as she came out to interrogate me about cheating (which I didn't do). She asked if I bought such and such a flower for flower day (which I did for quite a few of my friends) and I say yes and she straight snuffed me. Still got the scar.\n\nSo I said fuck it. I went home, grabbed an assload of pills (fuckin Tylenol.... I was 14), set a cross beside me on my bed, prayed, and downed the whole bottle. \n\nI woke up the next morning puking my brains out. My mom came in and saw \"the set-up\" and instantly realized what I attempted to do and called poison control. After a bunch of Gatorade and a lot of watching \"EmTV\" (back when The Marshall Mathers LP came out), I recovered. My mom and I never spoke about it since. Maybe once briefly immediately afterwards. \n\nI just remember waking up and not remembering what I did to make myself so sick. I remembered after a few seconds and didn't give it much thought. \n\nThat summer (the incident happened in April-May of 2000) was the best summer of my life. I never had so much fun and met so many new people (who are my best friends to this day). \n\nI remember thinking a few months later, \"Wow. Had that attempt worked, I wouldn't be enjoying myself this much right now. I would be missing all this.\"\n\nI am now 30 years old, just married my daughter's mother and making good money. Looking for a house to buy as of now and just enjoy life in general. Everything about it. \n\nEDIT: I just wanted to add some advice to those out there that may contemplate, especially for the teenagers out there... Don't make any impulse decisions. Life has a funny way of working shit out for everyone. After high school, you wont see or talk to anyone anymore for the most part. Just know that you have the power to make things better. Survive high school and your life really begins. Make the best of it and don't take shit from anyone.  \n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yxxhp/"}