{"id": "t5_2qh1i_t3_4e8oip_t1_d1y7ua3", "creation": 1460359961, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheSkrubHunter", "text": "\"I'm sorry\"\n\nI'm not a sociable person. I keep small friend groups to avoid drama, and to not disappoint a lot of people when I move after community college. In a result of this, I have had a total of five really close friends. Everyone else in my eyes was an 'acquaintance' of some sort, someone that I just 'Knew'. I wouldn't think twice about having a personal conversation with them. \n\nI had lost my last good friend to a car accident. To add onto that? Every single one of them died from car accidents within a three year span, all in the same general area, all due to high speed leading to fishtailing. \n\nNone of the other deaths affected me. I was genially worried after the third of five close friends passed without me shedding a single tear. This lead to Insomnia, which led to my doctor prescribing me sleep aid, as well as referring me to a therapist. \n\nI tried overdosing on sleeping pills. Not to an extreme amount, but still enough to where I had a possibility of dying in my sleep (I don't remember much of the previous few hours of taking them, so I couldn't tell you the exact amount). I decided if I woke up still alive, it was a sign to keep pushing through life. \n\nWhen I woke up the day after, everything seemed a lot brighter than usual. Not brighter like the sun was out without clouds, but like if you were to play a video game and turn the contrast and brightness way too high. I assumed this was the afterlife, but due to me not having any religious views, I didn't know what would happen. None of that mattered though, because the only thing I could think about was how sorry I was. \n\nI had family, and no matter the fact I isolated myself from most of them, they all loved me. If I was dead, they would not have spoken to me since my graduation of high school. These 'Acquaintances' I had thought of themselves more than that to me. Although I didn't believe it, they did care about me. Worst of all was that I had refused to communicate with my mother for the past three months. For what reason? I have no idea. One day I just decided I was tired of hearing her voice, and just stopped making effort to communicate with her. \n\nEventually, I did come to me senses, and the 'brightness' went down. I realized I was still in my room (although for some reason I was on the floor), and I got up oddly feeling normal. My life didn't flash through my eyes, and I didn't meet god or anything. I got ready for classes, and went to them. \n\nAlthough nothing noteworthy besides the sorry thoughts happened, I took in a lot from those thoughts. That day I went to my mothers house and spent the day with her, and have been doing that weekly. I've reached out to small friends and have developed relationships with them, even starting dating someone.\n\nThat all happened six months ago. I didn't talk to my councilor about it, and when my doctor asked why I needed a refill so early on my sleep aid, I told him I accidentally lost half the bottle down the drain. The whole event stayed in the back of my mind till this thread came up, which I took as an opportunity to share my experience. I want everyone to know that suicide isn't the answer. There are always people who you can reach out to, and always a solution. A temporary problem shouldn't be solved by a permanent fate. \n\nStay strong everyone!", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y7ua3/"}