{"id": "t5_2qh1i_t3_4e8oip_t1_d1yfcee", "creation": 1460382808, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RandoThrowawae", "text": "A little back story. I was a junior in high school, and had just told the girl who I was madly in love with that I liked her two weeks prior. She rejected me, claiming to have known that I liked her for a while, she just didn't say anything about it because she liked the attention. Also, around this same time my grandfather went into the hospital, and my older brother was visiting home (my older brother is an all around asshole, but everyone loves him and treats me like crap when he's around).\n\nDay before Christmas, I decided it was time to end it all, but I didn't want to ruin everyone's Christmas. So I waited until the 26th, at three in the morning. I took about 10 painkillers and tried to drown myself in a bath tub by filling it with water and holding my head under the faucet so that if I struggled, I would hit the faucet and stay in the water. Must've lasted at least two minutes because I start to feel myself black out, but the pain in my chest became too much. I jerked my head back from the tub and gasped for air. The first thought I had was wishing that the girl I had liked and my brother could feel the pain I felt, and that my grandfather's pain would stop. Why should someone who's led a good life suffer while these selfish people get by okay?\n\nNo one found out about what happened that morning for months, and even today, very few people know about all of this. This is the way I want to keep it (hence the throwaway), so if you're reading this and know who I am, please refrain from posting any personal details about anyone.\n\nFast forward to today, where I'm doing much better, enrolled in a good college, and studying hard. The girl I had liked and I are good friends, my grandfather passed away last August, and my brother and I still aren't on talking terms, but that's another story. If there's anything I've learned, it's that hate will do you no good. If anyone wrongs you, don't hold on to it. Let it go, and live for the present, not the past.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yfcee/"}