{"id": "t5_2qh1i_t3_4e8oip_t1_d24m42x", "creation": 1460761154, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "graciemae16", "text": "I stood on the roof of my house, finished writing my note and left it there. I just stood on the edge, closed my eyes, and felt the breeze. Just about to step off and my brother scoops me backwards, sobbing.\n\nFirst thing I felt was, \"aw shit, made my baby brother cry.\" Then, my parents came sprinting upstairs and my dad told me to go pack a bag, so we could go to the hospital. When I came down, he was sobbing - the last time I'd seen him cry was at his own dad's funeral. He kept asking me why, and I just kept saying I didn't care anymore.\n\nTwo weeks later, I still have my moments but I realize how much I'd miss my dad. Sometimes I feel guilty for knowing that I'd miss him more than the rest of my family, but he's my best friend. He told me if I had died he'd be right behind me, and then I felt bad that he has to wake up and worry about me every day.\n\nMy mental illnesses got in the way of my relationship with a guy I'm sure is the love of my life. I hated kids and weddings and love until I met him, and I let my insecurities get in the way and we had to break up. He won't even speak to me anymore, but my friends have all told me he's worried sick, and I know he loves me a ton. I'm sure my parents told him to give me space why I get healthy, and I wish he was here every second. With a clearer head (and a severe depression and anxiety diagnosis, along with medication) I realize that the pain would leave me and just manifest in those I love. I got a puppy and she helps on those bad days, but I miss my ex so much every second. It gets hard to breathe sometimes. If you're reading this, Greg, you were a bright light in the darkness for me, and I can never say thank you enough times for the happiness you gave me in those 8 months.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d24m42x/"}