{"id": "t5_2qh1i_t3_4e8oip_t1_d1yjrdc", "creation": 1460389551, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Maebenot", "text": "My heart breaks for you. I understand how hopeless this must feel and I think your feelings are totally normal given these circumstances. However, I do think you are catastrophizing somewhat with regards to your marriage potentially ending. I certainly don't know enough about your relationship to advocate or encourage something as serious as divorce but I do think there are some things you can bear in mind. \n\nFirstly, failure of something like a marriage is not only incredibly common but not an indictment of you as a person. It takes two people to create a healthy relationship and it sounds like your wife is not willing to do so (for example where she refuses to work on her own issues and scapegoats you instead). Secondly, there is certainly no guarantee that during a divorce your wife would gain sole custody, particularly if you are a competent parent with a good relationship with your daughter. It would be very difficult for her to legally relocate states away under any sort of shared custody terms. If the only reason you are not thinking of taking further steps is fear of being victimized in court due to your gender, I suggest consulting with a lawyer about typical divorce settlements in your state. I am going to reiterate that if you are a 'burning effigy' or 'dying a slow death' you are NOT standing up and being a model for your daughter already. As a child of a narcissist, I personally would have been better off without my MOTHER than without my enabling dad. Kids learn more from what they observe you do than what they hear you say and as she grows up she will become more and more aware of how unhappy you are. \n\nI hope counseling and introspection is effective for you, and I hope you find the peace and happiness you deserve. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yjrdc/"}