{"id": "t5_2qh1i_t3_4e8oip_t1_d1ybqis", "creation": 1460374658, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Linnil01", "text": "I've tried 2 times. It was a time in my life when my girlfriend had broken up with me, I was 17, and I became severely depressed and had panic attacks. I thought noone would ever want me again and the loneliness was brutal and crushed me completely. We still lived together and I had to watch her bring home lots of boys, I am a girl so that felt extra weird, did I drive her to become straight?\n\nWell onto det gory stuff. We had a extremely small bathroom and no ventilation in it, i covered it all with towles and had a small gas container, turned it on and waited. I passed out and then i heard screams suddenly and someone hitting me in the face, it was my ex. She had come home one day earlier from her new BF. I begged her to not call an ambulance and the condition was that i seek help. I hated myself even more, I could not even kill myself properly, and noone loved me. Fastforward a bit. I got diagnosed with borderline (wronly so). And got better. I met a boy and started college.\n\nSuddenly it all crashed. My boyfriend broke up with me and I started to fail every exam in my university studies. That meant I got no more money for my studies. I decided I was done with life. Fuck everything. I had read online that you could kill yourself with bitter almonds, in high doses it becomes like cyanide. So i stuffed myself with a lot of pills first, anxiety medication and then 400 almonds. It was a hard job I tell you. I felt like my breathing was stopping I stopped seeing straight, everything became light and I was so happy cause I would get to die. I don't believe in god or another life so I was excited for the fact that everything would just end. Suddenly my phone rings and stupid and \"high\" as I am I answer it, it's a friend who hears I sound strange. She calls an ambulance and they break into my apartment and I am rushed to the hospital. Got my stomach pumped and some kind of clear red IV that would counter cyanide. I once again hated myself and was so disappointed I failed. I was the hospitals come and must see for all doctors, they have never heard of anytyhing like killing yourself with almonds. A shrink at the hospital came over and talked to me. I took her about 10 minutes and she suspected I had Bipolar disorder.\n\nShe was correct.\n\nToday I still struggle with life but realize that when everything feels like I've hit bottom, just wait. It will get better, and get help!! I have medication that have saved my life today and a wonderful fiancee and soon a degree in sociology.\n\n( sorry if my english sucks, I'm swedish)", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ybqis/"}