{"id": "t5_2qh1i_t3_4e8oip_t1_d21jy7i", "creation": 1460575353, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mistychuu", "text": "Honestly? It was the fact I survived. I was heartbroken, devastated. Not because of the people I hurt, but because I still hurt and I was still there when I didn't want to be anymore. I couldn't understand what I did to deserve to still be here when I just wanted it all to end. I thought all those pills I swallowed would end me and they didn't.\n\nI'm only 21, but after a traumatic childhood and the revelation months earlier before my suicide attempt that I was Bipolar, I didn't want to be there anymore. I was tired of being strong and believing and hoping that it would get better in time when I had been hoping that for years. This happened 4 months ago.\n\nIt was very difficult to deal with in the aftermath because I realized it didn't fix anything and I really scared the people close to me. And it wasn't an option for me anymore. And that was terrifying because Suicide was always looked at by me as that 'friend' who would be there still if I couldn't take it anymore. And I no longer had that, because I survived. \n\nThe experience itself changed my life for better or worse because it was the first time I had actually TRIED and nearly succeeded when I had never acted on the thoughts before that moment in time. \n\nI don't know what kept me here, but I'm happy I stuck around because life has finally started to shape into the way I wanted it to be. It's still unpredictable, my mental illness (which by the way, turned out to be co-morbid with Borderline Personality Disorder as well) is never going to go away, and I need to address incidents of the past in therapy...but I'm truly feeling as if I can forgive the past for hurting me so much and move on and look at the present more.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d21jy7i/"}