{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8k3t", "creation": 1460362656, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "N42147", "text": "I didn't think of a phrase, I was simply bummed out. As I came to, my internal monologue was like \"no, no, no, no, I fucked it up, this can't be!\"\n\nI was sure I took a lethal dose. As background, I was undergoing negligent psychiatric treatment against the advice and will of my wonderful psychologist. I took several pills, the main were a large blue one to normalize an anomaly in brain waves caused by irreversible brain damage to the right front lobe. The other two were an antidepressant and clonazepam. I was very depressed for many valid reasons, going through the darkest point in my life, and therapy was giving me a glimmer of hope that the medicines provided by my apathetic toad of a psychiatrist extinguished. \n\nAfter a long period of slowly losing what I liked about myself and one too many disillusions in my love life, I decided the daily struggle wouldn't improve significantly and I was no longer willing to put myself through it. I fancied the idea of the ultimate rest for my weary soul, the end of my sorrow through my autumn leaf landing. \nI was taking a massive dose of 8 of the largest clonazepam pills available per day, but that night I took more or less 70 pills, all that I had left at the time. With every nightly dose, I felt an overwhelming cloak of lethargy lull me to slumber within minutes. I felt it so much stronger than any time before and I dedicated my brief next minutes to cherishing that which had been good in life and making peace with my departing. \n\nAround 18 hours later, I woke up still immersed in deep mental fog though acknowledging my continued existence, and it took several minutes before I was able to formulate my first thoughts about it. \n\nImmediately after, I ceased taking all medications against all medical orders (I know now it was quite dangerous to quit them like that, but to be fair it wouldn't have made a difference at the time, more encouragement even), only to endure several torturous weeks of adapting my body to live without benzodiazepines. \n\nToday I don't feel the depression I felt. I do feel I have a depressive personality beyond my social mask, one that dwells deep inside and I allow only for myself to see. I have never felt I belong in this world, even in times of joy when I felt loved and generally in plenitude. There was always this ghost gnawing at me, occasionally reminding myself of its permanence. I simply don't belong here. \n\nBut I have found certain focus that keeps me going. In this thread is an amazing post that invites us to recall the inherent and objective beauty in this world. This is a wise thought, and though I probably couldn't have simply externalized it in any manner, let alone such an effective one, I believe that too is what keeps me alive today.  ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8k3t/"}