{"id": "t5_2qh1i_t3_4e8oip_t1_d1zfdpv", "creation": 1460434697, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Wildcard709", "text": "Well, this is my story. (TL;DR I am a homeless youth with life threatening depression, you can figure out the rest)\n\n\nI grew up in a well-off family (not like rich or anything, be we had enough) living on a 5 acre (~20200m squared) farm with my mum, dad, younger brother and sister. At the age of 8, my parents split up, and mum took us kids. We moved to the Gold Coast, Australia, where to this day, I still live. Moving to a new primary school was tough, since I was the quiet type. \n\n\nAll through school, I was bullied for not having friends, and I couldn't make friends because everyone was an asshole. By this point, both my original parents had found new partners, and I rarely saw my dad. I have been dealing with depression since about my parents break up, but have never told either about it, because they weren't the type to care, so I left it to myself.\n\n\nI told myself that I would try to make friends during high school, and I did. But my life took a huge turn for the worst after I left school. During my entire life living with my mum, there had been lies flung between her and my dad. Because of that, I had learnt to never trust anyone. The trust issues go further, but I might leave that for another time.\n\n\nThe first weekday (so a Monday) after I had finished Grade 12, I had a very serious ankle injury, where I had torn almost everything in my right ankle. I was in bed for a good few weeks. While I was still recovering, my mum had told me that she doesn't want me living there anymore, and that I had to go live with my dad. So I moved to live with my dad, just months before my 18th birthday.\n\n\nFor the next couple of months, I was living at my nan's place (he lived with his mother due to financial troubles) where I had gotten a job. But a couple of months into the job, they had found a better staff member, so I was laid off. For about a month or two, I had been looking for more work, but nothing was suitable for me. \n\n\nThen, one morning, I woke up to my dad telling me; \"We can't have you living here anymore, you need to leave.\" I was given a day to pack my stuff and leave. \n\n\nIt hadn't hit me at that point, but I had ended up homeless, with no roof over my head, no food to keep me alive, and not even a single cent to my name. As I prepared m6self for the first night sleeping alone in my car (thank FUCKING god I had a car and a license) I got a call from my mum, she had heard about what had happened, and told me to come back around to her place until I found a place.\n\n\nSo I spent a day or so looking for places, until I came across a homeless youth service based on the Gold Coast; the [GCPHY](http://www.homelessyouth.com.au) (Gold Coast Project for Homeless Youth). I called them and moved into the house that day.\n\n\nFast forward a few months, I had moved out of the Crisis Shelter (Lawson House) and moved into a Medium Term Shelter (Jessica Dunne Lodge), I had started to yet my life back on track, and I met some really great people within the system. \n\n\nThere have been days/nights where I feel good, even happy, but there have been times where I have wanted to end my life. One of those nights, I felt so bad, I almost drank a bottle of Bleach. Before I did though, I had told one of the workers, and I was sent to Hospital so I would not try to harm myself any further.\n\n\nFor what I thought after being sent to Hospital, my first conscious thought was; \"Maybe it was a better idea to end myself.\"\n\n\nIt has been about 2-3 months since that had happened. I still live in that shelter to this very moment, and I still get thoughts of wanting to end my life. Yes I have had good things happen since then, aswell as bad. But the main thing is now; I'm still here, and I wouldn't be here telling you my story if I had gone through with any of my thoughts.\n\n\nAny that want to say this is not true, go right ahead. This is my true story, what I have had to go through to get to where I am today, is 100% true.\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1zfdpv/"}