{"id": "t5_2qh1i_t3_4e8oip_t1_d1yok4h", "creation": 1460395915, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AnArmyOfWombats", "text": "Tl;dr: Ramble about depression, addiction, and emotional despondency.\n\nI'm pulling out of a 4 year depression. The sadness was what I wallowed in for the first two years. \n\nThen, when it came, I was numb. The transition was both interesting and terrifying. I dissociated from my actions, feelings, and even some thoughts. \n\nIt felt like I watched myself as I bought beer to cope with my (perceived) failure at life. When I didn't shower, eat, or clean, I was an outside observer, looking in to (sometimes screaming at) this body. My body. \n\nI didn't want to deal with how I felt about life. So, I would take a week, or a few, and subsist on beer, mac and cheese (from the corner store where I got the beer). \n\nThe fun part is that it wasn't complete dissociation, that I could've dealt with. Each time I stopped for beer, my inner monologue resisted.\n\n*No, you don't need this.* *Well, there's the beer aisle.* *Well, I'm drinking this 6 pack, it's not a good idea* **4 beers in** *Yeah, I'm not getting anything done, I should be working or looking for work* **6 pack finished** *Again, another day wasted, well done...* **FUCK** \n\nEvery beer, I knew *Fuck, this isn't helping* The voice got smaller as I became more inebriated. I wanted to forget that critical voice in my head. I used to meditate, but things became too much and that wasn't in the cards any more. So, I went quick and easy, I drank.\n\nSilence is what I desired. Every thought, twisted to something negative, eventually numbed me. I forgot how to hurt with each self-flagellation. The anger I felt toward myself, this fierce pride and shame, I needed to distance myself from it. I needed to quiet my mind.\n\nI've been in therapy for a few years, then DBT, psychoanalysts, groups, etc. I'm lucky. I've talked and been heard, about trauma, experiences, and even how I think. \n\nI'm still drinking, but less often. I can handle things a bit better these days. I try not to disappear for weeks. It's contained to a few hours. \n\nI still struggle, but I'm not stagnant. That's ok.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yok4h/"}