{"id": "t5_2qh1i_t3_4e8oip_t1_d1yqb8i", "creation": 1460398192, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pmmeyourfoodz", "text": "I actually contemplated killing myself on Saturday last weekend. \nI have always felt weird and as if I didnt belong anywhere or to anything. I had plans to watch martial arts movies or the new Star Wars movie with some friends who cancelled last min. \nI was sad but decided to just go to bed early and sleep off my sadness. \nI woke up and the house was completely empty and my sadness for some reason had grown into the desire to see if maybe I belong in death? Maybe death would accept me better then life had been? I walked out side and say in the cold for a long time. Even picked up a razor blade and turned it around in my hands for a bit. I called one of my friends and cried to them on the phone about how I just wanted to end this feeling of pain and suffering in life. They told me to calm down and breath. That I wouldn't feel this way forever and it was going to be ok. They seemed annoyed with me so I apologized, and told then I loved them and got off the phone. \nI only wanted to stop or numb my pain and death was \nthe only way I knew. \nThen I remembered I had a klonopin someone had traded me a while back so I took that and more Tylenolpms then I remember. \nI ended up writing this before passing out for almost 24hrs straight. \n\n\n\"I need help\nI need to fucking yelp\nAnd scream\nAnd cry\nAnd destroy my own eyes\nBc I can only see\nNothing but suffering & demise\nI need help\nI need a belt\nTo throw around my neck\nSo I can stop viewing \nOnly this suffering and demise.\nNo one can give me help\nOnly I can help myself\nBut I'm not strong enough to deal with anything that is tough. \nI just wanted to be held\nSo that I could get well\nBut no one wants to hold me\nUnless they can fold me\nInto shapes that help them\nFeel better but only\nFor a fleeting moment.\nI'm this time we share together \nI only wish it could be\nForever and ever and ever.\nWhat does it all mean? \nWhat is the point of it all? \nIf everything goes in circles\nWe're only doomed from the start. \nThere is no beginning\nThere is no 32nd\nEverything is \"one\" \nNothing ever began and nothing ever ends. Why should I keep trying\nIf I'm only going in circles?\nAt least in death I can find\nSome meaning in the circles.\nIf love is the all mighty unifier\nThen death must be the separation. \nI will never ever be able\nTo fulfill my reparations. \nTo those I have hurt\nTo those I have burdened.\nAt this point in time I feel I must close my own curtain. \nOn my life \nOn my love\nOn my belief in the greater above. \nFor enlightenment is a lie\nTold to those who need it to survive. \nLife is only suffering\nAnd death is the only true cry\nFor those who suffer truly\nAnd can feel the world's worst sigh. \nI'm ever so sorry to tell you\nThis is my last goodbye.\nPlease know I was finally able\nTo find my own peace of mind.\"\n\n\nI woke up it was night so I was really confused, but my roommate and his kid were in the kitchen and when I walked out his 4yr old ran up to me and said \"HEY IM SO GLAD YOURE AWAKE NOW COME WITH ME!\" and my roommate asked me if I was ok. I showed him my poem and he hugged me. He went to his room and dug out poems he had written when his ex cheated on him about wanting to die. We made homemade ramen and chicken fries and watched TV with his kid. \nI was glad I didn't kill myself bc that ramen was the best I've ever had.  And it would suck for my roommate to have to deal with my dead body. That was really inconsiderate of me. I think the ramen made up for it though.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yqb8i/"}