{"id": "t5_2qh1i_t3_4e8oip_t1_d20z73s", "creation": 1460543306, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "loony_what", "text": "Back in summer, I tried to do it with the car. I drove down a major road which ends in a roundabout. I pressed the gas till I was going 150 (km/h) then pulled the steering as hard as I could. I closed my eyes when I did it, and did it when I was entering the roundabout... It was night, so there were no other cars. \n\nThe fucking thing didn't flip. It spun around and almost slammed into the fence. The first thing I remember, was the terror. Once I yanked the wheel I was terrified it was really happening, and when the screeching stopped I looked up, and it was as though in the aftermath of a cataclysm. I saw the smoke, the tire tracks, the stars above (cabrio banger), realized I was still alive, and couldn't begin to understand how was that possible. I stayed in a trance like state, until my senses returned to normal, still hearing the music playing. Eventually, some other people drove in the roundabout and were honking at me since I looked as though I'd thrown the car about, which made me snap out of the trance.\n\n\"You could've pressed the gas harder\" was the first thought, followed by guilt over thinking, I'd just left my friend's house. How would it have been for them, to get a call in the morning that I died in a car crash just as I was leaving their house? How would it have been for my parents to hear that I killed myself in a foreign country?\n\n The guilt almost made me throw up, but it also forced me to realize that I have a hell of a lot to lose if I go through with that again, and that death is the one thing that can't be taken back. I still don't know how is it possible to be still alive. How did I make it without a scratch; but in them 3 seconds when I was expecting to go head first with 2 tonnes of metal on top of me, the fear of losing my life was greater than the wish to die.  Never tried it since, and although I had thoughts after that moment, and impulses, I never took them seriously ever again, having known that fear and guilt.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d20z73s/"}