{"id": "t5_2qh1i_t3_4e8oip_t1_d1y56po", "creation": 1460351979, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 23, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I once tried to commit suicide in front of my brother. I didn't realize I would scar him for life but I wanted to end it (I was 14 and he was 6). \n\nThat school year, I went through a family crisis (my parents ALMOST divorced). I was bullied constantly and all the adults did NOTHING but tell me to \"man up\".\n\nI beat up one of my bullies and was put on six months probation and home based for a week. Texas takes \"Zero Tolerance\" seriously and \"self defense\" doesn't exist in schools. \n\nI thought the bullying would end there but it was just the beginning. My classmates knew what was in store for me if I fought again and did ALL they could to antagonize me. They knew I couldn't fight back; they wanted to get me out.\n\nAfter getting another bad report card, I decided to end it. I tried to jump off the stairs. I tried to stab myself. When those things didn't work, I decided to hang myself.\n\nWhat stopped me?\n\nThe Holy Spirit and my brother's crying.\n\nWhile I was choking on the rope, I heard a voice saying \"Don't do it. You got something great coming. Just stick around\". The voice was very calming. My brother crying out for me helped too.\n\nThough I didn't kill myself, I went through a HARSH 15 year addiction to porn afterwards. Porn was a great stress reliever. What started as a means to get over the crap I went through became mandatory. Over the years, I lost relationships with great people due to my addiction.\n\nBy the grace of God, I got over my addiction coming up seven months ago and my life is back on track.\n\nPeople say that black people don't commit (or attempt to commit) suicide are wrong. Lee Thompson Young did. Don Cornelius did. Ken Griffey, Jr. almost offed himself.\n\nAll I wanted that time was for someone to listen to me.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y56po/"}