{"id": "t5_2qh1i_t3_4e8oip_t1_d1z7f10", "creation": 1460422084, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Wild_Irrelephant", "text": "Wow, so many things you said hit home with me as things that I've struggled/failed to convey to people who have not been there before. \n> I find it excruciating to bear witness to then it can only be a drop in the ocean in comparison to his daily struggle.\n\nThis is so incredibly compassionate of you. In addition, I found that some people's brains can't rationalize that level of pain. This, of course, makes sense because they haven't been there, and that's fine. But many people who can't rationalize your pain end up rejecting it. I had a girlfriend who didn't like it when I said that I was \"sick\" because she couldn't wrap her head around the idea of it being an external affliction, something that I couldn't just stop doing. To believe somebody when they say it hurts, that means so much. \n\n>I always remind him that his condition warps his self perception...[and]...although it is the condition causing this that this point alone does not detract from the reality. It doesn't feel any less real to them\n\nAgain, such a familiar thought. The phrase that has stuck with me was in the context of suicide, and said something to the effect of that low being the result of a collapsed perception ([Here's the link to the TED talk](https://www.youtube.com/watch?v=D1QoyTmeAYw)). I would explain to people that I felt my life had become one dimensional: I wasn't capable of doing anything except suffer. \"You have so much to live for\" diminishes really quickly if you don't have the ability to perceive a thought like that. To help pry somebody's perception back open is, I'm sure, very challenging, but what an amazing thing to do if you can be successful. \n\n>This is not a broad stroke at anyone experiencing mental illness and it is important to remember that EVERYONE is different and have different needs.\n\nBeautifully stated. I've fancied myself a bit of an expert on the topic because it's been such a huge part of my life, but I realized that having seen the light doesn't translate into being able to help others. I'm only an expert of my own suffering. Everybody's pain is unique and as real as they say it is. I appreciate this portion, and your entire post, because it's helped me gain perspective in areas I may not have even realized I didn't understand.\n\nAnyways, sorry for the long reply, but I'm really passionate about this topic, and I was really moved by some of the things you said. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1z7f10/"}