{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8uyp", "creation": 1460363857, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CalebAK47", "text": "I've never personally attempted suicide but I've been through and still go through my own bouts of depression and my best friend has struggled with it a lot more and has attempted to kill himself twice now. For those wondering, he's doing much better now and I'm doing alright. Every day has it's own challenges, big or small, but I always try to remind myself of the quote, \"This too shall pass.\"\n\nI can't quite remember the details of the story/origin behind it at the moment and don't feel like looking it up but it's something along the lines of a king was bored with his life so he told someone to make or write him something he could look at or read that would make him sad when he was happy, and also make him happy when he was sad. After puzzling over it for some time they finally came back with a ring for him that was inscribed with that quote. \n\nIt has always been comforting to me, because it has always proven itself to be true in my own experience. It may help some, it may not, I just wanted to share it either way.\n\nEdit: I know I probably shouldn't share or say what I'm about to say because some may find it in poor taste but fuck it, I'm going to anyway because I'm laughing and I want to try to help others laugh as well. Even if it's only one other weirdo like me out there somewhere in the void, it'll be worth it to me at least..\nMy Dad has gifted me a dark sense of humor and he recently passed away which has been really hard for me. But reading through this thread, seeing all these quotes from people who had just tried to kill themselves and the inevitable \"it can only go up from here\" comments, I can't help but think of what my dad might have said and just smile. Like, \"Sure, life may go up again, but that'll just give me a higher place to jump from.\" I realize some, probably most, don't find that funny. But I do, because it reminds me of my dad and I really miss him.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8uyp/"}