{"id": "t5_2qh1i_t3_4e8oip_t1_d1ybqek", "creation": 1460374649, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 516, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lzrae", "text": "I've been extremely depressed lately. I've had a pretty good handle on it for the past 10 years, but I've felt it crumbling. Anti-depressants haven't been helping. \n\nMy family and friends keep me from doing it. I've always thought of suicide as the most selfish thing you can do. But lately I feel justified in thinking that wanting to keep someone alive against their will is selfish too.\n\nI know I can feel better again, but in the meantime I'm just trying to survive. Thanks for listening.\n\nEdit: Thank you all for the amazing advice. (Omg, I just swyped 'advice' and it came out at 'suicide' -_-)\n\nThere really is a lot of good stuff in this comment thread. I hope that anyone who is having their own problems, but can't ask for help, finds help in these responses. You're not alone.\n\nYou guys are all really amazing and I appreciate your help more than you know. \n\nEdit 2: Holy shit cakes, my first gold. Don't make me cry, guys. I'm still technically at work! I love you all, seriously. I don't know you, but I wouldn't be able to get through each day without your help.\n\nIf you need help or just need to vent, please message me. I will gladly offer an ear. I just don't want anyone to suffer alone. I'm so glad I got so many responses. You really hit me through not only today, but I feel reinvigorated. I want to pursue my interests again. I can't tell you guys enough how much that helps.\n\n...\n\nOk, I can cry now. Love.\n\nEdit 3: This may be swept under the rug by this point, but I was so overwhelmed by the love I got, I made a video for anyone who may also be feeling shitty. Just a long ramble from me about how wonderful you are. Thank you.\n\nhttps://youtu.be/mf3KBloixD4", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ybqek/"}