{"id": "t5_2qh1i_t3_4e8oip_t1_d1ykpq9", "creation": 1460390849, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tina_the_fat_llama", "text": "I was 15. Coming near the end of my sophomore year of high school. It was 3:45 am. I had went down into the basement of my father house where the fun safe was located. My father taught me the combination in case of any emergencies in which I would need a gun to protect myself or the house, or grab important documents from it in the event of some disaster.\n\nI grabbed the first pistol I saw, a colt .45 that was my grandfathers. Now we kept a separate ammo can but in the safe was a blue box of old ammunition for the pistol of my choice. I inserted a single round into the chamber and closed the bolt.\n\nThe next 10 seconds felt like years. It seemed as if time slowed down or even came to a complete stop around me, as if I was the only one not affected by it. Any and all sounds and bent noose just ceased. \n\nAll of that was just the 10 seconds it took for me to put the gun to my right temple and pull the trigger, hoping for nothingness.\n\nAll I heard was a click. I pulled back the bolt and the round came out. I checked the back of it only to see a dent from the firing pin in the primer. \n\nI just broke down in that moment. I was crying on the floor for about an hour until I realized my dad would be getting up soon for work. I went back to my room and laid in my bed, only able to think about what had just happened. I went to school the next morning as if nothing happened.\n\nIt's now been almost 3 years since that. I am now 18 going on 19 in a couple months. I'm now a college student or was. I was recently put in a psychiatric ward because the first appointment I ever made with a counselor in an attempt to finally get help, led  to the fear of me killing myself again. \n\nI am now on medication. Not really doing better so I'm going to ask my doctor about trying different medication. I have moved back home to go to community college and work while I get things in my life sorted out.\n\nNot a day goes by where I don't think about me shooting myself 3 years ago. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ykpq9/"}