{"id": "t5_2qh1i_t3_4e8oip_t1_d1yenxn", "creation": 1460381567, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "HadakaMiku", "text": "I'm sorry if this is too unrelated, but I have a story to tell about something that happened last night. I make my point in the last paragraph.\n\nI was under a lot of stress. I started out fine, but these thoughts started invading about these scenarios going wildly out of control and resulting in me being deeply hurt. Every time I caught myself, I would try to calm down and think of positive things instead. This went on for a while.\n\nThen I heard my two cats in another part of the house have a huge fight. This really set me over the edge, but not at first. First I tried to think of it as a test to see if I can think positively even after that happened. What I was really doing was suppressing my negative feelings which prevailed anyway. I started crying hard and felt really low. It felt like there was something deeply wrong with me and that i was alone. \n\nThen a really silly idea came to me. I decided to go to my dresser and pull out this stuffed bunny that I used to adore when I was a kid. (I should mention that I'm in my 20s and male.) I haven't thought about this thing since I was somewhere between 5 and 10\n\nAnyway, I slept with my stuffed bunny last night and did childish things like hug it, rub noses with it, and just lay there staring into its eyes. The therapeutic effect this had on me was enormous and kind of unexpected. After just a few minutes, I felt this amazing sense of security and that everything was going to be alright. This isn't something I feel like I could've done with any living thing I know.\n\nAt first I just laid there staring at it and just cried. Except this wasn't a bitter cry. It felt more like a release. It was as if this bunny was absorbing and deleting all negative feelings I was having. After that, I felt that sad-happy feeling like in the movie Inside Out. It felt like this bunny was really alive and had a soul and understood me. Whether or not this is actually true is completely irrelevant at this point. The feeling was real, and that's what mattered. I brought myself to tell the bunny out loud things like \"thank you\" and \"I love you\".\n\nThis was a powerful moment for me that I'm glad I had. The reason I'm saying all this here is because it might help you guys immensely to find a way to get in touch with the good parts of your inner child. Also, don't underestimate the importance of social bonding as it's a basic human _need_, not just a nice thing to have.\n\nEdit: changed \"positive living things\" to \"positive things\". Thanks phone...", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yenxn/"}