{"id": "t5_2qh1i_t3_4e8oip_t1_d1ykxmk", "creation": 1460391145, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SwedishSanta", "text": "Hello, I realize I am a bit late here for this comment to get noticed but I decided to share my story anyways. I moved from Sweden to Spain when I was a young lad. The bullying started already in my first year I went to school there but it escalated horribly during 6th to 9th grade. Somewhere around 7th grade I was at my lowest, mentally speaking. I was the weird Swede, under-performing in math and Spanish classes and I was small in stature. The kids and even the teachers picked on me every day. One time, my classmate pushed my neck so hard, he dislocate my neck right in front of my teacher. The teacher saw the whole thing but told my parents the same day that I hurt myself in my sleep. I just had it. I had to wear a neck-stabilizer (what is it called again?) for a month. It was so embarrassing. I was sad and angry and I felt so alone. I got no support from nobody. I decided to jump off the 9th floor later that day (where I lived back then). I always pondered on suicide since I moved to Spain, sitting on the window ledge contemplating if I would feel relief by jumping. However, that day I was determined. I came home, ate my most hated meal (lentil-soup) and went to my room. I was convinced life was against me. I was angry, sad and hated everything. I hated Spain, my parents, my sister, my classmates, you name it. I went to the window, opened it and stood on the ledge. I was so filled with anger and hate I never stopped to think, I just took one big step outside but suddenly my sister pulled me in. She said nothing during this and ran to mom to tell her what I was doing. I was sitting on the floor and my family members stood around me. I had no idea what my parents where telling me as I was so consumed by my emotions. I had one thing clear in my mind, though... I wanted to kill myself but not in front of my sister.\n\nI was going to try again soon after, when my sister would go off to a camp or event of some sort but my parents \"fixed\" the window so I couldn't open it and attempt to jump again. Sometimes I get flashbacks from this day and I remember this in detail. I get a clump in my throat thinking about this day, still.\n\nA year passed, the bullying continued but my parents told me I may go back to Sweden the year after if I get passing grades. So I decided to stay alive because I had hope that Sweden could give me back the happiness and hope I lost. This might sound like a cliché but when I started high-school in Sweden, all my sadness was gone. I felt free. My grades where doing better than ever, I had good friends and was never bullied.\n\nI am glad to be alive. I have done some traveling, seen beautiful places and got myself a wife from Canada, who is my everything.\n\nTL;DR: My first conscious thought was to try to jump again from the 9th floor but not in front of my sister", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ykxmk/"}