{"id": "t5_2qh1i_t3_4e8oip_t1_d1y6hq7", "creation": 1460355537, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "makes_witty_remarks", "text": "Back when I was a wee teenager, life was going pretty shittily for myself. Made a public post basically saying goodbye. Cousins got a hold of it, and it got back to my mother. Cops were called, but that didnt help. All i got was a stern talking to because they thought it was bullshit.\n\nFast forward 3 hours later, i snuck a large unopened bottle of Excedrin Migraine out of my mothers closet after i took a shower. \n\nStart downing the whole thing. 2 Pills every 2 minutes of something. cant remember too many details. I finished the bottle and started to drift away.\n\nIt messed me up so much i started hallucinating. I was seeing the fibers on my bed moving and everything. Thats the last i rememeber before waking up im assuming about 2 hours later opening my 2nd story window puking out of it. Dry heaving for 30 minutes straight. Horrible times were had. Pass back out.\n\nWake up for good. Couldve went about my day and went to school, but i didnt want people to see me so i admitted to my mother what happened. She honestly didnt believe me and still thought i was lying. She still ended up calling 911 and the paramedics came to my house to check my heart rate (because i felt my heart was beating way faster than normal)\n\nDidnt go to school, but my mother did take me to the hospital 3 hours later. I had to drink chalk to flush my stomach. And in my state since i was still a minor i had to be committed to a psychiatric hospital for evaluation. Got to spend my birthday in there. It didnt help. I was on sleeping medication after that, and by the time i was supposed to be released, i was still so ashamed of facing my peers that i decided to OD on that medication as well, tell them, that way i would have to stay there longer. \n\nThese days im doing slightly better. 9 years have passed, i still have my moments. Being bipolar is pretty shitty. I have my wonderful days where i feel like everything is going to be alright, and then others are more along the lines of \"Wow i should probably go and overdose on drugs or just blow my head off\"\n\nThankfully ive found love and faith in my family now and understand truly just how horrible suicide would be. Sure it ends my suffering, but it starts new suffering somewhere else. My logic stands on the line of \"I know how shitty i feel, i wouldnt want someone else to feel the way i do, because if i want to end it, so would they, and i dont need to put that on anyone\"\n\nAlso be careful who you confide in telling your personal deep life to. Had an ex once use it against me when we broke up\n\"You should have died all those years ago you piece of shit\"\n\nWent months saying she was right. Fuck those kinds of people. Real dick move.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y6hq7/"}