{"id": "t5_2qh1i_t3_4e8oip_t1_d1y9rcj", "creation": 1460367557, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CritFailingLife", "text": "That makes a ton of sense. My husband hasn't gotten to the trying point, but his depression has been bad enough at times that he's started wishing he could. It's definitely taken a toll on my wellbeing, too. Stuff like being scared when he goes on a drive that he'll decide to crash into something. That meant every time he went to work or came home or went to the store, I'd be scared. Trying to physically stop him from going on a drive after a fight once when he was really upset meant launching my 5'3\" body with everything I had onto his 6'5\" body, clinging as hard as I could, and biting his hand *hard* to get the keys out of it, worrying bout damaging him in the process but deciding to anyway, thinking \"fucking over his tendons and stuff would suck, but I think he'll die if I can't get the keys away from him.\" I lost sleep and didn't sleep as soundly because part of me was always listening for signs that he was in trouble. Even after getting him to get \"help\" (still waiting for that to actually be helpful as they haven't found an antidepressant that works on him yet and talking therapy has done nothing). I feel so much more exhausted and drained from living with his depression and I know it's got to feel a whole lot worse for him. After several years of them trying different meds on him, he basically seems to get side effects but never the positive effects from them. He seems to be internally learning how to cope with it all a bit better, but I'm still anxious as fuck when he doesn't respond to messages in the normal timeframe and I still put a lot of extra energy into worrying about him and about what things I should or shouldn't mention because of how they might affect his depression. It's exhausting and draining on both me and our relationship as well as its effect on him. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y9rcj/"}