{"id": "t5_2qh1i_t3_4e8oip_t1_d1ydjam", "creation": 1460379269, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "american_hatchet", "text": "My first thought after waking up (which shouldnt have happened) was to try it again and finish it. I had swallowed an immense amount of pills and alcohol the night before, and when I woke up I could barely stumble out of bed. I went to the bathroom to throw up, and before I knew it I had grabbed a shaving razor. Tried to pull the small dinky blade out and was slicing at my wrist. \n\nIt finally kicked in, \"What in gods name am I doing?!\" For one, it hurt so badly and wasnt doing a damn thing. And secondly, there was a panicked voice in my head telling me to stop, to just call anyone. \n\nI dont remember dialing my boss at work, but I apparently did and told her through tears that I would not be coming in. Then to 911. \n\nI had a roommate at the time that was completely unaware that any of this was happening. He had run out to get something for breakfast and was coming home when the first responders and police shows up. I remember them coming up the front stairs slowly, hands on their guns (they didnt know what sort of mental state I was in). They got me in cuffs and got me to the police car. I tried my best not to make eye contact with my room mate, but it happened. \n\nI was cooperative, never once resisted. I was just ashamed of myself. Why did I call anyone before it got this bad? Why did I talk to my room mate, my best friend? My family? \n\nI am very happy to say that I received (and continue to receive) great treatment. Lots of talk therapy, proper medication, many tools to help deal with the depression. Today I still deal with it, but I know i have people to turn to, thing I can do to regain control before it gets anyone near as bad as it was. \n\nPlease be safe my friends! Talk to someone. Call a crisis center or doctor or emergency line BEFORE you get to this point. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ydjam/"}