{"id": "t5_2qh1i_t3_4e8oip_t1_d1y9fbq", "creation": 1460366177, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ShadowHandler", "text": "Never shared the full story with anyone, but here goes:\n\nIn 2012 I was diagnosed with a neuro-degenerative illness and was told there are only a few dozen active recorded cases, and in past cases some patients have gotten something called [Morvan's Syndrome](https://en.wikipedia.org/wiki/Morvan%27s_syndrome) which leads to fatal insomnia.\n\nI was hospitalized for a month because my lung function was severely affected by the illness for a short time and I developed dementia and what appeared to be hallucinations (I don't remember most of my time at the hospital). Even then I was getting pretty decent sleep, so Morvan's syndrome wasn't on my radar until doctors told me it could become a real possibility (the EEG's showed I was getting very little REM sleep). Thankfully my lung function started to improve and I was released from the hospital, and went back to work. I was also given a drug called oxcarbazapine to help with the muscle issues.\n\nAbout 2 months after getting released from the hospital I started sleep walking. And really really walking. I lived alone and would open the door in my sleep, and walk off into the city. I'd usually find myself somewhere a mile or two away, and my legs would be in extreme pain, like I had been running. Needless to say it was pretty terrifying and I was basically getting no sleep.\n\nThis had been going on for a couple of weeks, and I was still going to work, and one Friday a work friend I had known for years asked me if I wanted to play games with a group of friends that night, and I said yes. When I got there I met my friend at the door and then slowly began talking to other people as they talked to me, and then I introduced myself by name to one guy and he laughed and said he knew who I was, and that we had all hung out together the weekend before... I had absolutely no memory of this, and I started to feel really fucking confused and nauseous and drove home. Later that night I woke up in a lawn with the sprinklers going... I was about a mile from my house. Sleep deprived, confused, and angry I walked back to my house and downed ALL of my pills.\n\nLess than 20 minutes later I was hurling... and because my muscles are fucked up, some of it started aspirating into my lungs... I fucking panicked and called 911. The fire station was about 2 blocks from my house, and it felt like they were there in seconds, I didn't even have to open the door... I just looked up and there were people in my house and I could see red lights flashing through the window.\n\nThey took me to the hospital, and started to give me some sludge stuff to drink that was supposed to keep me from absorbing much more... it was awful, and I was vomiting and aspirating a bit more, and I told them to stop. And the nurses kept doing it, but a doctor came in and told them to stop because the drug I had taken wasn't very potent in overdoses and because he didn't think pumping my stomach would help because I'd be okay.\n\nThe first thought wasn't thankfulness or hope, or anything like that... Instead I can only describe it as being entirely in the moment. Like nothing else mattered outside of the now, there was no work, no relationships, no responsibilities. I just felt very alive and conscious of everything that was going on.\n\nI stayed there overnight and half of the next day before getting released. Initially they said I would be there at least three days, but the afternoon after the night I was admitted a doctor came in smiling and said he had good news. He said he had spoken to someone about the oxcarbazapine drug I was taking, and that person told him that a very very small percentage of people taking it start sleepwalking. He told me to stop taking it, and said the nurses would bring me paperwork to discharge me and give me numbers to call if I again felt the way I had when I had been admitted.\n\nIt's been 4 years now, and while I still have major issues with the neurodegenerative illness, I have never had sleepwalking problems again since stopping my prescription for the drug.\n\n**TL;DR:** My initial thoughts before knowing I would be okay were a feeling of being in a totally surreal place and disconnected from life... and then that transitioned into very 'in the moment' thoughts and feelings when I learned I wasn't successful. Everything felt very... real.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y9fbq/"}