{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8glf", "creation": 1460362270, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "whatsweirdis", "text": "I was honestly mad. Mad that I was in the hospital with tubes down my throat, mad at the nurses for how they were speaking to me and treating me, mad that my mom was there crying and questioning me, mad that I had survived.     \nIt took some time to get over the anger, but once that subsided I figured that I now had a second chance so I would attempt to make what things I could control better in my life.   \nIt wasn't easy, and although I have a beautiful family, a stable job, finances under control, and don't abuse drugs I still get a random bought of depression. I had to realize that there's situational depression and non-situational, how to differentiate between the two and how to help it. When I attempted suicide I had lost my grandfather, my step dad was abusive, my boyfriend molested me and raped me once, and I was dealing with teenage hormones on top of it all. Instead of focusing on the grief of loosing a loved one I tried to self medicate with drugs (both prescribed by my therapist and street). That of course didn't help and I intentionally overdosed. Feeling depressed during times of trauma is okay. It's normal. It's healthy. It shouldn't be numbed..it needs to be felt in all its entirety. \n     \nNow when there's no outside reason to be depressed and you suddenly get sad for no reason, then you must focus on any and all the positives in your life. Retrain your mind to not dwell on things out of your control or things in the past that can no longer be resolved. Learn how to redirect your thoughts into something productive. I turned to my creative side and wrote, drew, sang, danced, anything to release the energy and feel better about myself. I still battle with it. Life isn't easy, but then again life would be boring if it were so I take it day to day.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8glf/"}