{"id": "t5_2qh1i_t3_4e8oip_t1_d1ygp9j", "creation": 1460385056, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "itshayjay", "text": "Late to the party but oh well,\nI tried to overdose on a trip to Thailand last year. I got drunk on the room tab, went down to the street and bought some drugs from the shifty little pop-up stores that appear at night, and took them on my way back to the hotel, washed them down with vodka and a little mixer to make sure I wouldn't throw up. I was feeling really emotional beforehand, as well as when I was back at the hotel wishing I could just die already, but actually planning it and going through with it was the most clarity I've ever experienced. I actually felt happy and excited that it was finally going to be over. I cut myself as well that evening, as well as writing to my best friend before I fell asleep.\nI woke up very late in the evening the next day, and just felt dread that I was still alive. The drugs had made me incredibly sleepy and my head felt so heavy I could barely move. I knew I now had to deal with the repercussions of what I'd tried to do, how upset my friend was, and how the bloody sheets would be explained when I checked out. It was more of the fact that I felt frustrated that it would look like I wasn't serious, and that I had faked it like a teenage girl for attention. More and more things from the previous night started to come back to me, but all I wanted to do was just disappear still. I had wanted to die, not pointlessly upset and inconvenience everyone else. \n\nEven now when things are finally better, the feelings and thoughts that led me to want to kill myself are still there, and I always wish I had died that night because then all the pain and suffering I will endure the rest of my life could have been avoided; the good parts are never really worth the bad parts. I haven't wanted to kill myself since but I think that may be because I haven't really been able to feel anything very strongly since; I'm still sad, I'm still happy, but never really passionately happy or devastated enough to try again yet.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ygp9j/"}