{"id": "t5_2qh1i_t3_4e8oip_t1_d1y4vwz", "creation": 1460351229, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "emo_reptar", "text": "\"Why did I stop\" \n\nShortly after realizing that I had survived my suicide attempt, I tried to better myself by reading book and playing video games. But that didn't last very long. \n\nAbout two months later after my first suicide attempt, I tried to do it again for personal reasons. And those reasons I didn't have control over. I was alone through the whole trip. I didn't have anyone. I wasn't a complete loner, I had friends that I would socialize with and hang out with, but none of them knew how I was truly feeling. \n\nAfter my third attempt, I decided to tell one of my close friends that I've attempted suicide on three different occasions. She just laughed and said, \"don't be a bitch, grow a pair\" after that I became more revert. I stopped hanging out, I stopped going out to parties. I was completely alone. I had no idea what to do, I didn't know what to do. I gave myself support for all these years and thoughtout high school I made, maybe two more suicide attempts. \n\nShortly after my freshman year of high school, I met a girl that helped me cope with all this pain and she understood everything. She didn't tell me to kill myself, she didn't berate me, she supported me all the way. I would sometimes call her in the middle of the night crying my eyes out because I was feeling depressed and she would help me. \n\nCome sophomore year, she passed away in a car crash. I was absolutely devastated. The only person that has ever helped me has just passed away and I was alone again. I stayed alone for another 2 years. I made it through by thinking about what she said and how to keep going and not stay in the past. \n\nNow, I have a close friend that truly helps me out a lot. She's talked me out of 2 suicide attempts and I forever thankful for her support. I don't know where I'd be without her support or my long time friend. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y4vwz/"}