{"id": "t5_2qh1i_t3_4e8oip_t1_d1yaxnz", "creation": 1460372051, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Eastoff12", "text": "I was fourteen when I attempted suicide and it was very much on an impulse. I had been thinking about it but I had not planned how, when, where etc. At the time, all I could think of was \"This has to end now.\"\n\nI overdosed on pills, then ten minutes later I went downstairs to tell my Mum as I believed I had failed and not taken enough. I don't remember much after that as I started dipping in and out of consciousness, but I properly woke up in the resuscitation room later in the evening (unsure of timings) in A&E to see an old man across from me, covered in blood and struggling to breathe. I was very disorientated, shocked and didn't really understand what was going on. I remember thinking, \"I failed and now I'm stuck here.\" \n\nOne thing that I would like to highlight is that the doctors and medical staff at the time were not very understanding at all. They were pretty patronizing (I don't want to generalise this to all medical professionals). I was repetitively told \"That was a silly thing to do, wasn't it.\" \"Lots of people's parents go through divorce and they don't attempt suicide.\" \"Have you learnt your lesson? Can you promise us you won't do it again?\"\n\nAs long as I can remember, my dad was physically and verbally abuse and an alcoholic. I WANTED my parents to separate so I could escape him but my Mum never had the confidence to do it. For years I would look after my mother when she had been physically hurt, crying and hiding from my Dad. However, she would never leave him despite numerous times she said she would. That's why I cracked and decided to kill myself because that was the only way I knew how to remove myself from the situation. I guess it might have been my own fault that the medical staff were patronizing as I didn't tell them this, I only told them that \"I did it because my parents are separating.\" \n\nFor anyone interested, my parents finally separated a few months after my attempted overdose and things have been so much better since.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yaxnz/"}