{"id": "t5_2qh1i_t3_4e8oip_t1_d1yamsj", "creation": 1460370977, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TIP-YOUR-UBER-DRIVER", "text": "This will probably get buried, but I just tried recently. I told my brothers at /r/uberdrivers that I quit, but I didnt.\n\nI went and tried to kill myself. I failed.\n\nMy first thought was, \"It will get better. It has to\". \n\nI went to a skyscraper here in miami and almost jumped off a very high balcony. I just acted like I lived there, it was surprisingly easy, and quite beautiful.\n\nWhy? I trusted a company called Uber. \n\nLike many others, I was an early adopter, bought a very nice car, provided excellent service, and made a  moderate living, i.e. 35k after cost. \n\nThen, Uber started the now infamous rate cuts. They even had the balls to say wed make more money. Quickly, the rates dropped 50% practically overnight, and the profit portion has dropped literally 80%.\n\nAfter cost, I make $30 per day, driving for 10 hours on average.\n\nI have to drive more, to keep a roof over my head, which prevents me from  applying to more jobs.\n\nIt's a vicious cycle that is hard to escape from. One month, my tires had to be replaced, all 4 of them.\n\nI replaced the tires at the expense of rent. I then started sleeping in my car.\n\nThen, further rate cuts. More hours needed to survive.\n\nNow, spring break is over. I lasted two weeks before I tried and failed to kill myself. \n\nSome days, I literally make $60 before all costs, driving 10 hours. I am sitting in my car at the Walmart here.\n\nPeople still think we make tons of money, and that's the worst part. People say \"damn bro nice car!\" or \"man you must be killing it this weekend!\"\n\nI can honestly understand why the Michigan driver did what he did. I wouldn't ever do that, but I see why he did. \n\nI'm going to kill myself, I just want to wait until the right moment. Like, I had a woman tell me how she took a pool ride that lasted 25 minutes through traffic and it was only .75 miles and it costed her $4 and how she loved it. \n\nI told her the driver probably made $1.50 from it, as they hadn't even picked up other passengers, she just shrugged \"oh really?! Woooow\" in a fake tone.\n\nMy favorite thing, and what keeps me going, is when people complain that there are nothing but immigrants and non English speakers driving uber, because you can be an illegal immigrant in a safe haven city and get a drivers licence and drive for uber.\n\nPeople like me are going to go ape shit, I will just off myself,  but I want to see the barbarians let loose on these people. \n\nThere were almost 300 sexual assault cases last year regarding Uber if I recall correctly. That number is going to skyrocket.\n\nI'm watching the ultimate game of \"you get what you pay for\" unfold, and it's the only thing I'm hanging around to see.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yamsj/"}