{"id": "t5_2qh1i_t3_4e8oip_t1_d1ybgwu", "creation": 1460373848, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 149, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SkinBintin", "text": "Relief. Plain and simple, relief. \n\nI hate talking about this. It was so long ago, but it still pains me at times. I've never 100% moved on from those darkest of days, and it's a constant battle keeping the negative thoughts restrained and at bay. But, here goes... \n\nIn my teens, I had a few failed suicide attempts. The first few, I wasn't really dedicated to the cause. It was a true cry for help, and I knew it. I felt alone and abandoned even though I had little reason to. \n\nThroughout my childhood I looked up to my dad. He was a hero of sorts. Now that I'm in my 30's, he's even more of a hero. The hardship he's overcome for the betterment of us kids and mum is astonishing. In my teens, it became apparent that my father and I had very different interests.  \n\nHe was Rugby mad. I moved from rugby to soccer, then to golf  then dumped sports entirely to chase my passion of cars. Well, being a troublesome street racer shit bag more like. I was a tech geek. He had no interest in it. I was becoming a bit of a game geek, he had no interest in any of that.  \n\nNow that's probably not that big a deal to most. And I doubt it would have for me. He is a good guy, and a difference in interests wouldn't have been allowed to tarnish a father son bond. I was the eldest son.  So I was always a wee bit jealous thinking my younger brothers had it better than me. Further to that, I was the victim of ruthless small town bullying.  \n\nFrom when I first started primary school until after I had left high-school.  The bullying never ended. I felt let down and abused by my peers. Through primary and then onto high-school,  I always had a small set of friends.  However, primary friends went to boarding school when I went to high school.  I had to start fresh.  Eventually when I left high-school early because I was failing dismally because of the bullying, I didn't really have friends outside of school. Again,  I was making new ones. This is where I feel in with the bad crowd. Really bad crowd. I was desperate to be accepted so I went along with their bullshit.  Even though deep down I knew I was being used as I had money because I worked full time, and had a car meaning transport into the surrounding cities. It was a shitty time, and it further drove a wedge between myself, and the majority of the towns citizens around my age and a little older. It sucked. \n\nAnyway, one night some shit went down. I won't say what, because it wasn't good. Anyway, while I didn't participate directly, I stood by and allowed it to happen. I wanted to stop it so bad,  but I didn't.  Fuck I regret it to this day. Eventually, we all got found out. Police interviews and all that shit. Got tasked to community service. As word went around town, the bullies that were a bit older than me, came down hard. I'd get jumped by groups of them when walking home at night. Lost teeth to their fists. Some of my assailants were cousins. Fuck that hurt even more. Family members hating me enough to do that. I think the brother next down from me knew what was going on. We had always fought.  Viciously at times. But during this period, he was just different. Noticeably so. Like he was trying to show love and be an awesome little brother, without making it obvious to anyone else. \n\nAside from him, I made sure no one knew how bad my life had become. I didn't want to let my parents down thinking they had raised such a fucking loser. I'd bottle it all up. From time to time it'd all explode out violently. At school, then at pubs later in life. The switch would finally get flicked and I'd explode. I'd wind up getting hurt, but I always dealt some serious damage in the process. Was never proud of it. It was embarrassing.  And for some of my bullies it added to the fun.  The game became trying to set me off. How much prodding would it take until that looney cunt blows his top. Haha fun times right? \n\nAnyway,  I'm waffling on. I'm not putting events together in a correct order etc. I guess the bonus of hitting this thread so late is its unlikely many will ever read this jumble of words. \n\nFirst couple times, I did a shit job. Didn't take enough pills. Didn't tie the noose right.  Survived the drive off the cliff. Until I came to my final attempt at ending my life. I was older now. Probably 18. I had made the concious decision that this is the day I leave this world, and no cunt is going to get in the way. The plan was to overdose, and that's exactly what I did. I took a ton of pills late one evening, and then walked around behind the wood shed at home, sat myself under a big Norfolk pine and let my mind begin to close down. I didn't give a fuck. I didn't want to leave any lasting legacy. I just wanted to check out. No fucking note. No bullshit.  No final texts desperate to be talked out of it. Nope, fuck this world and fuck every bastard in it. \n\nThe final moments of consciousness I recall the porch light coming on. Dad coming outside and heading for my sleep out.  I didn't really care that he'd find pill bottles. I was on my way out. (God what an asshole I was. I can't believe at the time I couldn't even muster some emotion for what I was about to put my family through.  I hate myself some times). Everything went black momentarily.  I was checking out. Barely popping in and out of consciousness.  I remember coming too for a bit. Dad calling out to mum. Sounding panicked.  Blackness again. Mum and dad calling my name. Clearly emotional and panicked.  Then, the moment that changed my life. Open my eyes for a moment. And dad comes clamoring through the shubs and grabs me. Tears rolling down his face. Can't even remember what he said.  I was fucked. Something totally kiwi though along the lines of \"you fucking idiot, what have you done to yourself... come on mate\". \n\nThat was the last thing I remembered until waking in the hospital. Mum and Dad right there by my side. I never shook that look on dad's face.  The emotion on it. That moment when I realised that he really did give a fuck about me. Loved me, just like all his sons.  And that sinking sensation thinking how bloody close I came to realising it all too late. \n\nI love my family. I know they all love me. While life can be a real struggle for me at times financially etc, I know I came through the pits of despair and came through the other side. Despite ALL of that, depression sneaks up on my a lot.  I'm in my 30's now, and at times I still have to fight back the urges to just let the darkness take over, and finally check out.  The main thing that prevents it is knowing how much pain I'll put my family and girlfriend though if I did it. I don't want to find out there's an afterlife and have to live in the knowledge I destroyed the hearts of so many.\n\n\nAnyway, there's my story. I don't know why I told it on Reddit of all places. Just felt like it was time to get it all off my chest.  I'm so emotional now. Sad in a way.  Feeling like a failure of sorts. But, also a little relieved.  And proud looking back, and seeing how far I've come. \n\nAnyway  thanks reddit for allowing me the space to let that all out. I think I'll look for somewhere on Reddit to talk about this stuff more regularly. I think it might be beneficial. \n\nEdit: an amazing redditor sent me a deep and heartfelt pm that has me feeling a bit better. Talking about such things brings me back to a darker lonely place I try to avoid wherever possible. You, the awesome people of Reddit, make it much easier for myself and others to open up about such thoughts and emotions, thanks to your genuinely caring responses.  So, thanks guys. You're amazing <3", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ybgwu/"}