{"id": "t5_2tand_t3_oukqs3_t1_h737lxk", "creation": 1627656743, "origin": "t5_2tand_t3_oukqs3", "height": 1, "replied_to": "t5_2tand_t3_oukqs3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "plantderived", "text": "Congrats for all your achievements! It’s only the beginning of a lifetime journey to becoming your best self. 💪\n\nIt’s great you gave up smoking weed in favour to antidepressents. I’ve struggled with depression too for about 5 years and daily toking not only made things worse, but opened up doors to more self-destructive, life-threatning decisions. I’m happy to have taken the steps to leaving all that behind and focusing on self-discovery & discipline.\n\nBeen through therapy last year but decided I was gonna handle things on my own. Did not study psychology / psychiatry profesionally but I have gained some pretty solid knowledge in the past 10 years, through research and immediate relations with people training in the fields (former close friends). At some point I got angry for receiving an untrue diagnose that I had to live with for, happily, only a few years. Last year’s therapist opened up a whole new perspective after presenting the truth: major PTSD from multiple narcissist traumas. Only after this episode I realised who I truly am deep down inside and how I want to become a better me. There are some deep scars from the past but once I cut contact with 99% of everyone I knew and started investing all that energy on me, I belive to be on a good path.\n \nWhat I constantly do for some time is: \n\n• **plant-based diet** – focusing on balancing micro / macro nutrients & maximising healing power of raw eating. I cook my meals (almost) daily and have been doing this for more than a year, way before the pandemic started. Time spent in the kitchen can be therapeutic if done smart. I have a list of staples to which I constantly add new (and old) flavours, techniques and sometimes gear. I am interested not only in nutritional values but also discovering cultural approaches and twists on food;\n\n• **supplements** – B12, D, Mg, Omega 3-6-9, NAC, Melatonin, on-off 5HTP & chlorella + cilantro / zeolite detox cycles. I’ve tested lots of pills, powders and liquids, from adaptogens to nootropics, but that’s what I found to be working on my body;\n\n• **breathwork** – daily exercises make me feel sooo refreshed. Although I still smoke tobacco my breathing while doing physical activities has improved a lot. Doing the Wim Hof method when I feel my body is on low energy;\n\n• **postural workouts** – kinda new to this, I combine beginner yoga (that I did in the past) with new techniques that I find on Youtube. Not a big fan of hitting the gym, I don’t enjoy doing any hardcore exercising nor the presence of other people while I sweat my ass off;\n\n• **alt-transportation** – never owned a car, had a bike for a while back and mostly used public transport / Uber for getting around the city. 3 years ago I bought my first manual scooter and have been loving it since. Riding this not only shaped my legs but made me more punctual as I now have to plan every trip in advance. Plus it’s a good reason for getting that daily natural vitamin D while working out legs / back / hand muscles. I own and recommend a scooter with pneumatic wheels;\n\n• **meditation** – guided for the most part, am trying to get better at controlling my thoughts alone, I need some landscape changing (happening soon);\n\n• **solidarity** – living alone in the past years helped me with learning how to love my mind, body and spirit;\n\n• **long-term objectives** - been doing a lot of reading, research, planning, projection, testing and iteration with myself on both personal & professional levels. Getting a new job this year made me realise I want to pursue a different career path after a decade of working in the same field. I quit 3 months later and am starting a new school soon. All the experiences and knowledge will still be inside me but I’m shifting to a whole new industry where I can apply most of what I know while learning & developing new skills;\n\n• **abstinence** – initially went through ½ year of total abstinence (sex, porn, alcohol, drugs) but the first time I engaged with the wrong people I relapsed. Now I’m back to limiting any arousal that could distract from employing my long-term plans;\n\n• **second-hand buying** – not only clothes but also dishware, tech and books. I’m trying a low-waste, minimalist approach on lifestyle so an not buying stuff on a regular basis, only when something breaks or I want it badly;\n\n• **spiritual practice** – born a Christian but never practiced this or any other religion. In the past year I’ve opened up to new experiences & was amazed by crystals, tarot, Reiki, energy & aura healing, lucid dreaming, chanting mantras, telepathy and lastly, a total surprise, prayer. I have a tarot deck that I fell in love with at first sight and a set of crystals that I constantly cleanse & charge. When in doubt I let myself guided by these or do little prayings to a God that has nothing to do with my birth-religion. Besides meditation, this is what helps me feel connected to a higher self;\n\n• **mindfulness** – I’ve put this at the end because, to me, it’s more of a mindset rather than a well-thought practice. From eating to thinking patterns, I summon myself to be & act in mindful, ethical and valuable ways. \n\nHope this adds some value to your enforcing of a stronger, upgraded routine. Stay sober and remember: the real truth to believe is the one that’s yours. 🤗", "permalink": "/r/DecidingToBeBetter/comments/oukqs3/how_do_i_further_discipline_myself/h737lxk/"}