{"id": "t5_2tand_t3_plvd5m_t1_hcegqhw", "creation": 1631335821, "origin": "t5_2tand_t3_plvd5m", "height": 1, "replied_to": "t5_2tand_t3_plvd5m", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Real_RobinGoodfellow", "text": "I got pregnant with my son when I was 23, so in some ways I had to squeeze the ‘fun’ of my twenties in to only the very first few years of them, but at the same time, being a Mum has absolutely been the most meaningful and joyful adventure of my life thus far.\n\nBut I am more than just a Mother, and exist independently of my relation to other people, so. The other most fun things of my twenties: \nDancing, at festivals or gigs or parties, covered in sweat, surrounded by my best friends and dozens of strangers, live music; feeling entirely embodied, myself, in the moment, and joyful. \n\nTravel- where even the most mundane of daily tasks (eating breakfast, buying a bus ticket, etc) is an adventure, and everyone you meet a potential friend. I’ve realised, as I’ve gotten older, that a lot of that sense of adventure, openness to opportunity, and wonderment can be carried over in to daily life at home, too. But, when and if you can- travel. It really is amazing.\n\nSwimming with manta rays to the sound of whalesong in a coral reef- more magic than I can say. \n\nSitting down and really enjoying quality time with my family, especially my grandparents; hearing about their lives, including the parts of them we wouldn’t have talked about when I was a kid. Getting tipsy together. Sharing meals. Coming to know elder family members as people, rather than only their roles to me.\n\nGood luck, OP. May covid relinquish its grip on the world sufficient to allow all these adventures and more to take place before our twenties end (I am very shortly to be turning twenty-nine :O !) I’m aware most if not all of what I’ve listed (well, apart from having a baby i spose lolol) is currently impossible where I live cause of lockdowns, which is def a bit of a bummer. Love this question btw, and the idea of a Fun List ❤️", "permalink": "/r/DecidingToBeBetter/comments/plvd5m/whats_the_most_enjoyable_most_fun_thing_you_did/hcegqhw/"}