{"id": "t5_2tand_t3_owqdjd_t1_h7ig9al", "creation": 1627961799, "origin": "t5_2tand_t3_owqdjd", "height": 1, "replied_to": "t5_2tand_t3_owqdjd", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "HomiesTrismegistus", "text": "Ugh dude, I feel you. I was a terrible drug addict and hurt many, many people. Most of my family still won't talk to me, I don't really plan on ever talking to any of them unless they make some sort of effort anyways, other than my immediate loved ones. I did lose all of my friends though, except for a couple who I have grown far apart from\n\nI am terribly embarrassed. I can't even look at facebook because it upsets me so much. I am trying to start life over. And I have. But I have only started getting my shit together for the last little over a year.\n\nYou've got this dude, fuck if anyone brings it up all you need to say is, \"look, I used to be a fuck up. I compare it to being a child. Now I do not feel like that or a child anymore, I am only trying to focus on what is in front of me\". If I was quick to judge someone from their past, which I may even easily do, if they rattled that line to me, I would just be like \"shit dude, me too. So let's be friends so that we can help each other grow\" or something. To be honest, anyone who can't understand that, at this point, I don't want to be friends with anyways.\n\nAnd many, many more people can look past that than you think. If they honestly can't, or some shit boils up, just say what you did here. If they don't get that, it won't stop it from hurting you, but know deep down that they're not worth it anyways. They either don't acknowledge their own mistakes, or(maybe this could even be a bad thing) \"haven't ever made any\".  You're more of a person for going through those things and deciding to be better, not less of a person.", "permalink": "/r/DecidingToBeBetter/comments/owqdjd/i_was_a_horrible_toxic_person_when_i_was_around/h7ig9al/"}