{"id": "t5_2tand_t3_owqdjd_t1_h7i8wt7", "creation": 1627957923, "origin": "t5_2tand_t3_owqdjd", "height": 1, "replied_to": "t5_2tand_t3_owqdjd", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PM_ME_YOUR_STOCKPIX", "text": "I see so much in this post, of myself and several people that I’m close with\n\nThis isn’t as uncommon as you may think and everyone tends to deal with this sort of thing a little differently\n\nA therapist is a huge step in the right direction, and it’s great that you’re able to recognize your problems and confront your past mistakes\n\nSometimes “the past is the past” can get old to hear, but it’s very true. The only thing you have control over is how you live life moving forward. You can be good to people, you can be a friend that others will love to have, you can love yourself while acknowledging and accepting that you’ve made mistakes in the past\n\nSetting realistic expectations and goals is important as well, as I’m sure a professional would agree with. For example, sometimes what helps is simply reaching out to those that you believe you’ve “wronged” in the past, but you can’t expect forgiveness, sunshine and daisies, happily ever after. Sometimes they still harbor a grudge or ghost you, and that’s okay! The only forgiveness you truly need to seek and rely on is from yourself. And, good news — you actually have control over that! :)\n\nAnother possibility is writing to these sorts of people from your past and simply never sending the message or letter. It can be helpful from my understanding, but I’ve never taken the plunge myself so I can’t speak from experience there\n\nI hope that some of this is helpful and that you’re able to relatively quickly move into the next stage of your life, free of the burden of guilting yourself. And remember, something like PTSD or trauma or depression or anxiety is not a life sentence behind bars or completely unmanageable. You can successfully live a fulfilling and worthwhile life with any or all of these diagnoses. But, one step at a time, and your first step may be to discuss your end goal with a therapist that you like and trust, and go into as much detail as you need to with him or her if it’s perhaps even just a matter of getting it all out there and off your chest to begin with\n\nAnyhow, I’ve maybe written too much, but I again hope that there is something of value here for you. And once again, you are absolutely not alone; there is support out there!", "permalink": "/r/DecidingToBeBetter/comments/owqdjd/i_was_a_horrible_toxic_person_when_i_was_around/h7i8wt7/"}