{"id": "t5_2tand_t3_p1owzq_t1_h8fde0h", "creation": 1628612887, "origin": "t5_2tand_t3_p1owzq", "height": 1, "replied_to": "t5_2tand_t3_p1owzq", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SirDickensonThePious", "text": "Things I found incredibly important through life:  \n\n\n\\-Time management is critical. you only have 24 hours a day, so think about how you spend those. Relaxation and rest is good and necessary, but moderation is key. use some of that time to build who you are outside of your obligations. find something you love to do and pursue it, be that a sport, art, or whatever.   \n\n\n\\- Making good friends: find friends who value you and make time for you as much as you do for them. If you're doing all of the work in a friendship you truly value, talk to that person and explain how you feel. I spent so much time trying to maintain friendships that the other person just didn't put any effort into and it was exhausting and frustrating.   \n\n\n\\- Your Job doesn't *have* to be the most amazing thing in the world. If you have things you enjoy doing outside work, as long as you work somewhere that keeps you happy, financially stable, and with people who value you, respect you, and are good to work with, that is perfectly fine. If you do truly love what you do, that's amazing, congratulations, but if you find joy in things outside of work, you can afford to be more flexible with what you do for a living, and that can be advantageous.   \n\n\n\\- At school, don't try and do everything. try as much as you have time for, but do be wis about how much you are involved in. don't join so many organizations/ clubs/ classes that you can't put in a good effort.   \n\n\n\\-For relationships, my biggest piece of advice is to not pursue a relationship for the purpose of being happy. you need to learn to be happy with yourself before you can be happy with another person. if you make someone else your primary source of meaning and happiness, this is dangerous as they will inevitably let you down (we're human :P ), and you will be dependent on them for being mentally positive.   \n\n\n\\-Relationships should also be a 2-way street. your partner should listen to you, accept feedback, respect you, and care for you. I personally believe that fighting is fruitless, and if you feel like you need to fight with your partner, you should find space to cool off until you can speak calmly and clearly to them. You should feel safe telling your partner that you didn't like something they did, and they should be able to listen and work with you to resolve this.   \n\n\n\\-when you date, date for *clarity first.*  I'm not sure what OP's views on marriage/ dating are, but if you're looking for a partner for life in some capacity, seek clarity about the person. your goal should be to get to know the other person (while obviously enjoying yourself along the way). For me, dating for clarity means waiting to get physically intimate (read: sex) for a while, because I find that that can distract me from what might otherwise be detractors or red flags in the relationship. For you this may look different, but In my experience, I think that getting to know the other person's character is more important than other physical fun things. That process is a lifelong one, so it's up to you when you feel comfortable doing things, but In my experience, I have had much happier relationships when I wait and take time to do other things with my partner beforehand.  \n\n\n\\-Lastly, Mindfulness: taking time daily to care for yourself mentally is super important. I have seen my life drastically improve in terms of mental health since I have adopted daily mental and spiritual [routines.](https://routines.My) spend time in meditation. if you don't know how, youtube is a great place to start. there's also the Headspace app to try as well. I don't use guidance anymore, but for me I typically spend time in silence doing the following almost every day:  \n\n\n\\-Gratefulness: take time to be thankful for what you have / what is true in your life  \n\\-Affirmation: affirm who you are/ what you want to be. Ex: I write out something like this every day:\n\nI am disciplined  \nI am kind  \nI am becoming better daily  \netc..   \n\n\nthink of it as a way of telling yourself what you like/love about yourself and recognizing that. love yourself!  \n\\-Meditation: for me I will set a timer for 15 minutes, and just let my mind chill out. I let racing thoughts go by/ run their course, and I also think about why I'm feeling what I'm feeling if there's something bothering me. it's taking time to search my emotions and \"weed the garden\", in a way.   \n\n\nHope this is helpful! I got a bit carried away writing but I truly hope this information helps someone as much as it has helped me.", "permalink": "/r/DecidingToBeBetter/comments/p1owzq/advice_youd_give_to_a_18f/h8fde0h/"}