{"id": "t5_2tand_t3_p1owzq_t1_h8eqjx0", "creation": 1628602925, "origin": "t5_2tand_t3_p1owzq", "height": 1, "replied_to": "t5_2tand_t3_p1owzq", "down_vote": 0, "up_vote": 15, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "The_Dude_of_Pala", "text": "I don't know if any of My advice would resonate with you. When I was your age I heard a lot of advice and decided to do whatever I wanted anyway. And all I really ended up with was a laundry list of things not to do. \n\nBut one of the things that no one ever taught me that I had to start learning in my 40's was, don't try so hard. You don't have to try to be better, you don't have to be anything more than you are. You're perfect just the way you are at every moment, even when you're a quaking mess. \n\nSerious things that helped me get healthier and happier; learn to love yourself UNCONDITIONALLY!!! Be kind to yourself, forgive yourself, and that your thoughts are thoughts, you don't have to listen to them. \n\nAlso You can't change anyone else or make anyone else happy. Likewise no one can change You nor make you happy. Only You can change You. The only thing You really can control in life is Your reactions to people, feelings and situations. \n\nUnderstand, really understand the difference between pain and suffering. Pain is real (like a broken bone or toothache). But suffering is usually ONLY in the mind (they \"hurt\" me, it's uncomfortable, it's not fair, etc...).\n\nI just recently stumbled across a book that has some great advice in it. It was written by a Zen Buddhist Nun. She drops a lot of the flowery Buddhist overtones and puts things in \"simple, plain English.\" To the point, no-nonsense advice. I highly recommend the book to anyone, but especially for a young woman, there's advice and a point of view in their that might resonate with you. \n\nBook: Ordinary Wonder, Zen Life and Practice.\nBy, Charlotte Joko Beck \n\nThe Audible version was just released and I checked it out too. It's pretty good, the book and the message is Wonderful, the audio narration is a bit \"flat\" but if you don't have time to sit and read it's a great way to take in Joko's message.", "permalink": "/r/DecidingToBeBetter/comments/p1owzq/advice_youd_give_to_a_18f/h8eqjx0/"}