{"id": "t5_2tand_t3_kje20j_t1_ggyutt2", "creation": 1608875803, "origin": "t5_2tand_t3_kje20j", "height": 1, "replied_to": "t5_2tand_t3_kje20j", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Gnomenads", "text": "Brother (or sister), I am so fucking proud of you! Going that long is a huge step and a monumental goal. I grew up in a household where we were never healthy, this last year I went 40 days and it was amazing.\n\nThen I slipped, I went back to fast food and liquor and weed, and it was hard. Life's been tough, going through a divorce, losing my three kids and barely seeing them, dealing with two herniated discs, so on and so forth.\n\nThis is not a pity party, this is quite the opposite. God has been good because in spite of everything life could be so much more difficult, but it would be easier if for the last three months I stuck with my streak.\n\nAll this to say, if there is anyone who reads this and is willing to learn, I want to with my whole heart encourage you, to continue on with your health adventure because it is SO SO SO SO worth it. Love yourself, goddammit! God created us, He wants us to love ourselves, so love ourselves and don't give up, I love you too! I'm rooting for you! I want you to succeed. \n\nAnd if you fail, that is not permanent, it is temporal, get back up soldier. Get back up you badass you, get back up because you are worth it all and worthy of it all. I've been loving myself in more ways each day and in spite of all of the \"shit\" that people have been experiencing (myself included), life is a blessing and I get to life. \n\nYou and I get to believe, we get to grow, we get to learn, we get to love ourselves, we get to be better than ourselves yesterday, we get to forgive ourselves, we get to accept the universe's forgiveness, we get to love living. I want to love and encourage anyone who reads this, open my door because you are awesome. Go get that shit, go get that fucking money, that goal, that girl, that PS5, because you deserve it. But always remember, quite contradictory, you don't deserve shit. That's what makes life so awesome. \n\nWe didn't ask to be born, yet we were. So what are we owed? Nothing, so everything becomes something to be thankful for.\n\nLove you all, Happy Holidays, and if anyone cares to reach out, DM me and we can talk. Love you alreadyl.", "permalink": "/r/DecidingToBeBetter/comments/kje20j/i_worked_out_every_single_day_for_3_weeks/ggyutt2/"}