{"id": "t5_2tand_t3_niznr5_t1_gz4pxrl", "creation": 1621745320, "origin": "t5_2tand_t3_niznr5", "height": 1, "replied_to": "t5_2tand_t3_niznr5", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I would start by seeing where the most obvious changes you can make are. I don’t mean to be insulting by saying this, but I’ve found that a lot of people get caught up in specifics when a generally healthy approach would be simpler and less stressful to their needs. \n\nBut if you don’t feel like reading this whole thing than I would say: nutrition, sleep, exercise. Don’t just eat healthy foods, eat appropriate portions of them. There are guides online that can show you rough measurements using parts of your hand. Like, a protein serving (like a fish fillet or chicken thigh) would be about the size of your fist, a teaspoon of oil would be the tip of your finger. They sell plates and Tupperware that have these portions marked so you don’t overeat. Work on trying to sleep 7-9 hours and not oversleep or under sleep. Obviously this will change once the baby comes, so it might help to look up what other mothers of newborns suggest to help their baby’s sleep schedule so they can regulate their own. Find a form of exercise you enjoy, and focus on aiming for a healthy lifestyle for yourself and your baby. Don’t get caught up in comparison/competition between yourself and others.\n\nI have plenty of relatives who are athletic who don’t count calories, and the reason is because they know enough about nutrition and exercise to understand what to expect. Try to look at general health recommendations by actual national and international organizations, rather than looking at influencers who often are lying about how they look the way they do, or lack experience in training people and are just saying what worked for them. I really like some influencers, but take their advice with a grain of salt.\n\nTo be honest, you can make a lot of huge strength gains as a beginner who doesn’t exercise a ton. I am a little jealous of your position. And if you know you are eating unhealthy already, you don’t have to go cold turkey on things to start seeing results or to make improvements. There’s a lot of benefits to being a beginner. Good luck on your journey!", "permalink": "/r/DecidingToBeBetter/comments/niznr5/i_have_to_get_healthy_but_there_are_some/gz4pxrl/"}