{"id": "t5_2tand_t3_kczeqx_t1_gfwjb2t", "creation": 1608019618, "origin": "t5_2tand_t3_kczeqx", "height": 1, "replied_to": "t5_2tand_t3_kczeqx", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "j_tothemoon", "text": "2020 was the end of a 10Y relationship for me. 3Y married. She had breast cancer at the start of the year and while through it, I did my best to support her in all her needs while she went through all the tests, surgery, and radiation therapy (she avoided chemo). In health and disease, right? But cancer was so much more than that. It changed her, she eventually emotionally cheated on me and started to be distant and to push me out of the relationship. We wanted to be mom and dad in 2020. We wanted to buy a house in 2020. All of that just went to waste on her decision (she was the one ending the relationship). Now I'm living with my grandparents since the start of November.\n\n2020 was also the year that my grandmother lost temporarily her IVIG transfusions due to a shortage caused by COVID. We managed to fill a big complaint against the hospital that managed to give her the IVIG, she will start again the day after tomorrow.\n\n2020 was also the year that I passed out for the first time due to intense stress, bad food habits and a sedentary lifestyle. But I understood what I should start to do from there. I started exercising and having healthier food habits. Lost roughly 30 pounds in a year and I want to keep it that way.\n\n2020 was also the year of complications at work. My main work is in a healthcare management unit. So with COVID, you can see the trouble. I never had so much trouble in a year than this year at work. At my second job (work as freelance), work got suspended from April to September. I'm on a contract until the end of the year and still don't know if they will renew.\n\n2020 was a sh\\*t year, and I'm still ok. I hope 2021 just swings by around the corner to make me happier than I ever was. I will be fighting for it.", "permalink": "/r/DecidingToBeBetter/comments/kczeqx/although_this_year_wasnt_ideal_at_all_a_lot_of_us/gfwjb2t/"}