{"id": "t5_2tand_t3_kczeqx_t1_ggbo7mw", "creation": 1608346950, "origin": "t5_2tand_t3_kczeqx", "height": 1, "replied_to": "t5_2tand_t3_kczeqx", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "moeru_gumi", "text": "The country was Japan, and the job was a common one, teaching English as a second language. However I also had a side job/apprenticeship learning tattooing and also running a bar/event for foreigners/LGBT community/board games/video games etc. It's no surprise to anybody who's spent 5 minutes in /r/japanlife that teaching English is considered the bottom-of-the-barrel job for trained monkeys, drunks and perverts, but I did it for years because Japan has national healthcare, rent is cheap(er than America), the job is simple enough, I actually enjoyed talking to many of the students and teaching those who were passionate about it, and if you don't drink your salary you make enough to live on. Art and bartending kept me sane, along with my friends of course, but the problem with being a foreigner in Japan is that most foreign people don't stay that long and every time you make a friend they're gone in a couple years or less. My girlfriend (now wife) is also American, and living in Japan to work as a translator w her Japanese spouse, but she was also dying inside from the daily grind/ Japanese work culture/ issues with her Japanese family/ long drawn out divorce. After time, additional medical issues were diagnosed along with our slow realization that the artist/music culture was not working out for us and our siblings are getting older and wanted us closer...  and we made the decision to finally come back to the US. It was terrifyingly expensive, we had to rehome our pets and plants and get rid of almost everything we owned, spent everything we had, and in the middle of all these preparations a pandemic hit. I don't know how we made it in one piece but it was a great decision for us. :)", "permalink": "/r/DecidingToBeBetter/comments/kczeqx/although_this_year_wasnt_ideal_at_all_a_lot_of_us/ggbo7mw/"}