{"id": "t5_2tand_t3_kczeqx_t1_gfvbpru", "creation": 1607992265, "origin": "t5_2tand_t3_kczeqx", "height": 1, "replied_to": "t5_2tand_t3_kczeqx", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "picekdesign", "text": "So good to read this now. Im im freaking out about my life and this gives me energy, because it was a year which actually taught me a lot and there are good things in result which come with pain. 2020 was for me the best and the worst year. The best because I spent 11 months with a woman I adored in one house, the worst because she left me and I'm crashed. At the end of a year I think I'm a better person though. I learn that I can love and be in mature relationship and I know I can do it. I need to be more independent and not afraid to ask questions when something is wrong, because it can be too late. It also gave me a kick and I stop being toxic freelancer being afraid of my life every time and I have more stable job. Actually, my money situation is the best ever and 2021 seem I could be confident about the money. I learn new habits from my ex, I eat better, my body is better, I treat social meetings more serious, I more relaxed with people and work, more confident of what I do. There is a lot of to work on myself, especially not coming back to back habits of a single person. In 2021 I want to just more take care of myself and grow more my brain into reading, focus, passions and have a quality life on my own. I also learn sleep helps with depression. I also shouldn't be afraid of medicine, even with head pain I should take paracetamol immediately and not when its gets totally bad. Also, at the end with bad time there is always family and I need to take care of it to not forget and take care of relationship and friendship and be true to them as lockdown show us that at the end there is only few people who stay.", "permalink": "/r/DecidingToBeBetter/comments/kczeqx/although_this_year_wasnt_ideal_at_all_a_lot_of_us/gfvbpru/"}