{"id": "t5_2tand_t3_mwllvz_t1_gvk69bx", "creation": 1619181790, "origin": "t5_2tand_t3_mwllvz", "height": 1, "replied_to": "t5_2tand_t3_mwllvz", "down_vote": 0, "up_vote": 20, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ms_abominable", "text": "That's so great! The relief of being seen and having tools are so fundamentally life-changing. If you have the bandwidth, try journalling so you can start seeing how patterns start shifting over time. It'll help when the euphoria of having support for the first time wears off and the marathon of maintenance kicks in.\n\nTo answer some of the questions here on exactly how therapy can help, for me the first step was getting validation that my family relationships were not healthy. I was raised to believe boundaries were selfish and self-care was vanity. That rotten foundation meant a lot of things in my life were in disorder—my mental and physical health, hygiene habits, undiagnosed adhd, an eating disorder, overachieving at school and then work, people pleasing, zero sense of what my needs and wants were, etc.  Seeing a therapist gave me a step by step guide to setting boundaries, creating a list of my personal values, and then guidance as I ran into situations that were beyond my skill level.\n\nOnce I got the hang of some of the basics, the sessions became more like troubleshooting. Like hmm, this week I felt like X because Y happened. How can we get ahead of that next week? Or maybe instead, it was coming to terms with the fact that X happens and it is not in my control, so I can choose to be kind to myself. It sounds crazy, but I literally needed someone to list out how to self care. I thought it was \"treat yourself\" kind of actions, like manicures or massages...not essentials like doing laundry or meal prepping so you can thank yourself later.\n\nI'd say the therapy roadmap looks something like:\nMindfulness --> Boundaries --> Self Discovery --> Behavioral Support --> Possible detour to a specialist if you uncover another issue like deep trauma --> Growth and Healing \n\nSometimes it's a spiral up and you redo the steps but with newer, less intense issues, until you feel whole and better. It's definitely not a straight line, and there's a fair amount of grieving, acceptance, and dark nights of the soul to get through. At some point you learn that you're human, that's ok, and you deserve kindness—especially from yourself ❤️ \n\nI hope that helps!", "permalink": "/r/DecidingToBeBetter/comments/mwllvz/ive_been_in_therapy_for_two_months_now_and_my/gvk69bx/"}