{"id": "t5_2tand_t3_mwllvz_t1_gvkviys", "creation": 1619193612, "origin": "t5_2tand_t3_mwllvz", "height": 1, "replied_to": "t5_2tand_t3_mwllvz", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KittyCatherine11", "text": "I would say you can’t view it as wasted time. It IS money, so I do understand that side can be limiting. But if you’ve got insurance or the money to try, and it’s truly just the time, then I’d say what you’re doing is like expecting to walk into a shoe store and find the right shoe immediately and walk out without trying it on. Which would be lovely, but isn’t the case. Even a shoe that looks really nice might not fit right. But you *can* take a quick glance over the shoes to narrow it down. \n\nThe best way to narrow down therapists is to look at their biographies. They should list a little about themselves so you can figure out a baseline. I was just looking at one for my partner (just as a back up plan) and one guy looked really interesting and kind and like he could fit, but it talked about spiritual counseling and he went to a Christian college. There’s *nothing* wrong with that, but it won’t fit for my atheist partner. It’ll be a barrier because spirituality is important. Additionally, it should list the types of strategies and where they studied. Not that their educational background is everything, but different schools produce different types of therapists. \n\nThink about these things:\n-Do you care if it’s a man or a woman?\n-Do you want someone religious?\n-Do you have a specific type of therapy or strategy that has worked for you before, and do they have that listed as a focus?\n-Where did they study?\n-Do they focus on *your* type of person: some therapist are focused on kids/teens, elderly, careers, grief, relationships, etc. most will help anyone, but if they work best with kids, it’s not likely right for you. \n\nSometimes with things like online therapy, you might not get the luxury of a bio. But it is absolutely ok to ask them questions in the first session to see if they fit. They always ask, “do you have any questions for me?” And it’s always awkward.  But like when a job interview asks you that, you just need to prepare for what you want to ask that’s important for you. \n\n\nOnce in the session, it’s your gut feeling and also liberating yourself to say “nah, this person isn’t right.” You shouldn’t feel obligated to stay. You shouldn’t feel guilty for trying someone else. If a therapist makes you feel that way, they’re not good at what they do. I think it’s that simple. You’re seeing if you feel like you can trust them. Trust is essential! And you want to know they’re on your side and understand your brain and how you work. Trust yourself and prioritize your feelings in this. \n\nI hope this helps somewhat. Happy to keep discussing too 💜", "permalink": "/r/DecidingToBeBetter/comments/mwllvz/ive_been_in_therapy_for_two_months_now_and_my/gvkviys/"}