{"id": "t5_2tand_t3_mlrtxb_t1_gto04og", "creation": 1617783452, "origin": "t5_2tand_t3_mlrtxb", "height": 1, "replied_to": "t5_2tand_t3_mlrtxb", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ohmygoshimdrowning", "text": "So, hear me out. Pick up artist websites.\n\nNow obviously your goal here isn't to do some sleazy routine in order to win favor with a girl and sleep with her. Your goal is to be more likeable and charming, which is basically just the first step of what these guys teach is.\n\nAlot of what you wrote resonates alot with me and who I was in my highschool years and shortly thereafter. I spent a fair amount of time reading into social psychology, evolutionary psych, sexual psychology, and even taking classes in college on these topics purely to become more successful in getting and maintaining friends as well as getting laid.\n\nI would spend time watching some puas on YouTube, namely Richard de la ruina, and some other weird fuck I don't remember. I never ran any routines on girls, but I did learn the fundamental ideas behind what people noticed about others, I would watch for how people reacted to their presence and the way they carried themselves.\n\nNow this might be a little counter intuitive, because the entire process i went through, was for the sake of exacerbating my manipulative and narcissistic behavior, but it was absolutely me faking it until I made it as far as learning the proper behaviors towards understanding how to behave, like fitting the mold I want people to see of me.\n\nGranted, now I don't even think about any of the shit I learned, but I do know how to be charming and well liked without too much conscious thought.\n\nAlso I've never been diagnosed, but I suspect I have a very mild form of aspergers or some form of sociopathy (both very under researched and understood so this is mostly just an extrapolation of my understanding of psychology) and the first thought I had after reading your post, noting your vernacular, was that you also may have an undiagnosed autism spectrum based disorder.", "permalink": "/r/DecidingToBeBetter/comments/mlrtxb/i_need_to_learn_how_to_speak_to_people_in_a/gto04og/"}