{"id": "t5_2qh5i_t3_qgowq3_t1_hi9gpm2", "creation": 1635351143, "origin": "t5_2qh5i_t3_qgowq3", "height": 1, "replied_to": "t5_2qh5i_t3_qgowq3", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "IWillBaconSlapYou", "text": "I'd also like to get on a soap box for a second and preach the importance of prenatal care. \n\n Due to the pandemic, my usual provider tried to cancel all my ultrasounds for the entire pregnancy (I was about six weeks and totally in the dark at this point). I found that risky and tracked down an elective ultrasound boutique at 14 weeks that was open (probably wasn't supposed to be - the owner was vocally anti-restriction, which was off-putting, but I was determined). She found \"something weird\" and advised me to get into my doctor's office one way or another. I got an appointment for two hours later. Longest two hours of my life! \n\n After the diagnosis, I was referred to a more advanced hospital (luckily I live near Seattle), where they aggressively monitored the baby's growth and condition. Through this intense scanning schedule, they were able to see that his intestines were dilating rapidly and risking perforation (which carries like a 50% fatality risk). This was why he was born at 32 weeks, to prevent perforation. I was in the hospital about to have my C-section when my usual provider called (apparently not realizing they had already referred me, which is typical of them) to tell me I could have an ultrasound now. \n\n So basically, if I hadn't insisted on getting ultrasounds, this guy would probably not be here (ETA: to be clear, although perforation has \"only\" a 50% fatality risk, that is with oversight and prompt treatment. I would have carried him 8+ more weeks to term with no intervention had I not had ultrasounds. Almost definitely wouldn't have been okay.)\n\n I had an argument on babycenter with a mom who was refusing her scans because nothing could make her abort. I just want everyone to know that there can be something wrong that you can *fix*. The baby can actually need help in there. It's not just all or nothing.", "permalink": "/r/happy/comments/qgowq3/my_son_is_12_months_corrected_after_being_born/hi9gpm2/"}