{"id": "t5_2tand_t3_mubjog_t1_gv9716l", "creation": 1618955943, "origin": "t5_2tand_t3_mubjog", "height": 1, "replied_to": "t5_2tand_t3_mubjog", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PositiveJourney", "text": "This honestly sounds like you were stalking my life with how close our experiences are. I’ve always heard of the small steps approach but I never really tried it because I didn’t think something as simple as drinking water or doing a chore could help me change anything . I always wanted to tackle the biggest issues first but never found the motivation to do so.\n\nI appreciate you taking your time to write out this comment. I definitely want things to get better and if doing small things is the best morbid than I’ll try it.\nToday I got out of bed 20 minutes earlier so I was able to eat and shower without stressing out about rushing to work so hopefully that’s a start. \n\nI’ll slowly answer the questions you have provided.\n\nQ1.What am is dissatisfied with in my personal and professional life?\n\nA1. For my personal life I am dissatisfied that I only have a group of online friends and no friends who live near me, I am dissatisfied  that I am in my mid 20s and I still live at home and I am dissatisfied that I am not taking care of physical or mental health at all.\n\nIn my professional life I am dissatisfied that I am still at the same part time job I’ve had since high school and that I’ve made no progress towards an actual career path for myself.\n\n\nQ2 What are my Vices? Why do I have these Vices?What would I Ideally replace these vices with so that I can cope in a healthier manner?\n\n\nQ3.\t⁠What are things that I have been putting on the shelf, and can be done in a day or week? These are the things that can help generate some momentum without being to overwhelming.\n\n\n\nQ4.\t⁠Why do I want to change? Think very hard about this one. Make it specific and honest. Look at this reason whenever I feel demotivated.\n\n\n\nQ5.\t⁠What are some things I struggle with mentally/cannot let go of? Any past trauma? Issues with my appearance or in general? Toxic relationships? Depressive episodes/anxiety/etcetera.\n\n\n\nQ6.\t⁠What kind of person do I want to be (my ideal)? What values do you want to uphold, and what kind of life would you find truly fulfilling?", "permalink": "/r/DecidingToBeBetter/comments/mubjog/how_do_i_break_this_cycle_of_me_doing_nothing/gv9716l/"}