{"id": "t5_2tand_t3_q9zwiz_t1_hh0pj0h", "creation": 1634498356, "origin": "t5_2tand_t3_q9zwiz", "height": 1, "replied_to": "t5_2tand_t3_q9zwiz", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Kaye480", "text": "Thanks for reaching out. I've walked in your steps, just so you know this is what I was able to do over time, by figuring it out and have a lot to share. Eventually, you will come to this decision deep in your gut on how you want to leave the situation.   Always come from a place of 'I want better than this shit'. \n\nDepends on how strongly intent you are of moving, that's up to you. Weigh many your pros and cons as best as possible, you have to save yourself.  I would say start using your intuition now, or at least trust it much more, make a list of the things you will and will not accept and stick to it, make a 'general'  list of the things you'd like to accomplish for you as a motivation, avoid scenarios that remind you of childhood, treat that like a checklist.\n\nDo internet searches on where you want to go, how much it will cost, the neighborhood, social services, crime stats etc. Brainstorm your butt off, it's a big life changing logistical thing so budgeting is key.\n\nSpend more time in nature that will help you dump the negativity and think better. You do not have to stay in the negative environment.\n\nBecome increasingly aware of your emotional and cognitive vulnerabilities and be lovingly honest with yourself, never lie to yourself and always depend on yourself and know when to reach out for help from the right people at the right time. Live by yourself, do not live with a boyfriend until you are solid and extremely confident, perhaps over time you may not want to do this.  Always keep your cellphone on you, and don't tell them your plans to move, misery loves company, they will try to talk you out of it and feel guilty.  \n\nOnce your survival needs have calmed down significantly, take some Udemy course in social psychology/ NLP for self understanding and future proof b.s. 'inoculation' against negative people. There's the podcast called Unslaved is a very good\n place to learn from.   \n\nAs far as psych counseling to seek, that is also up to you, but be very aware that they all may not have done their inner work either, or may be to closed off to be compassionate, play mind games, have boundary and respect issues themselves, they are worse than medical doctors. Don't let their certifications and professional initials after their name amaze, impress or fool you. \n\nThat's just the reality in my personal experiences when people allow themselves to treat people badly and how to learn to see right through them. \n\nYou got this, and can make a life for yourself on your own terms!", "permalink": "/r/DecidingToBeBetter/comments/q9zwiz/should_i_24f_leave_my_parents_home_and_move/hh0pj0h/"}