{"id": "t5_2tand_t3_q9zwiz_t1_hh0k63v", "creation": 1634496128, "origin": "t5_2tand_t3_q9zwiz", "height": 1, "replied_to": "t5_2tand_t3_q9zwiz", "down_vote": 0, "up_vote": 30, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "intensely_human", "text": "So in a universe with trillions of trillions of trillions of atoms youve got two choices? That's an illusion borne of your habaitual thinking.\n\nWhat about joining the Air Force? What about teaching English in South Korea, or working as support staff for Doctors Without Borders for a year and emerging with $30k in the bank and a lifetime's worth of stories?n What about shaving your head and being a buddhist nun at a monastery in Thailand? What about doing a go-fund-me to buy a used motorcycle and then riding to Tierra Del Fuego and back up to Alaska and then back home and *then* dealing with your parents, learning motorcycle maintenance and general toughness along the way?    \n\nAll things considered I do not recommend anything in life that involves \"pushing through\" unless what's on the other side is worth it. Are you going to push through time at your parents' home to get to ... more of the same? Makes no sense.  \n\nDon't just power through anything without a clear notion of what you're powering toward. There is an enormous cost to mental and physical health to pushing through anything. It has to be worth it. Stress is not just a feeling it is a biochemical state that weakens your health, takes years off your life, disrupts the pleasure centers of your brain, etc. You **will** die eventually, so you have to make sure whatever it is your sacrificing your body and time to, is something that's worth it. In the end we all become a sacrifice to our own lives.\n\nJust \"powering through\" without a clear goal is also an illusion. You aren't powering \"through\", you're just \"powering\". And 99.9% of the directions in the universe aren't worth very much. You've got to have a vision, and make decisions according to the vision.  \n\nHuman life is like a wallet full of money. The money (time, health, potential) goes out of your pocket either way - the question is whether we're using it to buy something we want or just dropping it down the shredder, or buying something horrible.\n\nImagine forking over $100 and in return you get a bag of dog shit. Worth it? No. The $100 is your time; the dog shit is the life you get if you don't create a vision.", "permalink": "/r/DecidingToBeBetter/comments/q9zwiz/should_i_24f_leave_my_parents_home_and_move/hh0k63v/"}