{"id": "t5_2tand_t3_owkdca_t1_h7kwk25", "creation": 1628014359, "origin": "t5_2tand_t3_owkdca", "height": 1, "replied_to": "t5_2tand_t3_owkdca", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "marcotiero", "text": "Honestly, I get where you're coming from, this is what Napoleon Hill describes as the \"Devil\" messing with us.\n\nI'm 40, I spent my 20s going to night clubs every week and spending money that I didn't have, instead of doing like you did and focused on the sensible things. I didn't get my drivers licence until I was 34, bought my first house at 36 and only now have I found my calling.\n\nIt's definitely easier to say than to do, but you just have to relax, you're still young and have plenty of time. We all have our own journey and go at our own pace. At 27, you still have time on your side. Think of graduating as the last paragraph of this chapter of your book (of life). Get this out of the way, maybe give yourself a holiday (even a staycation) and relax a bit and recharge your batteries. Take some time to think of what you want to do for the next chapter (or next decade of your life). Think about what kind of career you want, where you want to live, and be specific. Do this with the type of woman you'd like. Don't just look for any woman for the sake of it, but think about what you'd actually be attracted to.\n\nAlso, try not to stress about buying a home, you'll get the right one at the right time. I missed out on a couple of houses that I liked when trying to sort my mortgage, but now I've got a house, which whilst not perfect, was ideal for my budget and has everything I need close by (2 minutes to my gym, supermarket built across from it after I moved here, 3 minutes to the motorway, which can take me to the airport in 5 minutes, city centre in 10, my mums in 20 minutes, 20 minutes to work). Take your time in searching, save up money for your deposit in the meantime and by the time you find the one you want, you'll be able to afford it.\n\nGood luck to you!", "permalink": "/r/DecidingToBeBetter/comments/owkdca/fumbling_in_the_end_zone/h7kwk25/"}