{"id": "t5_2tand_t3_7c5306_t1_dpnhb1v", "creation": 1510371478, "origin": "t5_2tand_t3_7c5306", "height": 1, "replied_to": "t5_2tand_t3_7c5306", "down_vote": 0, "up_vote": 58, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Dannyboi93", "text": "Oh dear, oh dear... this is going to be a long post. But whatever. Shit happens.\n\n1. First of all, you've recognised you have a problem - give yourself credit for that and truly appreciate that you know that because people go there entire lives without realising this and are stuck in a negative feedback loop. Guess what, you're not! How fucking lucky are you? Very. Appreciate that shit.\n\n2. Meditate. I'm fucking serious, meditate that shit off. First of all you'll get to know yourself better, second of all you'll become more intuitive, 3rd attentive, 4th happier. Don't ask how. Can't be bothered explaining, read it up if you're that interested. Many methods give many benefits. Go for it. If you say no, you're saying no to something that you -if you read about it- know is going to benefit you. Why would you say no to something good? Are you stupid? Prove you're not.\n\n3. [Read this book.](https://www.amazon.co.uk/Law-Attraction-Michael-Losier-ebook/dp/B002VHI8RM/ref=sr_1_1?s=books&ie=UTF8&qid=1510370648&sr=1-1&keywords=law+of+attraction+by+michael+losier) it's up to you whether you do or don't, but I have an inferiority complex - it's nearly killed me 12 times. This book changed that. Maybe it'll click with you, maybe it won't. Fuck have you got to lose? We all die anyway.\n\n4. Fucking do something! I want to be better than other people because it'll make me feel good. But if I don't actually do anything I'm lying... so I get out and do shit! Wanna know the easiest way? Go to the fucking gym! Work your ass off! Then you can be happy knowing you worked harder than all those fat fucks who sat on the sofa watching soaps all day. Your daydreams aren't fucking daydreams if you're working towards them are they? No! THEY'RE FUCKING GOALS!!! **You're visualising your fucking goals!** just by doing something you've changed everything! **Guess what? If you work hard you'll look good, if you look good people will wanna fuck you. Everybody enjoys fucking!**\n\n5. Recognise what you have here... and this is really fucking important!!! So pay attention.\n\n- You daydream, which means\n- You know what makes you feel good, which means\n- You know what you want, which means\n- You know in someway, what you want is possible, which means\n- If you work hard you can fucking get it!\n- So go and figure out how you're gonna make this god damn daydream you're real fucking day!!!!\n- **DO IT!**\n\n6. You can get what you fucking want! You've realised that, now it's time to go and fucking get it!\n\n7. You weren't born to suffer. What's the fucking point in that?! That's stupid, we were born to get things to make us feel good. So go and get what makes you feel good. Evolution didn't make us crave sadness to improve us, evolution made us crave happiness from things that improve us and help us live better and longer. This isn't up for debate - just fucking accept it.\n\n8. Motivate yourself motherfucker! Motivation is like taking a bath, doesn't last forever - that's why we gotta do it daily. Or whenever, sometimes I don't shower. Doesn't matter. Wasn't planning on getting laid, sometimes I take a day off. Which takes me onto my next point...\n\n9. Give yourself a fucking break man! (or woman, whatever) Me and you will both be dead in 100 years and none of this will mean jack shit. It doesn't really matter if things go tits up - what matters is if we wonder \"could I have done more?\" I sniffed £2,000 worth of coke in one night on a minimum wage job once. Hated it, wouldn't do it again. Don't regret it though. Made me who I am today. Last one...\n\n10. **WE DONT MAKE MISTAKES**, we only learn lessons. So guess what - this is a lesson. What you gonna learn from this? Whatever I don't care, just be better than you were yesterday.\n\nI'm outta this bitch!\n\nPeace\n\nEdit: dont know why the numbers went like that... whatever you get the point.", "permalink": "/r/DecidingToBeBetter/comments/7c5306/struggling_with_an_inferiority_complex_and/dpnhb1v/"}