{"id": "t5_2tand_t3_2b7xk2_t1_cj32ne9", "creation": 1405910993, "origin": "t5_2tand_t3_2b7xk2", "height": 1, "replied_to": "t5_2tand_t3_2b7xk2", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "But that is Mother Nature’s cruel hoax. She doesn’t really care either way whether you are unhappy — she just wants you to want to pass on your genetic material. If you conflate intergenerational survival with well-being, that’s your problem, not nature’s. And matters are hardly helped by nature’s useful idiots in society, who propagate a popular piece of life-ruining advice: “If it feels good, do it.” Unless you share the same existential goals as protozoa, this is often flat-out wrong.\n\nMore philosophically, the problem stems from dissatisfaction — the sense that nothing has full flavor, and we want more. We can’t quite pin down what it is that we seek. Without a great deal of reflection and spiritual hard work, the likely candidates seem to be material things, physical pleasures or favor among friends and strangers.\n\nWe look for these things to fill an inner emptiness. They may bring a brief satisfaction, but it never lasts, and it is never enough. And so we crave more. This paradox has a word in Sanskrit: upadana, which refers to the cycle of craving and grasping. As the Dhammapada (the Buddha’s path of wisdom) puts it: “The craving of one given to heedless living grows like a creeper. Like the monkey seeking fruits in the forest, he leaps from life to life... Whoever is overcome by this wretched and sticky craving, his sorrows grow like grass after the rains.”\n\nThis search for fame, the lust for material things and the objectification of others — that is, the cycle of grasping and craving — follows a formula that is elegant, simple and deadly:\n\nLove things, use people.\n\nThis was Abd al-Rahman’s formula as he sleepwalked through life. It is the worldly snake oil peddled by the culture makers from Hollywood to Madison Avenue. But you know in your heart that it is morally disordered and a likely road to misery. You want to be free of the sticky cravings of unhappiness and find a formula for happiness instead. How? Simply invert the deadly formula and render it virtuous:\n\nLove people, use things.\n\nEasier said than done, I realize. It requires the courage to repudiate pride and the strength to love others — family, friends, colleagues, acquaintances, God and even strangers and enemies. Only deny love to things that actually are objects. The practice that achieves this is charity. Few things are as liberating as giving away to others that which we hold dear.\n\nThis also requires a condemnation of materialism. This is manifestly not an argument for any specific economic system. Anyone who has spent time in a socialist country must concede that materialism and selfishness are as bad under collectivism, or worse, as when markets are free. No political ideology is immune to materialism.\n\nFinally, it requires a deep skepticism of our own basic desires. Of course you are driven to seek admiration, splendor and physical license. But giving in to these impulses will bring unhappiness. You have a responsibility to yourself to stay in the battle. The day you declare a truce is the day you become unhappier. Declaring war on these destructive impulses is not about asceticism or Puritanism. It is about being a prudent person who seeks to avoid unnecessary suffering.\n\nAbd al-Rahman never got his happiness sums right. He never knew the right formula. Fortunately, we do.\n", "permalink": "/r/DecidingToBeBetter/comments/2b7xk2/love_people_not_pleasure_xpost_rtruereddit/cj32ne9/"}