{"id": "t5_2tand_t3_2b7xk2_t1_cj32n8t", "creation": 1405910984, "origin": "t5_2tand_t3_2b7xk2", "height": 1, "replied_to": "t5_2tand_t3_2b7xk2", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "ABD AL-RAHMAN III was an emir and caliph of Córdoba in 10th-century Spain. He was an absolute ruler who lived in complete luxury. Here’s how he assessed his life:\n\n“I have now reigned above 50 years in victory or peace; beloved by my subjects, dreaded by my enemies, and respected by my allies. Riches and honors, power and pleasure, have waited on my call, nor does any earthly blessing appear to have been wanting to my felicity.”\n\nFame, riches and pleasure beyond imagination. Sound great? He went on to write:\n\n“I have diligently numbered the days of pure and genuine happiness which have fallen to my lot: They amount to 14.”\n\nAbd al-Rahman’s problem wasn’t happiness, as he believed — it was unhappiness. If that sounds like a distinction without a difference, you probably have the same problem as the great emir. But with a little knowledge, you can avoid the misery that befell him.\n\nWhat is unhappiness? Your intuition might be that it is simply the opposite of happiness, just as darkness is the absence of light. That is not correct. Happiness and unhappiness are certainly related, but they are not actually opposites. Images of the brain show that parts of the left cerebral cortex are more active than the right when we are experiencing happiness, while the right side becomes more active when we are unhappy.\n\nAs strange as it seems, being happier than average does not mean that one can’t also be unhappier than average. One test for both happiness and unhappiness is the Positive Affectivity and Negative Affectivity Schedule test. I took the test myself. I found that, for happiness, I am at the top for people my age, sex, occupation and education group. But I get a pretty high score for unhappiness as well. I am a cheerful melancholic.\n\nSo when people say, “I am an unhappy person,” they are really doing sums, whether they realize it or not. They are saying, “My unhappiness is x, my happiness is y, and x > y.” The real questions are why, and what you can do to make y > x.\n\nIf you ask an unhappy person why he is unhappy, he’ll almost always blame circumstance. In many cases, of course, this is justified. Some people are oppressed or poor or have physical ailments that make life a chore. Research unsurprisingly suggests that racism causes unhappiness in children, and many academic studies trace a clear link between unhappiness and poverty. Another common source of unhappiness is loneliness, from which about 20 percent of Americans suffer enough to make it a major source of unhappiness in their lives.\n\nTHERE are also smaller circumstantial sources of unhappiness. The Princeton psychologist Daniel Kahneman and his colleagues measured the “negative affect” (bad moods) that ordinary daily activities and interactions kick up. They found that the No. 1 unhappiness-provoking event in a typical day is spending time with one’s boss (which, as a boss, made me unhappy to learn).\n\nCircumstances are certainly important. No doubt Abd al-Rahman could point to a few in his life. But paradoxically, a better explanation for his unhappiness may have been his own search for well-being. And the same might go for you.\n\nHave you ever known an alcoholic? They generally drink to relieve craving or anxiety — in other words, to attenuate a source of unhappiness. Yet it is the drink that ultimately prolongs their suffering. The same principle was at work for Abd al-Rahman in his pursuit of fame, wealth and pleasure.\n\nConsider fame. In 2009, researchers from the University of Rochester conducted a study tracking the success of 147 recent graduates in reaching their stated goals after graduation. Some had “intrinsic” goals, such as deep, enduring relationships. Others had “extrinsic” goals, such as achieving reputation or fame. The scholars found that intrinsic goals were associated with happier lives. But the people who pursued extrinsic goals experienced more negative emotions, such as shame and fear. They even suffered more physical maladies.\n\nThis is one of the cruelest ironies in life. I work in Washington, right in the middle of intensely public political battles. Bar none, the unhappiest people I have ever met are those most dedicated to their own self-aggrandizement — the pundits, the TV loudmouths, the media know-it-alls. They build themselves up and promote their images, but feel awful most of the time.\n\nThat’s the paradox of fame. Just like drugs and alcohol, once you become addicted, you can’t live without it. But you can’t live with it, either. Celebrities have described fame like being “an animal in a cage; a toy in a shop window; a Barbie doll; a public facade; a clay figure; or, that guy on TV,” according to research by the psychologist Donna Rockwell. Yet they can’t give it up.\n\nThat impulse to fame by everyday people has generated some astonishing innovations. One is the advent of reality television, in which ordinary people become actors in their day-to-day lives for others to watch. Why? “To be noticed, to be wanted, to be loved, to walk into a place and have others care about what you’re doing, even what you had for lunch that day: that’s what people want, in my opinion,” said one 26-year-old participant in an early hit reality show called “Big Brother.”\n\nAnd then there’s social media. Today, each of us can build a personal little fan base, thanks to Facebook, YouTube, Twitter and the like. We can broadcast the details of our lives to friends and strangers in an astonishingly efficient way. That’s good for staying in touch with friends, but it also puts a minor form of fame-seeking within each person’s reach. And several studies show that it can make us unhappy.\n\nIt makes sense. What do you post to Facebook? Pictures of yourself yelling at your kids, or having a hard time at work? No, you post smiling photos of a hiking trip with friends. You build a fake life — or at least an incomplete one — and share it. Furthermore, you consume almost exclusively the fake lives of your social media “friends.” Unless you are extraordinarily self-aware, how could it not make you feel worse to spend part of your time pretending to be happier than you are, and the other part of your time seeing how much happier others seem to be than you?\n\nSome look for relief from unhappiness in money and material things. This scenario is a little more complicated than fame. The evidence does suggest that money relieves suffering in cases of true material need. (This is a strong argument, in my view, for many safety-net policies for the indigent.) But when money becomes an end in itself, it can bring misery, too.\n\nFor decades, psychologists have been compiling a vast literature on the relationships between different aspirations and well-being. Whether they examine young adults or people of all ages, the bulk of the studies point toward the same important conclusion: People who rate materialistic goals like wealth as top personal priorities are significantly likelier to be more anxious, more depressed and more frequent drug users, and even to have more physical ailments than those who set their sights on more intrinsic values.\n\nNo one sums up the moral snares of materialism more famously than St. Paul in his First Letter to Timothy: “For the love of money is the root of all evil: which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.” Or as the Dalai Lama pithily suggests, it is better to want what you have than to have what you want.\n\nSO fame and money are out. How about pleasures of the flesh? Take the canonical hedonistic pleasure: lust. From Hollywood to college campuses, many assume that sex is always great, and sexual variety is even better.\n\nThis assumption actually has a name: the “Coolidge Effect,” named after the 30th president of the United States. The story (probably apocryphal) begins with Silent Cal and Mrs. Coolidge touring a poultry farm. The first lady noticed that there were very few roosters, and asked how so many eggs could be fertilized. The farmer told her that the virile roosters did their jobs over and over again each day. “Perhaps you could point that out to Mr. Coolidge,” she told him. The president, hearing the remark, asked whether the rooster serviced the same hen each time. No, the farmer told him — there were many hens for each rooster. “Perhaps you could point that out to Mrs. Coolidge,” said the president.\n\nThe president obviously figured these must be happy roosters. And notwithstanding the moral implications, the same principle should work for us. Right?\n\nWrong. In 2004, two economists looked into whether more sexual variety led to greater well-being. They looked at data from about 16,000 adult Americans who were asked confidentially how many sex partners they had had in the preceding year, and about their happiness. Across men and women alike, the data show that the optimal number of partners is one.\n\nThis might seem totally counterintuitive. After all, we are unambiguously driven to accumulate material goods, to seek fame, to look for pleasure. How can it be that these very things can give us unhappiness instead of happiness? There are two explanations, one biological and the other philosophical.\n\n\nFrom an evolutionary perspective, it makes sense that we are wired to seek fame, wealth and sexual variety. These things make us more likely to pass on our DNA. Had your cave-man ancestors not acquired some version of these things (a fine reputation for being a great rock sharpener; multiple animal skins), they might not have found enough mating partners to create your lineage.\n\nBut here’s where the evolutionary cables have crossed: We assume that things we are attracted to will relieve our suffering and raise our happiness. My brain says, “Get famous.” It also says, “Unhappiness is lousy.” I conflate the two, getting, “Get famous and you’ll be less unhappy.”", "permalink": "/r/DecidingToBeBetter/comments/2b7xk2/love_people_not_pleasure_xpost_rtruereddit/cj32n8t/"}