{"id": "t5_2tand_t3_q8o8f2_t1_hgrrles", "creation": 1634323383, "origin": "t5_2tand_t3_q8o8f2", "height": 1, "replied_to": "t5_2tand_t3_q8o8f2", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rocksteady2R", "text": "My handful of $.02?\n\n* therapists ought to be quite used to reticent patients.  it's the nature of our wounds that we wnat to keep quiet about them.\n\n* Even so, your first therapist might not be \"your\" therapist.   My first one suggested i give up an adiction for lent.   \"mother fucker, if it was that easy, i wouldn't fucking be here.\"   I gave him 3 visits before he said that, and i was on the fence the whole time.    Be prepared for this possibility.   I would think you ought to have a reasonable sense of trust within the first 2-3 visits.   I recently compared finding a therapist to finding a barber, and i think it holds.  YOu've got to really really really like your barber (or you ought to, so I think).   You don't go back to a barber if he can't hold a conversation you feel good about just as much as you don't go back if he leaves you looking horrible.   There are plenty of therapists, don't be shy about   finding one you like.\n\n* Mine was a referral from my physical doctor.   I liked her instantly, and was willing to commit after that first visit.   Having said that - I *still* only teased out my problems a few at a time.  I had 3 major things going on, and the first two were easy enough to lay out and talk about.  the third was my shameful secret, and i think she suspected it was there, but it was visit #7 when i finally brought it up.\n\n* having said that though - part of a therapists job is to push you into some revelations.  Well.... they may not say that's part of their job, i guess that's fair.   but it happened with me, and i appreciate the hell out of it.She led me to the water, I'm the one that had to drink, to use an idiom.  \n\n* I asked to record the sessions on my phone.  bought a little microphone ($20) for it too.   I'd record, and then listen to it on my various commutes in the car, or at bedtime, or on a walk.   This REALLY helpe me absorb the conversation, as often enough i would miss things, point out where i was still lying to myself, or i'd talk over her.  Those conversations cost me $150 an hour, right?  it was a godsend to be able to have that conversation over and over.  I think some therapists might not like this, but I'm an exceptional person and really just do what i want.... your life, yoru money, your therapy.   I think of it like a lecture at school or something - you can only pay so much attention *during* class, but how much better do we understand when we are able to go back over what was said and organize the notes?\n\n* So yeah.... If you don't want to dive in head first, feel free to start with a teaser.   also - a given therapist might have a series of 'ice-breaker' conversations reay to go.   mine had said she had a few excersises she liked to see new patients work thru.   Hers were ifferenent word-play/association exercises.  \n\n\n anyhow.  good luck.", "permalink": "/r/DecidingToBeBetter/comments/q8o8f2/i_want_to_book_an_appointment_with_a_psychologist/hgrrles/"}