{"id": "t5_2tand_t3_7nh6i7_t1_dsdj520", "creation": 1515435097, "origin": "t5_2tand_t3_7nh6i7", "height": 1, "replied_to": "t5_2tand_t3_7nh6i7", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rattl3me_throw-away", "text": "Hey, sorry it took me a couple days to get back. Responding to these takes a lot of emotional energy and I just have been burnt out. \n\nI read this response when you first made it and I’ve been thinking about it a lot. I understand what you’re saying and I even put it into practice with some positive results!\n\nI can see how I’m not thankful for the things in my life. I want things in my life I don’t have. In a lot of ways that’s not a bad thing. I have ambition, I have goals, I’m not complacent in where I am. In a lot of ways it has a negative effects too. I compare myself to others, I buy things I don’t need, I’m trying to live up to an image rather than just being myself. \n\nI went to a friends house that I don’t normally hang out with and there were a bunch of people I didn’t know. I found myself very nervous and comparing myself to people around me. Wondering what they thought of me etc. I thought back to this and just started thinking of the things I was thankful for. Thinking of what I wanted and how I wanted the night to go. I practiced mindfulness in that moment and went on to have a good night. Every time I felt myself slip I could grab myself and hold myself up. I was really proud. \n\nI think vocalizing these things would be really helpful. I have been talking to some people from this community and it’s really helped me in making progress. The problem I see is that it’s in my head and in text. I can see how vocalizing these things would have so much more power to them. \n\nI’ve thought about maybe talking to a therapist about some things because I don’t have too many friends near me that I would feel comfortable with speaking to this about. I have one friend from college who I know I could talk to and he’s actually a man of faith himself. I think I’m going to try vocalizing these things in my own time and maybe speaking to him before going to therapy.\n\nThank you for the meaningful response. I really appreciate it. ", "permalink": "/r/DecidingToBeBetter/comments/7nh6i7/my_life_fell_apart_this_past_year/dsdj520/"}