{"id": "t5_2tand_t3_7nh6i7_t1_ds9mmlz", "creation": 1515223902, "origin": "t5_2tand_t3_7nh6i7", "height": 1, "replied_to": "t5_2tand_t3_7nh6i7", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "movdev", "text": "hello again friend :)\n\nI would suggest you next ritualize vocal affirmations (some call them declarations) right when you get out of sleep into reality again.\n\nFor example, I have been having really bad dreams for along time. Due to jobless ness, it has lead to think of despair, that I can never change anything, that the same problems (ie rent, bills) are just getting closer and closer each day, that my so called friends and so called family have turned their back on me..you get the idea..pure negativity.\n\nWell I myself have turned to faith/prayer to combat this. So my affirmations and declarations are something like 'Thank you God for waking me up. For allowing me to wake up in the safety and peace in the land I am in. For the roof that is over me right now. For the dry bed I have slept in. For the food that awaits me in the fridge. Thank you God for this toilet and plumbing and hot water I can enjoy. I declare I believe in you God for giving me these things and I am thankful for them' etc. etc. \n\nIn my case, I need to add thankfulness for what I DO HAVE and not what I dont. And there really is no end to it if you start to be aware of your present environment that you enjoy. Heck, im thankful for having all my fingers, and 2 arms, and 2 legs to move about independently. Many do not even have that privilege!\n\nIt is very important that you say these things outloud...not just think them. Because the vocalization will energize the thoughts. Not in some mystical 'The Secret' Oprah winfery BS way, but just in terms of you declaring your intentions and your position on things. \n\nIf you are so inclined in faith, you can now add spiritual affirmations from the Bible and talk to God and be thankful for his promises. It will take you from being thankful for the here and now ground level view of your life/reality around you, to the 50 million foot level presepective of God and His power. Again, this is what works for me.\n\n\n\n", "permalink": "/r/DecidingToBeBetter/comments/7nh6i7/my_life_fell_apart_this_past_year/ds9mmlz/"}