{"id": "t5_2tand_t3_qgafmy_t1_hi4xw9b", "creation": 1635268320, "origin": "t5_2tand_t3_qgafmy", "height": 1, "replied_to": "t5_2tand_t3_qgafmy", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "labdog", "text": "There was a great movie, but I forgot the title. The main character commits suicide. When he lies dead on the floor in the morning, his phone rings. You know, the old style phone with answering machine. And we hear the messages. He just got his dream job. His girlfriend decided to get back to him. Someone had a refund to pay him. And so on, and so on.\n\nMany times I was thinking I was screwed. No way out, end of the line. But life taught me, that if you wait, most of the shit will somehow go away. I lost my job several times, each time before I even started to seriously look for a new job somebody called offering me a new one. I got plenty of super awkward personal situations that I thought I will never be able to meet some people again. But we met, we talked and we laughed. I totalled a car recently. It was my first accident. I was shocked and super stressed about it. But the insurance paid more than I expected. You never know.\n\nThere was also some really seriously bad shit in my life. I was crushed. Borderline depression. Dead drunk each day, or stoned, or both. But every time - I got up from the floor, got my shit together and started to cope.\n\nLife is harsh. I don't want to scare anyone, but you probably haven't seen a really bad shit yet. Bury your best friend in the woods at night, with your hands bleeding from digging... (Hands heal fast, at least hands...) That sort of shit, anyway. Using a car parable - you get a fender bender. But it's very, very likely, that driving long enough you will experience a serious car accident.\n\n\"On a long enough timeline, the survival rate for everyone drops to zero\" - guess the movie ;)\n\nOh, BTW, there's a song that helped me a lot in my life:[https://www.youtube.com/watch?v=AoFxUJtSp4g](https://www.youtube.com/watch?v=AoFxUJtSp4g)", "permalink": "/r/DecidingToBeBetter/comments/qgafmy/please_help_me_figure_out_life/hi4xw9b/"}