{"id": "t5_2tand_t3_obd5t4_t1_h5coqtj", "creation": 1626403182, "origin": "t5_2tand_t3_obd5t4", "height": 1, "replied_to": "t5_2tand_t3_obd5t4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "red-whine", "text": "you are not vain at all. you are experiencing something very normal and happens to many women. unfortunately, we’re socialized to believe our value comes from our appearance first and our desirability to men. it’s a very exhausting cycle that catches women of all types and causes us to feel inadequate. that cycle becomes even more damaging when you have experienced both sides. \n\nit feels really terrible to not get any positive male attention, especially at that age. sometimes it makes you feel like you’re not good enough at being a “woman”. that is NOT YOUR FAULT. your value is not in what men (or anyone) thinks of you. it is okay to want to be desired, but it does not define you. if the attention does subside, you will still be you! and that is more than enough. \n\ni think it also sounds like on top of beauty standards telling you how you’re falling short, your ED is saying the same. i know how toxic the cycle is of starving yourself only to be told how good you look - how are you supposed to stop when finally, you are being validated?? you’re not alone in that feeling. it has trapped so many of us, men and women. truly, again, remind yourself that it is NOT YOUR FAULT - you have been told you have to be thin to be beautiful - and more importantly, what’s the worst case scenario? what happens if you put on the 5 pounds and the attention stops? will you be any less valuable? will you have any less worth? absolutely not!!!! \n\nwhen all else fails, remind yourself that *genuine* desire and validation does not depend on appearance. you saw yourself that even when you felt attractive, alex still treated you poorly. LOTS !!! (i mean LOTS) of women have gone from receiving no male attention to receiving tons, not knowing how to handle it, and then living in constant fear of losing it. remind yourself that male attention centered around appearance isn’t always good, and your life is full of other beautiful and fulfilling things. \n\nsorry i wrote so much. i’m a 24 year old and i felt your situation very deeply. you are not alone, sooooo many women feel these same things. i would advise listening to mia khalifas interview on call her daddy. i don’t particularly like that podcast but mia has a beautiful story that has a lot of similarities to yours. it may give you some peace. i hope you take good care of yourself and remember no one suffers alone!!!", "permalink": "/r/DecidingToBeBetter/comments/obd5t4/19_yr_old_girl_who_began_receiving_attention_from/h5coqtj/"}