{"id": "t5_2tand_t3_3r2jf0_t1_cwkiskg", "creation": 1446396247, "origin": "t5_2tand_t3_3r2jf0", "height": 1, "replied_to": "t5_2tand_t3_3r2jf0", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DaTrowAway", "text": "I have a theory on magnetism.\n\nFirst of all, despite being pretty overweight... I've always dated very beautiful women. Coworkers and other people I know have literally told me that my girlfriends are way out of my league.\n\nI don't say this to brag or to suggest that I am magnetic, but I think I have one of the components of magnetism... maybe two. This *dating out of my league* thing has made me think very hard about how and why. I have friends who are far more attractive than me, but they're dating well below their league. \n\nI think some level of magnetism also explains why and how people date other people who differ on their level of physical attractiveness.\n\nSo first of all, we should address physical attraction. Anyone I know who is truly magnetic at least has some very attractive part of their body. Maybe they're pretty fit, maybe it's just a magnetic smile that can light up a room, but either way they've got something physical that you admire (perhaps even subconsciously).\n\nOverall, I think magnetism *is* beauty... but it can't be 100% physical beauty. Some very beautiful people are total jerks and are repulsive, rather than magnetic.\n\nSecondly, the person will draw you in to do something fun. In OP's examples, Guy invited her to play pool, Cara invited people for tea, and I can almost guarantee John's first date with OP was to do something fun. \n\nIn the example with Guy, maybe he was just waiting for someone to play pool with, or maybe he thought it would be a great ice breaker to make a new friend. It doesn't matter, both people had fun *together*. That's one trait of magnetic people. Again, it might be selfishly motivated, and for some people I think it is. But for me, I like to make other people happy so I will often try to bring them along to do something that I think will be fun for them. I want to be liked and this is a great way to have fun and make friendships stronger.\n\nThirdly, the person has to be a good listener. No matter what else you have going for you, if you can listen to other people (stories of heroism, problems, thoughts about the world) then you will make friends. This is probably the hardest one. It's not something you are born with or that makeup will fix. You actually have to care about what other people have to say (it's easy to tell if you're faking it too).\n\nSo, if you have some small element of the following three things, I think you will be magnetic:\n\n1. Physical Beauty\n\n2. Get other people to have fun\n\n3. Good listening skills", "permalink": "/r/DecidingToBeBetter/comments/3r2jf0/how_to_be_magnetic/cwkiskg/"}