{"id": "t5_2tand_t3_3r2jf0_t1_cwkdoow", "creation": 1446384971, "origin": "t5_2tand_t3_3r2jf0", "height": 1, "replied_to": "t5_2tand_t3_3r2jf0", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "This is an incredibly interesting read. I myself and struggling with magnetism, I'm somewhat of a wallflower too, depending on the situation. Like Guy, I desperately want to be liked. \n\n\nThe most magnetic I ever became was in the dating world. I'm female, so it was somewhat easier for me the achieve this, but at one point I was going on dates 5-6 times a week. It got to the point where if I woke up in \"not pajamas\" (a terrible habit of mine), my roommates would joke \"did you sleep in that or are you going on a date?\" At it wasn't just a parade of first dates, there were 4th, 5th, 6th dates (all without sleeping with any of them, I might add... Not that it's wrong, but for religious reasons it's not my thing) I put an end to it for two reasons: 1) it wasn't sustainable, my coursework and regular were, though I put some time/effort into them, slowly began to suffer and I just got tired of such serial dating. And 2) I met current boyfriend and I liked him very much. \n\n\nNow. Dating a lot isn't the epitome of success, far from it. But I did learn a LOT. It all really comes from inside yourself. I learned that because I also lost my magnetic field shortly after beginning to date current boyfriend, and I'm working to get it back. Essentially, the best and easiest way to be desired it to believe that you are desired (I say that in a \"desired for friendship/conversation/dating way\", not just lust). \n\nThis piece of advice is going to discredit everything I say, because of the embarrassing source, but it was a great step in my own journey, so I'll include it. Once I was suffering in an emotionally abusive relationship with a serial cheater (who was, oddly enough, named James... Too close to John for my liking). He was charismatic on the outside but a wreck on the inside in just about every way. I wanted so bad to fix it,  to make it work, to \"win\" him (thank god I didn't) and I started reading every relationship self-help source under the sun. Some were terrible. You shouldn't pay for anything, but I did. I chose a woman named Rori Raye. Don't pay for anything, but she does write some free articles. A lot of it discusses how you want to start by feeling good about yourself. Checking your emotions and radiating self-love. There are certainly ways to love yourself without being a good person (John) and there are ways to radiate magnetism without perhaps fully loving yourself (Clara/Guy), but the best way to gain a healthy level of magnetism is to love yourself, and to find yourself worthy of love (friendship and otherwise). \n\n\nAnother thing I learned from Rori is that not everyone will love you, and that's another secret to magnetism. There are some people who say to Guy \"No I don't want to play pool, leave me alone\", or just \"F off\". And some people who are jealous of Clara or find her pretentious, and there are some people who see through John and are repulsed by him. They generate have enough self-love to just let it go. Be careful, though. For everyone that does love you, not all will be willing to invest in you. Like Clara, being well-like can, strangely, also be lonely because other people have varying levels of commitment. She may be well-liked, but perhaps not invested in. \n\n\nSo, I moved on from the \"pyramid scheme\" feel of Rori Raye  after I was dumped by awful boyfriend. I took some time to recover and I started to read \"The Charisma Myth\"... It's sort of \"How to Win Friends and Influence People\" 2.0. It's got modern anecdotes and it changes the question. Rather than, how do I get people to like me (such as what Dale Carnegie seeks to answer), Olivia Fox Cabane seeks to explore some of the blocks that occur when we aren't feeling particularly charismatic and how we can instantly \"trick\" ourselves into feeling such. But, it's deep and a GREAT read. I highly recommend both books if you haven't read either, but The Charisma Myth is probably exactly what you're looking for. \n\nThe Charisma Myth also explores the different ways that we can be charismatic. I myself tend to thrive on the focus/kindness charisma, I have people tell me stories in Costco, give me free things, take care of me, because I tend to focus on others and how I can be kind to them. My dad, on the other hand, is more of a focus/authority charisma. He's the boss in every arena of his life. Picture this: he's a 6'3, heavily overweight structural engineer. And people LOVE him. It's because he's a natural leader, and he takes the time to listen to others. Every person who steps into his \"office\" (which... Given the way he carries himself usually just means his personal space... If you're sitting next to him on the couch at home, you're in his office. If you're in the car with him, you're in his office... But NOBODY resents this, we all like him for it), every person gets his attention and focus, and they go away with advice, sometimes sympathy or a laugh. You might come to him feeling frustrated and confused, but you always leave his presence feeling like you know where to go and what to do. But here's the thing, my dad isn't necessarily \"kind\". He doesn't worry about being polite or getting real with someone in Costco, he's a leader. \n\n\nOkay, this is getting long. The last bit I'll leave you with... You've got to be vulnerable. People LOVE vulnerabilities and they flock to them. Sometimes that means being candid where others might not. And you have to admit your flaws freely and openly (Dale Carnegie has a section about this in his book). Not in a pandering, self-effacing way, and definitely not for sympathy. More so, to give something for people to relate to. If you go off describing your amazing life and your fantastic job or your adorable puppy who's cuter than any other puppy who's ever existed (that's just not true. My puppy is.) We'll all just be sitting there like \"dude, I'm getting nothing\". But if you were to say \"You know, I'm kinda bummed out today. Someone sat on me on the metro. Á la Mis Thermopolis, Prin-CESS of Genovia\" or \"today I was such a dolt. I wore my shirt inside out for the better half of my morning\" and suddenly we can relate. You're showing your vulnerability (WITHOUT seeking sympathy or getting too heavy) and we relax. We can show our imperfections too.", "permalink": "/r/DecidingToBeBetter/comments/3r2jf0/how_to_be_magnetic/cwkdoow/"}