{"id": "t5_2tand_t3_htrx05_t1_fyond0a", "creation": 1595270141, "origin": "t5_2tand_t3_htrx05", "height": 1, "replied_to": "t5_2tand_t3_htrx05", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ryman13333", "text": "I totally know what you mean. Although he is playing a character that doesn't mean there aren't people somewhat like that. I certainly have known some. \n\nI believe an entrance into that sort of mindset can come from a buddhist perspective. People nowadays like to call it \"mindfulness\", which is somewhat funny because I think having a full mind is kind of opposite the point of the practice. In my view, the whole practice of \"mindfulness meditation\" is to understand how our minds work. You can sit there and watch thoughts arise and disappear, and see how our whole body reacts to that. \n\nWhat this practice allows us to do is examine how we interact with the world. You say that you want to be \"positive all the time\" and I don't think this is possible or healthy to try and achieve. What I think is valuable is examining what happens when we go to a dark place. Understand how our anxieties and fears feed themselves in our mind, and how we treat them.\n\nWith this understanding it is possible to choose to change our focus. I think a sense of wonder about the things around us is a very natural disposition. Unfortunately it is easy for a large amount of our mental energy to be controlled by our ego. This control of the ego is not only present in people that are full of themselves but also in those with deep self-hatred.\n\nThe way the buddhists sum it up is with the idea of the empty nature of the world. Many misapprehend this idea and believe it to be nihilistic, however it is quite the opposite. Seeing this empty nature can free us from our obsession with the self, and allow us to see the beauty (and horror) of the world surrounding us!", "permalink": "/r/DecidingToBeBetter/comments/htrx05/i_want_to_see_the_world_through_joe_peras_eyes_i/fyond0a/"}