{"id": "t5_2tand_t3_92ocks_t1_e3evbla", "creation": 1533132840, "origin": "t5_2tand_t3_92ocks", "height": 1, "replied_to": "t5_2tand_t3_92ocks", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DU09", "text": "Excellent read, thank you. I believe life and the circumstances that surround us are a reflection of us. Basically we live within ourselves. Therefore when you meet that resistance, it's basically life checking if you have what it takes to move a step higher, it wont be easy, but you cannot achieve anything without effort or expenditure of energy. With enough effort and will you can get anywhere before you realize it. Problem is that 95% of times we do not want to spend any energy or make that effort. I suspect most of us run from ourselves most of our life since we are too afraid to change or become that which we are, as that will require effort or worse becoming a different person which may create problems for your current persona. So we end up working in a cubicle for hours on end, hiding in effect. I am guilty of the same mistake. \n\nThe quality of your life can be measured by the level of freedom that you have. I never felt more free than when I had no job, I was uncertain of my future yet positive, however I had the freedom to be and do anything I desired every day, as I had no constraints such a job or obligations towards anyone. This allowed me to discover me in effect, and be that which I am and do things I always wanted to do. It is strange that you can be very happy and free when you have literally nothing but yourself. I suspect most of our modern life is full of distractions to keep us away from ourselves. This includes, jobs/career, family, internet, smartphones, everything that surrounds us can make us forget who we are or rather, that we are there. \n\nWe must not let years pass without us being present and taking control of the life that we have, otherwise we are not living our life we are living a template life which has nothing to do with us. It is true that while in school we have more freedom which we gradually lose as we enter adult life. Once you have a mortgage and debt to pay you are basically imprisoned. Going by the above definition, in that moment the quality of your life will be very poor. Being present with all these distractions around you and making the right choices, having the right attitude and reactions which YOU control, not some circumstance, can change your life. Once you are in control of your life, then it is a pure joy to live.  But too often we get distracted and forget ourselves, it can pass even YEARS between moments of clarity. I hope this helps. ", "permalink": "/r/DecidingToBeBetter/comments/92ocks/how_to_buy_in_to_yourself_after_being_forced_to/e3evbla/"}