{"id": "t5_2tand_t3_i9d7dm_t1_g1ft0xj", "creation": 1597411303, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 72, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "itchy_bitchy_spider", "text": "^^^ OP (/u/ChodeBrad), please read and pay attention to this comment above. I can relate to your post very much, my wife left me because I was also so focused on being a good provider that I became emotionally manipulative. I also was raised by single mother with 4 sisters in unstable household. I went through her browser history, same story she was googling emotional abuse and when I read the articles it hit me like getting punched in the stomach because it was true.\n\nIt was never intentional, and I think it comes from me also being a logic-minded person who is always asked for help by others and at work to assist in fixing problems. I had been approaching the relationship with the same mindset; something to be \"tweaked\", analyzed, broken down and improved. I didn't respect privacy or individuality because my default is to be thorough and unwavering in applying logic to issues. This mindset has done wonders in my career and for \"pulling myself up by bootstraps\" and improving on my upbringing. But in the relationship, it meant that I didn't treat her as an individual or my equal; I treated her like a project.\n\nHer leaving was the worst period of my life, and meditation and \"jouraling\" (I don't write much so I do audio/video recordings to get thoughts out of my head) have both had noticable impact on my relationship with others and how I view them. I used to assume those activities were MORE focused on \"what's going on in your head\", but they aren't (for me at least). Much of it is actually about acknowledging/externalizing these thoughts, because doing so means they are temporarily dismissed and give you an unsaturated headspace where you can focus on your REAL emotions/feelings, not what you think you're emoting.\n\nThere are very important parts of you that exist to support operations with other humans, and these parts are typically overshadowed by your constant thinking until they've been so repressed that they explode all at once. Think about your short temper, and feeling sick to your stomach after realizing you're manipulative. You felt those with your body because you'd been trying to \"think\" your way through absolutely everything and inevitably it doesn't work that way. This is your body/feelings trying to tell your brain \"SHUT THE FUCK UP, I TRIED TO TELL YOU ABOUT THIS  BUT YOU DIDN'T PAY ME ANY ATTENTION, NOW LOOK AT WHAT YOU'VE DONE\". Realize that you are actually a sensitive person; you aren't used to handling the usual amounts love emotions or feelings.\n\nMeditation/journaling also makes it possible to \"feel\" your way through the relationship, like a regular human. Because while you can (and have) \"think\" your way through being a provider, you can't \"think\" your way through an emotionally healthy relationship.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1ft0xj/"}