{"id": "t5_2tand_t3_i9d7dm_t1_g1jc2bj", "creation": 1597472405, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "jennib153", "text": "Perhaps you're right. Perhaps he's genuinely asking for help to resolve his problem so he doesn't lose his wife and children and they can all have a much better life. I hope this is the case because his whole life will improve, not just his marriage.\n15 years ago I left an abusive marriage of 10 years. I also have a psychology degree (although I don't work in that area anymore), so I guess if I could give him some advice besides stop being manipulative it would be this.\nIf you haven't told her that you've gone through her search history, then don't tell her. I think this would make things worse. She's most likely a shadow of her former self and you can't begin to imagine how soul destroying it is to have your husband vow to change but then continues to be the same asshole he always was. Actions speak louder than words. \nIts quite probable that you have an undiagnosed anxiety issue, and this is where your fear of losing control and not being able to control others comes from. So, you could do a search on anxiety disorders and even generalised anxiety disorders and look for some small tweaks you can make to your life that can make small improvements. Thing with small incremental improvements is that if you stick with them they become life changing. \nIf you're experiencing a moment of anger because something hasn't gone your way, or a situation is out of hand and you expressed your anger, perhaps you could tell your wife \"I'm sorry I reacted like that, I just freaked out and lost my shit because THAT scenario wasn't in my head and I didn't know how to deal with it\" Actually stating how you're feeling goes a long way to understanding some triggers and allows others to show empathy and understanding about the cause of the outburst. \nPerhaps giving over some decision to the wife might help. Small, unimportant things at first, like which restaurant to choose for dinner. However be warned that she will be extremely nervous about her decision because over the years you've probably ground down any self confidence to zero. Genuinely compliment her on her choice of restaurant etc on your way home with something like \"I really enjoyed that tonight, nice work on picking xyz restaurant\"\nPerhaps after a month or two of working really really hard on being honest, allowing her to be the decision maker in some things, giving her genuine compliments you could tell her that you're really really sorry that you've been an ass all these years and that you've made her life difficult and made her afraid of you and that over the last couple of months you've put in a real effort to be a better person. Tell her that you're going to continue working hard to be the man she deserves and the father their children deserve. \nIf you can't afford therapy (and look, sometimes it takes a long time to find the right therapist and that's money some people don't have), borrow self help books and watch YouTube videos. I personally think Jordan Peterson is an excellent resource and it would be a great place to start. Even search YouTube videos from the female perspective and then it may help you identify some behaviours you engage in. \nBest of luck to the OP. I hope it works out well for you and for your wife, especially your wife 😊", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1jc2bj/"}