{"id": "t5_2tand_t3_i9d7dm_t1_g1esz5a", "creation": 1597380932, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 41, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "deeeelightful", "text": "I think it makes a lot of sense to dig into your own past now. I'm no therapist, but for me, it took months and months of coming to terms with how my upbringing shaped me, and further months of realizing that I have the ability to change my own behavior to have the life I always wanted.       \n\n\n\n\n\n      \n\n\n\n\n\n\nI think it's worth noting your successes to yourself as you see them. It can be easy to get bogged down in negative thinking, so any time you do something on the right path, allow yourself to smile. Firstly, you seem to have accomplished your goal of being a present father who does not abandon his family. High five, you're already doing better than the example you were given as a child! Everything you do now will just make things better and better.      \n\n\n\n\n\n\n      \n\n\n\n\n\n\nThis may feel like an insurmountable hurdle to overcome, but it's not. It's just going to take some baby steps. I think it's a somewhat common thing to only want to give logical feedback and leave emotion out of things. Something to keep in mind with bridging this gap with your wife is that often, women are not looking for advice or a way to fix something, they literally just need to be heard. So a simple example would be that maybe your wife wants to tell you about how her friend is driving her crazy with texting her all the time, and your best response may very well be to just say, \"wow, I hear that your friend is really bugging you!\" and that's it. No need to bring any logic or advice into a situation unless she explicitly asks.      \n\n\n\n\n\n\n      \n\n\n\n\n\n\nI hope I can be of some help. Like I said, I'm no expert, but I do feel like I can relate to your story. I realized that I was the one causing a lot of problems in my marriage, and that hurts. But it's also been very powerful. There are so many (free) resources out there, from here on out it just takes your strength of will to find them and do better.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1esz5a/"}