{"id": "t5_2tand_t3_i9d7dm_t1_g1fqaqt", "creation": 1597409624, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kipwrecked", "text": "You're a legend. Many emotional abusers cannot recognise their own behaviour, let alone that it has a negative impact. Deciding to do something about it is heroic.\n\nBe aware that emotions are hard for you, explain all this to your wife, and ask her to help you acknowledge your behaviours when this becomes difficult. Transversley, let your wife explain to you how this is hard for her, try to acknowledge when she struggles, and try to acknowledge which behaviours you exhibit that exacerbate this. The important point here is that you don't judge each other, or feel judged, but simply communicate as honestly and frankly as possible. She is allowed to react and feel the way she does, and you are allowed to react and feel the way you do. Working together you can consciously change this situation for the better, for the both of you. \n\nBeing angry is usually a mixture of other emotions. Take a time out when you feel angry or annoyed, and try to distinguish what emotions are coming up when you feel this way. With recognition and practice you will be better able to cope with these feelings. It seems likely that what may have been a coping mechanism for your mother has become a guiding principle in your life. Don't be afraid of your emotions, and don't be scared to share your feelings with your wife.\n\nIt's never too late work on these things, and you seem to have tremendous insight into your own behaviour, which will take you a long way.\n\nTry researching 'Cognitive Behavioural Therapy' - even if you can't afford it you should be able to find good resources and learn more about it.\n\nGood luck and don't give up.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1fqaqt/"}