{"id": "t5_2tand_t3_i9d7dm_t1_g1evhfa", "creation": 1597382774, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "happydactyl31", "text": "First, let me join the congratulations. Recognizing something like this about yourself is incredibly difficult and complicated.  \n\nThere’s been some great advice given that I will not repeat. It sounds like you’ve identified some of the roots of your behavior and that’s a very important step. Keep working to figure out why you thought these things were okay, both the initial idea and the reinforcement of that idea. These things can be rooted in abuse or other difficult circumstances beyond your control. They can also be rooted in or exacerbated by mental health or social disorders. \n\nIt’s really critical that you don’t ever use these as an **excuse** for the problem though. That’s a key difference. My therapist discussed it in these terms - deep issues like abuse or neglect happen without our consent. It’s a bad luck of the draw and it is not our fault. Those things leave lasting effects that we couldn’t avoid, but at a certain point in your adulthood, you have to take responsibility for whatever those issues are and start working on them. \n\nIt would be like if someone else broke your leg and you just laid on the ground moaning and refusing medical treatment. Is it your fault your leg is broken? No. Is it totally valid there would be a period where you’re not capable of rationally addressing the problem because of the pain it’s causing you? Yes. Is it *your* responsibility to get (or even sometimes just accept) help after that too-painful period has subsided, even though you’re not the one who caused the problem? Absolutely. \n\nBeyond that, a lot of mental health is fake it til you make it. You have the genuine, good desire to correct the behavior. You may be struggling to figure out what the right thing is. Talk with your wife - calmly and at a pace you can both process - and do additional research to figure out what kind of person, man, husband, and father you want to be. Literally make checklists and other reminders about what that entails. This may be particularly helpful if you feel like you have social processing difficulties. If you consistently remind yourself to do the right things, ask the right questions, and offer the right responses, slowly but surely it will start becoming easier. Eventually it will be a reflex. Don’t worry that doing it this way “doesn’t count” or something. Your reason is good. Your desire is good. It’s just a matter of training your brain to remember that in the moment. \n\nBest of luck to you, man.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1evhfa/"}