{"id": "t5_2tand_t3_i9d7dm_t1_g1g47b6", "creation": 1597417056, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "miau_am", "text": "It's not realistic to expect someone to suddenly have the insight and perspective you're talking about (accountability, etc.). \n\nI think you/people generally may be assuming manipulative people are more conscious and calculated than they often are. This makes sense because we see a lot of cases of *political* manipulation (e.g. office politics) but this is a different thing entirely from emotional manipulation that happens in family/romantic relationships. \n\nOften we think manipulation is someone sitting around, devoid of emotion, thinking, \"ah yes, if I make my wife feel like shit, she will be easy to control, which benefits me. Next time she annoys me I will tell her she's like her mother, which will hurt her. Muahahaha.\" \n\nMost of the time though, what's behind *emotional* manipulation is waaaaay more instinctual and unconscious. Say I'm at a 10/10 emotionally, my feelings are hurt, my insecurities are triggered, and I want the conversation to stop immediately, I might lash out with \"shut up, you're just like your mother!\" If that immediately shuts the conversation down, it's not hard to see how next time I might say the same thing without thinking about it, because it's effective. \n\nNotice the difference though. In the second, hurting my wife is *not* the goal; stopping the conversation and pain is the goal. If I had an equally effective tool to make that happen that didn't hurt her, I'd probably use it. \n\nAlso, side note, a lot of people are *really fucked* financially right now, so don't be too quick to assume the therapy thing is evidence of manipulative bs (though it might be).", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1g47b6/"}