{"id": "t5_2tand_t3_i9d7dm_t1_g1eh3jq", "creation": 1597373606, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 894, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "deeeelightful", "text": "I have to say, this is incredible that you would admit that you have a serious problem. If I was your wife, just a simple admission of this understanding, along with a sincere apology, would mean the world.         \n\n\n\n\n\n\n\n\n        \n\n\n\n\n\n\n\n\nI'm glad you are aware that therapy would be your best bet, and I'm really sorry that it won't work right now. However, there are tons of things you can do.       \n\n\n\n\n\n\n      \n\n\n\n\n\n\n1. Recognize that your abusive tendencies are not going to disappear just because you want them to. You will likely have to break these bad habits with a lot of hard work. I recommend reading Triggers: Creating Behavior That Lasts--Becoming the Person You Want to Be by Mark Reiter and Marshall Goldsmith or Emotional Chaos to Clarity by Phillip Moffitt.      \n\n\n\n\n\n\n      \n\n\n\n\n\n\n2. Learn what an apology should really sound like. It's tricky, but I think it makes a big difference in building a relationship. I suggest Brené Brown's podcast Unlocking Us, specifically the two episodes featuring Harriet Lerner.      \n\n\n\n\n\n\n      \n\n\n\n\n\n\n3. Couples therapy would also be great, but as that's not going to happen, I suggest learning from the Gottman Institute. Their website is amazing, as well as their Instagram account. They have a great book called The Seven Principles for Making Marriage Work, and if you have $50 you can invest in some workbooks and cards that I have found to be pretty effective in my own marriage. They teach a lot about emotional intelligence, so you can do some research on your own regarding that, too.     \n\n\n\n\n\n\n\n      \n\n\n\n\n\n\n4. Give yourself some grace and realize that you are being faced with an amazing opportunity to make your life wonderful. It's not going to be easy, so take it slow. A lot of people find that meditation and journaling are great, especially when going through major changes like this. You can do this!!", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1eh3jq/"}