{"id": "t5_2tand_t3_i9d7dm_t1_g1fc3xk", "creation": 1597398163, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 94, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "helteringskeltering", "text": "This is manipulation. Prime example.\n\nEdit: I feel I need to leave this here for you:\n\n\nSo, manipulation is not intelligent.\n\nHere is why.\n\nManipulation is a severe lack of understanding of your own needs and desires, and an inability to express the desires or urges you have through adult words. So you resort to very basic unrefined coping skills that you have developed when you were a child. People who manipulate, actually lack in emotional intelligence, to the point where they have to, as you say, “bend the will of others”, because they are incapable of using words effectively enough to express their true self and their true feelings—just as you likely did back when you were a child and sucked at using words to say what you meant. It comes from a deep fear that your feelings will not be heard, that they’re not enough to get you what you want, so your strong doubt and lack of confidence in your own ability to communicate is what drives you to manipulate. You end up having to observe and learn the behaviour of others to communicate what you need. That extra effort shows just how dependent you actually are on people, and how dependent what you get out of life is on the whims, thought processes, emotions and actions of others. Let that sink in.\n\nOnce you’ve let that sink in, you’ll see how absurd manipulation actually is, and how wasteful all that time learning the patterns of others feels. You are living your life based entirely on others. That is parasitic.\n\nI, too, have been a master manipulator in my past relationship. I knew how to do it and I could get what I wanted whenever I wanted because I knew how to navigate my partner’s feelings. It felt like a piece of cake. Until one time, I caught myself making other accounts on social media, to check something about him, to attain extra info about him that I could later use as leverage. Much like you going through your wife’s history without her knowledge and having this info that you would otherwise not be privy to. That was the point I realised I hit a low. I realised that the only reason I have this information, is not through immense intellect and skill as I initially thought, but through a severe inadequacy in basic communication, where the mere thought of sharing my feelings, my vulnerability, and my request to gain access to this particular info made me feel weak and useless. I realised this was the only way to feel in control and power, ironically, even though there is zero power in obtaining information through ANY means outside of directly asking. It is actually a very strong indicator that you have absolutely zero control and power over your OWN feelings and words.\n\nSo step one: do not snoop. Remember that each time you snoop, it’s an indicator that you suck at communicating your needs (because you have so little trust in yourself) so you resort to the coward’s option.\n\nStep two: figure out what it is you’re feeling. About any situation. Start small. Write it down and journal it. Think of some situations you’re dissatisfied with. Why? What would you like to change about them? What is your expectation?\n\nStep three: the hardest of all. Take the plunge and communicate this to your wife. Using neutral I-statements, making it all about how you felt in certain situations. Be vulnerable. Reference your journal. Again, start small, you don’t have to go into any traumas just yet.\n\nPractice this. You will soon see how manipulation is actually a sign of terrible weakness in the emotional field, and aside from having honed observation skills (through sheer, consistent avoidance of observing yourself), there is really very little intellect there at all.\n\nGood luck.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1fc3xk/"}