{"id": "t5_2tand_t3_i9d7dm_t1_g1fwlzc", "creation": 1597413322, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lalallamas24", "text": "I don’t trust you and I don’t trust this post. \nBased on your reply history, you only reply to those who have praised you for this “realization”. But you’ve never responded to someone who has called you out for your ways. This is a huge issue imo. On top of that, what motivated you to sneak through your wife’s search history? \n\nPlus let’s actually talk about your wife, for a hot second. The fact that she has now been researching the way that you’ve been treating her speaks VOLUMES. She is so hurt by your words and your actions that she is researching why you are treating her the way you are treating her.. does that make sense? The damage is so far done. Good on her for being a strong willed woman and saying that she would never want to be with an abuser. Does being categorize as an abuser hurt you more or is it the fact that she sees you as one? She, your wife, your supposed equal. I’m sorry but would you ever treat your friends in the way that you treat your wife? I frickin hope not. Plus why would you ask her to marry you for you to now just use her? I mean c’mon. Your wife sounds like an amazing human being and the fact that you just took advantage of her? \n\nNah dude, you don’t see it quite yet. Yeah sucks to realize those characteristics fit your bill, but here’s the thing you need to pay it forward now. Apologizing won’t do anything. Her trust in you is gone. You want your wife back? Stop doing what you’re doing. Seriously. Cut it the fuck out. I don’t know you, but I try to believe people don’t want to intentionally hurt anyone, so I’m saying this with a lot of care, but you’re better than this. Make good on your word. Good job recognizing it, that’s the easy part in my eyes. You want your wife back? You better be there for her. Every. Single. Step. And communicate for fuck sake. It’s not that hard. She’s your wife! Trust her. Love her. See her. Hear her. Just like I’m sure she tried with you.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1fwlzc/"}