{"id": "t5_2tand_t3_i9d7dm_t1_g1erzr8", "creation": 1597380240, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 40, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "realperson67982", "text": "There are solutions. But you’re not going to like them. In fact, changing for most people, real change is the *last* thing they would ever want to do. If it was easy, you would have just done it! Furthermore, I want you to think of the last thing you would do to change, the thing you’re most scared of, but a little scared that you might be supposed to do it. It’s probably that. Change sucks ass.\n\nBut it opens opportunities for extremely fulfilling ways of living, more full, more beautiful probably than you can even imagine. The first solution will explain the reason for this.\n\n1. Most men really do live lives of quiet desperation: totally devoid of emotion. Emotion is a huge part of what makes life meaningful. Many guys cut off from emotion in their teens and don’t ever come back to it. This results in a flat life, as if in black and white, rather than in color. If you are living this way, I have a pretty big hunch that you that you are living in black and white.\n\nIf you’re emotionally abusing others, you’re emotionally abusing yourself. Probably by suppressing and cutting off from those emotions. This makes your emotions go numb. Learning to have a relationship with your own emotions, will vastly improve your life, and the life of others around you. You learn to love others, through loving yourself.\n\nI know this, because I lived in black and white for some years. Eventually, after trying everything, I began to find ways out of it. There are ways. The most important and effective of these was:\n\n2. Sobriety. Sobriety from everything that I had been (often unknowingly) using to stuff down my emotions. For me that was porn, weed, sweets, and carbs. This was a radical lifestyle change that took some time to get to. It doesn’t happen overnight. You don’t have to give up the exact ones I did, it depends on what your deepest addiction is. For me, my emotions cut off about the time I started looking at porn and masturbating. And that was the hardest and most painful one to stop. But let me tell you, after 40+ days of no orgasm, no porn, no weed, no sweets, and very little carbs, I felt emotions I had totally forgotten about. It was insane. Life was this beautiful rainbow of emotions to appreciate, yes even finding beauty in deep sadness. I related to others in ways I never had. I found out, and I had NO IDEA, that other people rely on eachother for their problems—quite often! Those things you would never tell anyone, that keep you up late at night? Yea! Those! We’re supposed to work through those together. Which brings me to:\n\n3. Join a men’s group. This is my number one recommendation for you. You may need counseling too, but no one can call you out on your bullshit like a men’s group. AND YOU NEED THIS from what you have said. Men’s group is a group of guys that get together and just talk. You make an effort to be vulnerable and really share what’s *emotionally* going on in your life *currently.* (Told you you might hate it). A lot of these issues you’re talking about are specific to men. There are a lot of problems with the way men are treated in this society, and lots of secret struggles we all bear quietly and alone. Women are not a dumping ground for these emotions or a blame bin. These are things that must be worked out with other men. The men’s groups I’ve been to worked like this. Each person gets ~5 minutes to talk and express what’s *really, authentically, emotionally* going on in their lives. This is done best while taking responsibility for your actions, thoughts, perceptions and emotions instead of blaming others. Ex: instead of “she makes me so angry doing x” one would say “I feel angry when she does x.” \nAnyways, these have been profoundly healing for the silent plague of loneliness that haunts men that I know and myself. \nI met a guy at one, he started out: “I didn’t know what emotions were until I was 46.” Youre not alone, in any of your struggles, and if not feeling emotions is one—then far from it.\n\n4. Psychedelics in a therapeutic context. There is a growing body of research (which I wrote a 12 page research paper on) on the seemingly miraculous results of psychedelic therapy. Psychedelics helped to lift me out of the long depression I was in for one of the first times. They will show you your fears, the things you’ve been hiding from, and you very well may have to face them. But they can show you love and intimacy in ways you never could have imagined too. Both of these are highly therapeutic. Seriously the results are astounding with unheard of 60% success in treating people who had been depressed for an average of 19 years in a preliminary study. Fully healed of depression, from one therapeutic dose, and stayed that way for 6 months to a year. Look into this at your own risk and only do it if you know exactly what you’re doing. If you’re stupid about it, they can be traumatizing. But in a safe set and setting, with the right preparation and support, there is extremely low potential for error (barring those with psychosis or close family history of psychosis). \n\n5. Meditation. A great, accessible, totally free way to get back in touch with your emotions. It also increases your awareness and makes you much more effective, calm, and level-headed in daily life. Read a bit about how to do it, or just sit and focus on the sensation of breathing. If thoughts arise, just observe them and let them go, and come back to the breath. Start with a small amount of time, 5-15 minutes. In meditation, it’s just you and yourself. The way to meditate is the way to live life, because it will show you all the ways you get in your own way doing such a simple task. It is one of the most important tasks to me, because we spend all of our lives thinking and using our brains. Yet we never learn how our brains work or practice the art of thinking! To think, many people have never even taken 5 minutes to sit and watch their thoughts to see how they work. If you can train the mind, you can do everything better, because everything involves the mind. I say this to entice you, because it will also be a gradual and manageable way to learn to deal with emotions.\nBonus: a 10 day vipassana meditation retreat if you’re up for it. This should blast you into feeling again and healing some trauma... if you can do it. It’s probably the hardest thing I did in my life. Oh and meditation also really helped me get sober. \n\n6. Learn about psychology, emotions, and process trauma. A great way to introduce the rational mind to emotion. Read what makes people happy in life. Read about intrinsic vs extrinsic motivation (for example winning is extrinsic). See which makes people happier. The good news is, all of this will be good for you. The way you’re hurting your wife, you’re most likely hurting a part of yourself. Healing that part of yourself can bring out sides of you you didn’t know you had. I learned to be funny as hell again. To be goofy and cut up. To laugh my ass off. To be loving and nurturing. To be angry and in control of my anger, directing only to where it is rightful and useful. To be sad, and to be compassionate and loving to myself in my sadness.\n\n7. The book Radical Acceptance was indispensable in my healing. It helped me to learn self compassion and self love: another vital thing I didn’t know people had. It is by a buddhist psychology PhD, and I highly recommend. Put any supernatural parts aside, although I believe she takes a scientific and agnostic approach.\n\n8. Self actualization and positive psychology. This is a whole field of psychology devoted to becoming the best a person can be. I recommend this, because I know you love to win. I think part of this is good, perhaps a desire to be the best you can be? But part of it is to put yourself above others, it seems. Self actualization will show you truly effective ways to live a life full of fulfillment, emotion, effectiveness, and contributing something great to society. \n\n9. I should have mentioned this first: google and/or get a book on healthy boundaries! Your boundaries are not healthy if you’re manipulating others. Healthy boundaries are this: I am responsible for my thoughts, beliefs, emotions and actions. Others are responsible for their thoughts, perceptions, beliefs, emotions and actions. You’re not responsible for others actions, and letting them be will probably be a huge weight off of your shoulders. And help them feel better too. Look up Assertiveness, as opposed to aggression or passivity. Assertiveness is being your best self, *while also encouraging everyone to be their best self in the way they want to be and respecting their boundaries.* \n\n10. For you specifically: be radically honest with yourself. How much of your “love” is just trying to get others to think highly of you? How often are you a “good person” just to look like a good person? **Do you really want to change, or do you just want to look like you’ve changed? How much do you want to just make a reddit post and make this go away, instead of actually doing the work to change?** And most importantly, **how has your manipulation and emotional abuse hurt yourself and others?** This one will hurt. It will help to have someone to keep you accountable and call you on your bullshit. And you’ll need to apologize **and** change your actions. **And** ***you don’t get to play the victim card against people who are the victims of your emotional abuse.*** I cannot stress this enough. You may be utterly cut off from emotions and probably won’t have any idea how much you’re hurting them. Well this hurts them even more. It’s saying “but *you* need to feel sorry for *me* because it’s just so hard to stop abusing you.” It’s incredibly, abusive. It’s the opposite of reality. It will be hard for you to change. You need someone to feel sorry for you, and that’s what men’s group, therapy, and good mature healthy friends are for. Not your wife. \n\nEdit: some clarification. Added #10. Continued below (last one).", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1erzr8/"}