{"id": "t5_2tand_t3_kgpics_t1_ggish18", "creation": 1608500802, "origin": "t5_2tand_t3_kgpics", "height": 1, "replied_to": "t5_2tand_t3_kgpics", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PSC1111", "text": "just some basic advice: thats a LOT of goals, and they reach very far into the future. a long term plan in general is good, but youre 15 man, a lot will change in the next few years and your goals probably will too, so dont be too crazy about following this one specific path. stay open for new plans.\n\nAlso, dont pile all that up in front of you, thats just discouraging. pick smth you know you really care about(health is always a good place to start), and take steps toward that rn. Best would be if that is something relatively easy.  do one thing right instead of a million wrong, then progress to the next thing, having become more confident and competent.\n\nAlso do not beat yourself up this hard!  when i was 15, maybe one or two people in class had girl/boyfriends, and each of those couples broke up pretty quick. Very few people look great with 15. If you treat your body well, in the next years akne will recede, you will naturally gain mass, etc.\n\nNegative thoughts like \"oh god im ugly\" will not only make it harder to improve and be happy, they are also very likely bullshit. most people who think they are ugly dont look horrible, i even knew a really pretty girl in high school who obsessed about her weight so unnecessarily, she developed an eating disorder. dont do that shit to yourself.\n\nyou probaly arent ugly or absurdly skinny for your age; if you are you probably wont be in a year or two; and even if you somehow, despite caring about your health and good habits(more than most teenagers), are still someone you see as a failure when you are 18:thats not even remotely the end.\n\nplenty great people went through loser phases. Otto von Bismarck(absolute fucking badass even though he was- ugh- a conservative) spent his college years partying and wasting a shitton of time. the guy who played iron man was a fucking alcoholic\n\n&#x200B;\n\n&#x200B;\n\nOOF sry for rant", "permalink": "/r/DecidingToBeBetter/comments/kgpics/how_do_i_get_disciplined_i_need_help/ggish18/"}