{"id": "t5_2tand_t3_l1tj2z_t1_gk1v77h", "creation": 1611228783, "origin": "t5_2tand_t3_l1tj2z", "height": 1, "replied_to": "t5_2tand_t3_l1tj2z", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dearlybeloved998", "text": "The only social media I use frequently is Reddit, Discord and Quora. Currently I am taking a hiatus from Discord. I also sometimes use Amino but very infrequently. I have an Instagram that I barely look at and only use to talk to an online friend of mine and I also have an old wattpad account that I no longer use, and also a Facebook to keep contact with my sister. I don't use facebook or Instagram, they're too toxic and devoid if any meaningful information, at least reddit has a lot of useful subreddits and is text based, instagram is basically an image based website where rich, privileged, attractive people post pictures of themselves that are photoshoped and enhanced with surgery and pseudo inspirational quotes in the captions of said pictures. Instagram is trash. Facebook is okay, at least partially, some communities are decent, but most of it is trash. Don't get me started on TikTok, it's just proving that all you need in life to make it big is to win the genetical lottery, and you will live in absolute luxury being a celebrity, getting millions of likes and attention every day, and going to meet and greets. For what? For doing nothing and looking pretty whole trash music is playing in the back ground.\n\nOn the other hand, Reddit and Quora are much less toxic, and since they are text based and not image based you never see celebrities and influencers showing off their perfect life™ to us peasants who are ugly, or perhaps are not really ugly, but just broke, with no money for surgery, dietitians, personal trainers and all that jazz, and overall different. Not inferior. I fucking despise Instagram and everything it stands for.", "permalink": "/r/DecidingToBeBetter/comments/l1tj2z/deleted_all_social_media_except_reddit_6_months/gk1v77h/"}