{"id": "t5_2tand_t3_ln0376_t1_go0frc8", "creation": 1613746952, "origin": "t5_2tand_t3_ln0376", "height": 1, "replied_to": "t5_2tand_t3_ln0376", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "putraadibadham", "text": "Welcome to the club brother. I was a stoner from 18-20, college years. First time smoking weed was an experience I could never forget. I was living in a dorm hostel on campus. Hang out next door a lot. Met this 2 people, one is a really deep thinker, one is chill stoner, which they both later on become like a brother figure that taught me a lot about life, about living in the city, the inner workings of it etc. On that night, we were planning to smoke, and I wanted to try for the first time. He was caling a friend of a friend’s plug, because his plug ran out. We met outside a club, a shady dealer around 2am riding a motorcycle. I was thinking all kinds of stuff, I never really done these stuff before. We got the weed, it was cheap weed actually nothing fancy, but we cant really get in campus after 12am. So we hid the weed inside a guitar and climbed up a gate of my college because the cops were guarding the entrance. It was semester break as well, so only a few people were on campus. We got in. He took out the weed and starts cutting with scissors and a paper, while my other friend played the guitar. One of my best memories ever. \n\nLots of good teenage memories smoking, one time we were stuck in traffic and a cop car was literally besides us, getting high in class, stoner talks, etc. In 2018 I was smoking everyday and night, and one time when I stopped, the withdrawl enters, was literally having panic attacks and anxiety. Scariest few months of my life, questioning reality and everything. But thank god it didn’t last long. I was never really addicted anyways, never smoked ciggarattes as well, just doing it for the sake of being teen, the curiosity and shit. \n\nBut a friend of my lost it. My ‘Deep Thinker’ friend developed psychosis from smoking too much. He lost it. He was always a philosophical person, unique individual, artistic i can say. He was convinced that he wanted to write a book from his life experiences, rather than finishing degree. He dropped out and went on working weird jobs, but he just couldn’t get what he was really imagining for. He was chasing this utopia if you might say. His instagram was really really weird, posting abstract shit and talking in languages on he could understand. We all were worried and scared, but he always say he’s in the best state he is in. He starts questioning existence, god, he went skinny, and was literally collecting trash on the sidewalk, this went on for 3 years, until his uncle saw him on the sidewalk and took him to a mental hospital. Few months ago I called him and he was doing well, thankfully. He admits the had a crazy phase, he told me that himself. It’s crazy what weed can do to people. \n\nBut at the end, Im kinda happy I went thru that tho. At least i can say when Im 50 or 60 I did teenage shit to the max. Enjoy life while you can. And you yourself will know when is enough.", "permalink": "/r/DecidingToBeBetter/comments/ln0376/decided_to_cut_weed_because_my_memory_and/go0frc8/"}