{"id": "t5_2tand_t3_oq4w4y_t1_h6c8ywy", "creation": 1627107937, "origin": "t5_2tand_t3_oq4w4y", "height": 1, "replied_to": "t5_2tand_t3_oq4w4y", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Majestic-Treacle-867", "text": "So glad that I found this post. What can I say, I understand you a lot because you are like me just that I am a girl. I have been through 2 serious relationships. In both relationships, my exes and I even talked about marriage and how many kids we would have later; however, I got dumped at both relationships. Today is one of the day I miss my ex and It comforts me that I see I am not alone out here.\r\n\nLike you, I truly believe that we should \"treat others as you want to be treated\". Therefore, I gave it all and was vulnerable in the previous relationship. Yet, he still wanted to break up with me after we had been together for 2 years. It causes me a lot of pain when we ended.\n\nFor a while, I thought that I was not good enough for him to keep me and value our relationship. It makes me feel really low about myself and attacks my self-confidence. I wear a lot more make-up and still feel not good enough. I lay on the bed for 14-18 hours and did not want to do anything.\n\nAt the same time, I watch a lot of videos about relationships/ how to overcome break-ups. I came to realize and accept that our relationship was just not work-out: we are not compatible and cannot make each other satisfied and happy...\r\n\nI got the logic, yet it is hard to control the emotion since I still have a lot of feelings for my ex. Therefore, I train myself to see through emotion and focus on what really matters at the moment. For me, since I am living by myself and making minimum wages, I understand that I need to prioritize my:\r  \n\n\n1. My well-beings\n2. My financial  security\n\nFor my well-beings, I tried different methods to stay on top of my mental and physical health. I believe I need to work on myself in order to get over and move on... I understand I could not do it by myself, so I look up what tools out there that can help me transform myself to a stronger and healthier person.\n\nI am a horrible cook, before, my ex usually took me out to eat. Therefore, after the break up, I usually skip meals and it really messes up my stomach. I also work 2 jobs to afford rental and paying bills. So, I have no time to learn and cook. Lucky we are in the age of technology where almost everything can be delivered to your door step. So, I stick with the [fresh meal plan](https://www.freshmealplan.com/Foods/2#traditional) to keep my diet regularly\n\nI tried my best to have enough sleep at least 7 hours a day and eat healthy diets. I was looking into supplements that can promote deep sleep but no side effects and no melatonin in the ingredients. I tried several brands and lately feel happy about [cerebral sleep](https://cerebralprime.com/product/cerebral-sleep/). Besides deep sleep with less interruptions, It helps me wake up feeling refreshed instead of drowsy and tired.\n\nLast but not least the game changer was [cerebral prime](https://cerebralprime.com/product/cerebral-prime/). It improves my mood significantly. I took it every working days so 5 days a week after wake up with empty stomach. It helps me get ready for a day with more optimistic thoughts and sense of living. Not just that, it boosts my energy and concentration dramatically that I take order and move so much faster at the restaurant I work at.\n\nFor financial security, I'm learn about saving and investing. I learn about trading from an old friend. She teaches me about stocks and options and day trading. I hope I can practice what I have been learning soon. She actually the one share me this link to purchase the [good supplements for healthy brain](https://cerebralprime.com/pg/29)\n\nI know it is a long post, I am just have too much emotions at this time... I miss my ex but at the same time I need to move on. Whenever, I have a thought of questioning the reason of break up and desperately hope we would be back, I just say an Our Father prayer and try to relocate my thoughts and energy to the moments...\n\nYou are not alone and REMEMBER YOU ARE NOT A PROBLEM! Let's get through this together and try to focus on what really matter. :)", "permalink": "/r/DecidingToBeBetter/comments/oq4w4y/am_i_the_problem_in_my_relationshios_or_is_it/h6c8ywy/"}