{"id": "t5_2tand_t3_owqdjd_t1_h7ihjdj", "creation": 1627962516, "origin": "t5_2tand_t3_owqdjd", "height": 1, "replied_to": "t5_2tand_t3_owqdjd", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "garbage_gemlin", "text": "hello! I actually had a similar thing. I was abrasive, confrontational, toxic and difficult to be around from 18-22, along with having a binge drinking problem and being messy. I lost friends i really valued due to just like long term annoying behaviour. I noticed my behaviour and started changing it at 20-21, but the damage was done and it took me a long long time to make real change, and I am still working on myself to this day. I also dealt with a lot of shame and embarrassment from my actions.\n\nThe first thing I had to do was create some space; I deleted my social media, moved to a new house with a roommate who was a stranger and just had as much of a fresh start as I could. \n\nThe 2nd thing I had to do was forgive myself, love myself and believe in myself. I used psychedelics as a tool for this but that isn't necessary. We all hold so many negative thoughts and stories about ourselves. you need to reframe your life story so that it doesn't focus on this event. Recently (3 weeks ago) i was thinking about the friends i lost and the shame i felt about that and i just started imagining reaching out to people i hadn't spoken to in years and them responding and maybe us being friends again. I felt BLISSFUL while imagining this. I just thought about it over and over until I felt like maybe they would be open to chatting with me and maybe I am not as unlikable as I thought.\n\nThe 3rd thing I did was tentatively reach out to people. I got social media back and i slowly added people back. I reached out to a couple of 'safe' people and then when they responded positively i reached out to a few more people and a few more. Everybody responded positively! I even received a surprise message from a friend that i really valued that i had bothered enough that she stopped talking to me 3 years ago and she wants to catch up.  \n\n\nI believe in you! people can change and while it sucks that you sucked back then, clearly you used that experience to learn and grow. It is lucky that happened to you at 18 and not at 25 or 45, because now you are a better person for the whole rest of your life!", "permalink": "/r/DecidingToBeBetter/comments/owqdjd/i_was_a_horrible_toxic_person_when_i_was_around/h7ihjdj/"}