{"id": "t5_2tand_t3_ax6shz_t1_ehsabyp", "creation": 1551726376, "origin": "t5_2tand_t3_ax6shz", "height": 1, "replied_to": "t5_2tand_t3_ax6shz", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kilotangoalpha", "text": "I was actually SO mad about this post I got on my computer so I could type a little faster and explain why this post is HARMFUL.\n\nOf course everything you said is a good fucking idea.  Great way to live.  The thing is, people with depression - a MEDICAL CONDITION - find doing these things DIFFICULT.  It does not matter how good an idea it is, depression affects one's ability to take care of one's self.  This includes everything mentioned on this list.  People with depression can often barely fucking manage to eat but sure, exercise & affirmations. whatever.  \nThe reason lists like this ARE HARMFUL is because when people are struggling with depression, this gives them the idea that it is their fault.  If only they could live by these non-professional Dr. Google standards they would not be depressed.  That is not the case.  This type of advice gives people with depression the idea that they are in control of their MEDICAL CONDITION and if they do not feel good it is their fault.  It gives them the idea that they do not need to seek medical attention because they could just exercise and meditate to feel better.  That is HARMFUL.  Everyone here, if you perpetrate advice like this, you are making those in your life with depression feel worse and struggle.  This is life-threatening.  \nIf you have depression, it is not your fault, you cannot control it by yourself, drinking water is a very good and helpful thing to do, but if you can get up enough energy to do one good thing to \"be better\", it is going to the doctor.  I know it's hard.  Do it when you can.  Try not to be discouraged if the first appointment doesn't go as planned.  Doctors are people and some of them suck.  There is someone out there who can help you with the things your body is doing to you.", "permalink": "/r/DecidingToBeBetter/comments/ax6shz/depression_a_list_of_things_that_may_help/ehsabyp/"}