{"id": "t5_2tand_t3_hqdy1u_t1_fxy1338", "creation": 1594659136, "origin": "t5_2tand_t3_hqdy1u", "height": 1, "replied_to": "t5_2tand_t3_hqdy1u", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Eladricen", "text": "The predicament is as old as love itself: you critique, and the only real distinction between you nagging him or giving constructive advice is the perception in his own head, how he feels that day, and how willing he is to give up parts of his identity and independence to accommodate your critiques regardless of how valid they are. When either of you express discontent about something the other is doing, someone's feelings and identity will pay the price. \n\nLabeling these sensitive relationship dynamics with things like \"gaslighting\" is so easy and perfect. Anytime you aren't accommodated, you're gaslighted/abused/rejected, etc. You both probably know full well how it feels to not be able to take anymore. Anymore rejection, anymore critiques, anymore hurt feelings, it's all just 1 straw away from breaking the camel's back. Yet to save ourselves, we must dehumanize and reject their experience (except we don't have to). Because ours is more important than theirs. (except it isn't)\n\nSo why is it that even after he cheated and improvement happened, things are still getting worse? We're not really looking in the right place here. He cheated, and now your attachment style is anxious as hell. When you say you were still doubtful of his fidelity, it's likely many things he did \"activated\" your anxious attachment and in turn causes you to exhibit behavior triggered by that. Not only are you probably not yet consciously aware of what triggers changes to your behavior with respect to the risk of him cheating again, but he is also probably totally unaware of how to deactivate your behavior.\n\nIn parting I'd like to give an example of a post-mortem style talk I had with an ex of mine. Neither of us cheated, but he was acting very distant and I was very upset after one night where it seemed almost as if he ignored me in the midst of having friends over. We all went to the club that night and I still felt ignored. So what did I do? I stopped even trying. When people hit on me, I'd dance with them, I wouldn't even look at this guy. I did everything I could to appear like I was having an awesome time without even engaging him. He had activated my own anxieties by ignoring me, and I was lashing out with my own revenge in a way. After a week of not talking to him, we had a big talk. He indicated he felt I was way out of his league, and of course, you could imagine that my response at the club only served to further dig that hole. Unwittingly, we were just activating each other's insecurities. We sat together and told each other the kinds of things that make us feel insecure in a relationship, that activate our attachment behaviors, and perhaps most importantly: how to deactivate them. I give this example because it's dissimilar enough that I believe it won't influence your own discussion with this guy if you choose to try again at any point. If you two are willing to talk about what triggers you, what the resulting behaviors are, and what you think would be the best ways to deactivate those are, you could very well find yourself in a very positive place like it did for us.", "permalink": "/r/DecidingToBeBetter/comments/hqdy1u/some_insight_please_i_used_to_be_critical_in/fxy1338/"}