{"id": "t5_2tand_t3_hqdy1u_t1_fxy1lgd", "creation": 1594659382, "origin": "t5_2tand_t3_hqdy1u", "height": 1, "replied_to": "t5_2tand_t3_hqdy1u", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Silentio26", "text": "I highly recommend the book \"why does he do that.\" The gist you may get out of it is that a lot of the times manipulative people get exactly what they want out of their victims, for a lack of a better word, with a well thought out behavior that drives their victim crazy. He doesn't want you to criticize his behavior, I mean, nobody likes criticism, and it doesn't seem like he actually wants to truly change at all. \n\nYou feel like when he just ditches you without saying anything while you set plans to talk with him it is a disrespect of your time. You feel that way, because it is the textbook example of someone disrespecting your time! \n\nBy denying you a chance to raise your concerns, he allows himself to continue doing it AND minimize his guilt about being so shitty towards you. If you stop complaining, he can easily fool himself into thinking that he's not hurting you in any way, since you're not raising any concerns. This type of disrespect will only grow with time if you let it. The brutal truth is, the more he steps on you, the more pathetic and undeserving of respect you will be in his eyes, compounding the problem. \n\nFor now though, he wants to be able to get away with being a shitty partner without any negative consequences. You're feeling confused and gaslighted and therefore start doubting yourself too much to raise any concerns. I very much doubt that it is a coincident that he is getting exactly what he wants out of you with his behavior. And I can promise you it's not because you're the one manipulating him.\n\nIt's good that you want to work on yourself, but relationships take two people mutually respecting each other (at least in good relationships). \n\nI also think you need to set some firm boundaries for yourself. Think through what you want out of a relationship and what is unacceptable to you. For example, it sounds like one of your boundaries would be that you are not okay with your partner sleeping with other people. You should be able to express that to your partner in a definite way, and include the fact that you will not allow him to disrespect your boundaries. You can say something like.. \"I am not okay with you ever sleeping, kissing, or sexually touching another woman. If you ever do it while we are together, I am going to break up with you,\" and follow through on it if it happens. Setting these types of boundaries isn't manipulative, it means having self-respect and integrity. \n\nObviously though, humans are flawed and there are times when he might do something that you find disrespectful without knowing it. However, if you bring it to his attention that what he did was not okay, and instead of trying to be better he tries to find a way to continue doing it without you \"nagging\" him in the future, and from what you wrote it seems to be working. Well, you are about to have a really bad time.", "permalink": "/r/DecidingToBeBetter/comments/hqdy1u/some_insight_please_i_used_to_be_critical_in/fxy1lgd/"}