{"id": "t5_2tand_t3_hqdy1u_t1_fxxy7pu", "creation": 1594657756, "origin": "t5_2tand_t3_hqdy1u", "height": 1, "replied_to": "t5_2tand_t3_hqdy1u", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "shaveend", "text": "The problem with constant criticism is, the person who's on the receiving side will eventually start to feel like he is never good enough and will start to resent the person saying it to him. Cuz every time when you're with him, he feels he gets belittled, and it makes him feel bad about himself. So to him, your words become toxic, no matter how true they may be.\n\nYou may be already picking your battles by not telling him every instance that you feel wronged, but from his perspective, every time you say something, it's definitely about something that he has done wrong.\nThink of it from his perspective, would you want to be in a relationship where you're told everyday , that you are wrong, not good enough and you should change, eventhough you've been trying hard (from what you've written, he has been trying). No, it will be very detrimental to your mental health.\n\nOn your part, what I would suggest is to compromise, show appreciation for his efforts and  recognize and complement his good qualities. The lack of appreciation and constant criticism is what usually drives a person to ignore everything the other person says. In his mind, since you never have anything good to say, why should he bother listening to you, since he knows that it'll only make him feel bad\n\nFrom what I've read, you have already reached that point and if you want to make it work, you'll need to have a conversation and tell him that you understand his perspective.\n\nIn no way am I saying, that you should stop telling him what he has done wrong, what I'm saying is that there is another problem that needs be addressed before trying to do that. (The effort should be made by both parties)\n\nIf those traits are intolerable, and he doesn't want to change them, the best thing is to break it off, he needs to realize his errors on his own and then change them. You can't try to change what he doesn't want to change.\n \nYou already know your perspective, I'm just giving you his perspective, for you think about it, before you make your final decision.", "permalink": "/r/DecidingToBeBetter/comments/hqdy1u/some_insight_please_i_used_to_be_critical_in/fxxy7pu/"}