{"id": "t5_2tand_t3_hqdy1u_t1_fxxwwzc", "creation": 1594657113, "origin": "t5_2tand_t3_hqdy1u", "height": 1, "replied_to": "t5_2tand_t3_hqdy1u", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nixsee", "text": "I don't think anyone could possibly come to any reasonable, definitive conclusion about this - as self-reflective and genuine as you seem to be, we're only hearing a small (likely biased) part of one side of the story. So, if you're truly genuine about all this, I'd be VERY skeptical of anyone who is strongly taking any particular stance on this.\n\nThis is especially the case regarding a term as strong as \"gaslighting\", which gets tossed around and accepted these days with almost zero self-reflection or concern (on full display in this very thread!). Often it seems to me that the person claiming gaslighting is the gaslighter themselves - but that's in general, not necessarily in this case. Moreover, what people tend to call gaslighting - a fundamentally psychopathic, malevolent behavior pattern - is really just the innumerable defense mechanisms that immature people (generally both parties!) subconsciously use to protect their fragile ego. Similar for labels of narcissist etc...\n\nSo, my first thought/suggestion is - ditch the notion of gaslighting from your vocabulary altogether. If there's even such a thing at all as a true gaslighter (I'm skeptical), it might be one in a million, or less. If there's any truth at all to your story (and that's not for any Reddit Doctor to establish), its far more likely that your ex-boyfriend is scared, insecure and broken, not a genetically predisposed psychopath. That's a pretty fair description of any human - its just how we are, by default,  especially one who has a past in being \"a player\".\n\nMy next question/thought is: You've broken up twice. Why are you still talking and meeting and discussing your non-relationship, seemingly with no progress towards contentment, let alone flourishing, on either side? There's other fish in the sea - carry on.\n\nThat leads to the deeper question that you need to ask yourself: Why be in ANY relationship at all?\n\nWe have one life to live and it will end likely sooner than we expect and surely sooner than we want. Time is the only thing we have - why would we give even a second of it to anyone when we could be spending that time on ourselves?\n\nThis, of course, is not at all to say that we should not have relationships - be they romantic or platonic. Its just suggesting that we should truly consider who we connect with, why and how. If we are going to trade away our precious time, freedom, and emotional energy, surely we should only do so if we think the relationship will help us live a better life than we otherwise could have alone.\n\nBut its worth seriously considering what are the things that you are seeking from a relationship with him, or anyone? Its quite evident that many (most?) people are in relationships for the wrong reasons - validation, prestige, attention, money, avoiding being alone with themselves, sex etc...\n\nAt the same time, there's many wonderful things that we can only get from relationships with others - for example, different perspectives and a judging, but compassionate, mirror that can help us grow into more knowledgeable, wiser, compassionate, better people. More than that, a \\*true, deep, genuine\\* relationship can bring a connection and experience unlike any other - a loving connection and identification with another, which helps us understand, make sense of and justify this otherwise meaningless and sorrowful existence.\n\nBut like attracts like (in a sense of maturity - personal characteristics are irrelevant), so it seems to me that its only possible to have the 2nd type of relationship if you have first developed a good relationship with yourself. One where you have self-confidence and the ability to give and receive honest, vulnerable, constructive criticism with joy rather than insecurity. Where you have patience and compassion and understanding for the shortcomings of yourself and others, while also maintaining standards.\n\nSo, what does it say about you if you are attracting and attracted to someone seemingly so broken?\n\nDeciding to be better - and I mean the real decision and action in life, not necessarily what gets shared in this sub - is fundamentally about developing humility. If pride/ego is the source of our defense mechanisms that present as gaslighting, then humility is the cure. Nothing good comes without it - you can't learn, have courage, love, or anything else unless you are able to take an objective view of yourself and your beliefs and put them in perspective and relation and harmony with others, and Reality at large.\n\nAs broken as you both seem to be (and, again, that's not to put you down - its simply the default for being a human, especially in such messed up societies as we have today), the reason you have some attraction to each other is that, at least at one point, you saw through through the chinks in each others' armor, behind the masks that you put on for the world to see, and saw the beautiful, humble, generous, compassionate potential that lay inside of each other. This recognition of what a human could be is the spark that creates \"true love\" and what has people throw aside their freedom (and often rationality) and hitch themselves together. Relationships fail insofar as one (or, likely, both) parties refuse to keep working to take off the armor, in which case you are better off on your own. But make no mistake, there's no reason why any relationship couldn't succeed other than fear and insecurity, which is fundamentally rooted in pride.\n\nWhat does this mean for you and him? I have no idea. You evidently have had some sort of connection that is worth sacrificing for, so maybe its possible to salvage things with some honest, vulnerable, soul-baring conversations. Maybe not though - there's plenty of other people in the world who you could start a new connection with without the baggage. Either way, you need to work to become the sort of person that the sort of person you'd like to be with would want to be with. You do that by first becoming the sort of person you yourself want to be with. You do that by taking a really hard, uncomfortable, terrifying, but honest look in the mirror. You seem to be doing that with this post, so things are looking up for you regardless of how this plays out. Stick to that process.\n\nA final thought is addressing the potential question of \"if you should guard your time as stingily as possible, why did you spend time writing this essay to a complete stranger who you will never know or \"get anything\" from?\". That goes to an even deeper level that I'll leave mostly unaddressed, other than to say that if you become better insofar as you develop humility, then the \"best\" you could ever become is purely humble, discarding your fleeting personal wants altogether and simply becoming a tool for the common good, for harmony. I've got plenty of progress left to make in my quest for self-humiliation, but I get more joy out of helping others lift themselves up than anything else.\n\nI hope this helps you (or at least someone) out.", "permalink": "/r/DecidingToBeBetter/comments/hqdy1u/some_insight_please_i_used_to_be_critical_in/fxxwwzc/"}