{"id": "t5_2tand_t3_n4ljjb_t1_gwyrmef", "creation": 1620172307, "origin": "t5_2tand_t3_n4ljjb", "height": 1, "replied_to": "t5_2tand_t3_n4ljjb", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "latraductoranerviosa", "text": "This story sounds so very much like my own. I was fortunate in that I was able to start snapping out of it sooner, but man... I relate so hard to so much of your story. Even the way you say \"claw yourself out of it\", I've used that exact word before: clawing myself out of that hole.\n\nI'm not 100% sure exactly what it was that triggered my own turn around, but I do know that at some point, I decided (probably unconsciously) that it was time to either give up, or to just TRY. I started trying again. I started acting like a person who actually wanted to be alive again. My father died a little while before I started picking up the pieces of myself and my life, and I used some of the money he left us to go back to college and finish my degree.\n\nMy vice was drinking. My trigger was not nearly as horrifying as yours (and can I just say how fucking sorry I am that you went through that?). To be honest, I think my \"trigger\" was just a series of smaller triggers over a period of years that culminated in the worst depressive episode of my life. Like you, I wasn't willing to commit suicide, even if I wanted to. I secretly wished, every night, that that would be the night I drank too much and died in my sleep. It was an ongoing nightmare, and the future didn't seem worth considering. \n\nThank you for sharing your story. I still struggle with anxiety and major depression, and part of me fears that I might fall into one of those episodes again. But the logical side of my mind not only doesn't believe it, but forbids it. Whenever I start to feel too low for too long, I take a long hard look at what's going on and I do everything I can to take care of myself, to gently guide myself through these far more minor depressive episodes. It hasn't been easy. It still isn't. People who go through this sort of thing, I don't think we'll ever \"have it easy\". But it does get better. My major horrible episode ended (or started to end) about 5-6 years ago. In the time since, I've earned a college degree, started work as a freelance translator, taught myself to play the ocarina and to knit, started writing again. My life is still not all sunshine and rainbows, but I am happy to be alive now. I enjoy working on myself. I enjoy the work I do. And I've worked so fucking hard to get to where I am now. \n\nI remember being where you are, looking at everything I had to fix, the mess that my life had become. I remember how overwhelming it was. But every tiny step toward progress fueled the hope that I'd somehow found, and I refused to let slow progress change my mind about moving forward. I became pig-headed about it, really. My small successes helped me to start believing in myself again.\n\nBelieve me when I say, you're a million percent correct that it doesn't matter how much time you feel you've lost. It doesn't matter how much time you fear it may take to reclaim your life. In my view, the point of living is to work on improving yourself, day by day. Just because you're starting from a particularly low point does NOT mean it's not worth it. \n\nI'm sorry this has gotten so long, but I just wanted to share that my heart goes out to you-- I feel pity for the person that I was when I was so desperately miserable. And I'm proud of you for having made it as far as you have. I'm proud of you for having the courage to share your pain, and to share this spark of hope with others who could be experiencing the very same pain and feeling absolutely and completely hopeless about the possibility of ever being able to live a real life again. No one can turn their lives around overnight. It takes small steps, and it's amazing to hear that you've started taking those steps. I sincerely wish you all the best on your journey forward. =)", "permalink": "/r/DecidingToBeBetter/comments/n4ljjb/after_drowning_in_depression_ptsd_and_addiction/gwyrmef/"}