{"id": "t5_2tand_t3_7xb3cq_t1_du89k92", "creation": 1518608472, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MattatouilleUK", "text": "Listen my dude,\n\nI'm 26 years old, I suffer with depression every single day of my life and I will unfortunately until the day I die. I broke up with the love of my life a year ago and I've lost most of my friends and a lot of my family.\n\nI'm overweight, full of anxiety and it took a lot for me not to end my life last year.\n\nThis year I decided to be better. I started studying positivity, looking at morning routines. What makes people successful. How I can implement things into my life that will make me enjoy my existence a little more.\n\nSo starting from the beginning of the year I've been writing down three things every single day that I'm grateful for. I've missed probably a week of doing it and it's the worst week i've had all year.\n\nAt the end of the day I write down at least one positive thing that happened to me. This all helps to make you looks for the positives rather than the negatives. It's partially to do with the law of attraction that states that you attract the feelings and emotions you give off. So if you think positive, the things happening to you will be positive and the people around you will be more positive.\n\nSo that's something that I do. Another thing I've started is a solid morning routine. So I wake up at 7am and make my bed, I'll drink a glass of water and then I'll get ready for the day. It puts me in a productive mood. I meditate to help bring myself into the right frame of mind and have things that I achieve.\n\nSet small goals everyday and help yourself achieve them. So even if it's as small as wake up at 7, shave, brush your teeth, have a shower. That's 4 things you can tick off that will start your positive day.\n\nRemember to smile. Smiling makes you happier, remembering to smile will naturally effect your mood.\n\nMake small habits that over your year will affect your life dramatically.\n\nDon't beat yourself up if you slip a little bit. Being your absolute best isn't about maxxing out every single day. Be the best version of yourself you can be. If on that day you can only manage to put your clothes on and work like a robot, then do that. But every day be the best you that you can be!\n\nSo on with my story.\n\nI started the year miserable, lonely and depressed. I took out my emotions on my mum. I blamed everyone else for all the bad things that happened in my life. I acted like a spoiled child. Then I caught a lucky break. I managed to spend a week on holiday and gain some perspective about what kind of a person I was and how I wanted to be.\n\nI found that I started asking myself why. Why do I want to be thin, why do I want loads of money, why do I want a relationship. I answered them honestly. I don't want to die early, I want to be able to live comfortably and I want to make someone happier than I could ever be.\n\nBut then you have to ask yourself, how are you going to achieve those things. Well if I'm going to lose weight and I want to do it not to look good but because it's a matter of life and death, suddenly exercising is a necessity. Sure motivation only lasts a week but that's why you discipline yourself.\n\nAnyway as time went on I found that because I was setting small goals I was doing really well. My house was finally clean because I told myself I was going to do the small things today that helped me tomorrow. So rather than complain and moan about having to do the dishes, I just spent 2 minutes actually doing it. By the end of the first week my house was spotless and I felt AMAZING. I've never been so productive in all my life and it was only small things I had to achieve.\n\nOn my list I would put stuff like, take the rubbish out, clean the kitchen, hoover downstairs and as I ticked them off it was like weight falling off of my shoulders. Of course the only issue with this is, if you set too many goals and then continously don't do them, they become \"oh i'll do it tomorrow\". To the point where I stopped hitting my goals completely and reverted back to being an awful human being.\n\nSo here I am now, telling you that you shouldn't beat yourself up so much. Give yourself daily habits and a morning ritual. Set your days up to be positive and work on that consistently. Some days will be alot better than others but you will make it through as long as you can find some positives.\n\nJust to prove to you about the positivity thing, I'll copy and paste it all in here for you to see. I use Google Keep to track my daily life and roubit to manage my daily habits. Here is my year so far.\n\n\n\n", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du89k92/"}