{"id": "t5_2tand_t3_7xb3cq_t1_du79h5x", "creation": 1518557649, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ScienceGun", "text": "I was always a diligent student, but I lacked direction. In college, I majored in English simply because I liked to read and write. I had no idea what to do with an English degree, so before I graduated I made plans to go to grad school and earn a master's degree. I still had no idea what I wanted to do with my life, so I decided to follow the example of a friend and major in Library Science so I could become a librarian.\n\nI knew ahead of time that librarians make a pitiful salary, but what I didn't know was just how much competition I would have to face for such a low-paying, low-status job. There were simply too many aspiring librarians, and too few jobs.\n\nI tried for years to find a job as a full-time librarian. The best I could manage was a part-time library clerk. Eventually I ran out of money and had to move back to my mother's house.\n\nI decided it was time for a career change. I started studying IT instead, since it seemed to be a growing field. I got an entry-level certification, but I still couldn't find work. Everywhere I went, people wanted someone with experience.\n\nEventually I told a friend about my frustrations. He offered to put a good word in for me at the company where he works. The only catch was, this company was literally halfway across the country from me. I figured, what the hell.\n\nI applied, and even though I was out of state, they hired me. Now, at age 30, I finally have my first full-time job, and my own place to live. It's not a dream job, but I like it and find it satisfying. It'll definitely do for now. I'm much happier now than I would have thought possible less than a year ago, and it's all because I said \"fuck it,\" and grabbed the opportunity that life presented me, despite my doubts.\n\nMy advice to you is keep an open mind, and when opportunity knocks, get your ass to the door ASAP. ", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du79h5x/"}