{"id": "t5_2tand_t3_7xb3cq_t1_du7hq93", "creation": 1518566106, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MotivationHacker", "text": "I don't want to write a wall of text but I'll tell you what I was like 10 years ago, and what I'm like now.\n\n*10 years ago:*\n\n* Shy\n* No friends\n* Afraid to talk to women\n* Deathly afraid to go out with women\n* Zero talents \n* Zero self-esteem\n* Zero self-belief\n* Passive aggressive \n* Never stood up for myself \n* Unathletic\n* Victim mindset\n* Always had someone to blame except me (e.g. teachers, parents, my upbringing) \n* Depressed\n* Anxious\n* Very insecure\n* Easily hurt by the words of others\n* Weak\n* Generally unhappy, much more negative emotions than positive (positives came in short doses and were fleeting) \n\n\n*Today:*\n\n* I have been complimented on my charisma, I have been called charming\n* Extremely social, people have a hard time believing I was ever shy\n* I can easily make friends \n* Not afraid to talk to, ask out, or have sex with women\n* Enormous self-belief\n* Assertive (this takes constant work as to not revert back to being passive)\n* Athletic (this one surprised me the most)\n* I take responsibility for everything in my life \n* Well-travelled with much more I'd like to see\n* Dabbled in a few instruments, learned to cook, other skills/talents added to the list \n* Unaffected by the words or actions of others\n* Generally very happy, positive emotions very regularly and I know how to handle the negative ones when they come\n* 6 years ago I started a self-development blog to help guys who used to be in my situation\n* 1 year ago I started a subreddit called /r/goodbyedepression to help people who were in the same scenario \n* I offer direct help to people who need an accountability buddy or live guidance \n\n\nAnyone can turn their life around, you can too. Never stop pushing. Never stop growing.", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du7hq93/"}