{"id": "t5_2tand_t3_7xb3cq_t1_du7e55m", "creation": 1518562247, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cho_Zen", "text": "I’m 31 next month. I’ve slipped, fallen, stalled, and muddled around on and off for about 8 years. I am now in my second semester of grad school, in a similar program I had an acceptance to in 2010. \n\nI got out of undergrad in 2009, applied and got into a grad program for education the following year while teaching in South Korea. I ignored that and pursued law school while working for a law firm out of state. I had a law school acceptance in hand, and let that slip, fell into depression, killed a year or so working a nothing job before wanting a degree in physical therapy. I started a career as a personal trainer as a good pairing with the education I was receiving. I couldn’t get classes one semester, and I dropped out for a sales job for a tech company. Physical therapy fell out the back of my mind. Lost that sales job eventually, and sat around for awhile again.\n\nDecided to settle for a job at a paint shop, thinking that I’d climb that corporate ladder. I got into a car accident that left me permanently disabled (injury to the spine) while on the job. I loafed around for another year, gained about 40 pounds of fat, and lost a body that was previously photographed for billboards and fitness marketing materials.\n\nDecided that I needed to pursue a grad degree, and was able to get in. Turns out, having untreated ADHD can be debilitating to the health of your life path. It’s less about being able to “pay attention” and more about not having a general narrator guiding you along, reminding you of what your goals are(working memory). \n\nI expected mountains from myself, and rightfully so, but I thought that I could do it alone. I received treatment, read up on my disorder, and build scaffolding around me to keep me from fucking myself. My future looks bright, and I feel like I’m on a path that is good for me. I’m still climbing out of the hole that I curled up in over nearly a decade, and I feel the pangs of regret of my twenties gone by, but I’m ecstatic about life, and feel good to be alive (thought I was gonna die for the second before my accident) and strolling forward again. \n\nRock bottom is good. Feels like shit, but you can start building foundations from bedrock. You know exactly where the bottom is, and that will ground you (pun, i know) for the rest of your life.\n\nNot sure if you’re familiar with physics, but know that static and kinetic friction work as an analogy for life. It take much more force to get an object that is at rest to move than it does keep an object in motion.\n\nOr try this analogy. \n\nYou get to make as many coins per minute as you can keep spinning at once. Looking at a pile of change, the task seems like a pile of shit. But start with one. Spin it, get it going. Then another. Add a couple more to the table, while flicking the first few to keep them warm (easier to keep them moving once they’re going) pretty soon, you’re at several dollars spinning on the table. Hundreds of dollars/hour. It’s easier to add items to your life once you’re in motion. Until you are, you’re just a pile of ineffective change. (Pun intended, again)", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du7e55m/"}