{"id": "t5_2tand_t3_7xb3cq_t1_du89kda", "creation": 1518608479, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MattatouilleUK", "text": "**I'm grateful for:**\n\n\n13/01/18\n\n\nMy cats\nMy family\nMy business\n\n\n14/01/18\n\n\nMy car\nMy house\nMy life\n\n\n15/01/18\n\n\nMy computer\nMy phone\nMy power bank\n\n\n16/01/18\n\n\nMy bedding\nMy shoes\nMy bathroom\n\n\n17/01/18\n\n\nMy paypal\nMy curtains\nThe multi-storey car park\n\n\n18/01/18\n\n\nMy clothes\nMy alarm clock\nMy education\n\n\n19/01/18\n\n\nAmazing music\nMy imagination\nMy memory foam mattress\n\n\n20/01/18\n\n\nCustomers\nOnline ordering\nNutrition diploma\n\n\n21/01/18\n\n\nMy bath\nMy neighbors\nBooks\n\n\n22/01/18\n\n\nExtra stock\nBusiness plans\nSeat warmers\n\n\n23/01/18\n\n\nNew bedding\nMy list of suppliers\nInsider pet knowledge\n\n\n24/01/18\n\n\nChinese food\nQuiet times when I'm tired.\nA fast internet connection\n\n\n25/01/18\n\n\nAir fresheners\nBath salts\nCandles\n\n\n26/01/18\n\n\nLandlord\nMy website\nMicrosoft Office\n\n\n27/01/18\n\n\nOn demand tv\nVideo tutorials\nCoffee\n\n\n28/01/18\n\n\nPositivity reminders\nFruit\nHeadphones\n\n\n29/01/18\n\n\nAudible books\nCheaper food\nEasy online payments\n\n\n30/01/18\n\n\nWater\nPast me\nPedigree wholesale\n\n\n31/01/18\n\n\nHomecooked food\nComfortable chairs\nOld photos\n\n\n01/02/18\n\n\nCustomer feedback\nFree uploading\nHoover\n\n\n02/02/18\n\n\nDeep heat\nMy mum \nMy charger\n\n\n03/02/18\n\n\nStock being close\nText messaging\nBeing able to sleep in\n\n\n04/02/18\n\n\nMotivation\nDiscipline\nHabits\n\n\n05/02/18\n\n\nLaunceston Computers\nFabric conditioner\nSnow\n\n\n06/02/18\n\n\nCat food\nNeck massager\nFresh clean bedding\n\n\n12/02/18\n\n\nMessenger\nMorning motivation\nBakery\n\n\n13/02/18\n\n\nMy computer.mouse\nColourful socks\nEarly alarms\n\n\n14/02/18\n\n\nCold water\nFast charging cables\nPain relief\n\n\n**One Positive thing that happened to me today**\n\n\n13/01/18\n\n\nI got a new cold-pressed food in stock and built my ikea bookshelf!\n\n\n14/01/18\n\n\nI sang karaoke with the family, it was fun!  \n\n\n15/01/18\n\n\nI managed to complete a basic prototype app on my computer!\n\n\n16/01/18\n\n\nI made mum happy when she was feeling kind of down!\n\n\n17/01/18\n\n\nI left a positive impact on my mum from the day before and I managed to get alot of work done!\n\n\n18/01/18\n\n\nThe shop is really starting to go well, most of the products are price and have new labels! Ebay has picked up again and I've got stock out the back that I can list! Finally know what I want to do with the cat stock and figuring out the rest of the shop too!\n\n\n19/01/18\n\n\nThe fact that I priced everything on the bottom floor of the shop into the EPOS system. Priced labelled all the bird seed and still managed to package a massive amount of parcels. I also managed to see where I was going wrong with the new changes I've introduced, so i'm positive I'm on the right track.\n\n\n20/01/18\n\n\nI changed the way someone viewed pet food for the better and converted him into a customer! I also finished labelling all products in the shop. Everything looks amazing and my customers will be happy! I also managed to stay present and aware as my meditaton app told me.\n\n\n21/01/18\n\n\nHad a nice relaxed coffee with Toby. Enjoyed planning my app with a marker and getting creative. Then creating another prototype! I found out that the cup brush attachment works really well and I spent a lot of my day doing what i wanted to!\n\n\n22/01/18\n\n\nIt was amazing learning more about seo and taking my business to the next level online. It will be good to see what kind of audience it could generate. We also got everything done without going crazy for ebay. Also i had a mcdonalds! Also i finished my book and im extremely motivated!\n\n\n23/01/18\n\n\nGot an account ready and sorted with Pedigree! Posted a blog on my website and linked it across social media. Also spoke to a company about natural dog treats that look really cool. Managed to have a nice chat with a lady about her dog and found some really cool harnesses through her and pedigree! Got rid of some calendars too! Awesome!!!! Toby also bought me a Costa!\n\n\n24/01/18\n\n\nHad a Chinese takeaway which tasted amazing as per usual. Prepared two blog posts so I don't have anything to worry about tomorrow and it felt great to be productive. I saw Rosie today and she complimented me on my choice of t-shirt, she is an incredibly nice person. I finished eBay nice and early and more wagg treats have been selling which means my listing is moving up and getting seen more!\n\n\n25/01/18\n\n\nWent bowling with dan and played a couple games of pool. Had a few slushies and overall had a fun day. Took the cardboard out of my house which was a good feeling. Plugged in my chrome cast and figured out how to cast to it easy from my phone which will make using my computer even better. \n\n\n26/01/18\n\n\nSome important payment stuff went through today, which was really positive. James wellbeloved stock showed up so now we have extra dog and cat food filling the shelves which is really cool. Mum and dave saw what i'd done to the website and liked it too. \n\n\n27/01/18\n\n\nI remembered to order packaging supplies. I had a ton of sleep. I got a caramel latte in the morning and had a nice chat with my neighbour. I bought some books to read and some to listen too. I also managed to stay up and watch some PPV wrestling that I wanted to see which was also very good.\n\n\n28/01/18\n\n\nI got all the cleaning done around the house and that felt good, I managed to tick off an item on my weekend jobs list and that felt good too. I've picked up epsom salts to help me get to sleep easier again and got a really helpful tip about woodshavings from a customer whilst I was in Costa.\n\n\n29/01/18\n\n\nI had some awesome KFC, I slept okay even though I didn't get many hours in. All of my payments are up to date for my home which is a great feeling, all of my rubbish is ready and waiting to go out tomorrow and we managed a pretty good order considering how slow January has been. We also got ebay sorted without arguing or getting stressed. Nice chilled day, just what I needed when I was tired.\n\n\n30/01/18\n\n\nPedigree wholesale opened my online account so I could look at their products. I managed to pay off all my home bills that were outstanding and restart old direct debits that were not setup yet. I dispatched a lot of ebay with time to spare by myself which was cool and I figured out what I want to list next.\n\n\n31/01/18\n\n\nI took a lot of money, which is an uptrend from the rest of the week. I ate chinese food for tea which was really good. My tape dispenser arrived today which helped me package easier. I also managed to get over my writing block and pushed an article out to the website.\n\n\n01/02/18\n\n\nWith mums help I figured out the cost of some biscuits for ebay. I didn't run out of stock like we thought I might. I organized my list and picked up what I needed from Tesco. I also had a lot of fun writing an article for my website.\n\n\n02/02/18\n\n\nEven though I hurt my neck really badly, it was fun to take a day off and chill out. Mum bought me a costa coffee and a cheese toastie which was thoughtful and I ended up watching lots of cool online videos.\n\n\n03/02/18\n\n\nMy neck hurt a lot less today, i was able to drive again which was good. I ordered lots of stock and got my finances in order again for the upcoming week. I also watched Coco and toby bought me a caramel latte which was awesome.\n\n\n04/02/18\n\n\nHad a lie in and cleaned the house. Spoke to Dr who fans online which was awesome. Created my first project in after effects. Found out an awesome trick for recording with a condenser microphone.\n\n\n05/02/18\n\n\nI got a doctor who intro done in after effects which was my first project ever and the people I created it for liked it alot. I managed to get 30 parcels done in the morning before work had even started which took the pressure off. Managed to get a nice toastie and a coffee which was really cool. Also spoke to upholstery experts about different fabrics for dog toys.\n\n\n12/02/18\n\n\nI had a very interesting conversation with Louwenna, I also got to stay in the shop and mostly relax because mum was very nice to me (I had a migraine). I also got a gingerbread man and a pork and apple slice which was awesome.\n\n\n13/02/18\n\n\nMe and louwenna are kind of a thing now! Had my first super positive morning back on my routine. Hit all my goals easily and now i'm thinking on what kind of exercise I can incorporate into my life.", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du89kda/"}