{"id": "t5_2tand_t3_7xb3cq_t1_du8eowz", "creation": 1518616967, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JesusGreen", "text": "I would say there were several different breaking points that set things in motion.\n\nThe first was some time into my addiction. I was still very much an addict both in mindset and in action, but I made the decision I wanted to quit. It wasn't really backed by solid motivations - I only wanted to quit at the time because I didn't want the harm I was doing myself to continue.. which, doesn't really work as a motivation to get clean because your addiction is often a result of poor self-esteem in the first place. So all it takes is a moment of weakness where you hate yourself again, and you're back to using. No surprises there, I did quit, several times, but also relapsed, several times. However, that initial decision to quit was still the first step.\n\nThe next big breaking point was a major binge I had, where I took so many stimulants I hallucinated that I'd helped 8 people escape from prison and was helping them hide from the cops in my bedroom. (Spoiler: I was totally alone the whole time) After I sobered up, it was just too much for my brain to handle that I'd pushed it so far. Like describing it back to myself it literally sounded like something ridiculous that only ever happens in movies, and I just felt ashamed of myself. So I again decided to try to get clean. \n\nNow the final breaking point, the thing that made the real difference, was that after starting to try to get clean this last time, I decided I wanted to work on myself. In particular, I decided I wanted to start meditating every day. From my experience with meditation, I knew that if I was taking drugs all the time, I wouldn't make any progress whatsoever with meditation. So now I had a reason to stay clean other than to avoid the negatives. I had something positive I wanted to work on, that didn't leave room for drugs. \n\nThat final motivator was what allowed me to stay clean, but also meditation is what encouraged me to get into self-improvement as a whole. Which is where I discovered something I felt passionate about, and started rebuilding and repairing my life, and making something positive of it. I honestly think it's the single most beneficial habit I've discovered in my life, because all my other negative habits (like smoking etc) just started dropping like flies as I maintained regular practice. New healthy/beneficial ones started popping up everywhere. The one constant through it all was meditation.\n\n**TL;DR: Meditate.**\n\n", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du8eowz/"}