{"id": "t5_2tand_t3_7xb3cq_t1_du7vnfj", "creation": 1518581175, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "baseball_guy", "text": "I don't want to go into too many details because I'm exhausted from a long day of work, and the careful phrasing that I'd require to tell my story well would be too arduous to communicate through text.  \n  \nI ended up in the parent's basement situation for two years, wavering from under employed and unemployed. I got a job, and the company promptly went out of business. Bad luck.  \n  \nIn the end though, I decided that my industry was too saturated with my types of skills. I could change that. I could attain more skills. I made an educated guess about the sorts of jobs that would be in demand in a year, studied my ass off, embarked on an ambitious project in order to refine my skills and turn the convert the things I learned to second nature.  \n  \nIt, uh, worked. Now I make 30% more than I ever made before, with a much better work/life balance to boot.  \n  \nMy advice to you is, if you're unemployed but not on the streets, this is an opportunity to work on you. Once you have a job, you're stuck, spending most of your useful hours getting better at whatever the job entails. In between jobs, you've a rare opportunity to prepare yourself for a better job than the one you most recently had. Don't waste that time.  \n  \nRoutinely, kids graduate high school, with few employable skills, go to college, and a mere four years later, have built a whole new career skill set from scratch. Four years is all it takes to learn a skill trade starting from zero. Lots of lucrative professions require for less training, and most people who aren't graduating high school also don't start from scratch.  \n  \nSo, as you meander the job boards, make a note of jobs that are numerous, but that you don't apply for because you're not qualified, and ask yourself if it's something you'd be willing to learn.  \n  \nIf I were unemployed right now, I'd study tensor flow all day and night.  \n  \nGood luck.", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du7vnfj/"}