{"id": "t5_2tand_t3_aqkin4_t1_egh2uoy", "creation": 1550169292, "origin": "t5_2tand_t3_aqkin4", "height": 1, "replied_to": "t5_2tand_t3_aqkin4", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "autemox", "text": "I agree completely with the premise and the problem, but it seems to me like there isn't a lot of solution here aside from \"just do it!\".  So I have some ideas that have been working for me lately:\n\n1. Read \"Unfuck Yourself\": https://www.amazon.com/Unfu-Yourself-Your-Head-into/dp/0062803832  This is a good book that looks at the psychology going on behind what OP describes.  It helps you reconnect your thought processes and teaches you some Adlerian Therapy (founded by psychologist Alfred Adler) to help you understand why your behaviors do not match up to your perceived goals (spoiler: you actually have another set of goals, with reasons, that your behaviors do match with).  I don't do it justice trying to explain it.\n\n2. Set achievable goals.  For me this is:\n\n* A. Run 2 miles a day with my dog around my neighborhood at any speed.  \n\nI track speed but I absolutely do not judge myself for what speed I go, because my goal is not to improve, my goal is to get some cardio exercise and to make myself and my dog happier.  Being outside in the sun helps make me feel great.  Making my dog happy makes me feel great.  Knowing I am doing something to improve and for my body makes me feel great.  Giving my eyes a rest from the computer by running mid-day makes me feel great.  As a >30 year old cardio makes me have increased energy so that I can achieve my goal B below.  I track whether I did cardio each day and try to beat the # of days I've done cardio long term (month to month, etc).\n\n* B. Do strength training every single day.  Do 4 sets of 1 exercise the first day, then increase to 2 exercises the next day.  If you miss a day, you only have to do the same amount of exercises you did 2 days before.  If you miss 2 days, you only have to do 1 less exercise than you did 3 days before.  Keep track of strength training using Momentum app and try to build a chain.  Track improvement over time and try to beat the # of days you've worked out long term (month to month, etc).\n\nWhat I have done here is changed my goals for strength training to reflect what I really need to work on: Building Habit.  Sure I want to get strong eventually and that will require 8 exercises 3 times a week, but that isn't going to happen until I build the habit, so my goals need to be geared towards habit building, not optimizing my routine.  I should feel good just doing 5-7 minutes of strength training if I hadn't done it for a week.  The next day, a little harder, but I did it the day before so I can do it today!\n\n* C. 5 other simple goals that can be achieved in mere minutes each day: Read Calendar and Quarterly Goals, Take Supplements, Drink Protein Shake, Do not Drink Soda, Drink 2L Water.\n\nThese goals, like cardio and strength training, are tracked in Momentum app and assessed over long periods of time with excel. Since I have a tendency to make excuses, I purposely chose easy goals that can be done in mere minutes.  By creating an environment where it is difficult to make excuses, I can build the habit of not making excuses.  In the future I will have a habit of not making excuses and I will then be able to set more difficult goals.\n\nTLDR; Recognizing that you need to unite yourself and stop feeling inner conflict and divide is a powerful first step, but inner-change won't be achieved at the click of a switch.  You need to change your environment and goals to facilitate inner-change given the circumstances of division.  These environmental changes should minimize the feelings of conflict and replace those feelings with positivity, good habits, and progress to physical health.  e.g. Set goals: Run with your dog at any speed each day.  Do a little more strength training than day before each day.  Track a few very simple daily goals and watch your progress over time.", "permalink": "/r/DecidingToBeBetter/comments/aqkin4/you_grow_as_a_person_by_being_unified_not_divided/egh2uoy/"}