{"id": "t5_2tand_t3_aqkin4_t1_eghiv2j", "creation": 1550180188, "origin": "t5_2tand_t3_aqkin4", "height": 1, "replied_to": "t5_2tand_t3_aqkin4", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "luuk0987", "text": "I like the post, it's well written.\n\nThough I feel we do have sub personalities, all with their own desires and needs. In essence, it is exactly what you are criticizing. But the solution you offer, become unified, seems a bit strange. When I decide to quit smoking, I might not be 100% behind it. The smoking sub personality of me still want to smoke. So when I do actually stop smoking entirely can't that just be seen as one part of me taking control of the other part? The brain suggests this is the case. Our reward system is constantly driving us to seek out please and with the prefrontal cortex we can inhibit these impulses. It's one part winning over the other. \n\nI can see how it helps to ignore a sub personality if you have the believe that you are 100% behind it. But not acknowledging that a part of you still wants it could be dangerous. The reason that when addicts relapse they usually are back to their old selves within a short period of time is because they let gave their toxic sub personality power again. \n\nYou are very correct in saying that beating yourself up for doing something creates a toxic relation with the self. \n\nThe best advice in here is that you need to accept your sub personalities before you can ignore them. Acceptance is the first step in getting rid of drug addiction for a reason. \n\nSo to put it all together; Sub personalities exist and before you can challenge them you need to accept them and acknowledge they are a part of who you are. Without this crucial step you cannot ignore them. Saying that you are 100% behind something isn't realistic and it could be dangerous not to acknowledge the shadow. It's about accepting, which creates the harmony. ", "permalink": "/r/DecidingToBeBetter/comments/aqkin4/you_grow_as_a_person_by_being_unified_not_divided/eghiv2j/"}