{"id": "t5_2tand_t3_mpicko_t1_gu9zuk0", "creation": 1618249083, "origin": "t5_2tand_t3_mpicko", "height": 1, "replied_to": "t5_2tand_t3_mpicko", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ElmSeedling", "text": "I usually make sure to put my phone away. I turn off the WiFi and put the sound on. I know that if someone NEED to talk to me, they will call or send a sms. Then I know it’s no point in checking my phone because it’s nothing important going on (if it were, the person would call/sms, right?). \n\nI also use the “pomodoro technique” as my study technique. I read for 20 minutes (one pomodoro), take a 5 minute break, and does this until I have done 4 pomodoros. Then I take a longer break and start over again. \nOne pomodoro is actually 25 minutes, but I’ve found that 20 minutes is perfect for me. \nIt’s important to stop when you’ve finished one pomodoro, even though you are really deep in the studying/writing. Most of the times you need that break. Make sure to take a proper break, walk away from your study spot and sit somewhere else - do something different! Don’t stay out and scroll Facebook on your computer. \n\nAs for the optimistic part, I always think of subjects I’ve had before. Reflect on how little I knew then, versus how much I know now! I know I have the ability to consume knowledge, and I choose to use that ability. \n\nI also make a schedule for the next day every night. I find it much easier to stay to a schedule than just reading some random we subjects every now and then throughout the day. But remember to be kind to yourself, if you read 3 hours instead of 4, that’s okay! Maybe you need more water or food to get through 4 hours, maybe you have to split those hours in two and do two in the morning and two in the evening. \nI know my brain just turn into to a big bag of nothing between 12:00 - 14:00, so I make sure to put my lunch break and exercise in these two hours. Find a schedule that fits you!", "permalink": "/r/DecidingToBeBetter/comments/mpicko/i_cant_study_cus_i_keep_getting_distracted_any/gu9zuk0/"}