{"id": "t5_2tand_t3_psj2kx_t1_hds4rrp", "creation": 1632267203, "origin": "t5_2tand_t3_psj2kx", "height": 1, "replied_to": "t5_2tand_t3_psj2kx", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "labdog", "text": "First of all - you're not sick. Not bad. Not wrong.\n\nWhere to start? Finding anything you could enjoy. Discover your favorite things. Little things.\n\nI couldn't build anything in my life without enjoying what I do.\n\nOverthinking kills all the joy. Fulfilling other expectations kills all the joy.\n\nDoing things good for myself feels nice. Cleaning my room. I know - it doesn't seem fun. But it's so nice to see it done. I feel great. When I learn new things I feel good. A flow state. I'm doing something related to my work. I'm a programmer. While I'm figuring out how to solve a very difficult problem - I find it feels amazingly good. Even though I don't want to start it. I'm lazy. But when I start, when it's happening - it's just fun.\n\nIt's like with swimming in cold water. There is that silly fear before jumping in. Then I jump. I go to the bottom. It's weird. When I surface it's no longer cold. It's nice. I'm glad. Swimming is so much fun. But every time before I jump in I'm a little scared. And there's absolutely no reason for it.\n\nI have a dog. I go for long walks with the dog. It's nice to see the dog happy.\n\nI remember to play games. Even when I don't quite feel like it. It's always worth it and fun. I feel better afterwards and whatever duties I have - it's easier then.\n\nWhat is expected of you - it really doesn't matter. Don't even think about it. You want a better life - just go for it at your own pace.\n\nYou are your only true boss. Be a good boss. Motivate yourself. Pay yourself well. Reward yourself. Don't think bad about yourself. Like yourself. Love yourself.\n\nI do all that. It works.\n\nOh, and BTW, turn that damn thing off. The Internet and social media is poison. Cutting it down can help. But even if you fail with that now and then - don't worry. Worrying and being harsh on yourself will not do any good. Just say to yourself \"shit happens, I'm trying again\".", "permalink": "/r/DecidingToBeBetter/comments/psj2kx/i_hit_rock_bottom_where_to_start/hds4rrp/"}