{"id": "t5_2tand_t3_mi3a63_t1_gt2ytt0", "creation": 1617316041, "origin": "t5_2tand_t3_mi3a63", "height": 1, "replied_to": "t5_2tand_t3_mi3a63", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "OlinSina", "text": "I do not quite know where to start responding to this except by voicing my appreciation. The amount of wisdom in the mentioned wall of text is staggering for the (relatively) small amount of text. I feel an obligation to respond to the rhetorical questions that you posed.\n\nYou said that we cannot \"Just do it.\" and I would agree, with one caveat. I think that at some point, you do have to push through some days. Arguably those are the most important days to push through, as the better you get at \"pushing through it\" the easier those days will be (and they are frequent). Jim Rohn (somebody labeled as a motivational speaker, though I do not believe him to be one. He gave seminars, but they were not full of the standard motivational material.) said something along the lines of \"The best you can do is not all you can do. Today, maybe you can only do one push up, and only one push up the next day. Is that all you can do? No. After that you might be able to do two push ups. Then some day maybe you will be able to do 50.\" which I think is in line with what you were saying.\n\n\"Are your goals reasonable?\"No. Yes? sorta? no...My long term goals are doable.My short term goals are a bit lofty, but achievable.My daily goals are not achievable. That is more a result of my propensity to plan things.\n\n\"Are you healthy?\"Mentally, yes.Physically is a work in progress\n\n\"Are you living a healthy lifestyle\"Not as healthy as the one you describe: I lift weights and do some amount of cardio daily, and I run 1-2 miles a week. I do attempt to prioritize the important things you describe, but I do not believe that I succeed. Until recently, I was not eating breakfast, and rarely eating lunch. Now I do both of those things. Neither of those meals would I say fit the standard you set forth. My dinners do fit the standard.\n\n\"Vitamins\"I do not really have access, as I am still under the whims of my parents, but I will do what I can.\n\n\"Do you have systems that work for you?\"**I am a bit lost on what to do here**I sure would like to...Atomic Habits was a good read.I don't quite understand the idea of systems, but to the best of my knowledge I can lay out my idea of a good day (in the sense of productivity.)I get up at six, and go to the gym. Then I have coffee, clean the kitchen, and clean my room. After that routine, which I have engrained fairly well, I schedule every assignment I am going to complete, and the time I should start and stop (this tends to be far beyond my abilities, not because I can't do it, but because I wont.) I get half way done with the list by around one. By this time, I have shut my phone down and moved it across the room. I have blacklisted all websites that could be distractions (with a chrome extension). Half way through the day, I decide to stop (for varying, foolish reasons). Then I feel guilty, but unwilling to continue for the rest of the day. This is on a good day... good days happen about two - three times a week. I would like to be able to increase this. (a hot cup of green tea, with a spoonful of honey, is generally helpful. Sitting in an uncomfortable position, or cross-legged generally helps me remember what I am supposed to be doing if I get distracted. I have started timing how long I am able to focus. This helps both for data, and--once the stopwatch has started--I am more motivated to work longer so that I can make my statistics better. it is silly, but it works.)**whether or not you read this all it is very helpful to think through this all. Thank you so much for that.**\n\n\"CAFFEINE\"I agree.\n\n\"Keep the big picture in mind\"Well, everything I do (or at least, everything I aim to do) is for the big picture, or as I like to call it \"future me.\" The thing is, the reasons you gave were not reasons that I find particularly meaningful. Not to say they are bad reasons, they are the reasons I am doing things, but that is not entirely relevant. So, I am looking for a particular job, to maybe support a family and/or a business. Those are things I would enjoy, I think. Future me would appreciate my attempts to put him into a position where those things are possible. That is I suppose my reason. I just do not know if that is a reason that will get me up in the morning. Many studies have shown that the more meaningful a persons reason for doing whatever they are doing, the harder and longer they are willing to work on it. The thing I was saying is that my reason could be part of the problem. I certainly do have a reason, I maybe just do not use it to the full extent I could be? I do not know. That is more of a half baked idea then anything of substance.\n\nTD;LR: Thank you very much for all of your help, it is deeply appreciated (as I hope my response has made clear. I do not quite understand systems.", "permalink": "/r/DecidingToBeBetter/comments/mi3a63/i_want_to_be_more_disciplined_just_maybe_not_as/gt2ytt0/"}