{"id": "t5_2tand_t3_q33ihh_t1_hfpcthh", "creation": 1633591999, "origin": "t5_2tand_t3_q33ihh", "height": 1, "replied_to": "t5_2tand_t3_q33ihh", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Youarethebigbang", "text": "Sorry you're going through this. I would start by talking with your primary care physician first and basically telling them the exact same things you shared here and see what they can do. Take what they suggested under advisement, but don't feel obligated/pressured to accept. I would think they could get you tested for clinical? depression, or instead of involving a psychiatrist or even psychologist, they might recommend some low dose pharmaceuticals, again your choice to try or not. \n\nAlso I'm sure you would have known but most healthcare plans include separate mental health coverage. Baring those, some online therapy is free or reduced rates (sometimes not advertised) for those in difficult financial situations. Or what apps have you tried? Even meditation, emotional support apps might jump start you and I think some like 7 cups start free then can upgrade to a therapist. Mylife I think is a decent meditation app. Betterhealth I think is straight therapy but pretty reasonable rates. \n\nI know you mentioned diet, but what supplements have you tried? Also, ave you tried aromatherapy, accupuncture, professional massage therapy? None are solutions on their own at all or substitutions for pro help, but sometimes a combination of things can give you that boost to keep looking for the right things that work for you. \n\nHonestly, it's not a solution, but just getting outside yourself is great therapy. To me, that means helping others, volunteering, etc. to take the focus off you and direct it positively on others who might need help more than yourself, because there always is someone (or something).", "permalink": "/r/DecidingToBeBetter/comments/q33ihh/how_to_stop_feeling_nothing_and_depressed_all_the/hfpcthh/"}