{"id": "t5_2tand_t3_q9zwiz_t1_hh0azer", "creation": 1634492411, "origin": "t5_2tand_t3_q9zwiz", "height": 1, "replied_to": "t5_2tand_t3_q9zwiz", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AsliBakchod", "text": "I'm a bit sceptical about the boyfriend option. Though I do not know the first thing about your relationship and do not presume to comment on it specifically, there are some general pitfalls that crop up in situations.\n\n1. This has happened to me personally, despite being, for all practical purposes, a completely healthy person mentally. I was dating a girl in college and I made her my entire life. The centre of my existence. Stopped hanging out with my friends. Hung out with hers. Did not do a single activity individually. Lost my hopes, dreams ambitions, I was just blissful being with her, that's it. I lost my own sense of self for the entire duration of that relationship. Lost more than  years to utter stagnation. It's a huge regret for me, I could have done so much more with those years. And this is despite me having all the options to do anything I wanted and being literally surrounded by people in college. \n\nIt turned progressively toxic, and I was left with not a single friend with me once it ended.\n\nIn an unfamiliar place with nothing else to do, it's a bit scary.\n\n2. Living together is complex. You need to consider if your relationship is developed enough for that. Generalizing, is your relationship developed enough to warrant moving across India? I mean, the only reason you're considering the place is him, right? Hypothetically, if you were to move, you could move anywhere. \n\n\nAll that being said, this comes from a place of bein dependant on a person for happiness and experiencing the toxic hell it was. Ultimately, if you consider your relationship can support it, then it might turn out to be a wonderful situation as well.\n\nEnough with the negativity, some constructive stuff now. Could you find a place where you could go to study? You said you're struggling finding a job? Go to a library or something? A friend's place? A calm environment where you can spend some focussed time daily upskilling/learning/applying for jobs? \n\nSend out atleast 10 job apps every day. At the end of the day, it's numbers game. \n\nExercise is a great wellbeing booster in all aspects. Fitness a horizontal multiplier that improves your quality of life across the board. Run? Cycle? Walk? Gym? Whatever floats your boat. \n\nOther human beings help. More so in real life than on the internet. Spend time with the friends you have? Try putting yourself in situations where you can make more? If you're in Delhi/NCR, come hang out :) \n\nHope some of this helps", "permalink": "/r/DecidingToBeBetter/comments/q9zwiz/should_i_24f_leave_my_parents_home_and_move/hh0azer/"}