{"id": "t5_2tand_t3_pz4i28_t1_hf3jg4d", "creation": 1633182793, "origin": "t5_2tand_t3_pz4i28", "height": 1, "replied_to": "t5_2tand_t3_pz4i28", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Lieranc", "text": "I was sheltered growing up and my career was pretty much decided for me (nursing). Left my dad (our relationship was very codependent). Moving out and deciding to stop being the golden child that holds my family’s wellbeing was very uncomfortable and burst my security bubble big time.\n\nI was in a secret long distance relationship with someone out of state and moved in with them, tried going back to college for a different degree because nursing was pretty depressing to me.\n\nMy relationship has its own new set of difficulties and we had just broken up a week ago. I’m still crippled from the hardships that we went through, but I’m working hard to pick myself back up so I can move out. Going back to nursing again as my money maker as I have no choice, but this time it’s a different dynamic in my mind. I told myself I’ll find a niche in nursing that I might enjoy, like perhaps being a Nurse Practitioner. Or maybe pursue programming on the side, who knows.\n\nI have worked very hard to be a good partner, tried to learn a lot of communication skills, expanding my empathy, working on myself; but it still was not enough. My life trajectory went from thinking I’d have a family with him and all these things we talked about, to living alone and figuring life out from scratch in a career that I’ve been avoiding for so long.\n\nSo yeah, I could have stayed complacent within my family’s toxic dynamic, or with my partner as I ruin myself to be the perfect partner and have everything stay the same, predictable, secure, although miserable. I could have forced myself into nursing way back when I was not emotionally mature enough to pursue it, but if I did that, who knows what kind of person I would be today. \n\nI’m shook; I anticipate a path of solitude and emptiness ahead of me. But yeah, still need to keep moving forward and choose even when it is painful. For if I had stayed, it would have been a kind of slow, background pain that rots my soul. And if I go, it would be lonely and empty but that’s the sacrifice I make so that I can have another shot at having a better life than what I had.\n\nDamn long text, but I guess I really just wanted to emphasize the different kinds of pain in life, and how to help yourself decide what kinds of sacrifices are worth doing and why.", "permalink": "/r/DecidingToBeBetter/comments/pz4i28/i_am_done_being_a_thinker_and_from_now_im_a_doer/hf3jg4d/"}