{"id": "t5_2tand_t3_icc6vg_t1_g22189g", "creation": 1597801283, "origin": "t5_2tand_t3_icc6vg", "height": 1, "replied_to": "t5_2tand_t3_icc6vg", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AngelFish2015", "text": "I agree with others who have commented saying to start with small things and move at a slow, manageable pace. Luckily, high school is such a small portion of your whole life. Tons of successful people didn’t do well in school, so don’t let that get you down. If you already know approximately what field you want to follow for college you can spend this next school year finding ways to volunteer or shadow that path (assuming you can with current COVID restrictions).\n\nGaining weight is hard, it absolutely effects body image and self esteem. But you should still love your body because it does wonderful things for you! A great instagram account to fallow is [Hey Tiffany Roe](https://instagram.com/heytiffanyroe?igshid=4o67r90ni41z) because she posts a lot about finding that good happy balance of mental health and body image. Baby steps right now can be simple as trading a drink for water instead, you can even buy things like mio, flavored water, fruit slices to make it more exciting. Take time to go for walks, it gets your body moving which can help produce endorphins that bring up your mood and can duel purpose as a chance to take in your world around you and feel gratitude. Regular exercise can also help regulate sleep.\n\nI’m not sure what kinds of essays college applications ask for these days, but you can write about this exact thing, finding yourself and becoming better, you can write about the true trials of pandemic life, you could write about mental health as a teenager. Essays don’t always have to be about some huge “accomplishment” like participating in an extra curricular. It should be about owning who you are and what your life is, even if it’s not where you always want to be.\n\nIt is wonderful that you recognize that you’re ready to improve. Get a journal, make big goals and then write down baby steps, and then find the one thing you can do this week. Change is a long process, but it can be very rewarding. I believe you can do this!", "permalink": "/r/DecidingToBeBetter/comments/icc6vg/ive_17f_decided_to_be_betterbut_have_no_idea/g22189g/"}