{"id": "t5_2tand_t3_icc6vg_t1_g221djj", "creation": 1597801362, "origin": "t5_2tand_t3_icc6vg", "height": 1, "replied_to": "t5_2tand_t3_icc6vg", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "justvibinreally", "text": "Getting better is never the easiest process because it involves things that we either are avoiding or have never tried doing. Bettering yourself “ASAP” is a really hard goal to hold yourself to and usually isn’t the most realistic. Like you said, small steps. \n\nI saw another comment talking about changing a little thing about your day to day life every week. Honestly that’s probably what I would look to do right now for you. \n\nLike for your sleep schedule, try going to bed half an hour earlier for a week. Then an hour earlier and so on. And naps aren’t necessarily bad! Did you know a person your age is supposed to be getting about 8.5-9.5 hours of sleep every day? Just focus on why you’re taking a nap. If you’re tired then by all means take a nap, but if you are just bored or sad, maybe try doing something small. A change of location can help. Like if you are laying down inside during the day, why not move outside and lay/sit down? The sun, even when not directly in it, can help the depression even a little. Other things can be reading a book, which honestly if you find one you enjoy can help pass the time. Maybe pick up a new hobby? What is something you’ve always wanted to try or thought was cool? Try it! You only get one life so why not give a new hobby a shot!\n\nYou also mentioned that your weight has been making you feel bad. I know the feeling of being uneasy about how much you weigh and feeling like there’s something wrong. It might be a self worth/confidence thing. One thing I really recommend doing, regardless of your weight or how you view yourself right now, is look in the mirror and say something like “I am beautiful” or “I love my eyes/hair/nose/etc”. Over time it helps your brain to think highly of yourself and makes you feel good about yourself. If you are really concerned about weight, maybe try exercising a little. Exercising not only helps you be healthy, it also can boost your mood. Simple ones like going on a walk or riding a bike once or twice a day can really boost you into being excited for the next day. \n\nAnd honestly not going to lie, college essays freaking suck. Even people who do a hundred sports and extracurriculars get stumped and don’t know what to write about, feeling like they haven’t done much. Try searching up “how to write a college essay” or “what to write my college essay about”. I’m in the same boat as you where I’m writing my college essays right now and that’s what I’ve been looking up. Sometimes the simplest search about something so simple really can help a whole lot. Lots of college professors and admissions administrators write articles on how to write essays and what they are looking for. They aren’t necessarily looking for something special that happened to you, but something average with a special twist. I believe in you! You got this! \n\nAnd I know it can be hard to let your family know these things, but sometimes it helps. If your family is not the safest or most healthy of families, I don’t suggest talking to them about it. But if you do have a family that will support you and you aren’t telling them because of an internal reason, I suggest trying to open up to even one of them. Opening up could help a lot. If you have any friends you feel you can open up to, then maybe try them too. If not, even a teacher or guidance counselor. \n\nThe main goal is to be happy with yourself. Give yourself time, give yourself small and achievable goals, and give yourself love. Getting better is a hard process, especially if you’re going at it alone. Try to give yourself love in the way of appreciating the small things in life and just being kind to yourself. \nI wish you the best and good luck with your college application process!", "permalink": "/r/DecidingToBeBetter/comments/icc6vg/ive_17f_decided_to_be_betterbut_have_no_idea/g221djj/"}