{"id": "t5_2tand_t3_ggvdjd_t1_fq5zo9p", "creation": 1589121378, "origin": "t5_2tand_t3_ggvdjd", "height": 1, "replied_to": "t5_2tand_t3_ggvdjd", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BetaBoy777", "text": "This is pretty serious so I’m gonna be a bit long. \n\nI would say you have anger issues and need to speak to a professional to deal with it but you’re 16 so I don’t think that’s necessary, at least for now. In 2 or 3 years if you’re still like this then definitely go seek professional help.\n\nA lot of your hot headedness has to do with being a teenager and that invincible/proud feeling a lot of boys your age have. In time you’ll mature and learn to keep your emotions in check. Or you won’t mature and end up in jail or worse. \n\nEither way, the first step in solving any problem is acknowledging that you have a problem. You made this post so you’re already on the right track. There isn’t any magical advice or technique that’ll suddenly change you. You have to actively and consistently try to change. No one can do this for you.\n\nFrom what you wrote, your pride/ego is what’s costing you. You have an image of who you are (or at least, who you want others to think you are)  in your head and are trying to live like that image. Change that image then you’ll be able to change for real.\n\nWhen situations arise (and they will) just please try to keep the bigger picture in mind. I know it’s hard to do that when you’re in the moment, believe me I’ve been there just like you. All decisions good and bad have consequences, the sooner you get that the better. \n\nTake deep breaths (it’s cliche but it does help for real). Getting riled up by a couple mean words is just childish. Accept some disrespect. That’s part of growing up. It’s hard to do in the moment but decide if what you’re about to do is worth it or not. Killing is never worth it. That will literally ruin your life.", "permalink": "/r/DecidingToBeBetter/comments/ggvdjd/how_do_i_become_more_calm_smart_in_confrontations/fq5zo9p/"}