{"id": "t5_2qh1i_t3_7c5u3e_t1_dpnf9vi", "creation": 1510368577, "origin": "t5_2qh1i_t3_7c5u3e", "height": 1, "replied_to": "t5_2qh1i_t3_7c5u3e", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "starmiehugs", "text": "I made several attempts as a teen which mostly would be seen as \"cry for help\" type attempts, but the truth is I was so so so uninformed about how the human body works that even though my attempt was very serious, it seemed to be like I was just trying to get attention. \n\nFor instance, I thought if I drank a full bottle of wine by myself, it would kill me. I thought if I took slightly more than the recommended dose of Tylenol, it would kill me. (My parents led me to believe that and I believed them...) Each time I was sure I'd die. I don't want to go into all the stupid ways I tried to kill myself but after each attempt I felt relieved that I hadn't died. I never actually wanted to ::die:: I wanted to be away from my abusive family, my unsupportive school, my boyfriend that kept pressuring me to do sexual things I wasn't ready for, etc etc. I wanted the situation, not my life, to be over. \n\nWhen I grew up, got away from the bad things that were going on, got into therapy, and started taking meds, I got better. With meds, it was an almost overnight change once I was on the right combination. I have depression, anxiety, and PTSD. I had an eating disorder and I was a self-harmer. If I can do it, anyone can do it. \n\nNow I have a wonderful life. I have a beautiful family. I still need meds and I still see a therapist. 99% of the time I'm happy and not tempted to self-harm or anything else. I had to work very hard to change my life but it was worth it. I got away from the bad things that were hurting me. Once I realized that I wasn't human garbage and that I was being hurt by garbage humans, everything changed. ", "permalink": "/r/AskReddit/comments/7c5u3e/serioussuicide_survivors_of_reddit_what_happened/dpnf9vi/"}