{"id": "t5_2tand_t3_mtiaw7_t1_gv0latj", "creation": 1618784189, "origin": "t5_2tand_t3_mtiaw7", "height": 1, "replied_to": "t5_2tand_t3_mtiaw7", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "startingfresh1120", "text": "I recently came to the realisation that I was relying a lot on others whenever I was bored and alone. For instance, one night I was just sitting at home alone and was constantly opening social media to see what people had posted. I was tempted to message people for no real reason other than reach out. Now, there’s nothing wrong with that in and of itself. However, I realised that I was using social media as a means to escape being alone with myself for a night. It was then that I realised I had to make more of an effort to be OK with sometimes just being to myself, and my own company being enough. \n\nNow, if someone forgets about you because you aren’t in their feed then I’d argue they aren’t a true friend. There’s nothing wrong with focusing on yourself and every now and again reaching out to friends and even hanging out. I’ve had those fears that friends will forget about me or lose interest if I’m not constantly hitting them up. But it works both ways. Friends can also hit you up and suggest times to hang out. You shouldn’t need to be updating your feed or liking every post from everyone to be a friend. Making an effort to keep in touch and spend time together should be enough. \n\nI wouldn’t overthink it too much. FOMO is such a real thing and it can lead us into unhealthy habits that don’t serve us. Absolutely take the time to foster a solid relationship with yourself. Make an effort to bring yourself happiness and to be content with your own company. But at the same time don’t neglect your relationships. It’s about balance, but only you will be able to work out how that balance will be for you. Hope that makes sense.", "permalink": "/r/DecidingToBeBetter/comments/mtiaw7/i_deleted_social_media_but_feel_lonely/gv0latj/"}