{"id": "t5_2tand_t3_p66zxe_t1_h9cjv21", "creation": 1629242488, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "asurrealglitterboy", "text": "You clearly have no idea what executive dysfunction is, it doesn’t work like that. You can mentally tell yourself to do something over and over, reason with yourself on how simple the task is, and for some reason just can not bring yourself to do it. Meanwhile for some reason another more seemingly complex task you can do with ease. Yeah it sounds illogical because it IS- mental illness is mental ILNESS for a reason. Same with the negativity of his post, you realise depression is literally defined by cognitive distortions, which basically means illogical thinking?\n\nAlso some mental illnesses are something you are born with that can’t be fixed?? Like ADHD for example which he believes he may have, and surprise surprise!! Is an executive dysfunction issue. I have severe ADHD and other similar comorbidities to OP and I have been in the same position he is in, it sounds a lot like the result of severe ADHD that has gone undiagnosed and untreated through to adulthood, like in my case. Similar to a physical illness that worsens without diagnosis and treatment, it can cause and contribute to other illnesses, especially if they already existed before. Prior to my diagnosis/treatment, reading something like what you just said would not have helped me at all and would only have harmed me and pushed me further towards the feeling of being ‘broken’. \n\nI was told things like this before receiving an ADHD diagnosis and treatment (which was the only thing that helped me with symptoms of my illnesses and helped me understand my thoughts and behaviour better), and they only made me feel worse and even less able, because as much as I wanted to do something that I KNEW was simple such as reply to a message or shower, I just couldn’t and couldn’t explain why, even to myself. It’s an executive dysfunction issue, which in my case and maybe OP’s case, can become exacerbated by depression, anxiety, and a host of other problems to a point where you are unable to convince yourself to do even the most ridiculously simple things. To an outsider executive dysfunction looks like a lack of effort or desire, but it’s like a mental battle you can’t win.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9cjv21/"}