{"id": "t5_2tand_t3_p66zxe_t1_h9ctigq", "creation": 1629247409, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 14, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "west_pac", "text": "Severe ADHD-PI was my read on it, too. I recognize a lot of the symptoms because I'm also ADHD-PI.\n\nBecause it's a brain chemistry and wiring issue, there are a few \"hacks\" you can use to reduce the symptoms. Note that I said reduce, not eliminate - only stuff like adderall will do that. But until you get a diagnosis I figure you could at least try this stuff to see if you can get some relief.\n\nThe first one to know about is sugar. If you don't have any ritalin or whatever that you can take, but you *need* to get something done, getting loaded up on sugar can help avoid the burnout. It won't help you get *started*, you'll still have to really force yourself, but you'll at least be able to sustain. Some people like ice creams, some people like energy drinks... pick your poison. Basically get yourself to a level of slight sugar-buzz and then just drip-feed your choice of sugar to maintain that level throughout the task.\n\nImportant to only pick one task for the day to get done, don't try to push multiple things. If you feel like doing something else after then great but otherwise just relax.\n\nThe next one is actually two combined: vitamin D and Omega 3. ADHD is highly comorbid with something called \"Delayed Sleep Phase Disorder\" or DSPD. Basically it's related to a lack of seratonin in the brain, which is unable to convert enough into melatonin, meaning you seem to go to bed later every night, and have shitty sleep as a result. What this lack of sleep does is it basically worsens all the symptoms, and actually accrues a sort of brain damage very similar to dementia over time. Taking Vitamin D after breakfast, and Omega 3 supplements after any meal during the day, will allow the brain to repair this damage. You should feel some of the \"brain fog\" clear, and will have less trouble having fluid verbal conversations if that's been an issue for you.\n\nLastly, and you might've guessed already, is melatonin itself. This works best in combination with with the vitamin D and Omega 3 mentioned above. You take it about 30 minutes before you're due to go to bed. I find it helps to combine it with valerian, otherwise the melatonin just wears off about 3 hours into the night. Sometimes if I wake up in the middle of the night, I'll go take another melatonin, watch some videos, and then head back to bed once I feel it kicking in.\n\nHTH dude...  all of these are good to know even WITH medication because tbh there's going to be times when you just don't want to deal with the amphetamine side-effects. I personally don't medicate over the weekends just to give myself a break, but I also practice this stuff during the week as I find it helps me feel more \"normal\".", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9ctigq/"}