{"id": "t5_2tand_t3_p66zxe_t1_h9b6wbp", "creation": 1629219353, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DaleNanton", "text": "Hey dude ok so first of all what's important to know for a *fact* is that this is temporary. You wrote this entire post in a coherent and articulate manner so I know your brain isn't totally fucked. What's very likely is that you need help processing your life experience. There are some standard issue things that you can do to help yourself right now which ranges from going on a walk, drinking a glass of water, giving yourself good nutritious food to going on a run and meditating and taking a bath (do not underestimate these \"small\" things - they are a form of self-respect). This can also go up to asking a friend to help you find a therapist OR if you don't have a friend, you can call [NYC Well](https://nycwell.cityofnewyork.us/en/) (you don't have to live in NYC to use this service) and you can talk to them and explain to them your situation and they will listen to you (they have stayed on the line for an hour with me) and will work with you to find a therapist. Honestly, I've called them just to freak out and cry and they've been absolutely cool with it - it's a really amazing service - don't feel the pressure to find a therapist with them but, again, I think you're having trouble processing your life experience and you need someone to help you process it. I'm not saying there's something \"wrong\" with you - there really isn't - it's been a hard year for a lot of people and, in a way, this is kind of the perfect time to let it all go so congrats on perfect timing. As my friend said a couple of weeks ago \"Everything is optional right now.\" so like...take full advantage of it if you want. I definitely took a full 3-4 months this winter to just totally let my shit hang out Lebowski style. Point being, you're not alone. Please feel free to DM me. Either way, you're definitely going to get through this. It's ok to just do tiny things just as long as you start to feel good about *something... whatever that is.* You don't have to do what you're \"supposed to\" - the cat's out of the bag: turns out, this whole thing \\*gestures broadly\\* is bullshit. You can make your own life just the way you want to. Just start very small and with things you really care about. Lay a good foundation. This is a good thing.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9b6wbp/"}