{"id": "t5_2tand_t3_p66zxe_t1_h9brxlc", "creation": 1629230127, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "messybitch87", "text": "I have ADHD, and it does sound a lot like you have ADHD. I also suddenly stopped being able to read books, finish watching videos, etc after leaving school. Being forced into a regular routine through school really helps keep it in check, but left to our own devices a lot of us become completely useless. ADHD is one condition in which medication is typically extremely effective. Go see a doctor, and let them know that you would like to be evaluated for potential ADHD. If you do have it, at the very least you can start medication for that to help significantly with the executive dysfunction and the inability to finish anything, like reading. \n\nI also have CPTSD. It’s no joke. Cognitive Behavioral Therapy is easily one of the best ways to deal with this, and a medication to help keep you stable in the meantime. When you find yourself thinking negatively, or reacting irrationally, you need to correct yourself. Stop and think. Are you overreacting? Are you being too hard on yourself in that instance? Like, if you’re calling yourself useless in your head or another negative thing, stop and be reasonable with yourself. It’s not that you’re useless or anything like that, it’s that your mind is depressed and it is causing you to be less active in your care and development. It’s not your fault, and it won’t last forever. Then try to think some nice things about yourself, or do something nice for yourself, like cooking a nice meal or taking a bubble bath. You deserve to be treated nicely by yourself. \n\nIf you’re reading this, go take a shower, brush your teeth, and brush your hair. These small things feel impossible to do, but future you will be thankful that you at least did that. If you feel up to it, take some nice walks and try to notice things you like on the way, like a tree you think looks great, a cool building, how many cats can you spot, etc. Exercise releases endorphins, and you need some extra endorphins right now. \n\nAlso, start mindfulness meditation. I started with the Headspace app, and learning this meditation style, plus cognitive behavioral therapy, was extremely helpful in learning to live a more stable life with my CPTSD. Definitely seek out a therapist, and don’t be afraid to ask for a different one if you’re not meshing with the one you have, to help you through this.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9brxlc/"}