{"id": "t5_2tand_t3_p66zxe_t1_h9drns9", "creation": 1629268026, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Shenanigansandtoast", "text": "I went through something similar. It was like an extended freeze in the flight, fight or freeze response mode. I just could not make my body do anything. I’d lay in bed for hours not able even get up to pee. What’s worse is I felt like a failure because I couldn’t grit my way through it. \n\nI’ve been diagnosed with CPTSD as well. For me I think I wasn’t even able to process the trauma until my early 20’s. Then it just hit me like a wall. It was really hard. Back then I just needed someone to tell me I could make it to the other side and there would be something worth living for. I just want you to know that you can make it to the other side and you will find things and good kind people that make life worth living for. \n\nKeep trying things but be kind to your body and mind. It needs the same patience with trauma that you would give it healing from a broken bone. I learned a lot from this book [“The Power of Habit”](https://www.amazon.com/dp/081298160X/ref=cm_sw_r_oth_api_glt_fabc_93EGKH9HDY6M6HBABDT3). I slowly build up one habit at a time like brushing my teeth or taking my meds. Eventually, I am able to function fairly well. Occasionally, I have a stressful event or a depressive episode that knocks me down a bit but I just start over, one thing at a time. \n\nI’ve had a hard time finding doctors that can help serious trauma but there have been a few. Don’t loose hope, it’s a rare skill. Care for you body like you would care for a loved friend. Many people who have had trauma growing up have a hard time feeling deserving of gentleness and care. Find little things that make life easier or give you joy and let them in. It’s ok to take shortcuts when you are worn down. \n\nFor me, I needed to cut off a lot of toxic and painful relationships. Now that I’ve started be able to care for myself my quality of life has drastically improved. \n\nAnyways, hope some of that was helpful. Take care. \n\nAlso, [r/CPTSD](https://www.reddit.com/r/CPTSD/) had some really nice people. They’ve helped me a lot from time to time.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9drns9/"}