{"id": "t5_2tand_t3_p66zxe_t1_h9cgezd", "creation": 1629240816, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "asurrealglitterboy", "text": "Hey, I’m in the UK & I definitely feel you on the thing about the NHS being rlly shit for mental health (fuck Tories and their underfunding lol), it’s so frustrating. You mentioned you think you may have ADHD, I know it’s so so so difficult to get a diagnosis and treatment for adult ADHD within the NHS, but I urge you to try that route if you can. I finally got an adult ADHD (severe ADHD-C, diagnosed at 21, I’m 22 now) diagnosis and treatment through a private online psychiatry service that can sort of use NHS funding instead of your funding if your GP signs off on it (I can link you to to the online service and a better explanation of what I’m talking about if you’re interested, just lmk).\n\nThe reason I’m suggesting this is because everything you said, especially your paragraph about taking months to reply to messages, 8 hours to put on socks etc doesn’t even sound ridiculous to me because it’s almost exactly me, and for me I’ve recently found it’s because of my ADHD and the resulting issues from it going undiagnosed and untreated for so long. It’s almost like a really dumb coping mechanism my brain came up with to deal with everything that is just further fuelled by the executive dysfunction from my ADHD, like a vicious cycle- it causes me less anxiety in the short term to avoid something completely soooooo why not just avoid avoid avoid until it inevitably becomes too big of a thing to ignore and makes it 100x worse lol.\n\nI also have dealt with depression, severe social anxiety, general anxiety, dissociation, some childhood trauma and rlllly bad executive dysfunction (as well as other issues eg self harm, substance issues, and just a very unstable and volatile mood/anger issues if you also deal/have dealt with these), and once I started treatment for ADHD (I take Elvanse/Vyvanse currently), while none of these were cured obviously, the stimulant medication treats a surprising amount of the symptoms of all of these when I am taking it as prescribed. \n\nI was never diagnosed with binge eating disorder or body dysmorphic disorder (and don’t believe I dealt with these issues severely enough to warrant a diagnosis) but definitely dealt with phases of binge eating/restricting at different periods throughout my life (I was in a phase of pretty bad binge eating for about 3 years consistently just before treatment) and had horrible body/facial image and self esteem to the point where I believed I was genuinely hideously ugly and therefore unlovable (I now realise this is objectively untrue, I was and am complimented on my appearance quite often but truly believed everyone was lying to me out of pity), both of these have improved greatly for me as well. Kinda embarrassing and I have never mentioned this to anyone before, but I remember looking in the mirror a few weeks after starting treatment and crying because for the first time in a long time I looked like a regular person to myself, like how you casually see someone on the street, and not some disgusting monster. I recently came to the conclusion a large amount of my issues must be due to ADHD and the trauma related to a late ADHD diagnosis and navigating a neurotypical world, which may be the case for you?\n\nI want to emphasise that ADHD medication is not a cure all for my issues, and I do still struggle with a lot of them pretty badly- in fact I’m adding an antidepressant to my ADHD medication to see if that further improves my social anxiety/depression/general anxiety- but definitely improves a lot of these issues for me at least. Particularly social anxiety- I overthink interactions a lot lot less and I am way more confident, but my social anxiety is pretty severe so it still won’t treat it completely, which is why I’m adding an antidepressant which hopefully will bring the social anxiety to manageable levels to where I can be open to therapy and find more long term solutions for the longstanding thought patterns and behaviours that contribute to a lot of my issues. It may be that you find a combination of a couple medications and therapy like this will help, like I hope they will for me.\n\nAlso, if you have tried antidepressants like SSRIs unsuccessfully before and do in fact have ADHD, I have seen a lot of anecdotal evidence from people with ADHD that antidepressants did not work for them until they also treated their ADHD. I can’t speak on this myself as I did not try antidepressants before my ADHD diagnosis, I coped with recreational drugs which was a bad idea lol, but may be worth researching?\n\nSorry this is such a long comment (can u tell I have ADHD ?? Lol), just want you to know there are always other avenues worth trying and not to give up hope, which I know is annoying to hear but it is true. Even if you find you do not have ADHD, or you end up starting ADHD treatment and find it doesn’t work as well for you, there are other options, unfortunately the NHS is horrible at helping you find those other options but please do not give up. I understand where you are coming from, it’s so hard to keep trying things when nothing ever seems to work but just hold on to that bit of hope that maybe you will find the right treatment one day- if you give up now how will you ever know? Again sorry for the long comment, but if you want any more info on the psychiatry service I was diagnosed & treated with, or literally anything else, feel free to message me/reply and I’ll happily help u out as much as I can !! <3", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9cgezd/"}