{"id": "t5_2tand_t3_p66zxe_t1_h9d7ect", "creation": 1629254523, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Low-Till4362", "text": "therapist here. that’s a lot of diagnoses. You are not your diagnosis. I read “i am not in control” essentially, many times throughout this. You’re right. You’re not because you keep telling yourself you are not. You are in control of you and nobody else. Basic CBT. We have a thought, those thoughts create emotions our emotions influence behavior, behavior influences thoughts and we start over. For example:\n\nI need to put on those socks. I can’t do that. I’ve been laying here for days. I’m broken and can’t be fixed. All those diagnosis prove it. If I get up and put on my socks I’ll probably just lay right back down. It will be so unpleasant. There’s no point….Now you feel hopeless, ashamed, discouraged. Now you stay in bed. \n\nLet’s reframe. Note, reframing is not just contradicting yourself. \n\nI can get up. I have the physical ability. Just because I have those diagnoses does not mean I physically cannot get up and put on my socks. Maybe if I just focus on putting my feet on the floor and standing up, then I’ll feel more motivated to walk over to my socks. It might be super unpleasant at first but i’ll feel pretty proud and astonished if I actually put my socks on….now you may feel just neutral, maybe a tad less self loathing, a little less helpless…you get up and put your socks on….now you think to yourself. Hey. I can do some things! And the positive cycle continues until you make it negative again. \n\nStop bullying yourself. Your no different than anyone else, you deserve respect and to be treated with decency. Your past neglect does not justify you neglecting yourself. Be better than those who abused you. You can do it. Your thoughts are just thoughts not facts. You can change the narrative that your brain is feeding you and take a different path. Good luck man!", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9d7ect/"}