{"id": "t5_2tand_t3_p66zxe_t1_h9djnwb", "creation": 1629261813, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "containmentleak", "text": "1: Obvs professional help. This sounds a lot like clinical depression. If what I say here is helpful for you, use it. If it is  not, discard pls. Questions are rhetorical. You can reply or not. Up to you. I have depressive episodes that get tough sometimes. Thankfully for me they do pass. Before therapy they used to linger and get worse each time. Now they are shorter and less frequent. But like colds and storms, they do come again and I have to remember these things to keep things from getting worse. I hope this helps you.\n\nAbout suicide: What do you \\*really\\* want? Do you want to not exist? Or do you want to stop the way you feel? It sounds like you want to live but you just want to stop the suffering so it seems like you have suicide ideation (Your brain is telling you that ending your life will end the suffering - but that might not be true. Who knows what happens after we die? We could all be going to some sort of hell and you could be trading one form of suffering with another.) but it sounds like you actually want to live but you want a different experience.\n\nThere is a 2 pronged approach here. **Physical** and **mental**.\n\n**Physically**, your brain needs happy hormones. . This might be all said to you before but the top three things to help your body make these hormones naturally are 1: sleep 2: nutrition 3: exercise.\n\n1: Sleep. Sleep as much as you need. Give your body as much sleep opportunity/potential as you can. You might not always get the full amount of sleep but sleep opportunity is important. This is step 1.\n\n2: Nutrition. With your energy levels so low you might be eating a lot of junk food or even just skipping meals. Eat. Eat regularly. Then, add things with vitamins. Gonna eat a bag of potato chips? Eat some mini tomatoes with them or wrap each chip in a lettuce leaf and then eat it. (Be sure to get the pre-washed pre-cut bag bcs you ain't got the energy to be washing lettuce leaves and making full blown salads right now). Add vitamins to the things you already eat. Gonna drink soda? Try switching to juice. Both are sweet, but juice has more vitamins. Keep it simple and small. This isn't about perfection, it's about doing what you can and letting the rest go. Maybe you'll make it full-blown fancy health-nut meals one day but that's not where you are now so every little bit matters and it helps.\n\n3: Exercise. If it is difficult to put your socks on then for you, exercise might be sitting on the balcony or just stepping outside at least once a day. That's it. Just stand up, go out the door, stand there for about 5 mins and then go back to bed. Congrats, you got your exercise! When you can challenge yourelf to do more you can walk to the nearest corner and back. You can try 5min yoga at home. Anything is better than nothing so try to get on your feet and hopefully get to a point where you can get your heart rate up. Build up to it.\n\n**Mentally** there a few things to look at:Disappointment:What are you disappointed about? You might have a lot of disappointment. Maybe you thought life would be different. You thought the pills would cure the problem. You thought you would be living in a different place by now. My biggest pain-point was: \"I have everything I wanted to achieve when I was younger, but I'm not happy. I can't appreciate anything. Why? What's wrong with me?\". There is no \"why\". It just is. It sucks. Make an \"this sucks and I'm disappointed list\" of all the things that you are sad about. Cry. Feel bad. Don't avoid that pain. You can handle it. You're not alone, you're not the only one with depression. It's a tough world and things just suck. Feel that. Grieve the loss of what you had hoped for your life. Maybe you lost a friendship, a job, a family member. Maybe you wanted more out of a friendship, more out of a relationsihp with a family member but it didn't happend. Now you are distant. That sucks. Feel it. Cry. Then drink some water and put your socks on and go to work. Rinse and repeat.\n\nExpectation:You may also have expectations. I call these \"shoulds\". No such thing as should. Should is the ideal world, a fantasy. You are real. You are human. Maybe you think you \"should\" shower everyday. Or you \"should\" be better by now. But you're not. It sucks. But you are exactly where you should be. Anyone with your brain chemistry and your life experiences would be suffering exactly as you are. It's not good or bad. It just is. It's real. It's not bad to want some things and to have some expectations. It's just important to learn to feel disappointment before deciding what you can or can't expect. It's a cycle of hope -> expectation -> disappointment -> hope. And by going through this loop over and over again we learn how to live in the real world. Sometimes we just get stuck or attached on one of these things. Lower your expectations. You wouldn't expect someone with broken legs to walk up the stairs. You can't expect your depressed self to shower, work, and eat like a non-depressed person. You're different. That's fine. You are as you should be. Adjust expectations and then act accordingly.\n\nHope:I'm still in the stage where I am learning about hope and struggling with this so I might not be able to put some things here. I do know that hope is important. I can only hope when I face my disappointment. When I am afraid of the pain of disappointment I stop hoping and when I stop hoping I stop living emotionally and everything goes downhill. Hope is good and as long as you are alive and fighting to keep going. Fighting to get those socks on and get the help you need to deal with this, there is hope for you. You may have lost connection with family or friends, but when we get older people die off and we lose connections anyway. You can make more. It might not happen today but I believe it will happen for you. (You're freaking 20 man. You haven't seen the full cycle of friendship changes that we go through - or even the 10yr later you suddenly reconnect with someone. Life is so strange and there are wonderful things that happen to that are completely unexpected).\n\nExtras:Try to celebrate everything you do. Got out of bed? Achievement! ate breakfast? Achievement! Had some whole foods in ANY meal of the day? Achievement! Good on you. :3 The same idea with gratitude. Don't force yourself to feel it, but if you notice throughout your day, Maybe it was raining all day but as soon as you got off work it stopped so you could put away your umbrella and you think \"Oh nice, I don't need my umbrella\". Just stop and try to stay in that feeling for a moment. When you feel gratitude, sit with it. If you don't feel it though, no worries. Just keep putting your socks on, one at a time.\n\nThe other thing that helps me a lot are depression memes. My favorite comic artists (back in the day) is shen comics. Not really depression comics but some of them did turn dark for a while. I'll try to link a few of my favorite panels for you:\n\n[https://www.webtoons.com/en/slice-of-life/bluechair/owlturd-79-change/viewer?title\\_no=199&episode\\_no=473](https://www.webtoons.com/en/slice-of-life/bluechair/owlturd-79-change/viewer?title_no=199&episode_no=473)\n\n[https://www.webtoons.com/en/slice-of-life/bluechair/owlturd-88-bottle-it/viewer?title\\_no=199&episode\\_no=500](https://www.webtoons.com/en/slice-of-life/bluechair/owlturd-88-bottle-it/viewer?title_no=199&episode_no=500)\n\n[https://www.webtoons.com/en/slice-of-life/bluechair/ep-339-defibrillate/viewer?title\\_no=199&episode\\_no=503](https://www.webtoons.com/en/slice-of-life/bluechair/ep-339-defibrillate/viewer?title_no=199&episode_no=503)\n\n[https://www.webtoons.com/en/slice-of-life/bluechair/ep-355-1-thing/viewer?title\\_no=199&episode\\_no=525](https://www.webtoons.com/en/slice-of-life/bluechair/ep-355-1-thing/viewer?title_no=199&episode_no=525)\n\nAnyway, Hope you find something helpful soon\\~!", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9djnwb/"}