{"id": "t5_2tand_t3_p66zxe_t1_h9brqhr", "creation": 1629230045, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "miler17flat", "text": "Congrats on writing such an articulate post! I’m sorry to hear you’re going through all this shit. You’ve got a lot of strangers on the internet rooting for you!\n\nTldr: a wonderful Stanford neuroscientist’s one-page description of using sunlight to decrease stress and improve mental and physical health: [here](https://scopeblog.stanford.edu/2020/06/03/setting-your-biological-clock-reducing-stress-while-sheltering-in-place/). There’s a 7min video on that page, I highly recommend watching all the way through. Stay strong!\n\n.  .\n\n.  .\n\n\nLong version:\nHave you heard of the professor and neuroscientist [Andrew Huberman](https://www.instagram.com/hubermanlab/?hl=en)? He publishes a lot of info on cost-free behaviors people can use to improve physical and mental well-being. (He’s not a clinician, but has posted interviews with some on his Instagram and YouTube page, and publishes great neuroscience data in multiple journals) I’d recommend trying to look into his work.\n\nHis biggest recommendations are: \n1. Get more **sunlight** to your eyes immediately in the morning than artificial light (ie be outside, without sunglasses, for at least 2-10min right after you wake up. Regardless of cloud coverage, and don’t have windows or glasses blocking the sky’s connection to your eyes. This behavior apparently has profoundly positive effects on your body’s regulation of cortisol and melatonin, among other good results. Don’t look directly at the sun; look towards the sky, and blink accordingly.\n2. Get **self-generated optic flow** at least once a day (ie move in a way that your body is creating: walking, running, biking. The idea is to have peripheral objects “flow” by your eyes, which apparently stimulates neural circuits that quiet your threat detection and fear, thus calming a person who is distracted, affected by trauma, or other things. The science behind this is where EMDR therapy originates, when patients move eyes back and forth and “work through” trauma with a therapist). \n3. Get **panoramic vision** at least once a day, and if only once then ideally in the evening near sunset (ie unfocus your eyes from whatever’s right in front of you—like a computer, phone, or book—and try to see a horizon). This can be accomplished at a beach, the top of a tall building, or even just a field. Similar effects to the previous two of helping to regulate hormones, neuromodulators and neurotransmitters, and bringing a sense of calmness, clarity, and control. \n\nThese are all peer-reviewed protocols with results in many mammals, including humans. \n\nI know it’s impossible to do these every day, and can be hard to even do them at all, but trying to average out 4-7x/week can show amazing results in people who previously reported senses of terrible mental-unwellness. \n\nKeep strong man! Dm if you want to talk", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9brqhr/"}