{"id": "t5_2tand_t3_b2oc60_t1_eivmq7a", "creation": 1553004159, "origin": "t5_2tand_t3_b2oc60", "height": 1, "replied_to": "t5_2tand_t3_b2oc60", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "roxieh", "text": "Congratulations. You are amazing.\n\n>If you've read this huge block of text, thanks for listening, and if anyone has any advice on how to stay not messy (especially in terms of lack of motivation) that would be phenomenal.\n\nI struggle with mess myself but I have to say the *only* thing I struggle with, now, is putting away my clothes properly after a day. My bathroom, kitchen and living spaces are all usually tidy and clean.\n\nMy first important thing was knowing that every item I had needs a home. Everything I own needs somewhere to live. If it doesn't have somewhere to live, it gets thrown away, and if I can't / really don't want to throw it away, I accept that it will do as clutter until I get a bigger place.\n\nBut honestly, give everything a home.\n\nOnce you know where the items in your home should live, then it becomes about realising that 5 seconds now means 5 minutes in the future.\n\nSo for example, you're in the kitchen and you spill some drink on the counter. It will take you five seconds to grab a paper towel and wash it, and throw the towel in the bin (or clean it with a damp cloth, whatever). If I leave it and forget about it I will come back to a sticky mess that I already \"left\" so will probably continue to \"leave\" until I actually \"clean\" it which is A Chore. If that happens, you then have a sticky mess to clean up as well as everything else you left to become A Chore. If I'd just wiped the mess/crumbs when I made them, in five seconds, there wouldn't even be A Chore to tackle in the first place.\n\nApplies to seeing an item out of place / not in its home. I see a cushion on the floor when it should be on the couch? It lives on the couch, it'll take me 5 seconds to move it. I see a blanket on the couch that should be folded at the end of the bed? It'll take me 5 seconds to fold it and put it on the bed when I'm already on the way to the bedroom. \n\nEtc etc. You get the point, I hope.\n\nAgain, I'm still learning this myself, but it's a LOT easier dealing with something that will take 5 seconds now rather than 5 minutes at the weekend.\n\nSo, to summarise:\n\n- Give things a home.\n- Throw things out if you haven't used them in more than a year.\n- Throw things out you can't find a home for, unless you really need/want to keep hold of it\n- Do something now for five seconds rather than in the future for five minutes.\n\n", "permalink": "/r/DecidingToBeBetter/comments/b2oc60/im_cleaning_my_apartment_for_the_first_time_in_a/eivmq7a/"}