{"id": "t5_2tand_t3_ns3b6j_t1_h0l54gz", "creation": 1622825855, "origin": "t5_2tand_t3_ns3b6j", "height": 1, "replied_to": "t5_2tand_t3_ns3b6j", "down_vote": 0, "up_vote": 32, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hannahrae44", "text": "After leaving a 4.5 year relationship that I completely lost myself in, I also kept telling myself that I just have to focus on *me* right now, heal my wounds, and learn how to genuinely love and respect myself. With that said, however, it took some getting used to not having a S.O. to hug at the end of the day, to have someone to call about that hilarious thing I just saw happen, and just have that general feeling of having someone to go to. \n\nEven through telling myself that, I still found myself swiping through Tinder, Bumble, and the like. I'd text with people for a couple weeks, and then when it all fell apart (and honestly, thank God these things only ever lasted a couple weeks for me), I'd just be left with that feeling of emptiness that I'd been trying to run from. I'd lie to myself and say, \"yes it would probably be better for me to be alone right now, but what if it's actually better to be talking excessively to this person!!\" \n\nSo I finally hit a point where I just got sick of this emotional turmoil I kept putting myself through and said ok no more. I'm finally able to learn my own energy, wants, needs, interests, etc. For the first time in my life, I'm learning who I am outside of other people. It is lonely sometimes, but I can't expect to have healthy relationships if I don't even know who I am. I can't give half of my life to someone when I only feel like half a person, to begin with; It's just a recipe for disaster. \n\nTLDR: learning to enjoy your own company and to love and respect yourself FIRST can be difficult and lonely. You have to know WHY you're doing it (and your reasons may very well be different from mine) in order to push through these hard nights/days. However, through time, I'm learning that it is well worth it :)\n\nOh yeah and I want to add that just having conversations via Reddit threads has been very helpful for me. If you don't already, I highly recommend engaging with others through this platform :)", "permalink": "/r/DecidingToBeBetter/comments/ns3b6j/i_need_a_relationship_detox/h0l54gz/"}