{"id": "t5_2tand_t3_ns3b6j_t1_h0lllmf", "creation": 1622832756, "origin": "t5_2tand_t3_ns3b6j", "height": 1, "replied_to": "t5_2tand_t3_ns3b6j", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mrsstiles", "text": "I am also going through a relationship detox. I was in a relationship with a man who ended up being emotionally abusive. For the first year or so of our relationship, he was the perfect partner, and when the abuse started, it was little and infrequent. It wasn't until months after our relationship ended that I realized what he had done, and how damaging it was to my self esteem. I sought therapy, read a ton of self help books, started doing daily yoga to help keep me present and stop ruminating about the past and the man i thought he was.\n    For a brief period, I thought I was ready to start a new relationship. I hated coming home to an empty apartment. I missed having someone to text throughout the day, to cook with, to talk to about my day. I still miss those things, but I don't cry on my way home to my apartment anymore. I don't dread the expanse of the weekend. I have a weekly \"date night\" with a female friend and that has helped tremendously with the loneliness. I also have 3 awesome rescue cats who let me cuddle them when I miss physical contact. I still wish I had that partner to share my life with, but right now, I know I need to heal and be on my own, so I never again remain in a relationship where I'm not respected and valued. I have to be able to love myself more than someone else. \nSo I deleted all of my dating apps. I'm going to do the things I love, that my ex put me down for, and reach a day where I don't hear his voice in the back of my head saying how stupid or a waste of time _______ is. When I don't hear in my mind him telling me I'm \"unproductive\"  when I take a day off from my two jobs and working on my online class. \nI know I deserve better than that. And I don't want to risk falling into another toxic relationship because it's hard being alone when so many other people seem to have someone.", "permalink": "/r/DecidingToBeBetter/comments/ns3b6j/i_need_a_relationship_detox/h0lllmf/"}