{"id": "t5_2tand_t3_ns3b6j_t1_h0m35vi", "creation": 1622840499, "origin": "t5_2tand_t3_ns3b6j", "height": 1, "replied_to": "t5_2tand_t3_ns3b6j", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "347volt", "text": "I’m now two years into my detox. I never thought of it as a detox until this thread. What a great way to put it! I (25m) was in a relationship with a great woman for three and a half years. We had split a few times but always got back together. I think we broke up 4 times. The relationship was main,y good but just fizzled out. There wasn’t any more growth to happen between us. One day we hung out and she told me she wasn’t happy again. This time was different, I knew this was it. I was completely heartbroken. I was so in love with her. I still love her but not in love, very different. It’s been nearly two years now and we haven’t met up or spoke since that day we broke up for good. I decided that I needed to take a break from romantic relationships. Before her I was in another relationship where I was manipulated to say the least. I never gave myself time to heal before getting into a relationship with ms.3.5 years. I haven’t gone on a single date, hooked up, even flirted or kissed anyone since. It gets lonely and sometimes I would just love to have intimacy again. But overall it has given me time to rediscover myself and discover more than before. Two years later it’s only now I feel ready to get back out there and try again for a romantic relationship. I feel if I did that break the cycle and just get back on the apps right away I would have just set myself up for failure. I haven’t tried to put myself out there yet as my province is still locked down but may try hinge in the near future. I’d say if you feel you need a break from romance the go for it. You got this!", "permalink": "/r/DecidingToBeBetter/comments/ns3b6j/i_need_a_relationship_detox/h0m35vi/"}