{"id": "t5_2tand_t3_qehydx_t1_hhtlx98", "creation": 1635047096, "origin": "t5_2tand_t3_qehydx", "height": 1, "replied_to": "t5_2tand_t3_qehydx", "down_vote": 0, "up_vote": 40, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "my-dog-for-president", "text": "I really, really hate to sound “age-ist” in any way, but I just hear so much of myself at 22 in this. I found that after college, when finally working and living on my own, I had a really hard time navigating attatchment in a healthy way. It felt like my life went from having family that was always in my home to friends that were my roommates, to suddenly having friends and family that could just come and go as they pleased, made me feel like I had to do a LOT more upkeep on making sure people stuck around.    \nBut over time, I found that you can just “be yourself,” and the people who really love you will stick around. I don’t mean to say that you can just be shitty to people whenever you naturally feel like it, but I’m more so saying that it is NOT up to you to manage everyone’s feelings all the time. It’s not your responsibility to make sure that everyone in your life feels 100% happy all the time, or 100% happy with what you’re doing, or 100% happy with your availability. Stick to managing your emotions, 24/7, and letting other people manage theirs. Offer to be there for them when they need it, and be there for them when they come to you for support if you willingly have that time and energy. But if not, they are adults and can manage their own emotions, it’s not on you, and frankly, not you (nor me, nor anyone) is going to manage their emotions any better for them anyway.    \n\nI think as you navigate life and settle into who you want to be, you will find more and more that good people will naturally gravitate toward you, so long as you’re merely trying to be a good person yourself. It’s not about being perfect, but the mere fact that you’re 22 and on this sub says something about how you are of a mindset of self improvement. So that being said, I think you will continue to grow into a healthy human and I think you sound like you already have a good head on your shoulders - if people can’t see that, they aren’t worth the effort to “cling” to. And that will be true for everyone - friends and family. No one in your life is worth compromising your ever lasting journey of seeking health and happiness. You will not always find those two things, but just make sure to keep pursuing them as best you can, and prioritize that pursuit over trying to make people stay, and then you will have a good balance of being there for yourself and being the kind of person that is good for people to have in their life.", "permalink": "/r/DecidingToBeBetter/comments/qehydx/how_to_overcome_insecure_attachment/hhtlx98/"}