{"id": "t5_2tand_t3_5zztvg_t1_df2yesd", "creation": 1489811185, "origin": "t5_2tand_t3_5zztvg", "height": 1, "replied_to": "t5_2tand_t3_5zztvg", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Astreja", "text": "Dragonlady (love that name, BTW!), I'm in a similar boat.  I turn 60 this August and am trying to turn things around after nearly 2 decades of avoiding exercise.  I used to be really active, at one point working out 7 days a week in weights and martial arts, but dropped all that around the time of a divorce.  The low point was around 2003 when my weight had ballooned up to 260 and I had panic attacks, gastroesophageal reflux and fiibromyalgia.  Fought down to 235 and then got stuck there for a while.\n\nThis may sound bizarre, but one thing that was instrumental in turning things around was when I started uncluttering my house in 2011.  In my home I couldn't breathe and couldn't think straight, so I started selling or giving away things that weren't being used.  Things aren't perfect, but they're at least 80% better -- No tchotchkes gathering dust on shelves, no running obstacle courses between stacked-up boxes of books in my home office.  More open space meant less stress and less distraction, and as the stress went down I felt better overall and had more energy, and my weight started to move down again.  (I got to 185 with a keto diet, but resumed eating carbs and went back up to 215.  I'm now at 210 without dieting.)\n\nThis kind of clearing-out exercise is good for teaching you what you really value.  I have a saying:  \"You can have anything you want, but you can't have *everything* you want.  Pick one.\"  If you don't care about affirmations or manicures, they won't help you.  Find one or two things that do matter a lot to you, and concentrate on them instead.\n\nI've made a bit more progress this year, just by trying different kinds of fitness activities until I found a few that I like for their own sake (cross-country skiing and snowshoeing, and I'll try hiking in the spring).  Going to the gym out of a sense of duty makes it easy to drop.  If you find an activity you look forward to doing, even once a week, it will pull you rather than you having to push yourself to do it.\n\nStrength and endurance first.  Work on moving fluidly, and adjust your diet gradually with small tweaks -- Cut down on pop / increase water; smaller portions of fried foods; a bit more vegetables / a bit less starch.  (Oh, and make sure you get enough sleep.  Very, very important.)\n\n", "permalink": "/r/DecidingToBeBetter/comments/5zztvg/how_to_accept_myself_for_what_i_am/df2yesd/"}