{"id": "t5_2tand_t3_5zztvg_t1_df3h4th", "creation": 1489854925, "origin": "t5_2tand_t3_5zztvg", "height": 1, "replied_to": "t5_2tand_t3_5zztvg", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "retractatus", "text": "I have a deep empathy for you, and I trust you will find your way to confidence and contentment.\n\nMy teen years/early 20s were dark as hell and I felt ugly, fat, and ready to die, and I couldn't find a positive thing in any situation.\n\nIt's been a long journey, but I'm in a great place now. I feel beautiful, genuinely *happy*, and I have the strength to keep achieving a great life.\n\nWhat first turned things around for me was health. When I was depressed, I just felt too weak to address my situation. I started to gain strength from exercising, eating real food like leafy vegetables, correcting nutritional deficiencies like low magnesium, and cutting out gluten. \n\nBeing healthy and well made it possible to face all my psychological issues. In fact, just being healthier made most of my depression and anxiety disappear.\n\nTwo years into the wellness thing (eating whole food, exercising, getting blood work to check nutritional deficiencies) I had some deep breakthroughs that helped me tap into my potential. I achieved my goal body, had a great social life where I felt cool, and had the courage to spontaneously travel to Europe and lived there blissly for two years, and just do great things that were previously out of reach.\n\nIt's now been 6 years since happiness and wellbeing is an every day part of my life. Keep going. Transformation is real.\n\nHow long have you been doing therapy? It really does take time.\n\nI know it's frustrating now, but that surface stuff is what it's all about. This is what human life is about.\n\nI highly recommend you trust your therapist. Just give it a go. Go through the motions. Say the words. \n\nIf you want \"deep stuff\", do some blood work (doesn't get deeper than that) to see how you can imporve your energy levels.\n\nHaving the energy to improve your situation is the key.\n\n\n\n\n", "permalink": "/r/DecidingToBeBetter/comments/5zztvg/how_to_accept_myself_for_what_i_am/df3h4th/"}