{"id": "t5_2tand_t3_q124jj_t1_hfc2gtz", "creation": 1633342925, "origin": "t5_2tand_t3_q124jj", "height": 1, "replied_to": "t5_2tand_t3_q124jj", "down_vote": 0, "up_vote": 26, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ok_Hamster3522", "text": "You’ve tried going away, you’ve gotten older, you’ve done other thing by s, yet you’re back in the same place. What is the common factor there? It’s you and your thoughts. Thoughts drive how we feel despite the circumstance we are in. \n\nWhat are the thoughts you are thinking? The subsequent feeling/emotion that comes with it is what you’re feeling. And then you go into all the things you’ve listed above. Stop and pay attention to your thoughts. As you said, you could have all the money and houses and all that, but you still wouldn’t feel fulfilled or happy. Why? It goes back to your thoughts about it. Some people are very wearily and miserable, some are stricken with poverty and happier than ever. It goes to show that it is not the outside world that drives your emotions (happiness being one of them), it is your thoughts about it. \n\nAlso, know that life is generally 50% good feelings and 50% bad feelings. Everyone get scared, gets happy, gets sad, get excited and gets bored. Experiencing all the emotions that we are able to it a joy of being human; a joy of being alive. \n\nStop and ponder your thoughts that are driving you into this place. What do those thoughts look like? What are your thinking?  It is not the world we live in that define us, it is what we think about the world. \n\nLook at your thoughts, look at your feelings. You can decide on thoughts that make you happier. This isn’t just a “be happy” fix, but one that starts deep in your mind. Recognize that there are good-feeling times and bad-feeling times. Be on with that, it’s just life. You’re in the deciding to be better sub. Decide today to be better. Decide to watch and become more aware of your thoughts. Decide to have the life you want right now, regardless of the world around you. You can have all happiness you desire right now. \n\nI hope this serves you, you’re amazing, and I love you.", "permalink": "/r/DecidingToBeBetter/comments/q124jj/i_hate_that_reddit_and_random_strangers_is/hfc2gtz/"}