{"id": "t5_2tand_t3_q124jj_t1_hfqkmkl", "creation": 1633620044, "origin": "t5_2tand_t3_q124jj", "height": 1, "replied_to": "t5_2tand_t3_q124jj", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "QWhooo", "text": "There are online options for therapy, many of which I think can be accessed from anywhere in the world.  If you get to the point where trying on your own isn't working for you, it might be worth investigating those.  But whether or not you do get help, it's valuable to continue to add strategies on how to overcome your struggles.  \n\nI am glad my previous thoughts were helpful, even though I felt like I had to cut it short!  There were so many useful things you noticed about yourself that I felt were worth mention -- but then I realized that the point of my questions was to encourage **you** to examine the answers for yourself, to see how they might help, so I didn't reply directly to them.\n\nThis reminded me of a fun and helpful journaling trick I have used in the past: interviewing yourself.  You start by asking yourself a question, pretending you are an interviewer external to yourself (so you call your actual self \"you\" when you are in the interviewer role).  Set up the page like it's a dialog between you and the interviewer.  Then answer the question, as briefly or lengthily as you feel like doing, but keep aware for any moments your interviewer might interject with a question to get more details.  Or if no obvious questions jump out, just find ways to press yourself for more details.  Remember to be gentle with yourself, and definitely question negative thoughts as best you can.  Have your interviewer treat you just like you would treat a dear friend who is having negative thoughts.\n\nYou can also personify your negative thoughts and interview them directly.  I did this a few times; one time I was interviewing \"Resistance\", and somehow I ended up calling it by the name \"Boo\", because it reminded me of the Mario Bros Boo Buddies:  every time I looked at it, it froze and tried to pretend not to be chasing me, but then when I turned my back, it was creeping after me, occasionally making silly faces at me.  This one was very elusive when I was writing to it, and its responses were really trying not to give anything away, so I had to keep guessing what it meant.  It was fun to play both roles (myself, and the Boo) and I was fascinated by where it went:  I ended up realizing that this \"Boo\" part of me was worried about me regretting things, especially changing things, and it had all kinds of tricks to help make sure I stayed complacent instead of making progress, even though it knew that I was regretting not making progress, too.  All of our internal monsters tend to be there for some purpose, usually some kind of self-protection from something scary.  (I got this idea from Havi Brooks at [fluentself.com](https://fluentself.com)... but I just went back there for the first time in a long time and I'm not sure how easy her musings would be to follow, for someone who hasn't read them before.)\n\nAnyways, I've \"talked\" (written) your \"ears\" (eyes) off again;  I am likely self-therapizing by writing to you, because your struggles reflect my own.  I find myself wishing I was as introspective as you are when I was your age; maybe I would've figured myself out sooner if I was!  You are in a very good position to make progress on figuring yourself out, because you are thinking about it, and you should give yourself full credit for that.  Keep up the good work!", "permalink": "/r/DecidingToBeBetter/comments/q124jj/i_hate_that_reddit_and_random_strangers_is/hfqkmkl/"}