{"id": "t5_2tand_t3_fh707i_t1_fkbd6x7", "creation": 1584030816, "origin": "t5_2tand_t3_fh707i", "height": 1, "replied_to": "t5_2tand_t3_fh707i", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sea_Soil", "text": "Therapy helped!\n\nWhat helps the most is regular meditation, I aim to meditate every night before bed. \n\nI also have done a lot of journalling and writing about my trauma, I'm a filmmaker so I've made films about it, having a creative outlet lets me look at it from a different perspective.\n\nI cultivate self love through self care. Fitness and wellness are my main hobby and when I'm treating my body and mind kindly, I feel the best. \n\nKeep an eye on your thoughts and feelings. Recognize that feelings are just that, feelings. They are temporary, always. Don't let negative thoughts run wild and control you. When I catch myself thinking  something like, \"I'm ugly\" or \"My boyfriend wants someone prettier than me\" I stop and say \"No. That's not true. I love myself and I deserve to be happy.\" Or \"It's okay that I am thinking these thoughts but they're just thoughts, that doesn't make them true.\" I focus on the positive things in my life and practice gratefulness. \n\nBecause of neuroplasticity we can literally rewire our brains. If we stop thinking those harmful thoughts, those neural pathways will weaken and die. that's what I mean by a mental diet. get rid of those junk thoughts!\n\nEdit: I also want to give my boyfriend credit for restoring my faith in humanity. He is one of the first people in the world to make me feel seen. He genuinely loves me exactly the way I am and on days when I'm feeling insecure or trying to self sabotage he's there for me, handling it gracefully. he showed me what it's like to be loved and supported in a real and healthy way in a way that I never saw my mother be loved. I love him more than anything else in the world. I'm blessed to have him in my life.", "permalink": "/r/DecidingToBeBetter/comments/fh707i/how_to_stop_resenting_men_because_of_abusive/fkbd6x7/"}