{"id": "t5_2tand_t3_opdgv5_t1_h66k7o2", "creation": 1626993262, "origin": "t5_2tand_t3_opdgv5", "height": 1, "replied_to": "t5_2tand_t3_opdgv5", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "heerewegoiguess", "text": "A big factor that I think is underrecognized when it comes to procrastination and motivation is that people (especially those with adhd) can be hyper critical of themselves and feel really shit about not living up to the potential that they feel they have.\n\nIt turns into feeling bad about something being so hard or overwhelming (especially with large projects that have been put off) and that feeling of being overwhelmed and inadequate is uncomfortable as fuck so you put off starting to avoid it. It's a fun positive reinforcement because the more you put it off the more negative those feelings get and the more you want to put it off.\n\nGreat when it's something like learning a new skill. \"Ugh I wish I started doing this when I first thought about it months/years ago. I'd be so good at it by now and I'm just shit because I haven't put any effort into it\" which becomes judging yourself against a fantasy of what \"could have been\" where you'll never match up so it's a nice powerful negative feeling to fight against\n\nSo OP isn't wrong really. It's largely a mental problem that you have to try to short circuit the self doubt to get around, and a good way is what someone recommends with the setting a timer and doing it for 15 minutes. The specific goal as opposed to the open ended daunting one makes it a lot easier to get started which cuts past a huge chunk of the \"negative energy\" working against you. Not all of it though so you gotta make it a habit\n\nAnother good thing to do is try snowballing, where you start with small easy things to do (wash a dish or two, take out the trash, make your bed) and let the dopamine carry you over the humps of more difficult things until you get em done. If I have a sink full of dishes they can sit there for ages, but then if I go out and buy ingredients for a nice dinner all of a sudden I can ride that to get some dishes done before I cook and if I'm lucky carry it to clean as j go while cooking and then I have a nice meal and clean kitchen. (Doesn't always work, but it's a solid mechanism to exploit whenever possible)", "permalink": "/r/DecidingToBeBetter/comments/opdgv5/you_dont_need_motivation_you_need_to_work/h66k7o2/"}