{"id": "t5_2tand_t3_poqbds_t1_hd0iney", "creation": 1631748648, "origin": "t5_2tand_t3_poqbds", "height": 1, "replied_to": "t5_2tand_t3_poqbds", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rebbecarose", "text": "Not sure what you're looking for or what job training program you used. Some job training programs have interview and resume assistance. If they don't you could still ask the instructors if they know anyone who is hiring. \n\nI've interviewed a lot of people and I've never rejected a candidate because of their voice so while I can't speak for everyone it's likely not that. \n\nReasons I have rejected candidates: \n\nthe basics - they were late without calling ahead, they were unkempt per my company's standard, the things everyone tells you about being on time and looking sharp really is half the battle\n\nLack of industry knowledge for candidates hiring into upper level technical jobs\n\nThats it. For entry level the 2nd didn't even apply.  This isn't to say that I haven't had to pick the best of a qualified bunch which is always hard. In that position I always wished we could hire everyone. Several times we did call those candidates back later when more positions opened up. \n\nIn the pick the most qualified out of the qualified scenario  here are some things that are fairly simple that make you stand out:\n\nHave copies of your documentation with you.  IE resume, cover letter, training certs, letters of recommendation etc\n\nHave a pen and a backup pen - this one only pays off if the interviewer forgets their pen but it's great when it happens\n\nKnow a bit about the company. A good one for this is if you have a phone interview ask the interviewer to send you some additional documentation but always Google whoever you're interested in working for. \n\nRemember to ask questions. Questions give you the chance to show off that googling you did and get a sense of the expectations.  As an applicant it can be hard to remember that you're interviewing the company just as much as the company is interviewing you. We need a person, you need a job. The challenge is to see if both parties think it's a good fit. \n\n\nBreaking into a new industry is hard. When I entered my field I interviewed for 8 months. It is a numbers game but it takes practice to get good at interviewing from either side. Your job as an applicant is to make them like you. Your resume tells them whether or not they can train you getting them to like you makes them want to. I wish this last part wasn't true but it wasn't until I was on like month 6 of interviews when I got comfortable enough to crack a joke that I started getting offers. \n\nGood luck, many have been where you are, persistence is the best course.", "permalink": "/r/DecidingToBeBetter/comments/poqbds/i_hate_looking_for_a_job_no_one_will_hire_me/hd0iney/"}