{"id": "t5_2tand_t3_mqeqtu_t1_guftxro", "creation": 1618363970, "origin": "t5_2tand_t3_mqeqtu", "height": 1, "replied_to": "t5_2tand_t3_mqeqtu", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Dopaminjutsu", "text": "I can relate to a lot of what you wrote. It might be worth hearing about how it could be worse for a frame of reference to your emotional processing. I apologize in advance if anything sounds like I am passing judgment; this is not my intention at all.\n\nI also graduated from a prestigious university (in Neuroscience) that supposedly grade inflates (in a lot of the \"weeding\" classes I took this was absolutely not the case by the way. People were just really that smart and studious and well-prepared to shift the normal curve way high, while I was still figuring out where my asshole was). I was high school valedictorian and barely average at that university; due to grading shenanigans I ended up with a GPA somewhere around 3.0 depending on how you count things. That I survived undergrad with any scrap of self-respect is really kind of miraculous. Certainly I was already deeply suicidal when I graduated.\n\nI was doubly, triply, maybe quadruply lucky to get into an 8-year medical school program when I got into that university, and while in retrospect I always had the intelligence for that path, I absolutely lacked the self-esteem, mental health, and maturity to succeed as a doctor. I failed out of medical school and spent a few years working whatever jobs, getting rejected from various schools for a variety of other things I thought I might want to do, and subsequently wanting to kill myself even more and chasing addictions. I was working minimum-wage and bossman didn't give benefits. \n\nI'm still a massive fuckup in tons of debt, single, lazy, etc. while all my friends are doctors or what have you. I'm going to be 29 this year and for all the privilege I have been given all I did with my time thus far is shit all over it. But if I'm not going to just fucking kill myself I may as well do something with my time. I finished a certification program recently and hope to be starting a new career--to be in your shoes but almost a decade later. \n\nIt feels shitty, I know--and I'm not telling you that's not valid, because it absolutely is to have ambitions but the path to those ambitions be impossibly uncertain. But looking in from the outside I can tell you you're doing quite well and agonizing over hypotheticals is a luxury I'd cut off a toe for right now. Buck up, friend; show up at your job, take it step by step. If you want to grow your salary, there's time for that. Just cross that bridge when you get to it.", "permalink": "/r/DecidingToBeBetter/comments/mqeqtu/how_can_i_start_being_grateful_and_feel_less/guftxro/"}