{"id": "t5_2tand_t3_pcagpu_t1_hahskg8", "creation": 1630023482, "origin": "t5_2tand_t3_pcagpu", "height": 1, "replied_to": "t5_2tand_t3_pcagpu", "down_vote": 0, "up_vote": 14, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "greebledhorse", "text": "I'd suggest taking another look at the narrative you're creating around this because it seems like the narrative you have now isn't necessarily a narrative of you rooting for yourself. This isn't to say you shouldn't be accountable, but I think you can fit in more self forgiveness! From what I've read, even the most self-destructive impulses, even the impulses that don't feel like who you want to be as a person, are rooted in your body trying to protect you because it loves you.\n\nI'm guessing these intense feelings of jealousy come from your body desperately trying to protect you from being lied to, led on, and abandoned. Maybe you've experienced a severe abandonment in the past. Maybe there are parts of the narrative you tell about yourself that don't fully capture how worthy you are, worthy of all of the love your boyfriend is showing you. It's mature and great to recognize that jealousy isn't you showing up as your best self, and to recognize that it can hurt people. But on the other hand, if you're struggling with big questions about worth and/or abandonment, it doesn't seem productive to pile on a third struggle and make the story about how you're some kind of time bomb of toxicity who can hurt and hurt and hurt just as long as other people are okay. There must be a new narrative you could create that could help ease the burden and show compassion towards the injuries behind the jealousy. I'd suggest getting really curious about little things that make you feel seen and grounded, things that don't rely on comparison, and being intentional about asking for those things or incorporating them into your life. It could also be helpful to imagine a scenario where your relationship doesn't work out, just to run through some actionable things you could do after that. That could help the possibility shift from a devastating unknown to something that would really really suck but follows rules and could be survived. \n\nI'd also suggest looking up Internal Family Systems therapy. I've never done it myself, but the idea behind it is solidly rooted in seeing negative impulses as self-protective, and it really helped me just to read about it. Best of luck.", "permalink": "/r/DecidingToBeBetter/comments/pcagpu/i_cant_stop_thinking_about_my_boyfriends_ex/hahskg8/"}