{"id": "t5_2tand_t3_pcagpu_t1_hahsx23", "creation": 1630023649, "origin": "t5_2tand_t3_pcagpu", "height": 1, "replied_to": "t5_2tand_t3_pcagpu", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lesbian_czar", "text": "That sounds really tough to deal with and very painful! I'm so sorry you are going through this!\n\nIt might be good to figure out what messages you are telling yourself about you when you get to this headspace. From your post could one of them be \"I think I'm ugly\"? It might be helpful after figuring out what the messages are that you tell yourself to write positive affirmations, such as \"I am beautiful.\" \"I am loved.\" I am worthy of being loved.\" \"I am fun to be around.\" Anything that is a statement that is basically the opposite of what the negative self talk is saying. It has to be written as what you want to believe. You will likely feel uncomfortable and like you're lying to yourself, that's okay! Put those positive affirmations on note cards and put them up by places you frequent; bedroom light switch, mirror, by your bed, etc. Imagine your self talk as if it is a playlist, right now you have a lot of negative self talk, this is like adding positive affirmations to the playlist so you get those messages. It will take a little while but those messages get in your mind and your start to believe them. \n\nI don't know if you have done any DBT therapy, but it might be helpful. DBT is not just for people with BPD (not that there is anything wrong with having BPD) and had a lot of really useful tools. You could ask your therapist about it. \n\nAlso, a big thing about therapy is practicing the skills you are learning in therapy outside of therapy. If your therapist gives you homework, do it. Ask for homework from your therapist. This will help you get the most out of therapy.", "permalink": "/r/DecidingToBeBetter/comments/pcagpu/i_cant_stop_thinking_about_my_boyfriends_ex/hahsx23/"}