{"id": "t5_2tand_t3_pcagpu_t1_hahk2wd", "creation": 1630019501, "origin": "t5_2tand_t3_pcagpu", "height": 1, "replied_to": "t5_2tand_t3_pcagpu", "down_vote": 0, "up_vote": 198, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "But_like_whytho", "text": "Oh honey…you didn’t list your age and I’m gonna guess you’re under 30, cause these kinds of thoughts tend to go away the older you get. \n\nWhat you’re describing are automatic negative thoughts and they can come in a whole host of colors and flavors (yay). Your mind starts down a familiar path and suddenly it’s like a flood you can’t get away from, they spiral until you end the cycle. The trick is to cut them off at the start and redirect to something else. There are several ways to do this. \n\nThe next time you start thinking his ex is smarter, prettier, better in bed, etc. forcibly stop yourself, look in the mirror and say to yourself, “so what?” So what if she’s “better” than you (she’s not, your brain is lying to you). What does it matter if she’s prettier or sexier? He’s not with her he’s with YOU. If he wanted to be with her he would be. He doesn’t want to be with her, he wants to be with you. Write it out so you can see it, put post it notes up saying “it doesn’t matter if she is because she’s gone” or whatever saying works for you. Repeat it over and over to yourself until your brain creates a new pathway and breaks the cycle. \n\nThere will always be someone prettier, sexier, skinnier, smarter, funnier, etc. than you, just like you’re prettier, sexier, smarter, etc. than A LOT of other people. You can’t control your competition the only thing you can do is your very best at the time. \n\nYou ARE good enough to be loved. Every single thing those negative thoughts have in common is that at their core is the belief that you aren’t good enough or deserving enough of love. This is what your sessions with your therapist should be about, uncovering WHY you don’t think you’re good enough and developing tools for better coping mechanisms when you feel that way. It almost always has something to do with your childhood and your relationship with your caregivers and their relationships with the people in their lives. \n\nYour bf chose you because he cares for you deeply. He’s with YOU now, not her. Stop living in their past and start focusing on your future. Distract yourself with hobbies and activities that get you out of your automatic negative thought rut and that make you feel better. Rather than going to bed, go for a walk. Talk to strangers. Make kids smile. See how many dogs you meet. Focus on the sun on your skin, wind in your hair, and earth beneath your feet. Live in the NOW, not someone else’s then, and you’ll feel much better about yourself and everyone else.", "permalink": "/r/DecidingToBeBetter/comments/pcagpu/i_cant_stop_thinking_about_my_boyfriends_ex/hahk2wd/"}