{"id": "t5_2tand_t3_oc6xxb_t1_h3togj4", "creation": 1625244533, "origin": "t5_2tand_t3_oc6xxb", "height": 1, "replied_to": "t5_2tand_t3_oc6xxb", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "xjulesx21", "text": "hey, fellow human. first of all, good for you for recognizing your issue and working to be better. that’s the first step of recovery is admitting you have an issue and it can take a long time for people to get to that point. \n\nsecond of all, you’re not an idiot by any means. addiction is normally the result of some sort of other trauma or problems that haven’t been dealt with. I can definitely relate to you, as I was prescribed benzos for 7 years and once I didn’t want to be on them anymore I had many grand mal seizures (I believe they’ve changed the name to clonic tonic seizures?). I had to work my way back up to getting my license back, learning to write and walk balanced again. it ruined my life for years. but once I had the strength to go to detox, I was there for 3 weeks getting stable and then detoxed off benzos. by far one of the hardest & most dangerous drugs I’d ever been addicted to. but the detox changed my life, not only to get me fully off the shit but I met a lot of other people in similar situations that I really connected with. I was in awe at how much of a family mentality it was like in there, everyone was kind and helpful and most people loved to sit and talk since there’s really nothing else to do.\n\nIf you feel like you need to ever attend rehab, detox, NA, etc, just know that these are (for the most part - i’ve been to a lot) safe spaces. it’s only in those settings and jail that you’ll connect with a large group of people with substance problems, which can be really helpful in feeling not so alone. especially when, at least for me, my family really looked down on me and I felt like a failure. but connecting with others who have the same sort of issues, especially with NA cause people are further along in sobriety normally. you don’t gotta go thru the steps or get a sponsor, I never officially did, but the connection aspect can be really helpful. just wanted to point that out. \n\nthird of all, I’d try to get to the bottom of what makes you want to use. for example, for me it was the fact that I was misdiagnosed and not getting any true help like therapy, CBT, psychotherapy, etc. that shit was really helpful for me in those dark times. when you know the why, you can better work towards those issues to try to not use anymore. \n\nbeing sober after using is hard, obviously. I recommend you try to stay busy. I’ve found that movies and TV shows that really interest you help to distract you well. same with Youtube. before you know it a few hours have flown by and you haven’t used. if you have hobbies or activities, dive into them. if not, pick up some new ones and try em out. for example, I’m horrible at art but I find it relaxing sometimes to just go wild and not care what the outcome looks like. plenty of activities can be done this way. *distractions are your best friend while newly sober*. if you can, I wouldn’t worry too much about responsibilities or being productive. just focus on being content in the moment and not using. \n\n& finally, the longer you don’t use, the less and less you think about substances. i’m 2.5 years sober and rarely think about drugs. but my partner was not as lucky as me and fell victim to OD with some bunk laced stuff and is no longer physically here. I miss him every minute of every day, but the best I can do now is spread advice of sobriety to hopefully reduce the amount of people trapped in this cycle. \n\nsending you love, you got this. 💙", "permalink": "/r/DecidingToBeBetter/comments/oc6xxb/finally_coming_to_terms_with_the_fact_that_im_an/h3togj4/"}