{"id": "t5_2tand_t3_oczq1s_t1_h3xzuai", "creation": 1625336673, "origin": "t5_2tand_t3_oczq1s", "height": 1, "replied_to": "t5_2tand_t3_oczq1s", "down_vote": 0, "up_vote": 18, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thisgingercake", "text": "Hi there -\n\nYes, please cry when you need to because that's the bodies way of releasing toxic levels of stress. \n\nHonestly, It sounds like your central nervous system could use some TLC.  \n\nThere are many people who can relate to enduring an abusive childhood.  \n\nNeuroscience is just starting to explain to us how core wounds work and how much we are triggered by our upbringing / treatment in our childhood homes. \n\nthat being said, WHEN YOU MOVE OUT and away from them, I'd recommend getting yourself some assistance in processing this.  IF you're still on their insurance right now, I'd get started with the process of finding the right trauma therapist for you, one that has PLENTY of verified experience with EMDR protocol and/or family systems therapy. \n\nTrauma therapists have access to tools like neurofeedback , BAUD, Brainspotting and / or EMDR protocol.   \n\nYou are not your brain.  As a child you've were forced to develop under conditions that left you struggling to regulate.  PTSD has it's roots in lifestyles such as these. \n\nAt the end of the day here, you must protect yourself to the best of your ability.   \n\nPosting here today and on other forums like r/CPTSD will likely help you feel the support of your community. \n\nYou are worthy of a safe place, you deserve love and the ability to have the tools and space to regulate.\n\n\\--\n\nsending you healing vibes. \n\n\\---\n\nI've done 198 hours of trauma therapy within the past year and a half. It has been incredibly eye opening and has pretty much saved my physical vessel from the stress I had been storing from my upbringing.  I am able to set boundaries now, I am able to see red flags and I am able to hear my own voice again and honor that.", "permalink": "/r/DecidingToBeBetter/comments/oczq1s/as_an_adult_with_problems_im_just_wondering_if/h3xzuai/"}