{"id": "t5_2tand_t3_8ddw9g_t1_dxu1gr5", "creation": 1524498746, "origin": "t5_2tand_t3_8ddw9g", "height": 1, "replied_to": "t5_2tand_t3_8ddw9g", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "stecklese", "text": "This article made a huge impact on me. I created an 11:11 alarm as a reminder to constantly reflect on it.\n\nhttps://goop.com/wellness/health/rewire-your-head-change-your-world/\n\n\"In Superbrain, Deepak and I emphasize that your brain is an organ that works for you. That might sound weird, but what I mean is that your brain is bringing you sensations that need to be interpreted. Whenever we have a sensory experience of seeing, hearing, smelling, tasting, or feeling something, we have to put it in context of what we already know in order to make sense of it. To do this, you use brain synapses you’ve already formed, based on experiences you’ve already had, all driven by the choices you’ve already made.  \n So the choices you’ve made in the past create the experiences you have now. The choices you make from today forward determine the experiences that will determine who you are in the future.\n  \nWe like to say that the real you is that entity that’s using the brain. You’re using the brain as it’s bringing you these sensations and images, memories, feelings, and thoughts.  \n In effect, your brain brings you your world. But you have the power to determine the world your brain brings you.\n\n“The mistake that will make you miserable is to identify with the information being made available to your mind.”\n\nAs soon as you make that leap of understanding, you realize that when someone does something bad to you and makes you sad or angry, the last thing in the world you should do is say, “I am angry” or “I am sad.” When you see a red car go by, your brain brings you the image of a red car, but you don’t say, “I am a red car.” You say, “I see a red car.” Same thing: If that red car then runs through a puddle and soaks you, your brain brings you the feeling of anger. That doesn’t mean you “are” angry.\n\nI call it mountaintop consciousness: You’re sitting on a mountaintop, observing what the brain is doing—using your brain, rather than having your brain use you. The mistake that will make you miserable is to identify with the information being made available to your mind\"", "permalink": "/r/DecidingToBeBetter/comments/8ddw9g/how_to_not_complain_in_life_please_respond/dxu1gr5/"}