{"id": "t5_2tand_t3_lsbm3a_t1_goucvh2", "creation": 1614356262, "origin": "t5_2tand_t3_lsbm3a", "height": 1, "replied_to": "t5_2tand_t3_lsbm3a", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "can-of-fortissimo", "text": "You did great. I want to say that if you don’t stick to this plan of biking every day, do not be hard on yourself. Instead, always remember why you did it, and why it was something you wanted to do. What you felt today will not be infinitely replicable with the same activity, since you need a dose of the unknown mixed in. So do not become disaffected and insist on keeping up the activity when you notice it doesn’t give you as much anymore. Instead, remember how it made you feel, how it made you look at your future differently, what made you want to do it, and think about what is the next avenue to find this. It’s very easy for me at least to eventually fall back on anger and trying to force myself, and being disappointed after an initial success. Part of that can also be from trying to take a step I’m not quite ready for. A journey like this should be as positive and encouraging as possible, and when it is scary, do not forget the fun in a little bit of risk. When you adopt a playful attitude, failing is also a little less horrible. Afterall, you’re only playing. There’s no need for letting the journey get heavy or painful. That only makes you not want to do it. Eventhough you have to do things that are very challenging, it is definitely within the realm of the possible to get to a place where you actually genuinely want to undertake it. Why would you ever not want your life to be great? That’s what’s important here. And if that starts slipping away, it can be very important to take a step back and remembering that you’re doing this in order to live an engaging, adventurous life. That means your day to day feeling of engagement and adventure is the priority, which in turn means not thinking and doing things that makes you feel less engaged. A major one to look out for is “I should do x” or “today I will do y”. You’re allowed to write things you’d like to do down on paper, but I strongly recommend avoiding thinking that way. Don’t put too much effort for yourself in the future, because it makes you not want to engage. You exist in the present, and engagement happens in the present, so 90+% of your mental experience should be concerned with the present, which is where all action you will ever take in your life occurs. If you feel resistance to taking action right now, see if you can examine it, and see if you can remember why you want to do it. Learn to inspire yourself by working with yourself in the present. Also the harder the thing you’re trying to do, the more you have to confine yourself to the present in order to get through it. On mile 50 of a 100 mile run, you simply can’t handle thinking about the next 50 miles. All of the mental power and strength is in the present. It cannot be overstated, even if I’m not succeeding in putting it as succinctly as I’d like right now. \n\nAnd to end, I’d like to encourage you to take a look at r/nofap and r/semenretention. The latter is much more positive, and places more emphasis on the importance of the mindset, but has more weird and superstitious theories too. Your appetite for life and the energy you have for engaging with it will go through the roof when you leave these things, including the mindset that makes you even want these things, behind.\n\nI hope there’s something in this ramble that’s useful to you. It will be amazing to have a world with more loving, fulfilled people in it, and you can be on the frontier trying to encourage that by leading the way!", "permalink": "/r/DecidingToBeBetter/comments/lsbm3a/went_out_of_home_after_4_years/goucvh2/"}