{"id": "t5_2tand_t3_lsbm3a_t1_goslmg1", "creation": 1614313039, "origin": "t5_2tand_t3_lsbm3a", "height": 1, "replied_to": "t5_2tand_t3_lsbm3a", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MonkKeyJar", "text": "Hey man THIS IS HUGE. You are finally ready to get your life together. The important thing is to use this as a starting point and try to stop the things that are hurting you so that you can make REAL progress.\n\n1) I would suggest finding a local job. Yea the social anxiety is gonna suck ( trust me I know) but your gonna have it regardless and might as well start earning your own income. This will keep you away from your dad, porn, and give you something to keep you busy. 2) Use that  income since you don't have rent and put some into things that you enjoy like a nice video game or your favorite restaurant every now and then. But save most of it. 3) If your gonna get away from your dad your gonna have to get your own place which requires money. Your old enough now to go out on your own. Yea it's scary, but people far less brave than you have done it too. 4) With your own place, your own steady income, your already gonna be a in a better place. Now is the time to use whatever disposable income you have and start going to gym and therapy. These two things are gonna really change your life and help you figure out your self worth. These two things also require maximum effort. Go into the gym and run as fast as you can for as long as you can. Then do it again. Find the heaviest amount of weight you can get at least 5 reps out of before you can't lift anymore. Then do it again. 6) All these things are both easily possible and only require your own time and effort to accomplish. And doing it in this order will help you to not give up too quickly. You will quickly realize your own capability and worth. 7) speak with your therapist about body dismorphia, it's possible your obsession about being skinny and your appearance may actually be too hard for you to handle properly.", "permalink": "/r/DecidingToBeBetter/comments/lsbm3a/went_out_of_home_after_4_years/goslmg1/"}