{"id": "t5_2tand_t3_mwllvz_t1_gvkg45y", "creation": 1619186861, "origin": "t5_2tand_t3_mwllvz", "height": 1, "replied_to": "t5_2tand_t3_mwllvz", "down_vote": 0, "up_vote": 26, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "knoxsyd", "text": "I’m really surprised to hear OP was in therapy for such a short time and feels so much better. I’m not saying that’s not possible, but I started feeling like OP (hopeful) after about 10-11 months of weekly 40 minute sessions WITH THE SAME THERAPIST. Finding a good therapist takes time too. \n\n\nFor me, it was my therapist’s annoying ass interruptions when I’m on a negative train of thought. Seriously, she pissed me off on more than one occasion. (That women and I have gotten INTO it 🤬)\n\n\nBut something started happening around month 5ish. I started hearing her annoying ass interruptions outside of the fucking office. Like there was a new voice in my head and he was not a fan of the current tenant. \n\n\nI love my therapist. But she acts like she knows better than me. It took me a long time to realize that she does, and to actually start listening to her. And even longer to practice what she preached. She helped me navigate and identify toxic coworkers/friends/family and then she geared me up to deal with them. \n\n\nBut the best training she gave me, was to actually call out my own feelings and give them a soap box. Has someone ever said something that just upset you, and instead of addressing it, you just nod and smile cuz even you don’t fully comprehend why you’re feeling so strongly about something and then you rationalize it away as “oh I’m just being dramatic or stupid”. That shit is not ok and I used to do that ALL THE TIME without realizing it. \n\n\nI still have issues with depression and anxiety. But it’s so much more manageable. I feel almost human. And I actually like the people I socialize with. \n\nAnd since this was super long and I don’t have a tldr here a summary of what I look like in a typical therapy session:\n\n\n🙃🙁😞😥😠😠😡🤬🤬🤬😡😠🥺😢😭😂🤣🥲😅😀\n\nEDIT: one thing I want to add, the person writing to you right now, is now 4 years into therapy with the same asshole therapist who I fucking love.", "permalink": "/r/DecidingToBeBetter/comments/mwllvz/ive_been_in_therapy_for_two_months_now_and_my/gvkg45y/"}