{"id": "t5_2tand_t3_mwllvz_t1_gvjpn4u", "creation": 1619168772, "origin": "t5_2tand_t3_mwllvz", "height": 1, "replied_to": "t5_2tand_t3_mwllvz", "down_vote": 0, "up_vote": 27, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Psychotherapists help in many different ways. I’m going to copy paste something which might help explain it :\n\nSeveral approaches to psychotherapy, including cognitive-behavioral, interpersonal, and psychodynamic, help depressed/anxious people recover. Psychotherapy offers people the opportunity to identify the factors that contribute to their depression and to deal effectively with the psychological, behavioral, interpersonal and situational causes. Skilled therapists can work with depressed individuals to:\nPinpoint the life problems that contribute to their depression and help them understand which aspects of those problems they may be able to solve or improve\nA trained therapist can help depressed patients identify options for the future and set realistic goals that enable them to enhance their mental and emotional well-being. Therapists also help individuals identify how they have successfully dealt with similar feelings if they have been depressed in the past.\nIdentify negative or distorted thinking patterns that contribute to feelings of hopelessness and helplessness that accompany depression\nFor example, depressed individuals may tend to overgeneralize, that is, to think of circumstances in terms of \"always\" or \"never.\" They may also take events personally. A trained and competent therapist can help nurture a more positive outlook on life.\nExplore other learned thoughts and behaviors that create problems and contribute to depression\nFor example, therapists can help depressed individuals understand and improve patterns of interacting with other people that contribute to their depression.\nHelp people regain a sense of control and pleasure in life\nPsychotherapy helps people see choices as well as gradually incorporate enjoyable, fulfilling activities back into their lives.\nHaving one episode of depression greatly increases the risk of having another episode. There is some evidence that ongoing psychotherapy may lessen the chance of future episodes or reduce their intensity. Through therapy, people can learn skills to avoid unnecessary suffering from later bouts of depression.", "permalink": "/r/DecidingToBeBetter/comments/mwllvz/ive_been_in_therapy_for_two_months_now_and_my/gvjpn4u/"}