{"id": "t5_2tand_t3_l12sco_t1_gjx29rn", "creation": 1611122402, "origin": "t5_2tand_t3_l12sco", "height": 1, "replied_to": "t5_2tand_t3_l12sco", "down_vote": 0, "up_vote": 17, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hichkihichki", "text": "This was me a few years ago! And it was affecting our relationship too. My bf has a very strong work ethic, so he couldn't understand my complaining and started interpreting it as me being lazy or not serious etc. But reality was two fold\n\n1. Yes the work place was toxic\n\n2. Yes I was not processing my emotions and was dumping all my feeling onto my bf.\n\n\n\nSo I changed it by approaching these two issues separately :\n\n1. I practiced detachment from workplace politics by completely focussing on my side of the work, making sure I do everything right and don't make mistakes and then if I get a negative input, I use it to better my skills and brush off the non constructive feedback. I also did job hunts to keep giving myself something to look forward to. I valued my job for the financial independence it gives me etc. \n\n2. I completely stopped mentioning jobs to him. I would write down about job related issues in a \"deathnote\" diary I bought online 😅 And I would just complain to my diary and all my bad emotions were contained only in it. \n\n\nEventually I was able to retain my Generally positive self in the face of a sour faced boss and practiced detachment so much that his mean words just slipped off of me. I saw him as this \"hurt animal\" who has his own issues at home and is taking it out by barking at me. The more positive and unphased I got, the more my boss found it confusing as to why I wasn't responding to his rebukes. It honestly is the best skill I have gained : Doing my best with full positivity with no regards for other's mean attitude. But at the same time I ensured I wasn't lagging behind in my contribution to work.\n\nThink of yourself as Elle Woods from Legally Blonde 😊", "permalink": "/r/DecidingToBeBetter/comments/l12sco/i_dont_want_to_drive_my_boyfriend_away_with_my/gjx29rn/"}