{"id": "t5_2qh5i_t3_llyp7y_t1_gnv5bq6", "creation": 1613635084, "origin": "t5_2qh5i_t3_llyp7y", "height": 1, "replied_to": "t5_2qh5i_t3_llyp7y", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "chazcope", "text": "Okay, hi u/charalot \\-- first and foremost, kudos to you for supporting your daughter. There is a direct, scientifically proven link between the mental well-being of transgender individuals and familial support. If the parents support their transgender child, suicide rates drop from \\~40% to \\*freaking\\* \\~4%. Your decision to stand by her side despite the gravitas of this situation cannot be understated. I am sending a million hugs your way. Please let your daughter know she can reach out to me at any time to talk. I began my transition at 26, myself. My Instagram is @ th3sloaneranger and she can DM me. \n\nNow, I'm going to answer each of your questions individually and then provide some tips for you two, as requested. \n\n> Did you do any shopping for items in person? \n\nYes! In fact, I recommend starting your shopping in person. It's very scary for a trans person to shop in person. I can remember the intense pressure and fear I felt walking into TJ Maxx or Goodwill and shopping by myself in the women's section (my mother, at the time, did not support me and would not shop with me, though I did have friends to go with me from time to time). It feels like everyone in the world is watching you and judging, but I recommend this for a few reasons. First, it helps you find the right sizes for everything. Second, it provides exposure therapy for your daughter. The more time your daughter spends in slight discomfort, the more confident and sure she will become. That fear I used to feel walking into TJ Maxx is nearly gone these days because I've relentlessly exposed myself to the discomfort. If I see someone looking at me weird, I don't internalize that anymore. I own it. \n\n> Did you try things on? How did you handle that? \n\nYes, of course! Listen, I made a ton of mistakes at the start of my transition. I bought goofy clothes that I wouldn't be caught dead in, things that didn't fit right, things that didn't match, etc. This is her journey, though, and she has to learn and grow from those mistakes. Let her explore gender expression in her own ways. Provide her with advice (e.g. \"honey, stripes and houndstooth don't go together\"), but don't try to constrain her. There's not a trans person I know that didn't have a very, very embarrassing stage at the start of their transition. Let her be awkward for a bit! \n\nAs for the actual act of trying things on, do what she's comfortable doing. I don't think I went to the women's dressing rooms until at least 5 months into my transition. I didn't feel safe or like I'd be allowed/accepted. So if she's taking dresses to the men's side of things, so be it. It's only temporary and there'll come a day where no one bats an eye at her going to the women's dressing rooms. \n\n> Do you have any tips for the two of us? \n\nI have PLENTY of tips. I'm going to rapid-fire this because I have a feeling I'm running out of space here in this comment. \n\nDo's: \n\n1. Long sleeve tops to shorten arm length\n2. Wide, thick straps up top (i.e. not spaghetti )\n3. Things with collars. \n4. Things that cinch at the waste\n5. A-line skirts are primo.\n6. Skinny jeans rock!\n7. Accessorize w/ belts, purses, and jewelry.\n\nDont's:\n\n1. Busy shoulder details (draws attention)\n2. Sleeves that stop at the shoulder or are three-quarters length.\n3. 1:1 proportion outfits where the top is the same length as the bottom. \n4. Add ankle width w/ flairs or bell bottoms\n5. Go for tight skirts unless you're very capable of tucking. \n\nLastly, don't be afraid to find a top she likes and then buy that top in multiple colors. Target is great for this, because they'll have shirts in six different colors. This will allow her to be comfortable several times before having to do laundry. \n\nI hope this all helps! I can answer more questions if you have them. :)", "permalink": "/r/happy/comments/llyp7y/im_hesitant_to_post_this_outside_of_lgbt_specific/gnv5bq6/"}