{"id": "t5_2qh5i_t3_llyp7y_t1_gntu6su", "creation": 1613607572, "origin": "t5_2qh5i_t3_llyp7y", "height": 1, "replied_to": "t5_2qh5i_t3_llyp7y", "down_vote": 0, "up_vote": 18, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "chazcope", "text": "Hey! Thank you so much for the compliment. I really appreciate what you're saying and I love to hear I have your support. You're very welcome here!! \n\nI do want to point a small thing out to you, if you don't mind. I hope you'll be able to field my constructive comment! :) The reason I want to say something is because it's not very common I receive such a kind, earnest, and honest compliment.\n\nIf you say you're \"heterosexual\", then by definition you can be attracted to me. Being \"heterosexual\" (i.e. \"straight\") means you're into the other gender (i.e. the opposite of your own). That's me... I am the opposite gender as you. I am not a man. I’m just a woman. So, if you're \"heterosexual\", that means you can be into me without being \"homosexual\". I'm a woman in bed. I'm a woman when driving to the grocery store. I'm a woman when (badly) playing the guitar. Just because I once presented as a man does not mean I am one, nor that I'm part man-part woman. I'm just a woman with the adjective of \"trans\"!\n\nNow, before I let you go, one last thing! It's completely fair for someone like yourself to say that you have \"a preference for certain anatomy\". Maybe you don't like penis. And that is ONE HUNDRED PERCENT okay. I wouldn't hold that against you and no one else should, either. People have their preferences and types and we should honor those preferences. But me having a penis does not make me a man, and if a straight man were to take me home, he would still be definitively straight.\n\nAnyways, I'm really sorry to take your complement and turn it into constructive criticism. I do appreciate what you're saying. I am touched and feel your love. Thank you, friend! :)", "permalink": "/r/happy/comments/llyp7y/im_hesitant_to_post_this_outside_of_lgbt_specific/gntu6su/"}