{"id": "t5_2tand_t3_oz6u7y_t1_h7zc6o3", "creation": 1628283709, "origin": "t5_2tand_t3_oz6u7y", "height": 1, "replied_to": "t5_2tand_t3_oz6u7y", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ghostvinyl143", "text": "I've been where you are. Numerous times in fact.  Things that helped me:\n\n1. Figure out who you are.  No really, I thought I knew who I was, but over time I realized alot of the things I used to describe myself where actually the way I interpreted other people's expectations and how I tied my worth to being valuable in the eyes of people I care about (thank you therapy, we will get to that.)  See in my experience, hindsight being 20/20 a lot of what I did in my youth (16 to 25), was from all the expectations I shouldered (I chose to shoulder).  This will lead us into wasting time, energy, money, and potential growth.  Had I done what you did, I could've saved myself about 50k in student loans and CC debt, saved myself 5 years of pain and uncertainty, and possibly a suicide attempt.  \n\nIdk about you, but I'm a depressed perfectionist with \"high-fuctioning\" anxiety to my own detriment. Let me tell you right now, you aren't wasting time, so much as biding your time.  What is it that you love? Something that you lose yourself in.  You've been playing video games and browsing the internet all day?  Consider streaming while you play.  Why not?  You won't lose anything.  Delete social media apps and replace it with Wikipedia and browse topics that interest you, or reexamine what/who you follow.  Do these people and pages inspire you, give you something other than a dopamine kick?  One of the major turning points for me was living in my car for a month jobless, not wanting to admit I failed my family, until I found out my parents were getting divorced and I promptly moved back home to help them and my brothers deal with the fallout. In that time, I went back to what I loved and put away: writing, painting, learning things that interested me on my own (history, philosophy, religious and spiritual studies.)  I started watching full semester lectures on YouTube of topics that I loved or inspired me.  (I'll accept your hate reddit, but Maps of Meaning by Jordan Peterson was one of the most illuminating.)\n\nAll that being said, I'm not to where I can make a living off of those things, but that process has put me in a happier place and on a path that excites me and scares me.  I still work a numbing 40+ hours a week for a major corporation, and I still struggle some days but overall implementing those changes has helped me tremendously. \n\n2. Therapy - you mentioned it. It did help me. Now I just did Better help and for a small time talk space. Maybe you don't need \"therapy\" like you think you do.  Maybe you just need some experienced professional to give you help realigning your perception. Therapy showed me how my own self-talk and how I develop my self-image was hurting myself when I thought it was making me stronger and more self-reliant. I'd recommend either for just a short time. I was with betterhelp for six months before I felt like I could manage alone. Talkspace was provided through my employer, but with lackluster services so I switched a month into it. \n\nGo into it knowing what results you want and be open and candid. Don't be afraid to say I don't know. (According my therapist that was my default to anytime I was feeling a lack of control over my life and emotions. And when I caught myself saying that or feeling that uncertainty, I was able to step back and examine the actual problems.\n\n3.  Find your power.  This is a tough one.  Try to figure out a schedule, nothing to tyrannical, give yourself room to move.  Find something you can control and control the f out of it. One thing that helped me was diet.  You can easily control what you put into your body, start there tracking what you eat and your calories, planning your meals and setting specific times to eat. Another thing is pick a week this month. Any week. Plan out that week as if your life was perfect and you could do anything at all.  Now that you did that, very loosely without being a tyrant, what can you do to make any of that a possibility? \n\nExample of the top of my head based loosely on what I do atm:  Sat-Fri\n\nSaturday:  wake up before 10; write 1500 words before lunch; respond to emails and correspondence during lunch; research marketing and budgets and business plan for at least 3 hours (with small breaks)\n\nSunday:  wake up before 10; draw a design for a t-shirt, poster, logo, just draw for 2 hours; write 1500 words; play a game and record footage for 1-2 hours.  Read anything (wiki, internet articles, books)\n\nMonday:  wake up before 10; write 1500 words; record and paint; research (related to the reason I recorded the game footage); watch a few episodes or a movie (typically related to game footage I recorded or something I had been reading, looking through common themes) and capture footage.\n\nTuesday:  Combine and edit video, record voice over, (taking breaks cause this is a long process for someone like me); Do planning and business research.\n\nI'll stop there cause it gets repetitive, but you see what I am going for. I use Google Calendar to set this as Goals (not events or task.)  Goals are adaptive and learn and can be easily moved if needed (maybe I really want to or am inspired to write after I reach my limit, I just drag my goals around.  What's more I enjoy the dopamine kick when I hit the check as done option on my calendar, and it will recognize and learn and adjust according to how you function. Ex: when I started I never managed to write when I planned to, after about a month, Google started scheduling it to the time I was actually marking it complete. \n\nAnother thing to note, I didn't put my actual job on there, because it isnt a part of my perfect life.  So once I plan the week my first task is to figure out what I can realistically do.  This took sometime, but it'll come about. For extra help, set your work schedule as a recurring event to prevent your goals from being scheduled during that time, don't forget about drive time and getting ready time (I give myself an extra 30 minutes prior to my work shift and an hour after; Ex if I'm scheduled 2-11, my calendar says 130-12.)  Of course you don't have to worry about this atm, but keep it in mind.\n\nThat is what helped me, still not perfect. Definitely still struggling. I'm currently behind about 4,000 words and reading and video editing.  Finances are preventing me from painting very often, and July was just an outright horrible failure on my part.  Now I'm quarantined because I threw up at work last night, so I'm stressed about my friends and coworkers being stuck without me when we are already understaffed.  But despite all that I know, I am working towards something for myself, that also helps give me a sense of value.  It has helped me have more hope for my future.\n\nIt sucks for alot of us. It seems like there are no \"good\" options for a big chunk of teens to late twenties. Just don't give in to despair or envy, that will just lead to bitterness and a further spiral down.  \n\nI hope that helps, sorry for the novel.  Just know you are stronger and more powerful than you realize. The world is quite literally at your fingertips. \n\nI love you and hope you can find what you need!", "permalink": "/r/DecidingToBeBetter/comments/oz6u7y/how_to_force_myself_to_do_things/h7zc6o3/"}