{"id": "t5_2tand_t3_oz6u7y_t1_h7zzlad", "creation": 1628295005, "origin": "t5_2tand_t3_oz6u7y", "height": 1, "replied_to": "t5_2tand_t3_oz6u7y", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ghostvinyl143", "text": "OK I'll try my best, I'm a long winded person.  \n\nTLDR:\n\nI've been there. Lived out of my car, moved back in with my mom during her and my dad's divorce.  Things that helped me:\n\n1. Figure out who you are. Not who you think your parents/family/friends think you should be, but who you are. You clearly get enjoyment out of video games, why not stream or do commentary?  You'll lose nothing, but could gain anything. Spending too much time on social media? Switch it up, download Wikipedia and search things that interest you, fall through the wormhole, you'll get more from it than SM. Change up your news feed to things that encourage and inspire you.\n\n2. Therapy.  I used Talkspace through my employer for a month switched to Betterhelp and paid it myself for the features and time commitment. Did it for like 6 months and we decided I was capable of coping on my own and it had risen my confidence and self value tremendously as well as illuminate how I see and talk about myself hurt me. Don't think of it as \"I need therapy\" but \"I'm not an expert on how emotions and self-value effect me, so I will seek out an expert to help me.\"\n\n3. Find your power.  Find something you can control easily. Mine was diet. I tracked and recorded what I ate. Granted I wanted to lose weight so that helped. But in 30 days if you are doing it right you'll see results that will help kick you into \"I am in charge of my life mode.\"  Another thing is to pick a week in the future and make a schedule of \"your perfect week.\"  Don't be a tyrant. Give yourself room to fail, room to reschedule and follow your intuition. \n\nHopefully I condensed it down enough for you.  If not you can always DM me any questions or vents.  I would recommend whenever you can or want to, go to my OG response and ask yourself those questions.\n\nBest of luck to you!\n\nSincerely,\n\nA 30 year old depressive perfectionist with high functioning anxiety, who still struggles everyday, but now has hope and determination to fight my darkness.", "permalink": "/r/DecidingToBeBetter/comments/oz6u7y/how_to_force_myself_to_do_things/h7zzlad/"}