{"id": "t5_2tand_t3_oz6u7y_t1_h7yumqa", "creation": 1628276005, "origin": "t5_2tand_t3_oz6u7y", "height": 1, "replied_to": "t5_2tand_t3_oz6u7y", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Enough-Issue-5441", "text": "I snooped through your profile. I went through some of the same issues at that age and I’ve come to a conclusion: you’re fucked. And it’s only going to get worse. \n\nYou are really young, and you are still living with your parents. This is a blessing, there’s people who turn 18 and get kicked out of their home on their birthday. You should really be using this time to invest in yourself before shit gets worse. And it will get worse.\n\nFinding love? Ask yourself this: Why would a person be interested in you specifically? Take a long look at yourself in the mirror as you ponder on this thought. What attributes do you have that makes you attractive? (Physical, mental, emotional) From reading your posts, you need to work on yourself before attempting to find love. \n\nYou are going to fail. A lot. Over and over again, in rapid succession. Many failures await you. However these are a good thing, because it means you are trying; an attempt is being made. Failure will bring you the most experience. As you age the amount of total failures will decrease, but not completely go away. The amount that they effect you decreases as you learn the best ways of dealing with them.\n\nIf you don’t get a job after an ample amount of time your parents will be forced with two options.\n\n1. Let you do as you want and take no action.\n\n2. Kick you out.\n\nIf option 1 is picked, you will live in their house until your 30 with absolutely NO life skills. My cousin is this way. He turned 25 this year and it’s pathetic. He went to college, got a degree in programming, but he has NO EXPERIENCE. Programming is a constantly changing field where new languages come out that need to be learned. His mother never forced him to get a job, so now his degree is essentially worthless. \n\nIf they pick option 2. You will be forced to adapt or die. \n\nWhatever option they pick you will hate your parents for it. The trick is to not let them pick between these options. Go out and get a job before they have to make their decision m.", "permalink": "/r/DecidingToBeBetter/comments/oz6u7y/how_to_force_myself_to_do_things/h7yumqa/"}