{"id": "t5_2tand_t3_oz6u7y_t1_h7yu0ud", "creation": 1628275744, "origin": "t5_2tand_t3_oz6u7y", "height": 1, "replied_to": "t5_2tand_t3_oz6u7y", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "leyline", "text": "Be pro-active.  \n\nWrite down a list of the chores they have you do, and consider it a quest list to kill that day.  Promise yourself a reward for each you do, or especially doing them all.  Personally I like to think, I need to drink more water, so I make a mental game of, if I drink a soda, then it will decrease my health and mental vigor, but if I drink water, it's really extra good like from a mystical spring, and even if I and just blah, water, I focus - it it will rejuvenate my body, feel the life flowing in as I swallow it.  And of course it does...  I try to make the mental rush of it important.\n\nPretend that some ill will befall you if you do not complete your quests (I mean your parents will scold you and you will be drained) but do it as a focus / motivation.\n\nI also agree with the 5 minute thing.  Tell yourself, I will go do this for 5 minutes, and I will see what I can do.  I don't have to do it all, but lets see where it gets me.\n\nI've had days in my life where I needed to take off work in the week, and I wanted to make it up on the weekend not to fall behind.  I told myself, I'll go in for just a bit on the weekend, just to catch up, and I can leave as soon as I knock out an hour because hey it's the weekend and I don't \"NEED\" to be there. It's funny sometimes those are they days when whoosh, all the time flies by took a few hours, but I finished the whole task! (even though I sat down going \"I will just do an hour to catch up some.\")\n\nIf you can start getting up and doing small tasks without them on you, they may become surprised, and they may become more positive.\n\nYou could also make up this list, and discuss the plan with them. Say, hey I know you think I am lazy, I am going to take this on myself, and if you notice a change could you please say something positive to me, and if I slip or fail, please don't cut me down, but please offer me a polite kindness to get back up and continue.\n\nUse your device less.  Do not take it to the bathroom.  Leave it in your room and go for a walk outside around your house, your area, or a park.  Phones and games can become an addiction, and this can drain you. Make it a goal to be able to be separate from it for a few minutes at a time, and a little longer each day.\n\nMake your reward a healthy bit of a game after you have done your tasks. Or a special drink, a special cup of tea, or a sparkly beverage, but sit down and take the time to prepare and sip it, 5, 10, 15 minutes of \"cool time\"  This may help release some weight from your mind.\n\nThis will not be an overnight change, this might happen so slowly things to not seem like they are \"working\" but hopefully in 30 days, 3 months, 6 months, you can look back and see.\n\nPersonally I lost 50 lbs, it took 14 months to do, a little under 1lb a week, and it seemed like a journey I could never succeed.  Covid hit, and I was afraid to eat fresh food because it would be contaminated, so I only ate canned / cooked things for a while. Over the past 18 months I lost my track and I gained 20lb back.  I feel terrible and I have been in a similar fear as you... Today, I took a salad to work, and I decided that I need to hit my diet hard like I did in 2019.  \n\nSo I will think of your struggle each day as I face my own; and you can know there is someone out there and you are not alone.", "permalink": "/r/DecidingToBeBetter/comments/oz6u7y/how_to_force_myself_to_do_things/h7yu0ud/"}