{"id": "t5_2tand_t3_oz6u7y_t1_h7xrtr5", "creation": 1628259557, "origin": "t5_2tand_t3_oz6u7y", "height": 1, "replied_to": "t5_2tand_t3_oz6u7y", "down_vote": 0, "up_vote": 15, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "maebyfunke980", "text": "Great advice by others, but you’re probably dealing with a combination of the pressure from your parents and possibly some variety of depression, which sometimes just manifests as doing nothing or avoiding things you should do. Without more details it’s hard to say, and understandable that sometimes you get to a place where even the effort to type a longer post seems daunting. I’d suggest trying to start with one thing a day that you don’t do now but you are aware you should: brush your teeth, take a shower, do one chore…just choose one thing. Try to repeat that for a week but don’t get discouraged if you can’t do it. If your parents are approachable, or if one of them is, maybe talk to them and let them know you need some support. How you feel on the inside isn’t visible to others: they see what looks like a lack of motivation or laziness and that’s not it at all. It’s a treatable problem but having support is helpful. Conversely, it’s unhelpful and can make things worse when you’re in that place to have people hounding you about why you’re not doing x, y, and z. Maybe the next time they bring it up, is your opening to talk about your struggles (I’d say less is more in that conversation though, depending on your relationship, they don’t need all of the details of your inner life and self, just enough to understand why you’re not able to do all of the things they think you should be doing - maybe just let them know you need help finding a provider for your mental health without stating the exact nature of the issue). Good luck and please know this is super common.\n\nEdit: I looked at your post history. You likely have some trauma issues specifically involving your parents and unresolved feelings about neglect or feeling unloved, which is very legitimate and can cause a lot of problems if it isn’t addressed, so I’d  try reading some posts on r/CPTSD and see if and of it resonates. And consider the fact that you’ve even figured this out an accomplishment. Not everyone is able to identify the root or source of their depression, anxiety, or discontent at such a young age. You’re other posts demonstrate that you’re quite intelligent and mature. You’re more aware and introspective than a lot of your peers (and I certainly mean no offense to all young people, but your prefrontal cortex isn’t finished developing yet so your brain is literally still a work in progress). Once you’ve identified the cause or the trauma, you can help yourself find the best path to get yourself to a better place mentally. That path looks different for everyone because even if we experienced the same exact trauma, the way it impacted or affects us individually is different. You can do this.", "permalink": "/r/DecidingToBeBetter/comments/oz6u7y/how_to_force_myself_to_do_things/h7xrtr5/"}