{"id": "t5_2tand_t3_o36ii2_t1_h2adbmv", "creation": 1624073848, "origin": "t5_2tand_t3_o36ii2", "height": 1, "replied_to": "t5_2tand_t3_o36ii2", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bossplayaintraining", "text": "yeah i live in this province & i know how they do it. back when they had the stay at home order they would promise us re-opening every 2 weeks only to delay it at the last minute. and we went through these \"reopening stages\" last summer only to have it taken all away at the end of november. now i get that this corresponds with case counts but still. this is how i feel it's gonna be: they're gonna give us a little \"freedom\" in the summer to placate us only to take it away come the fall & leave it taken away until june, making up variants along the way. normal, pre-2020 normal, life as we knew it, is gone forever. and it is NEVER coming back. i did not see anything on the government's website implying a complete return to normal or any semblance of a plan to do so. this is fucked. life as we have known it is over. unfortunately a vast majority of ppl in my province have accepted it.\n\nand to top it all off, all but one of my country's MP's voted in legislature to suspend elections. now any student of history will look at this and realize this is BAD FUCKING NEWS. democracy is basically dead in this country. meanwhile g7 leaders (and there's photo evidence of this) are chopping it up without masks or social distancing literally laughing at us, & our MP's & MPP's flee to florida for vacations & sicko parties with their families & come back the next fucking day WITHOUT having to quarantine or isolate at all.\n\ndon't hold your breath about \"phases.\" it's all a fucking lie. an illusion. they're never giving us our lives back. welcome to hell. welcome to chinada. abandon all hope ye who enter here. and with the new bill c-10 that practically prohibits freedom of criticism against the government, i'm so lucky i can still say this & gestapo hasn't arrested me yet.\n\nand btw, of course there's a lot of anger here. i mean, if your government unjustly locked you & 37 million of your fellow citizens up in solitary confinement supermax jail cells for 15 months for not doing anything, lied to keep you locked up, made media appearances in the jail cell to give an appearance of \"we're all in this together\" but snuck out of their prison cells to do actual criminal shit, made up different bullshit reasons to lock you up, made you take part in humiliating rituals all day to strip you of your identity & any feelings of love, prohibited visitations, & turned the vast majority of your fellow inmates into prison snitches who attack & gaslight you the moment you speak up about the prison sucking, all while having a prison guard tell you \"two more weeks\" EVERY TIME you're on the brink of getting released, of course you'd be angry.", "permalink": "/r/DecidingToBeBetter/comments/o36ii2/24m_i_need_serious_help/h2adbmv/"}