{"id": "t5_2qh1i_t3_b75gpg_t1_ejpsqa9", "creation": 1553923602, "origin": "t5_2qh1i_t3_b75gpg", "height": 1, "replied_to": "t5_2qh1i_t3_b75gpg", "down_vote": 0, "up_vote": 33, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Closecalllynn", "text": "First time I was a day from getting the bullets when I was caught and admitted to psychward for a few days. I'd had a really bad concussion that lead to depressed mood and that went unchecked because I was in basic. I thought everyone in basic thought of 10 different ways to kill themselves every 5 minutes. Turns out that's wrong. Got my head put back on in psychward with a few days of good rest to heal up the concussion and just take a time out from all the stress. I was ashamed it got that far but glad they forced me to go to psychward.\n\nSecond time was a bad reaction to birth control. Took it at 1230 night time. It was my day off from work. I spent it all crying into my dogs shoulder telling her she was a good puppy and I was a bad owner. Around 5pm room mate was an ass insisting that we couldnt wait to go grocery shopping despite me feeling like emotional ass and having plenty at least for the next 3 or 4 days.. Kinda lost my shit. Stormed out into a cold night while she was getting ready. I was wearing a tshirt and cargo pants and tennis shoes. Didnt take a coat or anything. It was about 5°F outside with a 20mph wind. Sun was already long gone. Walked for a couple hours. Knew I was really fucked up. Called a suicide hotline. Got hung up on going through the dial menus. Tried a second time. Hit the right buttons to go to a person. Person didnt answer ended up on a voicemail. Didnt call again. Kept walking until my whole body hurt from the cold (about 3 hours total so far). Dipped into a gas station. Of course I ended up in the aisle for medication and hygiene. Knew I was super fucked when I started considering whether to buy drugs or a razor. Took off walking back in the cold. Found myself 2 blocks from the gas station on a bridge over the busiest street in town. Finally clicked that I needed to get a hold of someone, anyone and get myself figured the fuck out. Biggest thing wasnt family or friends or anyone else. I had put my dog in her kennel before storming out. I needed to let her out and get her her treat for the night. i had 2% battery left on the phone. Called my ex boyfriend (ended on and still on super good terms with him). Left him a voicemail saying my phone was dying but I really desperately needed a ride home and I was at a parking lot where we both went to college. Walked straight to the parking lot. By the time I got there I was exhausted and tired and couldnt focus on anything but the fact that I needed to get home and have someone take my guns out of the apartment. I sat down in a snowdrift and waited, hoping my ex would get my message. I had almost cried myself to sleep when he rolled up in his mustang. He got out and plopped in the snow with me. Hugged me told me it was okay. We both got in his car. And he just drove for an hour or so until he kinda coaxed me into making my own decision. I wanted to just go home. Have him take the guns. If just go straight to bed and call doc about the medication in the morning. He did take the guns. Asshole room mate insisted we eat out and then go \"grocery shopping\". She actually just took us to a restaurant she wanted despite forcing me to pick something, and then to Walmart so she could buy me ugly ass socks that went straight to the trash when I found out she was beating my dog a couple weeks after this. Never got the damned groceries.  I didnt take the birth control that night. \n\nWhen I woke up the next morning I was in a much clearer head space. Still anxious and down but better. First thing I did was hug the crao out of my doggo.  Called the doc after doggo and I ate breakfast. Doc said not to even touch the bc pills and just toss them in the garbage. Doing a lot better now. So glad that I didnt go through. Dont know why i got put to a voicemail on a crisis hotline. But my doggo is the best thing ever. She got lots of treats before bed and the next day ", "permalink": "/r/AskReddit/comments/b75gpg/serious_suicide_survivors_of_reddit_what_was_your/ejpsqa9/"}