{"id": "t5_2qh1i_t3_b75gpg_t1_ejqcpqe", "creation": 1553953086, "origin": "t5_2qh1i_t3_b75gpg", "height": 1, "replied_to": "t5_2qh1i_t3_b75gpg", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Brewsterscoffee", "text": "Hi Bob, thanks for the welcome. Wish everyone else in this universe had no memory of what happened as well. I'm not in therapy or anything so I hope it's cool if I just start pouring out an essay. During my blackout, I showed up a few times to what I thought was my job, each time wearing various amounts of clothing (shirt from work uniform, boxers, one sock & different shirt from work uniform, covered in vomit, no sock) and begging to work. The thing is, I work at a chain and I wasn't actually going to the outlet I work at, but a different one. Verbally fought both of the managers. They still won't speak to me.\n\nMy mother took me to her place, and I was instant knockout on the couch. She went to go do something, and I jumped off her balcony. Got right back up and started running.\n\nBoyfriend found me later eating an entire cake from the grocery store, with my hands, on the street. He took me in and changed my clothes. I fought him to go buy razorblades. He couldn't stop me. Came home and was knockout on his bed. He went to work and came home to a pool of blood. I was gone. I had near cut all my fingers off. He was worried because I had left all my belongings behind, except for a teddy bear.\n\nSent the police and the EMTs on a wild goose chase. I felt like a rabbit getting hunted. I hate running, but it's all I did. I would rest briefly in an alley somewhere before concerned bystanders pleaded for me to wait for an ambulance. I would take off running again.\n\nThe police and EMTs ended up catching me, they were pretty smart about it. They asked a group of friends to stop me in the street and casually ask me if I wanted to go out with them, and not mention my hand, the blood, etc. to not spook me away. As I talked with them, the police and EMT came down both sides of the road to affectively corner me in. I spent one night getting stabilised at a hospital before awaking the next morning. I ripped out the tubes and IVs, and ran away. Asked some lady down the street for a cigarette, because though I had quit a year before, I picked up smoking with a vengeance during my escapade. She was a nurse at the hospital I ran from, and took me right back after noticing I still had tubes in my arms and stitches all over my hand.\n\nGot sent to another hospital that was better equipped and yeah, that was a long stay and is its own story.\n\nI had clothes in my home that nobody would claim as theirs. Men's clothing. I spent 600 euros at random grocery stores, some in different cities and towns. My boss said I bought him a ton of alcohol and food for his whole family before disappearing. A lot of things still don't add up. My front door and house was covered in vomit. Life is strange.\n\nThanks for letting me get that out.\n\n", "permalink": "/r/AskReddit/comments/b75gpg/serious_suicide_survivors_of_reddit_what_was_your/ejqcpqe/"}