{"id": "t5_2qh1i_t3_b75gpg_t1_ejq5xw9", "creation": 1553944963, "origin": "t5_2qh1i_t3_b75gpg", "height": 1, "replied_to": "t5_2qh1i_t3_b75gpg", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Brewsterscoffee", "text": "I was 11 the first time, OD'd on a bottle of ibuprofen and figured if I went to bed I wouldn't wake up. Woke up a few hours later and puked the darkest vomit for 3 days straight. First thought when I woke up was \"I want my mom.\" I passed it off as food poisoning to not upset her.\n\n16 the second time, OD'd on benzos and hung myself in the closet. Woke up briefly in the hospital and noticed I had hospital gowns on, I was wondering who changed me and who had seen me naked. Everything was a bit much and I went back to sleep.\n\n21 was the last time, OD'd on a mix of alcohol, opiates, and benzos with the plan to hang myself after. Never got my head in the noose because I took an astromical amount of benzos/opiates. Was a missing person and had a 2 and a half week blackout. I had brief moments of conciousness, one being \"Where did I get these clothes and where is all this blood coming from?\", another \"Escape!!!\", the third being \"I need to die\", and then hanging myself in the hospital with a cut up pillow case in the shower. The next being sheer panic after being tied to the bed with restraints. A lot of guilt. \"I need to pee.\" and the fifth, after gaining some normal base conciousness about a month later, was \"I've killed myself and this is the alternate universe, maybe I'm meant to live.\"\n\nIt sounds dumb but the amount I took gave me temporary brain damage. My vitals, blood levels, and head didn't fully recover until months after. Passing out all over the place with psychosis.\n\nNot too proud of the track record as most of my family suceeded after the first, second, or third attempt. I'm just really bad at calculating.", "permalink": "/r/AskReddit/comments/b75gpg/serious_suicide_survivors_of_reddit_what_was_your/ejq5xw9/"}