{"id": "t5_2tand_t3_omlvaj_t1_h5o312o", "creation": 1626637977, "origin": "t5_2tand_t3_omlvaj", "height": 1, "replied_to": "t5_2tand_t3_omlvaj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "EmploymentAbject4019", "text": "When I was your age I was getting ripped off and being depressed about it. \n\nAlmost 30 now and have learned some things. \nPeople want to explore the other side of the world when you can explore right in your own backyard. \nThe biggest thing is what are you interested in? What do you *think* will be most fulfilling to you? Sometimes people get what they want and they are still not fulfilled. Or they wish they had thing or that with it to make it better. \n\nYoga (8limbs not just working out) helped me ground myself and be content. There are so many resources online to do this for free too. \nSo it’s mostly about spending 15-30 mins a day to explore what it has to offer. (not religious)\n\nWhat it has offered me was appreciating the moment before my eyes. Understanding my emotions better, what this does or doesn’t make me feel a certain way. Marveling at nature just as much as man-made creations. So almost every moment in my life is fulfilling and the not so “exciting” moments are perfect time to practice this again. Doing pranayama while standing in line at the grocery store. Regulating my nervous system so my body can feel peace. \n\nSo when you do travel you will feel fulfilled whether or not it was perfect. \nSo when you do eat a meal, you’re thankful you have a meal even if g Ramsey didn’t cook it. \nSo when you wake up in the morning, you can appreciate that you did. \n\nHumans make life complicated so turn to simplicity in your well being. So when something goes array you don’t feel like your whole day is ruined. \n\nOn money, this is a perfect opportunity to learn how to be creative on a budget. Also reverse your goals. If you want to do x - what will it take and work backwards with money. Make goals from there. With the economy the way that it is I would send your resume out to places that are offering more. You may not have qualifications but if they see you can learn you might have a chance! The worst they can say is no. \n\nAlso there are plenty of things to do for free, but you have to search for it. If you can make friends alone the way all the better. I wouldn’t recommend getting tied down based on another comment I saw, bc that can make you feel like you’ve wasted your 20s as I have. \nHowever that doesn’t mean shunning this or any person away from your life just bc you’re not into romance. Many good relationships come out of being friends first. No rush. \n\nMake every decision as a decision closer to your goals. Feel free to dm.", "permalink": "/r/DecidingToBeBetter/comments/omlvaj/trying_to_live_more/h5o312o/"}