{"id": "t5_2tand_t3_omlvaj_t1_h5m203o", "creation": 1626599738, "origin": "t5_2tand_t3_omlvaj", "height": 1, "replied_to": "t5_2tand_t3_omlvaj", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KaPresh33", "text": "Unless you're living paycheck to paycheck with nothing left over, it is possible to do cheaply. It would take some time to say enough to get to the point of being able to do it far away and for a long time though, but...some options to consider are\n\n\n1.) Workaway. You volunteer for a set number of hours a week doing something in exchange for housing, housing and food, or housing, food, and sone pay. This is how I was able to spend a couple months in Spain. \n\n2.) Working holiday visas. Depending on what country you're from, you could have multiple working holiday arrangements available to you. You apply for a visa, go to the country, and can legally work there for a time. I did this in New Zealand. Most countries if not all \"require\" you to have a set amount of funds in your bank account before flying over, which I highly recommend actually having, but...they never checked to see if I actually did have the money. I can't recommend going over there with a low amount, but theoretically it is possible. \n\n3.) Au Pair visas. You make an arrangement with a family abroad to nanny their kids for them. They give you housing, often meals, and a small allowance for doing whatever. \n\n4.) Teach English abroad. Asia has quite a few jobs available from what I've heard. Spain has an offer for Americans and Canadians that allows you to be an English teaching assistant in Spanish classrooms. The government pays you for your work and gives you a school to work in. You have to have a 4 year degree (in anything) for this to be possible though, and the pay is not much. You'd still be pretty strapped for cash, just in a new location. It's doable, but you will need a roomate or two. A girl doing this once told me she loved it, but she highly recommended coming over with some savings set up first, so...this might be hard to do. \n\n\nFor all of those options you'd still need to save up enough for the flight at a minimum though. Flight deals can be found if you know how and when to look, but that's a different matter. Budget airlines in some locations can make flying cheaper than you'd expect. For an example, check out Ryanair. They're not a good airline, but they're a well known one in Europe and for good reason. They're dirt cheap. \n\nThis all assumes you have SOME disposable income after you pay your bills every month. It would take a while to save up to do these things, but a lot of people assume travel HAS to cost tons and tons of money. It doesn't have to if you are willing to give up some comforts/expectations and do things a little differently. Do your research and budget well and you'll save a few more bucks here and there.", "permalink": "/r/DecidingToBeBetter/comments/omlvaj/trying_to_live_more/h5m203o/"}