{"id": "t5_2tand_t3_m8p3ud_t1_grkj19u", "creation": 1616225624, "origin": "t5_2tand_t3_m8p3ud", "height": 1, "replied_to": "t5_2tand_t3_m8p3ud", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lulumeme", "text": "this is for the readers who are methadone/suboxone and consider getting 100% clean by quitting it - people who get on suboxone or methadone especially, are often quick to realize after a few years that the methadone is holding them down, and they're still a bit depressed and anxious and think getting off methadone will relieve it and bring some tension release. But this realization is often false. Not only the withdrawal period is going to be longer than you think it would be, instead of now thinking its the done thats dragging you down, now youre dragged down by the post acute withdrawal symptoms and always questioning whether the bad mood you have is still the residual withdrawal symptoms. Its the opposite of the expected \"tension\" release that you imagined getting completely clean would give.\n\nNow at least for me personally and the friends in the same methadone program i had, the reality was that it was just the usual tries to pinpoint all life problems to one cause and shift all the blame on that one thing, in this case suboxone or methadone. But this is just oversimplified illusion, its just convincing yourself that just getting rid of this one thing (methadone) will fix all your mental problems.  And its just a comforting hope which is very understandable, but not realistic, and extremely oversimplified view. We always targeted some one thing expecting it to bring huge amount of release and every time we realized its not it, its just one small screw in the grand scheme of this. \n\nnext, it took some analyzing, but the reality was that just before the methadone you or I, were likely just as depressed and anxious as you are now, or even moreso. This is proof that the methadone is not as much of a baggage as you think and you just again pinpoint all the blame on one thing. Its likely that you are feeling the same or even better now on the done, than you were right before hopping on it or before even addiction when you were sober. I mean you started addiction exactly because you were not feeling good sober, that sobriety was painful and being clean is hard as hell. Its why you began all this in the first place. So dont expect getting of the done to bring some huge baggage relief, it will return you to the way you felt sober before all this, and its likely you were just as depressed or moreso, so you actually feel a little bit less depressed now on the done than you were even before addiction began and you were sober yet. \n\nnow for those that think the done makes you desentized to natural rewards and natural levels of dopamine and endorphins etc, its more complicated than that. First, as long as you take the done as prescribed, it just fills up the exact same way the receptors that would otherwise be filled by your natural production of endorphins. neuroplasticity lets your neurons get around this roadblock to reward circuit and develops a new pathway to it, so you function the same as you did before done. Just the same way as the day goes, your brain produces endorphins and lets the opioid pathways and receptors function, methadone does the same thing and your brain function exactly as it would normally, it doesnt care whether its methadone or natural endorphins that  fill up the receptors, as long as its filled, the neuron is active and functioning, and the messages get passed through this receptor. Its when theres lack of it, during withdrawal, this opioid neuron is offline and since its the middleman between to other neurons, the 'message' doest get transmitted. As soon as the neuron is activated by done or endorphins, it functions as a middleman that passed through the neuronal signals. Since point A and the last stop between the neurons is a loong pathway, as long as all the receptors are active and not \"roadblocked\", the message gets passed thru as it would normally. \n\nYou feel close to or just as you would have sober without the done (assume the withdrawal is 100% over), and the cause for your depression or anxiety is very likely something else, not related to the methadone or suboxone. Whats more likely, that your suddenly are not depressed after quitting the sub/done, or that you will still feel the same void and be dissapointed with realization its not related to the sub/done and its moreso a problem mental or physical that you had before even addiction, and still have. I definitely was pretty depressed before any addiction or methadone, so why would quitting it bring some relief in my depression? and it didnt. theres no logic in that. Unless you were pretty happy before the addiction then yes, getting 100% clean would bring relief, but the most likely scenario is people still feel depressed after quitting done and sadly fall back into addiction, but back to recreational opioids again and thats how overdoses happen when relapsing. \n\nIf you are not happy now while on done, you will probably not be any happier quitting done.. i know it would be nice if getting relief from depression would be that simple as removing one cause like the done, but its not that simple, thats why depression and addiction are so hard to treat, its very complicated.  So consider the huge risk of relapse to typical opioids if you quit done, and that you will not be as easily put back on the done if you ask to go back. the cause of your unhappines is deeper and was there before the done, admit it. \n\nalso, the done protects you from overdose and relapse because opioids just dont work. So you are forced to search for a more natural way to treat your unhappiness and its the best way to go. Dont be ashamed of being on maintenance methadone program. similarly diabetics take insuling everyday, or mentally ill people take serious meds or antidepressants every day. Of course it would be nice to be 100% clean, but they often find they feel even worse naturally, its not always preferable to be clean as your mental issues will not be in check and may manifest again and relapse.", "permalink": "/r/DecidingToBeBetter/comments/m8p3ud/being_sober_is_beautiful/grkj19u/"}