{"id": "t5_2tand_t3_m8p3ud_t1_grkvm7m", "creation": 1616239191, "origin": "t5_2tand_t3_m8p3ud", "height": 1, "replied_to": "t5_2tand_t3_m8p3ud", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JMCochransmind", "text": "I'm not on methadone. Methadone was worse than any other drug out there. It did give a false hope that I was going in the right direction, but I spent a year on methadone and weening off just to realize I was in the same place or worse than where I had started. It took another year of therapy and going to a psychiatrist and reading books including, \"The True Path\", which when I bought, I didn't know was for addicts. Meditation and reading about mindfulness and actually practicing yoga and mindfulness was a huge help to discovering the underlying issues to my addiction and overcoming them. The biggest lesson I had to learn is that it is okay to just be okay with myself and from there I could let go a lot of, \"tension\", and actually start being me in the world and finding my place in it. There is no easy fix, and no one thing to blame any of it on, other than the fact you have problems with yourself that are standing in the way of you getting clean. Getting clean enough to understand your own problems and start facing them is the only way to living a more fulfilled life. Any addict has a huge chance of relapse, but once you make it to a place you learn you can be happy with yourself and find a path in life that makes you feel good, then you have a good chance of staying clean and learning it was the drugs and yourself holding you back and life isn't that bad. This isn't a guide on how to get clean, as many people may require medicine to help them be stable from other issues. If you didn't have mental health problems when you got on drugs, you are likely to have them once you get off. This is just a story of how I felt on my road to getting clean and what I had to learn to truly find myself and overcome what was going on inside of my head. I'm still on that journey today. I haven't relapsed but I'm almost a year clean from all meds and I am working on my masters in Counseling and I am in a good way. The moral of the story is do what ever it takes for you to get clean. Know that it is a long, hard road full of set backs and moral challenges. But, as long as you stay on the path you can over come with hard work and continued forward progress.", "permalink": "/r/DecidingToBeBetter/comments/m8p3ud/being_sober_is_beautiful/grkvm7m/"}