{"id": "t5_2tand_t3_phxvxg_t1_hbob81b", "creation": 1630840440, "origin": "t5_2tand_t3_phxvxg", "height": 1, "replied_to": "t5_2tand_t3_phxvxg", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Amberthms", "text": "Before starting anything, you need to get rid of that belief that it’s too late. The truth is, people even at their 90’s have achieved things they never have in their younger years. \n\nI believe the brain is like a muscle. Not using it causes it to get weak, but that doesn’t mean it’s impossible for it to return to its former glory (or beyond that). Admittedly it will take effort and may be challenging, but it is not impossible/too late at all.\n\nTake advantage of these things: your own interests, your reasons, and framing.\n\nIt is easier to become consistent in something when you are interested in it. Reading does not have to be boring. I’m 16 and I find most books boring like most teenagers, yet I read every night. Find topics and genres that capture your attention. Explore exciting topics such as horror, psychological, comedy, or something related to your favorite hobbies or celebrities. \n\nNext are your reasons. Clearly your first reason is the feeling of dissatisfaction you have in relation to your past (in comparison to the present), but you must look towards the future as well. How would improving your mind help you in the future? Write these reasons down. These reasons will motivate you and propel you into training your mind. Would it help at your current job? Would it improve your social life and make interesting conversations easier to hold? Would you feel more confident in yourself? Write your ideals and aspirations so that you can look at them when you feel demotivated.\n\nNext is framing. I’d argue that before starting anything challenging, if you don’t have a decent method of framing and mindset in general then things would be much harder, to the point of possibly giving up. Get rid of limiting beliefs. Don’t think “I can’t do this” or “It’s too late for me”. Adopt a growth mindset and don’t think “I can’t”, think “I’ll find a way/I’ll figure it out”. Frame difficult and arduous things as exciting challenges. Give yourself hope and (sorry if this sounds cheesy) have 100% belief in yourself. It’s proven that people who fully believe in themselves (or are believed in by other people) achieve more compared to those who don’t. Ask yourself: “Is it that I truly can’t, or I just won’t?”\n\nIf reading is not really your forte, try educational videos. Yup. There are so much interesting lessons, documentaries, etc. online that you’d probably get addicted to them. What’s out there? You could learn fun and interesting things about space, concepts/theories, riddles, economics, politics, how hotdogs are made(? haha), philosophy (my personal favorite!), and even animated e-books if plain text is just too boring for you (there’s one for art of war on youtube!).\n\nAnd lastly, you could join a lot of subreddits with educational content so that (assuming you browse reddit regularly) you maintain some form of exposure to them even if you falter on training your mind. \n\nHave fun with it, learning is an exciting experience if created and absorbed right. \n\nYou mentioned that you want to focus on “growth”, so here are some general topics I recommend: self-improvement, philosophy (I started on stoicism, but there are many more out there), psychology (and trying to observe it in relation to yourself makes it even more fun), sociology, and perhaps you could educate yourself on finances and whatever hobby/career you currently have.\n\nI apologize if this is not helpful, but I hope it gives you some ideas! Good luck, and you can do it :)", "permalink": "/r/DecidingToBeBetter/comments/phxvxg/how_can_i_regain_my_mind_and_reduce_years_of/hbob81b/"}