{"id": "t5_2tand_t3_et3mig_t1_ffhg0bv", "creation": 1579933658, "origin": "t5_2tand_t3_et3mig", "height": 1, "replied_to": "t5_2tand_t3_et3mig", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LizGarfieldSmut", "text": "Oh. No worries, I kind of talked it out to myself today. Reddit can be weird sometimes. It's like an infected wound of not having validation that I feel gets poked at here and there for the longest time, and I feel like I improve my thought process about it up an down, but still if I just run into someone saying something about success with like social circles and SOs and jobs I just have to do a lot of talking with myself, figuring out what is going on and why. I guess in a way this latest post I read helped me out, getting what I feel is true about why I'm in this position so it doesn't blame myself but just as something in a greater system. I feel tormented by these things tangential to these things, when I hear of them. So I guess that's good, that I'm expressing myself better, what my thoughts on the whole thing is.\nSo thanks for your words, I like never hear anything validating really, except from my dad. Usually on Reddit I don't express it well so I just get hate, so it's nice to get validation. Puts me in a position where I feel like I'm not someone's diminutive, like I've felt mainly my whole life, in relation to practically everyone. I guess I'll look up those two names now, thanks.\n\nEDIT: So thanks for the suggestions. I briefly looked up their bios on Wikipedia, and it's cool, Tolle seems to have had an epiphany at 29 that he can just seperate awareness from thoughts. I think I did that like at 16 on vacation, and a few times trying to replicate it like at 21 for a few moments but haven't done it since. I think that there are real instinctual feelings of needs of validity, that when triggered with the non monk environment, are basically at odds with this enlightenment. I guess I'll really try to look into his stuff. I know I saw similar Buddhist writings in Thich Nhat Hahn's book Happiness once, on how to meditate. As far as the second author he seems to know about performance anxiety or something. if he can help me not so feel so bad as to stay showing up for more than the first few weeks of a class of a time, with no other responsibilities, or to show up to an accounting final that I'm totally prepared for to get a certificate, to walk to the car to the class and do the test, despite what happens if I don't, if he can help with that, might make things more interesting for me. Like really doubt it, but why not, I'll look into his most famous book I guess too. Later, like after tomorrow. Man not being validated really does something to your psyche, holy shit. But hey, at least I've improved to the point that right now through this pain while reading and typing about this stuff, I'm not forced to go to the store to drown some alcohol to stop this pain, it's bearable enough for me to just like not. I guess. Probably because beforehand I'd just assume that this was not because of bullying at 5, but because it was an inherent quality in me, that's weak, that everybody around me sees and feels disgust. Thanks for reading, just appreciate that this helps me get my thoughts out.", "permalink": "/r/DecidingToBeBetter/comments/et3mig/i_had_my_first_kiss_at_23_years_old_after/ffhg0bv/"}