{"id": "t5_2tand_t3_ltc1d0_t1_goxbgat", "creation": 1614391102, "origin": "t5_2tand_t3_ltc1d0", "height": 1, "replied_to": "t5_2tand_t3_ltc1d0", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "brittlebittle", "text": "Thanks for the response. So the first time he had this idea, he says he was delusional because he was treating his depression, IBS and ADHD with kratom- which is a legal supplement/drug that gives you energy and kills pain- but I've never trusted it because it seemed to mess with his mind. He says he was becoming \"manic\" and then he couldn't get the thruple idea out of his head, especially with how close him, the girl and I had been getting. He says he can't control his emotions, but he's been looking into going to therapy for it. \nSince then he's cut the kratom and I'm proud- we've gotten him on actual ADHD medication that's helping a lot (his thoughts seem so much more rational than ever before omg). I've also since found him a natural supplement on amazon that killed his IBS pain. So yeah he doesn't take it daily anymore and he no longer relies on it to get through the day which is really really good. \n\nAnyway, it took him weeks because he thought he could convince me that if I wasn't so insecure I'd probably be okay with it. When really I just don't want to date multiple people at once. \n\nThe girl is unaware about the thruple idea. When we had been hanging out a lot, she would frequently tell me I'm cute and jokingly say that she was going to steal me away from my boyfriend right in front of him. I thought she was just making jokes but there's part of me that thinks she had a crush on me. She didn't do this stuff to my boyfriend, if anything sometimes she'd act like she didn't want him there so that we could be alone together. If she does like me romantically, it's not mutual. She's not really my type and plus I already have a boyfriend.\n\nI don't think he was going to try to talk us both into the thruple, he says it was more like a \"maybe it'll happen naturally\" sort of thing. I honestly don't think he even could have cheated if he wanted to; I've been by his side most of the time we've known her and she's not the type of person to do that behind my back and pretend it never happened. He swears the thruple idea was including me or not at all. He said he didn't want to do it just to fuck two girls, he wanted her to love me and spend time on me as well. It confused the hell out of me. \n\nSometimes I question if he respects me as much as he should. It's really hard to say. With the ups and downs of his mental health, sometimes he's the perfect boyfriend and other times he acts like a stranger and I question if I even know who he is- that is until he calms down after a few hours, comes back and apologizes and says he doesn't know what came over him- and is suddenly perfect boyfriend again.", "permalink": "/r/DecidingToBeBetter/comments/ltc1d0/my_long_term_boyfriend_told_me_two_months_ago/goxbgat/"}