{"id": "t5_2tand_t3_ltc1d0_t1_goxoo7e", "creation": 1614396631, "origin": "t5_2tand_t3_ltc1d0", "height": 1, "replied_to": "t5_2tand_t3_ltc1d0", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Lizard208", "text": "Please listen to me. Long story short, I was with my ex for 5 1/2 years. and he constantly made me feel less than. It was in ways like you described here; not exactly saying outright that he wish I looked different, but doing things that indicate that. Then, when I got insecure and jealous, turned it back on me that I just needed to be more confident, more self assured; that reason I was feeling that way was because of my own inadequacies, not because of the actions HE chose to take to make me feel that way. And then it would come back to how inconvenient this is for HIM; how much it stressed HIM out. It was always about making him comfortable and everything I needed or felt was invalidated. This lead me to utterly low self esteem, constant self critique, and absolute insecurity. He made me feel crazy, while continuing to disrespect my boundaries and needs that could make me feel safe, secured, and valued by him. We were together so long that I just got used this.\nIt took us breaking up for me to realize how utterly backwards this was, and when it ended, I felt like I could breathe for the first time in a long time. \nSimply put, your boyfriend does not respect you. It’s not wrong for him to be interested in a thruple, but if it was something he wanted, then it was his responsibility to realize the implications of bringing it up. It is PERFECTLY natural to feel insecure and jealous after he proposed this thruple situation (of course it makes you question things after your monogamous partner expresses interest in someone else??) and if he cared about you and how you feel, he would have anticipated this was a possibility beforehand. You two have been together for so long that he should know what it would take to ease your mind and make you feel secure again, and he would’ve done it immediately if he cared about meeting your needs as well in the relationship. You don’t need to work on feeling less insecure, he should’ve worked on restoring the security he disrupted in the first place. He has the power to work with you to make you feel safe, valued, secure, sexy, and loved, and he is choosing not to. This is not your responsibility alone. Also, your “no” should have been met with instantaneous understanding and support, and the fact it took WEEKS for him to accept this is a huge red flag. This is indicative he does not respect your boundaries. ALSO his fundamental misunderstanding of your sexuality indicates he doesn’t care to truly understand you; another huge red flag. \nObviously, this is a snippet of your relationship, but I have this feeling you are in a very simaliar situation to what I was in. My advice would be to leave. It will get worse if you don’t, I promise you. You deserve better, and you will feel better once you let go of this. I stopped feeling so jealous of other girls. I stopped thinking my thoughts, feelings, boundaries, and whatever else were wrong and needed to be fixed or better. They way you feel is VALID op, and you don’t need to fix or change it.\nWishing you lots of love and strength and healing ❤️", "permalink": "/r/DecidingToBeBetter/comments/ltc1d0/my_long_term_boyfriend_told_me_two_months_ago/goxoo7e/"}