{"id": "t5_2tand_t3_ltc1d0_t1_goygqfc", "creation": 1614409460, "origin": "t5_2tand_t3_ltc1d0", "height": 1, "replied_to": "t5_2tand_t3_ltc1d0", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "chickentenders222", "text": "Except for that drug use is 100% an excuse, whether it's valid or not you can debate. But just based on the fact that psychoactive/psychotropic drugs, alter your mind, thoughts and all; makes it a very complicated thing. And the common notion of drugs showing, \"that's how they really feel\" is beyond stupid. Watch someome on PCP or PVP, start talking in demonic/unintelligable languages and tell me that's what they've really been feeling this whole time...\n\nWether it's valid or not depends on many many things, and is very subjective. It's very notable that she said generally, his thoughts lacked rationality... \n\nPeople with ADHD inately have emotional dysregulation/liability, primarily from structural abnormality and underdevelopment in the anterior cingulate cortex (at the bottom of the frontal lobes in the PFC). This sometimes (rarely) means they can naturally reach emotions to the severity of mania (not duration as seen in Bipolar type 1), but may often mean they're far more predisposed to adverse psychiatric reactions such as drug-induced mania. Not to mention, hyper-sexuality is well researched in ADHD, as well as comorbid personality disorders like BPD. \n\nAnd, there's a large difference in \"he didn't respect you\" and \"he doesn't respect you\". A massive difference. Despite your highschool psychology class, there seems to be a gap in your knowledge of drugs; if you assume, that while he was possibly in a \"manic\" state, his actions entirely reflect his respect for her, then you didn't do too well in psychology then. That's like, dealing with someone with schizoaffective disorder (+ comorbid borderline personality disorder) and mid-psychotic breakdown, saying that they don't care about you because they weren't paying attention to you. \n\nI highly doubt you've experienced mania, or dealt with someome who has; during it, you probably aren't even respecting yourself nor your owm boundries. \"Nothing you described here is normal\", yeah well neither is mania...\n\nThe irony is that if he was on Meth, it seems it might have prevented it. Being that Methamphetamine (yes, Meth not Adderal, as 100% Dextro enantiomer, the most psychoactive form, Desoxyn), is an FDA approved 1-st line treatment for ADHD; She also stated his behavior and such improved greatly after actual stimulant treatment (I'm assuming it's either Methylphenidate or Amphetamine based because the non-stimulant options, and off-label BuPROpion all take weeks to build up and work, they're not 1st line treatments, and they're statistically less effective. Correct me if I'm wrong.) \n\nIt's absurd, that with you're \"Psychology background\" you insult him, \"Loser\" and imply that his actions while possibly experiencing a drug-induced manic adverse reaction to at least 2 alkaloid opioids, (which can also have stimulant effects depending on chemovar [Strain].) That this somehow sets the entire dynamic for their relationship, in the notion that he doesn't respect her.\n\nSomething that's toxic is insulting him unmaturely. Using pseudo-accolades as being a reddit psychologist.\n\nNot even justifying his actions, but what response was that?", "permalink": "/r/DecidingToBeBetter/comments/ltc1d0/my_long_term_boyfriend_told_me_two_months_ago/goygqfc/"}