{"id": "t5_2tand_t3_m9bl7d_t1_grlz1l2", "creation": 1616262944, "origin": "t5_2tand_t3_m9bl7d", "height": 1, "replied_to": "t5_2tand_t3_m9bl7d", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Practice gratitude towards yourself for learning and growing. Give yourself positive affirmations that you are on the right path and that you are enough. Thank your community for any support or guidance they may have offered you while on your quest for self improvement and reciprocate that support. If you are open to this kind of stuff...meditate and write about how you are enough. I know that sounds like some woo woo bullshit and cheesy as hell, but I can relate to what you’ve shared and these things have helped me. In the past I would go on a self growth journey, eventually be overcome with self doubt, break, and would have to sort of start over with that growth cycle. I was also seeking validation from others in regards to being ‘enough’ in misguided ways. Now that I recognize these things I am able to break the cycle. I do the affirmations/meditation, which have empowered me to push forward in that personal growth and truly believe in myself. Before it was more of a lie I was telling myself and indirectly others. It was a more toxic form of that fake it till you make it mentality. \n\nI think another key thing I’ve learned is you can still wholeheartedly believe in yourself and have off days where you are out of your rhythm. It’s okay to have a funk - we are not robots. We are humans with complex and fluctuating emotions. It’s not always going to be rainbows and sunshine. Nor is it always going to be doom and gloom. Those two things can exist at the same time or alternate. It’s a damn paradox, but that’s what makes life thrilling and beautiful. Embracing that is freeing. Forgiveness towards yourself is just as important as gratitude. Forgive yourself for an off day, reflect on what’s causing the feeling of doubt, think about how you want to bounce back and do so as soon as you are able.", "permalink": "/r/DecidingToBeBetter/comments/m9bl7d/striving_for_self_improvement_while_feeling_like/grlz1l2/"}