{"id": "t5_2tand_t3_htzlp8_t1_fymv4rv", "creation": 1595225788, "origin": "t5_2tand_t3_htzlp8", "height": 1, "replied_to": "t5_2tand_t3_htzlp8", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "funkymakaki", "text": "You are doing great since you have already identified your problem, and trust me, you are not alone.\n\nChanging your habits is hard work, there’s no doubt about that. Instead of changing everything at once and becoming overwhelmed, try to focus on small victories. Make a small, achievable goal and work as hard as you can to achieve that. Once you achieve a small goal, the feeling of accomplishment will help you with your next goal. These small goals will be your roadmap towards the bigger goal, and trust me, you can do it. The fact that you want this and said it out loud to us speaks volumes. You can do it.\n\nAlso, to me it sounds like you are not used to failing. I have been in your position before, and you have to teach yourself to accept failures and move on. But by moving on I do not mean to just forget it never happened, instead think about the reasons *why* and *how* you failed. Once you identify why and how you failed, you can start thinking about how to prevent it from happening again. Not all failures are preventable, nor should they be, but this is a way for you to learn.\n\nWhat once helped me immensely in being focused to a task at hand was to identify how I used my idle time online. Browsing through social media over and over again led me to nowhere and made completing my assignments even harder, and frankly, once I noticed how much of my free time went down the drain because of social media, it was easy to make cuts. I started noticing how idle browsing was a way for me to avoid school assignments and chores I didn’t like. Then I made small goals for myself, for example to write a paragraph of an essay and then I could spend 15 minutes online to give my brain a break – but after those 15 minutes I *had* to continue. This applies to anything from essays to cleaning, cooking, shopping – you name it. But the main thing is to start with small steps and work towards the bigger goal.\n\nHope this stuff helps and good luck!", "permalink": "/r/DecidingToBeBetter/comments/htzlp8/18_years_old_never_developed_life_skills_where_do/fymv4rv/"}