{"id": "t5_2tand_t3_htzlp8_t1_fyk2hlo", "creation": 1595165999, "origin": "t5_2tand_t3_htzlp8", "height": 1, "replied_to": "t5_2tand_t3_htzlp8", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PsTakuu", "text": "Learn how to study:\nOne or two note taking techniques (cornell) (read; reread and note take; fast reread)\nA flash card technique. (Plenty of digital options now - but hand writing definitions and meanings cannot be replaced with keyboard/copy paste)\n\nSome of your points are around discipline and time management. You can’t manage time but you can manage what you choose to do.\n\nLearn how you prioritize your tasks and goals. (Ranking urgent/important/length of duration of impact (weighted on last one)).  There’s millions of things to do in life so set goals and revisit and adjust. \n\nFactor in time for faith and family.\n\nProjects and teams that succeed long term are group based, and if you were like me as ‘gifted’ - you were sought after for group membership and got your stuff done well — but didn’t realize that you could have pushed yourself to develop leadership and intentionally strengthening the team in other ways besides the school work. \n\nLeaders/bosses are people with lives and families besides their work life — be careful not to judge them for the only aspect of life you see - and correct coworkers who do (be a leader in any role).\n\n“Faster thinking” reminds me of a book - Thinking Fast and Slow.  If you can make it through that you have already achieved doing your first request. Something that isn’t immediately pleasurable:)\n\nNonviolent Communication by Marshall Rosenberg (From the list below) will help you understand people and leaders and communicate better.\n\nAnything from Satya Nadella’s reading list:\n\nhttps://www.businessinsider.com/satya-nadellas-book-recommendations-for-success-and-culture-change-2019-8", "permalink": "/r/DecidingToBeBetter/comments/htzlp8/18_years_old_never_developed_life_skills_where_do/fyk2hlo/"}