{"id": "t5_2tand_t3_htzlp8_t1_fylfw5j", "creation": 1595193247, "origin": "t5_2tand_t3_htzlp8", "height": 1, "replied_to": "t5_2tand_t3_htzlp8", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "burgertronics", "text": "I think for you, learning how to be a gracious learner will be critical. Understand that each day, you put in effort to be better and that's the prize. For you, praise might have been a big motivator because gifted kids just get a lot of praise but the adult world doesn't care as much. Stupidly, that was a shock to me and I went barking up the wrong trees for a long time lol.\n\nI grew up similarly with advanced courses and private school and all that and I had a really hard time not being good at things right away later on. A lot of the things you pointed out come from life experience but there are also things you can teach yourself that you can apply when those situation arise:\n\n\\- project management articles and methods\n\n\\- habit building methods that are effective (look up the book 'Atomic Habits'. this video is also a fresh perspective: [https://www.youtube.com/watch?v=x4fsbGAiocI](https://www.youtube.com/watch?v=x4fsbGAiocI))\n\n\\- for decision making - remember it's always better to make a decision, fail miserably and learn from it than to not make a decision at all. \n\n\\- reframing situations - you don't want to 'force' yourself to do anything for example. you'd want to find how that specific thing fits into your life goals or in your case, to make you a better person\n\n\\- reframing ties into find your why. Why do you do things? A lot of people live very passively so learning to be intentional is a big life change and something you can do gradually. Simon Sinek has a great book and many videos on this.\n\n\\- learn to deal with difficult emotions (lots of podcasts and videos on Youtube about this), because you're on a journey of personal growth and it can be very painful emotionally and uncomfortable-- it's sitting through the uncomfortable that is your pathway to real growth\n\nGood on you for being 18 and wanting to do better-- I actually see a bit of myself in this post. Good luck to you.", "permalink": "/r/DecidingToBeBetter/comments/htzlp8/18_years_old_never_developed_life_skills_where_do/fylfw5j/"}