{"id": "t5_2tand_t3_d9065x_t1_f1f8bdo", "creation": 1569438890, "origin": "t5_2tand_t3_d9065x", "height": 1, "replied_to": "t5_2tand_t3_d9065x", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "smileycat", "text": "This is honestly how I've always lived my life. I took all those lessons from my parents to heart (always be yourself, be honest, the golden rule, blah blah blah). I should preface this with the fact that I grew up before social media. I honestly believed that everyone was being themselves. 30+ years later I come to find out that EVERYONE is a liar. EVERYONE is lying all the time. Is it social media's influence? I don't know. I do know that it's made my life both difficult and amazing all at the same time. Firstly, I got married young and am still disgustingly happy in my relationship. We are always open and honest with each other and share nearly all the thoughts in our heads good or bad and we treat each other wonderfully and respectfully at all times. Secondly, I have an extremely difficult time making and keeping friends. I am myself when I meet them. We hit it off wonderfully. I invest emotionally. They turn out to be horrible human beings. They are LYING all the damn time about who they are. I have basically resigned myself to the fact that I may never have friends. It may always just be my husband and I. I do have to say this to those of you out there who lie about who you are in any and all circumstance: Don't. By being honest with myself and others about who I am I LOVE who I am and I enjoy the hell out of my life. I don't have the stress and anxiety about keeping things straight all the time. I don't understand why everyone feels the need to lie. If you like you then why wouldn't you want to be true to yourself? I own my flaws and can laugh about it. I am a clutz. My taste in music is something most people hate and would make fun of me for but how can they when I do it first. So what if you don't like what I like? So what if you are into stupid shit. Everyone has something lame about themselves. It's what makes us all wonderfully unique. Please just own who you are and stop lying to impress someone who (a.) doesn't give a shit and (b.) isn't worth impressing. You are worth impressing yourself first and foremost. Live a life you love and people will be impressed and it will be genuine. Who would want a basket full of likes and approval over something that you know is a lie you made up about yourself. Wouldn't you rather have the likes and approval over the things about you that are real and true?", "permalink": "/r/DecidingToBeBetter/comments/d9065x/why_you_should_always_be_genuine/f1f8bdo/"}