{"id": "t5_2tand_t3_d9065x_t1_f20iuel", "creation": 1569860203, "origin": "t5_2tand_t3_d9065x", "height": 1, "replied_to": "t5_2tand_t3_d9065x", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "smileycat", "text": "On my phone so I apologize for any formatting issues. First of all I never said that I never lie. Of course I have. I just don't lie about anything and everything or to everybody. For the first 16 years of my life I lied to everyone about being sexually abused so not only am I quite good at lying, I also know the strain it puts on you over the long term. Because of that I choose not to lie about myself. Of course I have worked jobs that I hated for people who have treated me like shit. I feel there is a difference between lying and just choosing not to say anything about it. If I were straight out asked my feelings about a work thing that I felt negatively about I would have been honest. However,  in those situations they don't ask, because they legitimately don't fucking care.\n\nYes, I am privileged.  I won the genetic lotto by being born a white female in America.  However,  my life has not been perfect as you can gather from the sexual abuse for 16 years comment above. I was born poor but thankfully in a rural part of the US so I didn't have to struggle with too much violence growing up. But from there I made something of myself that I am very proud of and my husband and I own and operate our own business.  So instead of dealing with unethical employers I can become the boss I wish I had always had. I am happy to say that even though I was abused for so long that I feel very healthy and healed from trauma that turns most people into victims for their entire lives. My positive outlook on life was hard earned and I do not trust 99.9% of people and that includes my own family.  But to lie about myself to these people does nothing for me. It only makes them more comfortable treating me like a door mat. It only separates me from making real friendships and relationships that I can get something out of. It gives them everything and me nothing. If it's not real and genuine then they can fucking keep it. Life is too short and hard to put everyone else's comfort above my own. If I disagree with something that is told to me I will say so. If I find your conversation to be ignorant and shameful I will say so as politely as possible.  Being honest doesn't mean being rude and cruel. If you think about what you want to say then you can take an extra second or two to think of a better way to say it so that your thoughts and ideas will be more likely to be heard. \n\nAnd for whatever its worth...  whatever it is that has you feeling the need to be so aggressively angry about someone choosing to be honest more often then lying... I feel for you. Whatever it was, it must've been extremely difficult.", "permalink": "/r/DecidingToBeBetter/comments/d9065x/why_you_should_always_be_genuine/f20iuel/"}