{"id": "t5_2qh5i_t3_d2l6i_t1_c0x7ml9", "creation": 1282249147, "origin": "t5_2qh5i_t3_d2l6i", "height": 1, "replied_to": "t5_2qh5i_t3_d2l6i", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nrbartman", "text": "That's exactly what happens. And the moment she's born your brain changes. Like in an instant. It just hits you like a ton of bricks. After a few months you feel more like you again, but that first few minutes realizing you're a dad/mom does something to the chemical makeup of your brain or something. It's not something I can fully describe. \n\nI was worried about the financial stability thing too - I make a decent living, but nowhere near what I was thinking I'd need in order to feel comfortable with a baby. But your spending habits change so drastically once she's here. You put diapers and formula just below rent on your MUST PAY list each month automatically, and you will. You're going to be AMAZED at how much less you spend on going out for drinks or dinner or just generally waste each month - now that you'll be going out less and worrying about taking care of her needs.\n\nWe end up with more money each month now that we've got her, simply due to our naturally protective approach to our spending. When you go out for a happy our drink after work one of your first thoughts is, 'Man, $9.50 for two beers is basically half a container of formula.' and you maybe only have one beer the next time. \n\nIt all adds up, and the things you think will be a source of stress right now become decreasingly stressful as the months go on. All in all, if you have an analytical mind or like problem solving you'll naturally learn how to be an efficient parent. Once most of that is out of the way you can really just sit back and enjoy parenthood. \n\nIf it's any indication, we just went through the tough first few months and are already looking forward to a second baby in a few years. \n\nEnjoy!", "permalink": "/r/happy/comments/d2l6i/i_went_my_first_ultrasound_for_my_future_daughter/c0x7ml9/"}