{"id": "t5_2tand_t3_kquu9c_t1_gi843ck", "creation": 1609881389, "origin": "t5_2tand_t3_kquu9c", "height": 1, "replied_to": "t5_2tand_t3_kquu9c", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dumbitchidiot", "text": "i think if you were already struggling to go to the gym before, it’s worth firstly asking yourself if the gym rat life is actually a lifestyle you WANT to live. do you enjoy the gym enough to go as frequently as you want for years to come? is that a realistic goal to have for yourself? or do u go to the gym because you want to be fit and you feel like you have to go to the gym to attain that goal? if you think the gym isn’t great for u, THATS OKAY because we are not built for gyms, gyms are built for people who find them useful. you can instead find a different way to get exercise in. my former therapist told me that 30 minutes of light exercise 3 days a week is like taking a small dose of effective antidepressants. i think going on walks 3 days a week would be great, or even once a week if three days a week is too overwhelming or draining. from there you can increase how frequently you exercise when you’re ready. you can also branch out and try to find things that are even more fun or engaging for u!! roller skating, skate boarding, biking, tennis, yoga, etc are all great forms of exercise that lots of people genuinely enjoy doing. you can even chose to get your body more acclimated to exercise before going back to the gym lifestyle, or you can find that you do really like being at the gym and none of that advice was helpful. that’s up to u to figure out. \n\nthe most important thing to remember with depression is you have a sickness. just like you can’t blame someone with bronchitis for coughing, you can not blame yourself for struggling to take care of yourself of perform tasks. especially if YOU are trying and your illness is winning the fight. you aren’t bad, you aren’t a failure, you aren’t anything your brain is trying to tell you. you are a person who’s brain chemistry is so out of balance that it can’t complete many of it’s necessary functions. goodluck 💜💜", "permalink": "/r/DecidingToBeBetter/comments/kquu9c/i_stopped_going_to_the_gym_because_anxiety_and/gi843ck/"}