{"id": "t5_2qh1i_t3_14s8q5_t1_c7fy54h", "creation": 1355410666, "origin": "t5_2qh1i_t3_14s8q5", "height": 1, "replied_to": "t5_2qh1i_t3_14s8q5", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "It's an empowering feeling that you can end your own life. I thought of myself as a trouble to the world and that I alone could rid the planet of a piece of shit like myself. \n\nMy attempt happened at the end of my senior year of high school. I was alone and my future was looking bleak at best. I was put into an \"out patient care center\" where I was tatted like a prisoner rather than a patient. The other patients weren't exactly...in trouble(?) as much as they were a handful to deal with. Kids with anger problems who were dumped there. \n\nI slit my wrist and tried to bleed out. My mother caught me and rushed my to the emergency room after she patched me up (mother is a registered nurse) and they diagnosed/held me over night.\n\nThe thing is: suicide is selfish. \"Once you're gone you're gone\" was more of a challenge to me than a warning but I started to look at stories and talk to military mothers who didn't know if their child was going to make it home. I realized that if I didn't love myself, I did love my parents, my family, and my passions. Experiences only happen once! On a freak accident I was created; by genetics I was given depression (it was snowballed by life experiences) but it isn't worth it.\n\n By the graces of the universe my consciousness was given a chance to receive this opportunity at life that was taken from billions and is poor to most. It would be overall a punishment to the people around me. I am still depressed, suicidal but.. It's okay. It is. It does get better. If it doesn't, you're doing something you're not meant to do. Einstein (he got me through a lot) is a great guy to look at. Quite a few quotes (insanity, fish climbing a tree, a few more) just make the light at the end of the tunnel a little brighter. \n\nTake it from me, a 19 year old male with the world at his fingertips, live for those who don't. Live for those who can't. There's always something you can do to help someone. Just be there. \n\nTL; DR a load of text that you should read of you're interested. \n", "permalink": "/r/AskReddit/comments/14s8q5/suicide_survivors_of_reddit_whats_one_thing_you/c7fy54h/"}