{"id": "t5_2tand_t3_qdqmx2_t1_hhoaxkm", "creation": 1634940263, "origin": "t5_2tand_t3_qdqmx2", "height": 1, "replied_to": "t5_2tand_t3_qdqmx2", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CrimsonWolfSage", "text": "Checkout r/jobs and r/careeradvice for helpful tips and suggestions. Generally speaking... Fast Food, Retail, and Warehouse are all needing people and some will pay reasonably. Surprisingly, if you check into things like Construction, HVAC, Plumber, Electrician, etc. it might offer paid apprenticeships and many people earn 75k+ without a degree there.\n\nr/mechanicadvice with your car can offer some sensible advice on the car. Sounds like a money pit to me, as you mention many issues... but it's also true that most used cars are cheaper to fix than to replace.\n\nNew home is essentially out of the question in your position. Mortgages or banks will want to see a good job with years, if not decades, of stable job and credit history. Make it a life goal for now, but you have to want it... and save for it. Apartments can be a hassle to get into, but you can usually get one or at least roommate with someone with a free room. Put in the work, and something will turn up!\n\nExtra money now, look at r/freelance or google gig jobs. Door to door, you could sell products or offer to do things like... mow the lawn, clean house, babysit, build or fix something. Maybe a Delivery service or Taxi can be lucrative for your area (Beware... wear & tear, plus risk of accidents is on you basically). Online opportunities range from writing blogs to managing projects or developing them. Just need a laptop or tablet/phone for many possibilities to open up.\n\nInterests and hobbies are generally good, but also keep in mind your realistic personal space and financial picture. It might satisfy your curious and interests by joining a website, blog, or forum for you art and martial arts. Personally have enjoyed some youtube shows that explain new concepts and analysis of my favorite topics. Which allows me to avoid buying supplies, DIY in cramped spaces, and no extra luggage afterwards to cleanup or deal with... at a time I don't have extra space at all.\n\nAs far as Martial Arts goes tho. You could read books at the local library and practice Kata or positions/movements at the park. However... you might not like the attention some strangers will give you. So don't over do it with the shadow fights.\n\nTravel is always nice, but it costs a bit and you'll want a Passport. Philippines is a nice area, but you will need a friend to avoid the foreign easy target issue.\n\nEveryone wants to retire and feel satisfied that their life had meaning. Since USA is expensive to live in and relative to the world seems hostile for retiring in some ways. Retirement in other countries is a popular option that offers lower cost of living and even some perks. Such as a better view of the ocean and warmer weather. But, it's not a magic solution... you still need a serious retirement account for it to be enjoyable.\n\n(Edit: r/financialadvice is deprecated) r/personalfinance can provide better insight into retirement goals. There's multiple ways to help save up, and while you are young and working... pretty good time to risk your savings in the open market with stocks and various other options there. At the very least, start a 401k and try to put 10% into it... or even just a few dollars every paycheck is that's all you can spare. It does add up with the magic of compound interest.\n\nUltimately, think you should break down all these issues into very narrow and specific posts. That way you can avoid the wall of text thats inevitably with so much to talk about at once. It also let's your mind compartmentalize each issue and when it's done. It's done and gone for good, instead of being touched on over and over.\n\n...but in the end. It is your life and any response is just a suggestion. Take what is good, and what works for you. Leave the rest.", "permalink": "/r/DecidingToBeBetter/comments/qdqmx2/quitfired_from_job_want_a_better_life/hhoaxkm/"}