{"id": "t5_2tand_t3_6r1c1o_t1_dl1qks9", "creation": 1501650673, "origin": "t5_2tand_t3_6r1c1o", "height": 1, "replied_to": "t5_2tand_t3_6r1c1o", "down_vote": 0, "up_vote": 19, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Well, honestly.... I read every word, and it's painful partly because I myself am stuck in a toxic job, and have been looking for a purpose for about the last 6 years. I've gone to therapy, I've been told I have Adult ADD, which I took drugs for. I also got into meditation and was thinking about travel to Chile to drink some cactus tea and trip out.... All of this in hopes I figure out something.\n\nYou write the same way I write in my journals, countless journals I've written... Eventually all thrown away. Hundreds of journals, asking for help or guidance. I've followed countless programs, schemes, plans, diets, rules....... But nothing really spoke to me.\n\nI've even looked to some sub-reddits... And nothing really spoke to me. But your story does. It speaks to me. That's allot of fucking words you put up there. Sounds like you have lots to say. \n\nHonestly sounds like you are a fucking Lion trying to tear out of a cage. Filled with rage, fear, bloodthirsty, ready to show everyone who doubted you what you are fucking made of.\n\nHow do you show people what you want to say? How do you make people listen? \n\nJust speak your mind. Stay true to your heart. Try writing a book. Try exposing a little bit of the pain to yourself.\n\nInstead of trying to impress those around you, impress yourself and say fuck what others think. That is what a true lion needs. It's PRIDE that you are missing, and you need to get it any way you can.\n\nAll therapists do is help you discover your inner demons, and demolish them by building up the opposite feelings. \n\nYou want to stop beating yourself up? Then you've got to build yourself into something or someone who can take the damage. Become that person you wouldn't even want to fuck with. Become the very thing you envy most.\n\nFuck all these people that say happiness is the goal. It isn't true. Those who are at the top, successful, prideful... Are those that could face all the world had against them, and laugh. \n\nYou just need to have pride in yourself and stop thinking you're a pussy, lazy, no good baby boy... And start seeing yourself as someone worth writing about.\n\nHell, you could be the first author. That's how we get out of this shit stain we've painted ourselves with. \n\nJust today, I went to a street were I was mocked by coworkers over 4 years ago for my inability to run it completely for a mile and a half.... And ran it again. Brought back all those feelings of defeat.... Only this time I pushed myself further, and made it further. Even if it was only a little better time than all those years ago.... It showed me something. I.... Will... Always... Improve.\n\nShow yourself what you are made of, even if it's small to others, it's better than where you were yesterday.\n\n\nFrom reading all that, it sounds like you are already better than that sack of shit you described in the beginning. Take some fucking PRIDE in that man. Keep going. You're already different.\n\nFeel the difference.", "permalink": "/r/DecidingToBeBetter/comments/6r1c1o/some_questions_about_brain_fog_purpose/dl1qks9/"}