{"id": "t5_2tand_t3_6r1c1o_t1_drf18lx", "creation": 1513594031, "origin": "t5_2tand_t3_6r1c1o", "height": 1, "replied_to": "t5_2tand_t3_6r1c1o", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "creamyj0e", "text": "I just wanted to say thank you, for being able to articulate that which I can't seem to do. I would say 90% of what you are saying resonates with me, might as well BE me, word for word. We have even both done Ayahuasca in Peru. I don't know your reasons for going, but I went to find some sort of answer as to why I have been living my life like this. I discovered self love through it, that the heart is the compass, if we can let our minds rest and listen to it. \n\nI also write, because I can't seem to express my issues orally in a coherent way that makes sense to whoever I talk to. When I listen to the words out of my mouth I sound like a lazy piece of shit. I am lazy, but I don't want to be. I found this post somehow, a keyword in my searchbar was lack of focus. I struggle with this too. That and discipline that needs to be nurtured. Currently I am wrapping my emotions into poetry and posting it on instagram, or attending open mic nights, just to challenge my comfort zone, forcing myself to write an hour every day even though I have a day where I feel about as creative as a door knob. It is a muscle to work out, same goes for the body, same goes for the mind. They are all elligible for exercise. I am trying to approach a holistic lifestyle, to see if that spark some much needed change. Eliminating bad habits and replacing them with healthy ones.\n\nWe are destined for something, I think, maybe that's an incredibly naive thing to say, but I believe it to be true. Thank you again for this post, it gave me some peace of mind knowing I am not crazy or alone in feeling this way. That is not to say I am glad you are struggling, but you are not alone, and neither am I it seems like.\n\nTrust your heart brother, we will break through to the other side eventually.", "permalink": "/r/DecidingToBeBetter/comments/6r1c1o/some_questions_about_brain_fog_purpose/drf18lx/"}