{"id": "t5_2tand_t3_6r1c1o_t1_dlamtqt", "creation": 1502131936, "origin": "t5_2tand_t3_6r1c1o", "height": 1, "replied_to": "t5_2tand_t3_6r1c1o", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "What it sounds like to me is you are fighting two ideas. One idea being the perfect person you've created and designed based on what others have told you... The other who you think you REALLY are underneath. \n\nI can tell by reading your response, you are struggling to determine which one of these people you want to be. \n\nI know what's going on, because I've done the same thing. I would talk my mind into circles, endless circles. Still do sometimes. It took me going through society's \"standard\" way of coping with stress and depression to see myself for who I truly was... And determine I didn't need help after all. \n\nThe only thing I can tell you is, we both need to make a decision of what life we want to live and stop hovering in the safety zone. \n\nI am scared of risks on all sides, and the longer I hide... Everything outside seems to dull... I either become a tape recorder that spits out quick learned theories (that don't help anyone, because it's as good as saying \"I'm sorry for your loss\" during a funeral), or I become emotionally and physically mute to the world around me by way of self pity and defeat. \n\nI can only imagine you have gone through the same.\n\nYour energy is being spent on too much thinking, and not enough doing the thing that it is you wish to do... Which seems to be writing. Could be wrong, so insert whatever it is in your head you've conjured up over the years. \n\nPeople don't agree with me most times. I don't have the life people want to live. I am not a teacher, or a millionaire, or a model citizen. I am me. I need to learn that being me doesn't mean I have to be anything else just because others think so. \n\nBeing me is a responsibility only I can live up to and work on. The way I do that is whatever way I've thought of at the time. It changes, it flows, it grows and shrinks. Just like life.\n\nYou are going to die someday, your time is limited in this choice. You better hurry!", "permalink": "/r/DecidingToBeBetter/comments/6r1c1o/some_questions_about_brain_fog_purpose/dlamtqt/"}