{"id": "t5_2tand_t3_6r1c1o_t1_dl33f6m", "creation": 1501717170, "origin": "t5_2tand_t3_6r1c1o", "height": 1, "replied_to": "t5_2tand_t3_6r1c1o", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Sounds like you are in the realization I was about two months ago. Really struggling, and even my writing was becoming something I resented about myself. \n\nFunny, we all bleed red in our heart I guess? Maybe we all have the same problems, just different ways of handling them. Or similar ways, in the case of you and me. \n\nI'll tell you what. Want to write a book together? Just for fun? What would be the outcome of your book? What would be the goal? \n\nMine would be to find peace with yourself, and use that understanding to push yourself further into a life you know is good for you.\n\nI've always wanted to get to the source of \"What is my purpose\" being truthfully \"No purpose except what you allow\". That is the truth. All of us here have absolutely no purpose that we know of. We haven't been told what we are here for (with exception of other human beings) and we have made up very grand stories. \n\nIt seems that we are still making grand stories about ourselves, especially now with the internet... When do the stories stop? When do we feel satisfied? Never...? Or do we make our own satisfaction in life? \n\nIf you could get down to the grit of that question... It think no one's life would be the same. Maybe we would all finally have that \"aha\" moment, and feel the strength we actually have without the guilt that comes with it?\n\nJust an idea I've been mulling over for a while. I was accussed of being a douche earlier though, so I may be wrong... But hey, who's tracking at this point? If I am a douche, I'll be forgotten when I die. If I am onto something though.... I could help people after death with my strange thoughts? \n\nSame goes for you... Maybe you aren't as bad as you thought, after all? Maybe your words could do some good? If not now, if not for you.... Eventually, when you become dust once again?", "permalink": "/r/DecidingToBeBetter/comments/6r1c1o/some_questions_about_brain_fog_purpose/dl33f6m/"}