{"id": "t5_2tand_t3_6r1c1o_t1_dl9lq0n", "creation": 1502073524, "origin": "t5_2tand_t3_6r1c1o", "height": 1, "replied_to": "t5_2tand_t3_6r1c1o", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "punchitchewy", "text": "thanks!\n\nI've been attempting to go gluten (and grain) free for a few months but have struggled since I'm also cultivating an intermittent fasting protocol, progressive calisthenics routine, daily meditation, working a second job, trying to just be better and \"do the next right thing\" (i.e- dishes, clean room, FLOSS...NOW, NOT TOMORROW, DO IT DO IT DO IT) and also not give in to my cravings for alcohol...so I've struggled with giving up gluten and grains cuz they're just so damn tasty. I haven't put in the effort to eliminate gluten since it's hiding everywhere, but did cut out bread and any other obvious forms of gluten for a few weeks and looked better, though with everything else going on it's hard to say whether or not any changes in mood were related to that or my other diet/lifestyle changes.\n\nPoint being, I aspire to go gluten free as I've heard enough anecdotal reports and discussion from doctors (Kelly Brogan is one, tons of great info) talking about how much gluten and grains affects gut health and all of the related health effects.\n\nI know soon I'll have enough of those new habits under my belt to really cut out gluten for a few weeks. I'm excited to try it, you never know, a lot of my melodrama could be the result of toast ffs.  eye roll. I actually typo-d \"rye roll\" on that last sentence before correcting it...maybe it's a sign?\n\nAs for the \"feel the fear and do it anyway\" that is sorta my mantra these days. I'm terrified of some of the things that little voice tells me to do, mostly  because most of me is sure I'll fail....but that whole story is so cliche, nearly everyone who has any kind of success at all says that exact thing...so really it's just my turn to nut up and do the thing that will probably be beneficial in some way no matter what.\n\nI'm gonna download that book (hopefully it's still free!)", "permalink": "/r/DecidingToBeBetter/comments/6r1c1o/some_questions_about_brain_fog_purpose/dl9lq0n/"}