{"id": "t5_2tand_t3_mek9nt_t1_gsiwpun", "creation": 1616888456, "origin": "t5_2tand_t3_mek9nt", "height": 1, "replied_to": "t5_2tand_t3_mek9nt", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "anonymiz123", "text": "Oh my god! You nailed it! This is how it’s done! It happened to me!! At least they (people both on social media as well as real life) tried anyway. And all the people who were trying to suck me into the crazy mindfuck game? They all turned out to be right wing extremists. Like...literally, Nazis. \n\nFor me, it was when Obama got elected. Suddenly, the government was the bad guys. And they really did do a good mind fuck on me because for a long time I believed that, too. \n\nTheir mistake was turning on me. I recognized the mindfuck for what it was. And then I started writing down experience as I remembered specifically. And it took years, years to put a lot of it together. I changed, they did not, and that’s how I sussed them out.\n\nI still have very little trust of people. One of the first things he did to me was to make me paranoid, which was not very hard for me since I already had social anxiety. I had several breakdowns. I think I just got done and mad because in order to get at me fully, they targeted friends, and a neighbor. The neighbor died after the security alarm was set off over 60 times in one summer. (They did that in order to keep me sleep deprived; I was working nights.) My neighbor was elderly, and she hurt her hip rushing to turn off the alarm by the door one day. She ended up dying of a blood clot in the hospital, as she was recovering.\n\nI’m really proud of you for using your brain instead of falling for the lizard mind/limbic system trap that all conspiracy mind fuckers try to get us to use first. It’s a long long way to normal; you will never be the same again, which is why it’s so effective. \n\nI’d love to chat with you live some day.", "permalink": "/r/DecidingToBeBetter/comments/mek9nt/i_was_a_full_blown_consipiritard_for_about_10/gsiwpun/"}