{"id": "t5_2tand_t3_l2by18_t1_gk6b5op", "creation": 1611323432, "origin": "t5_2tand_t3_l2by18", "height": 1, "replied_to": "t5_2tand_t3_l2by18", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Nutelladela", "text": "Hey, so I'm seeing a lot of bad advice here relating to mental health medication and refering to it as \"relying on drugs.\" I know that you already said that you've decided to try medication, but I'm worried that these comments might discourage you, so I want to encourage you to follow through with it by writing down some information. \n\nWeed is clinically proven to make paranoia, anxiety, and depression worse when you're not high, causing you to rely more and more on THC to relieve the very symptoms that its causing. Weed is also proven to lower IQ over several years of use and to trigger psychotic episodes in those prone to them. I would link all of these studies, but proving this isn't the point of my comment as I can see that you've already felt these effects yourself. But I want to make a clear distinction between a \"drug\" like weed and a psychiatric medication.\n\nThat being said, psychiatric medications function like a supplement that you can often stop taking once you've caught up on what you were missing and have balanced out the chemicals that regulate mood. I'm sure this is a cheesy, overused example already, but if you take an MRI of a brain suffering from depression or anxiety, you can physically see the difference between that brain and a healthy brain on the scan. What this means is that the effects of depression and anxiety are truly real, and DO require medication. No amount of willpower will fix a broken leg or a failing liver, and neither will it fix your brain. \n\nThe reason why medication might feel like it didn't work for some is because there are multiple chemicals that regulate mood that we might be deficient in: serotonin, dopamine, oxytocin and endorphins. Different medications act on different chemicals, and some people simply haven't figured out which chemical they're deficient in yet. If one anti depressant doesn't work, I absolutely guarantee you that another one will. \n\nThere are multiple types of mental health medications under different names. Some say that they're for anxiety, others for ADHD, others for depression, etc. Just because a medication isn't labeled as being for depression doesn't mean that it doesn't have the potential to treat yours. All of these medications act on different \"happy\" chemicals for different purposes, meaning that they all have the potential to treat your depression if that chemical is what you need. Don't be afraid to try the full scope of meds available to you during your treatment until you find one that works, even if its intended use is for something else. \n\nLastly, don't be discouraged if you don't get it right from the first try. I rarely guarantee things, but I absolutely 100% guarantee that the right medication will work for you as long as you keep trying. You don't have to do this on your own, and what feels like a mountain to climb right now will finally feel manageable once you do get the right treatment. It won't take long, just don't give up on your right to be able to function like everyone else. Medication isn't a \"crutch\", it's life saving treatment and a chance to a fresh start. \n\nI believe in you, and I'm so proud of you for choosing to do this. You're a fucking boss and I'm so excited for what your life will bring now that you're giving yourself the chance to live it!", "permalink": "/r/DecidingToBeBetter/comments/l2by18/threw_out_my_weed_scheduled_a_psych_appointment/gk6b5op/"}