{"id": "t5_2tand_t3_l2by18_t1_gk4uttw", "creation": 1611283709, "origin": "t5_2tand_t3_l2by18", "height": 1, "replied_to": "t5_2tand_t3_l2by18", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bennyp1111", "text": "My friend, you’re making a beautiful decision and I applaud you. But please please please do not immediately go to a doctor and ask for other drugs. Simply put, you likely just have a drug addiction to weed. That’s it. It makes no sense to cure your addiction by switching to another one. Even if a doctor tells you it is a good idea. Whether society likes to admit it or not, doctors make tons and tons of money off of telling people they’re ill and prescribing drug addictions to fix the illness. It’s no wonder why drug addictions are an epidemic. But an addiction like weed is held together, not by the physical effects of quitting, which are never worse than a flu, but by our perceptions that the drug helps us. \n\nI’d guess you think weed stops you from being depressed. When I was addicted to weed for 6 years, I thought the same thing. But the truth to addictions is, they trap us by convincing us that our poisons are somehow beneficial to us. I used to think weed medicated my depression, only to learn through experience and mindfulness, that weed caused my depression. Sure, it gave me a temporary high, but I get that feeling 10X from taking deep breaths, which happens when you smoke. But hours later, I felt awful. It was because I was inhaling dirty toxins constantly. It was because I was messing with my brain chemistry. None of these things are natural. None of these things heal anything. \n\nLuckily, all of our minds and bodies are strong and fully capable of repairing themselves. I feel radiant as a sober person and I think you can too. But please please please, I beg of you, give Allen Carr’s EasyWay to Stop Smoking a serious listen before seeing a doctor and turning to other drugs. \n\nThere is a way out of the addiction trap. You simply have to logically understand how it works, and it will be easy and exhilarating to escape to freedom. Allen Carr’s book will show you the instructions to be free, if you listen carefully. Bonus point: replace each instance of ‘nicotine’ with ‘weed’ or ‘marijuana’. Bonus point 2: take a sick day from work and purely focus on listening to this book. I am saying this because this is literally exactly how I escaped my pot addiction.", "permalink": "/r/DecidingToBeBetter/comments/l2by18/threw_out_my_weed_scheduled_a_psych_appointment/gk4uttw/"}