{"id": "t5_2tand_t3_3697li_t1_crcalvv", "creation": 1431898284, "origin": "t5_2tand_t3_3697li", "height": 1, "replied_to": "t5_2tand_t3_3697li", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "andrewlarkin", "text": "**Take the following with a grain of salt**\n\nSo, I just turned 26 but I can relate to this feeling. I like being high-intensity but have to revert back to being unmotivated and lump like. But it's a game of leveling up slowly and steadily. But sometimes you need a kick. A kick to get you out of your cycle.\n\nThis can be many things, some of the things I have tried, with my personal results:\n\n1. Meditation: visualizing what you want in life and asking yourself the things that you need to do to make them happen. I found I was sometimes holding myself back in my thoughts because of love for my family or things I liked doing. But you have to be cut-throat. If you feel your mortgage is tying you down, get rid of it. If you feel your job isn't exactly what you want to do, quit. If you have negative people in your life, cut them out, don't respond to their calls or msgs. Who cares? Life is too precious to be wasted. Like Steve Jobs had said: if you were going to die tomorrow, what are the things you'd change?\n\n2. Change in diet: /r/keto folks will tell you that almost completely cutting out carbs change your life. It's been the case for me too. In the last month that I've been on this diet (on-and-off), eating butter often, drinking coffee with a tonne of cream, I'm been WIRED. My coworkers notice the difference, and honestly, we've been killing it since. And if you're doubtful of this diet, all I ask is, do it for 3 days. It will be hard but if we can't change something so fundamental as our diet, just for 3 days. We are getting _way_ too comfortable.\n\n3. Go visit the gym: I don't know if you hit the gym at all. But if you don't  have the habit of craving the gym, just go to the gym and sit somewhere and watch people do their thing. For 3 days. I swear to you, by day 3, you'll be so pumped to hit the gym. And when you do, set the treadmill to interval (something that stretches your limit) for 10 mintues and TOIL through it. Like, BEAT that machine. Finish that 10 minutes even if you're crawling. Then do some weights and push your body to what you _thought_ was impossible. And, keep this as your habit. Because a better body gets you so far!\n\n4. Look at what others do: people like Dave Asprey, Sam Harris, Tim Ferris have spent a tonne of time and money hacking themselves. Take tips from them, read/hear their books/videos. They're much older than I am, so I bet you, it's not an age thing. I have met a 80yo Buddhist monk who travels 10 countries every month, making our achievements look like peanuts.\n\n(bonus) 5. Have a night out: after you've started feeling the change, and feeling amazing, take the people you love out. Enjoy the camaraderie with your brothers/sisters who live for positive experiences. And if you've got the hookups and trust, you may experiment with things that people in /r/Psychonaut/ talk about. And before you judge their experiences, please understand that the point of all this is to take you out of average day-to-day experience and show you other possibilities that you're not aware of.\n\nVideos that help me:\n\n- You will relate to this SO much: https://www.youtube.com/watch?v=mbInxLZ2KAM\n- https://vimeo.com/68855377", "permalink": "/r/DecidingToBeBetter/comments/3697li/how_do_i_get_my_spark_back/crcalvv/"}