{"id": "t5_2qh5i_t3_9p0gwf_t1_e7ynl1r", "creation": 1539813921, "origin": "t5_2qh5i_t3_9p0gwf", "height": 1, "replied_to": "t5_2qh5i_t3_9p0gwf", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DarkEyeLOL", "text": "I'm glad that you found your joy back in life.\nI found out that I had ADD (Attention Deficit Disorder) back when I was 18 years old. \n\nI was always super tired and I had trouble to concentrate. This is also why people always thought I was high on drugs, because I would stare for example to the window in class with a sleepy look on my face. And they also told me how I had to put more effort into school.\n\nThis is where I tried to figure out how to be more energized and make people like me more. As I proceeded to find out what the reasoning behind my problem was, nothing seemed to be the case.\n\nUntill I started to develop a depression, this is where I finally found out I had ADD. I described my weaknesses on Google, like for example not being able to concentrate, staring a lot, only being interested in the stuff you really care of.\n\n\nShortly after that I started trying out my father's medication, because he also shares the same disorder as me. \n\nHe had already asked me to try out his meds to see if it makes me feel better, but I always refused to try them out, because I didn't want to admit I had a disorder at the time.\n\nWhen I took my first pill of menthylfenidate, I felt like a fresh new person. It felt like all of my senses worked better than before. Like I remember eating lunch, and the taste of the food was much more detailed than it used to be.\n\nAlso people around me started noticing how I was much more talkative, started to be much more productive in class and how I didn't look sleepy anymore. This also gave me a huge confidence boost.\n\nMy parents also accused me of having ADD back when I was twelve, but they never did anything with that suspicion. This is why I never did school on a higher degree as I would actually be able to reach back at high school, because I wasn't able to concentrate enough.\n\nNow I see a bright future in front of me, after my current study I want to do a further education. ", "permalink": "/r/happy/comments/9p0gwf/nobody_irl_seems_to_understand_so_im_going_to/e7ynl1r/"}