{"id": "t5_2tand_t3_nwf5vh_t1_h19n511", "creation": 1623324537, "origin": "t5_2tand_t3_nwf5vh", "height": 1, "replied_to": "t5_2tand_t3_nwf5vh", "down_vote": 0, "up_vote": 49, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Maggiemaccy", "text": "This is so spot on. \nWhen I realised I had to start managing my mental health condition the way I manage my chronic physical health condition my quality of life improved so greatly. \n\nOne of the turning points for me was acceptance that something is better than nothing. \n\nSome of my tips-\n\nInvesting in comfortable ‘day clothes’. Just like leggings, T-shirt’s etc. When I get up on a day off I change into these immediately instead of letting myself stay in pyjamas. When I spent all day in pjs it felt like a huge other task to then go pick out an outfit and change into jeans or whatever so this was a barrier to me leaving the house. When I’m in comfortable but acceptable day clothes i feel I can just go.\n\n-if there’s an overwhelming list of things I have to do but I’m avoiding I tell myself I just have to pick one today. One today is better than none at all, I do this daily and now can get through my essentials. \n\n-if my mind is telling me to avoid some part of my basic routine I just accept that. Like some days I’m in the shower and my mind is like ‘don’t want to brush teeth’, previously I would have sat on my bed until I found the motivation to brush my teeth, now I just accept that and move on with the rest of my routine, I always end up with the energy to do it after.\n\nVocalising the immediate benefit of things. I’m terrible with delayed gratification, for years this prompted me to just lie in bed for hours on end. I got into this habit of affirming the short term benefits I’m getting from what I’m doing and not thinking too much about long term pay off. I do my skincare routine “this feels so good and clean”, I complete a task I didn’t want to do “I’m so glad I can stop thinking about this now”, I clean my house “I’m excited to get into bed tonight in a clean room with fresh sheets”. Through time I do get instant gratification from completing these tasks now\n\nAlso if, like me you find you’re drained and fatigued often I’ve started combating this by first questioning “am I really too tired or am I overwhelmed?”, before returning to bed I drink a pint of water and see if I’m feeling dehydrated also and for some reason this often helps. \n\nDon’t push it. I committed to treating my mental illness like my physical illness and with that when I’m having a really bad day I don’t keep pushing, I rest, remind myself it’s not forever and some down time won’t end the world. \n\nOutsource if you have the resources. Have your work clothes dry cleaned, have a cleaner come in for a day per week, use a meal prep service, take your car to be cleaned. I have a friend who never washes her own hair ever, there’s a training academy for hair dressers that offers services at a significant discount, she gets a wash and blow dry every Friday. If you have the resources there is no shame in taking the pressure off yourself and outsourcing tasks you struggle with that will significantly improve your quality of life", "permalink": "/r/DecidingToBeBetter/comments/nwf5vh/hygiene_tips_for_when_youre_at_your_lowest/h19n511/"}