{"id": "t5_2tand_t3_nwf5vh_t1_h1bqxcr", "creation": 1623358288, "origin": "t5_2tand_t3_nwf5vh", "height": 1, "replied_to": "t5_2tand_t3_nwf5vh", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TerhaNuvin", "text": "What get's me through depressive episodes is:\n\n1) CBD Oil (I take 2x5 drops daily, 25% CBD concentration) - it may sound like snakeoil to some, but I got my hands on a local brand that keeps my thoughts less erratic and also cuts down the anxiety levels\n\n2) Trying to do one task. Sometimes I am extremely motivated and i get to do a big task like cleaning an entire room or taking a walk. Sometimes everything is just a bit too much so I settle for smaller tasks like getting out of bed and lying on the couch instead.\n\n3) Once I am back to a less depressive state I try to stay on a strict schedule. Feed cats, go to work, get some groceries, come back home, work out, cook, read, sleep. Even on weekends. I can only function when I have a routine that I can rely on.\n\n4) Have one person I can vent to. I usually text them about how I feel like garbage and that I hate myself. That makes it possible for me to change from a victim's perspective to a more objective perspective. But that's really hard and I am only able to do that because of 2 years of hard work in therapy.\n\nBut the most important thing I've learned through therapy was, that it's ok to do nothing and feel like shit. It's the worst feeling if you lie in bed, sun shining in your face and you hate yourself because it's already 3 pm and you are awake since 10 am. But once I started telling myself that it's alright to stay in bed and do nothing and to just accept things how they are, the self hatred got less and I started having more energy for other things.\n\n\nBut if nothing helps and you can't function anymore use all of the energy you can muster and get your ass to a doctor and get yourself some happy pills. \nIt's not going to cure the depression but it makes it at least possible for you to function on a basic level so you have the energy to improve your life and your mental health.", "permalink": "/r/DecidingToBeBetter/comments/nwf5vh/hygiene_tips_for_when_youre_at_your_lowest/h1bqxcr/"}