{"id": "t5_2tand_t3_bgtlkt_t1_elrmyg1", "creation": 1556217982, "origin": "t5_2tand_t3_bgtlkt", "height": 1, "replied_to": "t5_2tand_t3_bgtlkt", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DWShimoda", "text": ">Right around that time, a dear old friend of mine, something of a mentor to me, he was **like an uncle or surrogate father** in some ways, he asked me to move in with him. He lived in the same area I had moved away from in MA. It was a move that made sense, I was still going to be broke at the end of every month paying him rent...but it felt like a good move and I took him up on it. At that point, I was back in the area I was in before, no longer farming, just working and renting a room from my mentor/friend. That didn't last long under those circumstances, **2 months into that arrangement, he fell terminally ill with liver cancer.** I'll never forget the day he walked into the kitchen and told me. 15 minutes later, he presented me with a bargain which felt like destiny. He said, \"You take care of me until I die, I'll ask you to take care of my dogs (he had 3) and then I'll leave all of this to you.\"\n\n-\nI'd be willing to bet that **he already KNEW** his diagnosis & prognosis in advance.\n-\nThat is to say, *at least* when he asked you to \"move in with him\" -- and probably even some significant time *prior to that* -- several months, maybe even a year (or more) before.\n\n-\nSounds to me like that 2 months as \"renter\" was your \"trial/probationary\" period -- he was seeing/testing whether you would be a good (hard working) potential \"caregiver\" (as well as likely whether & how good you would be as an \"heir\" to take care of his \"doggo\" friends) -- he'd likely already \"pre-vetted\" you relative to what he'd heard about the years immediately prior to that... you working on the farm in VT, etc.\n\n-\nIOW, he **chose** you... as a sort of \"quasi/surrogate-son.\"\n\n-\nAnd it sounds like you came through **for him** as such... with \"flying colors\"; over and above what most ACTUAL \"sons\" are willing (or able) to do.\n\nYou done good, laddie.\n-", "permalink": "/r/DecidingToBeBetter/comments/bgtlkt/3_years_ago_i_made_a_decision_to_move_out_of_my/elrmyg1/"}