{"id": "t5_2tand_t3_pwfh8w_t1_hehj443", "creation": 1632759233, "origin": "t5_2tand_t3_pwfh8w", "height": 1, "replied_to": "t5_2tand_t3_pwfh8w", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "labdog", "text": "I understand you. I've been there, done that.\n\nI have some good news and bad news for you. It's not YT. Like it's not any particular drug you use.\n\nIt's just escaping from the pain. Here comes the bad news. There is something painful that awaits your awareness. Watching shit online makes you unaware. Your mind shuts down to protect you from the pain.\n\nHowever - this state will only give you more pain.\n\nNow the strategy. When you know the YT (or anything else) is not a problem - you need to find the strength to face the REAL problem. I don't know what it is. Do you?\n\nBut let me ask some diagnostic questions. Do you think you deserve better? It's very important. If no - do you hate yourself sometimes, or... maybe often?\n\nTake a while to think about it. Then, there's mental exercise.\n\nLet's say you want to have something done. You ordered someone to do that, but that someone failed to do that. Well, he felt bad, maybe was sick or something. And now he's tired. You still want it done. Do you think that making the person miserable will help him to have the shit done? The person is already demotivated, so, what will it be?\n\nMy logic is following. When I help a person to get better, the person will be able to do what's expected.\n\nBe good to yourself. Help yourself. Do the good stuff. Be a good, motivating boss. Whatever shit you are going through - you need some positive reinforcement. Some reward.\n\nThis is how our brains work. We are addicted to dopamine and there is no way around it. Let's use it to our advantage. Confronting the chaos and doing the right things is rewarding. Do that. THIS is important.\n\nThere IS a reward and you NEED it. Just TAKE it. Think of what you could do instead of watching YouTube that would be rewarding, yet good for you. Will it be a workout? Maybe playing a good game? Maybe doing some difficult task you're going to do tomorrow for a year? Or SLEEP? By all means, if you're tired, have a good nap. It will help you.\n\nDon't think about things you don't want to do anymore. Think of the things you want to do.\n\nDon't try to force to anything. When it's repulsive - it will not work. I sometimes do things I hated to do. But everytime just before I'm getting to that - I quit hating them. I must find some fun in absolutely everything I do. I must want it. I don't do things I don't want to do. That's the catch.\n\nWhen it's like painful - treat it as a challenge. Let it be exciting. Here's the tough one and I will try it.\n\nWhen people PUNISH themselves, when they are mean to themselves - it cannot work in the long term. It just doesn't work.\n\nYou cannot even train animals by being cruel or mean to them. You know what works? TREATS! You can train practically any animal anything - just motivate them with some treats. Humans are not that different. Use treats. Miracles will happen.", "permalink": "/r/DecidingToBeBetter/comments/pwfh8w/i_want_to_ditch_my_youtube_addiction_but_i_dont/hehj443/"}