{"id": "t5_2tand_t3_q5otq3_t1_hg75uei", "creation": 1633931750, "origin": "t5_2tand_t3_q5otq3", "height": 1, "replied_to": "t5_2tand_t3_q5otq3", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Alternative_Fuel5805", "text": "I'm sorry if this is not what you expect, I wouldn't consider myself a toxic person, but there was a time where I felt like that, I had daily problems with the people around me, and felt I couldn't trust a soul.\n\n**Meditation** helps with the anxiety, reduced my anger, pride, depression, and really helped me in times I felt alone, no matter the number of people actually around me. It is not the fastest, nor easiest to get used to, but it is the most beneficial.\n\n**Personally**, What helped me get out of that was meditation on biblical things, e.g. 'I can do all things in God who strengthens me\", or most notably \"come to me all ye who are worked, I will give you rest\" Matthew 11:28 The principle is that this goes to your heart/spirit/subconscious mind and you will become what you think about. I haven't tried the wide range of meditation outside the bible since those have been enough.\n\n**You could also learn** about attachment theory, which has helped me on my relationships, there are **programs like** transformation mastery which I haven't taken but I've seen people getting great results, **books like** Letting Go, David R. Hawkins. Maybe even **try searching** for Emmanuel tv's youtube channel.\n\nu/okitwasme2, It is always good to try New/different things, These are all things that have made me who I am that gave me happiness, hope, and have overflowing love to others.\n\n**And it all started for me when I had the desire to be better, just as you have**, it is a painful way, but constantly challenging what we believe, is ultimately the best tool to change the paradigm that we are in.\n\nI wish you and your daughter the best, I love you, may God bless you", "permalink": "/r/DecidingToBeBetter/comments/q5otq3/current_toxic_person_looking_for_advice_from/hg75uei/"}