{"id": "t5_2tand_t3_q5otq3_t1_hh2bfxe", "creation": 1634525225, "origin": "t5_2tand_t3_q5otq3", "height": 1, "replied_to": "t5_2tand_t3_q5otq3", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BerrySensitive", "text": "**Resources & skills:**  \n\r  \n***Emotional regulation:***   \nThis was the number one skill that has really, really helped my anxiety, depression and interpersonal relationships. It also helped a number of other issues like avoidance-based procrastination. I have basically three tools I use to do this: 1. Sitting with the emotion. I really, really used to struggle with intense feelings. I'd get completely overwhelmed and feel like I couldn't cope. Which makes sense because I'd never been taught to regulate or even identify my own emotions! I struggled to know what I was feeling other than \"bad\" or \"good\". I definitely didn't know how to self-soothe in a healthy way (used to just avoid feeling bad through escapism and eating sweets). I'm also not into the touchy-feely new age stuff and could never really get the hang of meditation. However, just quietly sitting with the intense feeling without judgment and not trying to fight it, react or act upon it really helps. My counsellor told me that our brains can only maintain strong emotions for about 10-15 mins. I found that if I set a timer, after 10 mins I'd be feeling slightly less shitty than before, and after about 15mins the feeling would mostly have passed. Knowing that it wasn't forever helped me immensely to cope during those moments.\r  \n2. Writing it out. I find I process my feelings much better on paper (and it means I act less impulsively in highly emotional situations). There was no special skill or training here, just locking myself in my room and scribbling it out. I found I'd frequently get to the bottom of something that was bothering me I wasn't aware of.\r  \n3. CBT (a new tool for me). I started off watching the 17 min video by the guy who invented it because my depressed attention span was struggling: https://www.youtube.com/watch?v=H1T5uMeYv9Q It really drew me in and you can find his book online for free: https://kupdf.net/download/feeling-good-the-new-mood-therapy-david-burnspdf\\_5e4572cce2b6f5e30ef1afad\\_pdf Another helpful tool is the Woebot app, which helps you apply the tools in the moment (also free to download).  \n\r  \n***Social skills:*** a website that I used at the time which was extremely useful was SucceedSocially.com. It's a completely free resource and it covers all manner of challenges in a step-by-step way that assumes you've got no prior knowledge. It also covers issues I had which I couldn't find help on anywhere else. For example, feeling resentful about \"why should I be the one to always initiate a conversation?\" or \"what do I say?\"  \n\r  \n***Romantic relationships:*** There was a few skills here. Healthy conflict resolution was the biggest game changer (and it can be used to benefit any other relationship as well). I don't have a specific resource to recommend as I learnt from the couples counselling mostly, but the tips seem to be pretty standard (using \"I\" statements, Gottman institute stuff). Learning to walk away and emotionally regulate or write your feelings out. It is stuff you can practice with a solo therapist - I did!  \n\r  \n***Family estrangement:*** I too was estranged from my family for about 7 years because of my dad's unmanaged anger issues. I found a new charity called Stand Alone (UK based) which really helped with the grief and loneliness you experience with estrangement. Opening up to people in the office around the holidays surprisingly helped as well. I had a lot of well meaning colleagues ask if I was seeing family for Christmas, and I gave the truthful answer of \"no, we don't get along so well, but I will be seeing my boyfriend's family which will be nice\", which was truthful but also gave a less heavy conversation option. A surprising number of people opened up to me about their strained family relations, and I realised I was far from the only one who had family estrangement which was comforting. It may help you too to know you are not alone.  \n\r  \nIn terms of custody issues, I don't have personal experience with this. However, when I was on the infidelity boards after I got cheated on, I saw Bill Eddy's work with Divorcing High Conflict Personalities mentioned frequently. I use some of the theory to deal with my dad who is very reactive and who I need to have a working relationship with, and it definitely helps descalate things and get stuff done.  \r  \n\n\nwishing you the very best \\~ Berry", "permalink": "/r/DecidingToBeBetter/comments/q5otq3/current_toxic_person_looking_for_advice_from/hh2bfxe/"}