{"id": "t5_2tand_t3_q5otq3_t1_hh2aj70", "creation": 1634524754, "origin": "t5_2tand_t3_q5otq3", "height": 1, "replied_to": "t5_2tand_t3_q5otq3", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BerrySensitive", "text": "Hey okitwasme (and anyone else who is going through similar challenges), \n\nI'm so sorry to hear you're struggling with this. \n\nI am someone who came from a dysfunctional family and definitely had some toxic traits. I have been working on them for the past 6 years in 1.5 years weekly therapy, some couples therapy sessions and recently by learning CBT techniques. I found the problems came up very strongly in social interactions as a child/teenager and later in romantic relationships. I've fixed both of these areas to the point where I only occasionally get issues in my relationship (the most recent one to get fixed, so it's not completely second nature yet). However, interactions with high-conflict people are still an active challenge for me. I also am actively working on my anxiety and depression which is primarily around work/ failure using CBT techniques which I am just learning. I really hope I can give you some useful advice from what I've learnt.   \n\n\n**Context**:\n\nGrowing up, I really struggled to make friends. It felt like everyone else was following some kind of rule book that I couldn't see, and I'd get seemingly randomly socially punished because I'd committed a social faux-pas. It felt very frustrating and unfair.    \n\n\nKids are sponges who pick up everything about interacting from the adults around them. When you come from a dysfunctional family (which it ) there's a bunch of life skills that you miss out on, because you only have the unhelpful examples to learn from.   \n\n\nNow the life skills that you miss out on can be extremely varied depending on the kinds of issues your family had. For example, I know one person who was neglected physically and had a mother with an eating disorder. They had to learn personal grooming and how to have a healthy relationship with food. My best friend had absolutely no discipline at home, so had to learn to take constructive criticism calmly. Me personally, my family was middle class and we were materially and physically well provided for. My big challenge was having two very judgemental, critical parents. My dad was very controlling & aggressive with an anger problem. My mum was very sensitive and quick to blame others. Neither of my parents had any friends and we were very isolated because we moved around a lot & didn't have extended family near us.   \n\n\nSo some of the rules I had learnt were: it's acceptable to criticize others & boss them around when you feel you are right. You can treat people with rudeness if you disagree with them. If people are wrong you have \"won\" and you can make fun of them. When someone leaves the room it is ok to gossip about them to others.   \n\n\nUnsurprisingly, none of the other kids wanted to hang out with me.   \n\n\n**I didn't know any better.** It's not a child's responsibility to teach themselves how to behave - we are all reliant on the examples of adults around us for that. You did the best you could with the limited resources you had access to at the time. You were adaptable and resourceful and it got you this far - sometimes the solutions we come up with as children are really quite ingenious. \n\nIt is not your fault and in a fair world it wouldn't have happened. However, now that we are adults, it is our responsibility to take ownership of our issues. (If you're already at this point then great! Sorry if you've already realized this - I'm just saying this as it was something I had to learn).   \n\n\nAs I got a bit older, I realised that my social skills were seriously lacking and tried to set about changing them. After three years of lot of clumsy attempts, a LOT of social mistakes and awkwardness, loneliness, trial-and-error, watching/ mimicking others & surfing the web for advice (see resources) and a fresh start at college, I was in a much better place socially aged 19. However at this point I was starting to realise that my family wasn't like other people's families. Other people's parents actually seemed to enjoy having them around. Other young people my age didn't get screamed at, slapped, humiliated and weren't terrified of their dad. People were kind of shocked at the sorts of things I'd accepted as normal - and I realised that what had been happening was emotional abuse (with some aspects of physical and financial abuse). Unfortunately, my new found freedom and standing up for myself led to much worse conflicts at home, culminating in an incident where my dad pinned me to the wall and screamed in my face. My dad had been charging me rent at \"market rate\" (£100 a week - and no, he didn't need the money) and demanding I did 3 hours of housework a week while I was working full time. I was out of the house as much as possible, I cooked and bought all of my own food, tidied up after myself, tried to keep out of the way as much as possible. I realised that no matter what I did, I was still going to get shouted at and blamed, and I had enough. I thought - screw this. I can get my own place for less money without the privilege of being screamed at and threatened. I moved out and completely cut contact with my parents at aged 21.   \n\n\nThen as an adult, life got a lot better. I wasn't living with my parents any more and constantly getting put down. I felt great. I had my first full time job and was able to start weekly counselling. I learnt to deal with my feelings and unpack the trauma & some of the unhelpful beliefs from my family. After a year and a half I was feeling so much better. I had learnt emotional regulation, what was and wasn't appropriate to expect from relationships. My depression had lifted & felt I had talked about my history & the emotional abuse all I needed. I scrimped & saved up for three years then went into full time study & completed a degree, got another job straight after graduation. I learnt to drive and bought my first car (financed it all myself). I met my boyfriend, who was extremely loving and caring. He always knew the right thing to say, he made me feel amazing and knew how to calm me down when I was anxious and cheer me up when I was down. I moved in with him after a year of long-distance. Everything was looking up. I'd made it.  \n\n\nUntil it all fell apart. It started with relationship issues. We began to argue a lot. I was a lot more tidy and logical, he was more laid back and easy going than I was. But little things started to really wind me up that he and I found myself getting really irritable with him frequently. I was just trying to improve things for both of us and make it better. If I could just make him see it my way, we'd have a much more tidy home and I wouldn't feel so irritable about it. If he was just a bit more considerate and said things in a slightly different way, I'd feel a bit better. That's what you do in relationships, right? You're supposed to rely on eachother and ask for what you need? But however I asked, whether it was nicely or sometimes with irritation, it was never long until I started feeling annoyed by something else. He struggled with conflict as well - but whereas I was eager to get everything resolved immediately, he would avoid it. He told me over and over \"you're being too critical... it's your tone of voice. You can't speak to me like that\". We recognised we were having issues and went to relationship counselling. I had high hopes for it because personal therapy had been so helpful. We just needed to learn relationship skills, I thought. However, we went for a few sessions...and didn't really connect with the counsellor. Changed counsellor. Again, it didn't seem a good match. Whenever we tried to talk about issues it just went round in circles. So after a few sessions we stopped going. Unsurprisingly the issues didn't go away on their own and went on for another half a year. My boyfriend had gotten really withdrawn and distant. He stopped wanting to have sex pretty much at all. He said it was work problems, he said he also had depression. He'd been really supportive when I was doing my degree and I knew what depression was like, so of course I wanted to help him and support him too. I tried to give him the time and space he needed, but seeing him so unhappy made me really anxious. I really needed him and I really needed reassurance, but I was also resentful of the way he was making me feel so anxious, it would all build up inside of me and I'd blow up about something minor, he'd withdraw even more and it would go on....", "permalink": "/r/DecidingToBeBetter/comments/q5otq3/current_toxic_person_looking_for_advice_from/hh2aj70/"}