{"id": "t5_2tand_t3_nihct9_t1_gz2yb36", "creation": 1621709052, "origin": "t5_2tand_t3_nihct9", "height": 1, "replied_to": "t5_2tand_t3_nihct9", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "weareonarockinspace", "text": "I’m glad I could be helpful. I just read your post history. You’re clearly a very smart person. You’re self reflective,  self aware,  and you care about your relationships and other people’s feelings. Getting your own anxiety under control is paramount to being able to share all of these gifts that you already have with another person. It’s a process that takes time and continued intention. There’s not a quick fix to returning home to yourself, loving yourself and recognizing that you/ are ok as you are. That where you are now is ok... \n\nIt’s not wrong to be anxious, but developing a kind relationship toward your anxiety and knowing yourself is very important to healing and creating space for it. You seem like a person who may really benefit from the support of a therapist because you already have the awareness of your state and the drive to change your thought patterns, you just might benefit from someone helping to support you in developing the tools and language to do so more effectively. In my opinion, therapy is only really helpful if you have a therapist that you build a positive relationship with and you feel understands you. I also recommend meditation. I have experienced tons of anxiety in life and meditation is the one tool that has really helped me manage it and understand myself better. I’m extremely optimistic for you! You’re always welcome to message me if you’d like. Or anyone else who might read this and needs someone to talk to. I’m just a regular person with my own problems, but I think about this stuff a lot and have grown and I’m happy to help anyone if I can.", "permalink": "/r/DecidingToBeBetter/comments/nihct9/the_thought_of_getting_close_to_someone_triggers/gz2yb36/"}