{"id": "t5_2tand_t3_dygyro_t1_f84yy90", "creation": 1574263966, "origin": "t5_2tand_t3_dygyro", "height": 1, "replied_to": "t5_2tand_t3_dygyro", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "butwhatsmyname", "text": "Hey, this isn't a quick or an easy thing to do. Things didn't work out the way you'd hoped with the workout group, and that probably feels shitty, but you've now got that experience on board as you look at your options. Having identified tactics and approaches which *don't* work well for you is incredibly useful. The fact that you made the attempt at all? Solid evidence that you're ready to make a change and you're willing to put the work in. \n\nThere's something which might help you out while you're working on this. I have a problem with being over-critical of people around me in my head sometimes. People not looking where they're going. People behaving selfishly or thoughtlessly. Whenever one of those thoughts pops into my head I try and pick out something to compliment about the person I've been picky about. It can be anything - I can see they've made an effort with their hair. I like their shoes. They look like they're confident about where they're going today. It seems like they're doing their best in a hard time. Whatever. I pick something which I find positive about them and kind of... say it out loud in my head? It makes me feel surprisingly positive and reduces my stress.\n\nI also try and make supportive comments on Reddit when I can. I'm subscribed to DecidingToBeBetter, BrokeHobbies and Casual conversation and I try and encourage effort, persistence, kindness, patience. I like myself better when I am kind to others, and it makes me less critical of others. \n\nAnything you do which lightens your load and makes you feel better about people is worth doing. Every inch forward is progress. You're already pushing forward with this. Hang in there.", "permalink": "/r/DecidingToBeBetter/comments/dygyro/i_am_a_chronic_complainer_and_it_affects_me_at/f84yy90/"}