{"id": "t5_2tand_t3_dygyro_t1_f84ch3l", "creation": 1574241075, "origin": "t5_2tand_t3_dygyro", "height": 1, "replied_to": "t5_2tand_t3_dygyro", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "butwhatsmyname", "text": "I get you completely. I had an issue with that too, to some extent. For me, that too stemmed from insecurity - making fun of things with sarcasm, and only being negative about whatever's going on means that nobody can ever pin you down about things you actually care about. Keeps you safe. Anybody tries to behave that way toward you and they're punching at fog. \n\nBut it feels shitty, doesn't it. Maybe not at the time, but at the end of a day you find that you haven't had any warm, pleasant, kind, sincere, or affectionate human interaction. And then you realise that you're kind of trapped, because after a while you only really hang out with other people who behave the same way. \n\nI guess for me the key thing was deciding that I didn't want to feel that loneliness anymore, and deciding to just try shit out until I hit on something that worked. The thing that really started to make a difference was spending time with different people. I'm not saying you have to drop everyone and start over, but you do need to seek out a situation where people talk and behave differently.\n\nI got into theatre and tried out some musical stuff too. I started doing a similar thing to the issue with complaining, I just held back for a while. I'd nod and chuckle, but I just let the conversations go on around me. It was scary. Sarcasm, complaint, negativity, were all ways that I \"bonded\" with the people around me and attempting to be more sincere was fucking terrifying, especially after I myself had trash talked that kind of thing in the past.\n\nBut I didn't want to be that person anymore, so I decided I had to stop caring about what that person would say. \n\nLearning to stand up for myself against the voices of my old bad habits was fucking hard. But it saved me. Once I'd started having conversations about things I was excited about or genuinely interested in, it was addictive. When you're sarcastic and negative, people around you shut down to keep themselves safe from that. As soon as you start being more neutral and open, you'll find that other people (especially ones who didn't know Negative You all that well) will open up too.\n\nIt's less lonely and more fulfilling. You can definitely do that.", "permalink": "/r/DecidingToBeBetter/comments/dygyro/i_am_a_chronic_complainer_and_it_affects_me_at/f84ch3l/"}