{"id": "t5_2tand_t3_m0yhhe_t1_gqatsfg", "creation": 1615269624, "origin": "t5_2tand_t3_m0yhhe", "height": 1, "replied_to": "t5_2tand_t3_m0yhhe", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ray-Flower", "text": "I've been there. I find the least fun and most hopelessness-inducing years of my life were spent in school. I was picked on, always rejected for a number of different reasons, didn't have any friends, and had drama-filled online relationships. I'm also the type of person to think of love and relationships a lot, so it wasn't fun. \n\nWhat I can tell you is that the moment I graduated and moved elsewhere to pursue my future career was when things got better, for me personally. Wasn't too happy with my family and living situation, and the town I was in was very negative. After I moved I made some new friends and the town I'm still living in now is beautiful. \n\nThe things that made the biggest difference in my life is having a dream, and taking action towards that dream. Thinking about what it is I want to do and just decide that I am going to be passionate about what I want to do, and do it! If I'm feeling like shit, I do my future self a favor and work towards my dream, because it's not about how I feel, it's about what I want deep down inside. My desires give me courage to do things I'm scared of doing. \n\n/r/getdisciplined/comments/1q96b5/i_just_dont_care_about_myself/cdah4af/\nThis comment has some great advice for feeling better about yourself and just being happy being yourself! I do those 4 things daily and it gives me such a feeling of empowerment, as someone who used to be really depressed all the time. I took some expensive self development coaching on achieving success and happiness in my life, and points 2 and 3 in that comment are crucial to being happy. \n\nLove yourself! Treat yourself to nice things! Treat yourself like you're your own best friend! You can only love others When you love yourself. When you are happy, it will attract the happiness of others. Love is a universal force of good: nothing can EVER stay negative if you put enough love into it! No one ever stays angry or sad if you tickle them enough. Remember that. If you close your eyes and focus your thoughts as \"I truly love myself in every way now\", your state of mind will shift dramatically, but only should you truly desire and believe in it, because if you don't believe, it simply just won't work. \n\nIf you want to improve yourself and have some really powerful mental and social tools, I recommend reading the book \"You were born rich\" by Bob Proctor. It is an amazing book that goes into many areas of life like how our mind works, why we feel stuck and, how to break out of our downwards spiral. I'm currently reading it and my self development coach founded his teachings from Bob's lessons. Bob is an amazing self development teacher who has spent his life learning and teaching others on self development. If you do anything, get this book and read it. Practice it. It will break you out. \n\nI hope this helps. Life sucked for me in school and I never want to go back, life gets way better as you get older.", "permalink": "/r/DecidingToBeBetter/comments/m0yhhe/problems_with_selfworth_and_selfsteem_want_to/gqatsfg/"}