{"id": "t5_2tand_t3_p83dea_t1_h9owg8t", "creation": 1629483059, "origin": "t5_2tand_t3_p83dea", "height": 1, "replied_to": "t5_2tand_t3_p83dea", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "danckest", "text": "For me the easiest thing is not to focus on myself, but put my focus on the world around me.\n\nFor example, if I was to for a new relationship (does not matter if romantic or not), I usually focus on what the other person has to say, more than what I will be responding. I am also comfortable with silences, not trying to force a conversation, it seems more natural to me.\n\nWith any sports related activities, I think that it is important to first asses your own skills. If you are joining a group sports activity that you are just starting out, then just joint beginners class. Then it is easy not to be afraid, since everyone is a beginner. There will be times, when you might feel discouraged because you are failing, or because it is a bad workout day, but everyone gets those. I try to be the person that  accepts when a teammate makes a mistake and encourages them to keep going. This usually spreads and created a supportive environment. If you are not in a supportive environment, then change it and find one that is. This can be applicable also for other skills, e.g. learning a new language. People that are already skilled at that and see you trying would \\[1\\] be happy that other people are also learning it, \\[2\\] might offer you help or advice. So try to see that as an opportunity.\n\nAny other people that are judging you for trying to improve yourself, while not being in the community are irrelevant. Those are not the kid of people you want to associate with. If someone in your life is judging you for trying to be better, then you should evaluate if you want to keep them in your life.\n\nKeep going, keep learning. Your future self will thank you later.", "permalink": "/r/DecidingToBeBetter/comments/p83dea/how_to_not_be_afraid_of_being_seen_trying/h9owg8t/"}