{"id": "t5_2tand_t3_pce9m1_t1_halgihn", "creation": 1630093037, "origin": "t5_2tand_t3_pce9m1", "height": 1, "replied_to": "t5_2tand_t3_pce9m1", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "The_Dude_of_Pala", "text": "Well... It sounds like you're the 24yo version of myself. I was a Type-A, anal retentive go getter with everything to prove. I slept 2-3 hours a night and worked a 100 hours a week. My mind was so busy that my thoughts had thoughts... I'm an analytical thinker so even driving down the road I was developing code in my head and trying to invent a new method for mending fences, because I saw a broken fence. My mind was a busy place. By the time I was in my 30's I was going through severe cycles of anxiety and deep depression. Around 37 I had a legitimate breakdown and attempted suicide. It left me hospitalized for over a month. You'd think that would have been enough for me to take inventory and reevaluate my life, but nope. I eased back into work and a few years later was right back in the thick of it. \n\nIt wasn't until I was in my 40's that I pretty much gave up and then really asked myself \"what the hell for?\" I had a six figure career, house, kids, all that stuff, but I was still an unhappy mess. I'd been in therapy off and on since childhood, but this time I was able to turn my thinking brain off and just sit back. I spent weeks just drinking coffee on the porch wondering what to do without doing it the way I'd always done it. \n\nI have some pretty messed childhood tramas so I started reading C.J. Jung, William James, etc... Dr. Hawkins and so on, exploring my past and learning to let go. Then I read Don Miguel Ruiz books and started listening to Alan Watts and Ram Dass. My perspectives were changing I was thinking less, no more anxiety and fewer of those migraines you're talking about. Eventually I started practicing Taoism (and Dudeism). I felt much more relaxed, I was meditating, successfully, which I had failed at for decades and generally felt better. I developed a healthy \"fu*k it\" attitude, I don't care what people think anymore, I don't worry about providing unsolicited advice or solutions and I realize everything people say is literally \"just their opinion, man.\" A few years practicing Taoism I became interested in Soto/Zen Buddhism and that's been my guiding philosophy and way of life for a few years now. \n\nI'm not advocating Taoism or Buddhism, I find Christian Mysticism to be very interesting too. What I am sorta suggesting is that for busy-body over thinkers like us it's very beneficial to become comfortable with NOT Thinking. Simplicity is key, too. Besides this reddit account I don't have any other social media, I don't really watch TV or listen to the radio. I listen to classical music or Rekei and I try to stick to watching \"wholesome\" shows or YouTube channels. I definitely don't watch the news or politics or anything like that anymore. Keeping it simple, keeping my focus on myself and my family and friends keeps me plenty occupied. My daily routine consists of a little meditation, a few chores and some side work, practicing mindfulness throughout the day. It might sound boring but it's the most peaceful and whole my life's ever been.", "permalink": "/r/DecidingToBeBetter/comments/pce9m1/what_even_is_relaxing/halgihn/"}