{"id": "t5_2tand_t3_6r1c1o_t1_dl21j5a", "creation": 1501675862, "origin": "t5_2tand_t3_6r1c1o", "height": 1, "replied_to": "t5_2tand_t3_6r1c1o", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "This all seems extremely familiar to me, and I want to say I know what you are going through and I wish I was somewhere on the other side telling you exactly where you need to go, but the truth is I'm probably a quite few steps behind you. Hopefully I can give some perspective though, and maybe tell you something that I'd like to hear myself.\n\nFirst off, I think it's great you've found a creative outlet. A lot of people spend years finding something worthwhile or are just too content to put in the effort required. You've already overcome so much and put yourself on the right track in so many different areas recently, and you just need to keep going and keep trying to find little things to improve on. To improve on your own well-being. This goes for the OCD, the anxiety, the brain-fog and the self-hatred as well. These aren't permanent states and you won't have to deal with them forever, but they also won't disappear overnight. They are more like brain loops established due to your toxic environment and negative self-talk, and they are trying to keep themselves alive. Think of it like psychological debt. Or to use a more inspiring metaphor: it's like your brain is out of shape. You've spent so many years eating junk and doing not doing anything good for your own mental well-being, and it's going to take some time with proper diet and exercise to get to decent level. But just like you always see quick progress at first when exercising, the problems you are facing will also take a shorter time than you think to diminish. You won't have to spend 20 years in a buddhist monastery to solve your problems, and you won't have to solve them all at once. I know, it's gonna suck, and I know the feeling of trying to rebuild your mind essentially, but you have to use your broken mind to do that, which is kind of where this whole spiral began. It's kind of like trying to fix up a house but you only have a sledgehammer at your disposal. But I believe that spiral goes both ways. I believe that momentum will make these things easier. It's not a grind; it's an avalanche. Slow trickles at first here and there, but eventually it escalates, and what seemingly had no correlation before, is helping to build up that momentum. \n\nI'm going to use the writing here as an example of how you maybe could use some of the same approaches to some of your other issues. If you are just starting out writing, know that you are going to suck. Even if you've written something before, the reason you are not getting anything done, is that you are too committed to your work. I'm the same way, and I know exactly what's so problematic about that situation, but you literally have to not give a fuck. Your creative outlet will have a lot of shit that needs to get out before the good stuff comes. Think of it like the shit is clogging the pipes, and you just need to get it out of the way. Just write an article or whatever format you choose once a day, or even more, and then just get it out of your way. You don't have to spend a lot of time on it, but I guarantee that once you start actually finishing things, you will want to keep going. You will end up finding yourself the funniest person alive for a few moments a day, once you get through that mountain of shit in your way. You don't have to hate that process though. Revel in the shit. Have fun with it. Try deliberately to write the shittiest thing you can come up with and laugh at it afterwards. Don't get hung up on stuff like \"using your time effectively\"; that's bullshit. You just need to be writing. And if you ever find yourself getting stuck: write about something that pisses you off. Get the anger and frustration out of the way.\n\nAs for the brain-fog/OCD/anxiety, it's probably stress/PTSD related, at least I think it is for me, and I can only talk from my own experience and how my own shitty brain operates sometimes, but your situation seems very familiar to me. It's like there's a bunch of little circuits that once served a purpose or got strengthened over time through some destructive behavior but are now obsolete, so they just keep going without much purpose, constantly splitting your attention, and some might even be causing you stress if they are related to negative experiences in the past or anxiety about the future. The only way to get rid of them is to starve them of attention. Circuits that aren't being used will eventually get repurposed, but they continue to have a purpose as long as you give them attention. This is much harder than it sounds, but I believe meditation is a good exercise for this, but eventually you are going to want to take the practice with you outside of your meditation practice. For instance, say you want to spend a certain period of time writing, but you keep getting distracted by your OCD and anxiety. Instead of letting it take over, try being aware of the physical sensation for a little while and then turn your attention back to writing. You are probably going to suck at this at first as well, but I think everyone sucks at this. It's just that most people don't have enough accumulated issues for it to interfere heavily with their daily lives and aspirations.\n\nThis ended up being longer than I intended, and I'm can't keep writing anymore at this time. Let me know if you want me to elaborate somewhere.\n\ntl;dr: You are on the right track. Don't be too impatient with yourself, that will only leave to setbacks. \n\n", "permalink": "/r/DecidingToBeBetter/comments/6r1c1o/some_questions_about_brain_fog_purpose/dl21j5a/"}