{"id": "t5_2tand_t3_6r1c1o_t1_dl9l9ut", "creation": 1502072960, "origin": "t5_2tand_t3_6r1c1o", "height": 1, "replied_to": "t5_2tand_t3_6r1c1o", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "punchitchewy", "text": "Thanks!\n\nSorry for the late reply. I usually get deflated by shame after pouring my heart out online (or in person) and am afraid to check my messages (or see the person) for a while after...mostly in case someone has decided to attack me...I'm learning how to nut up and just get it over with more cuz it's rarely bad and I don't want to be so meek haha.\n\nI don't think I can commit to a book at the moment (lots of other new challenges in my life right now taking most of my energy) but I'd be up for something smaller, maybe an article? \n\nI often wonder what i would write about. There is this constant voice or feeling that wants me to be able to explain \"my story\" and what the significance of all the struggles and triumphs are and how they all led to me getting to a much better place...even though I'm not there yet, it's as if I'm supposed to write it that way. I know it can be annoying when people talk in a high minded way about what they are \"supposed\" to do...(or maybe that's just my judgment, I don't know, frigging ego vs super ego vs society vs a;skdjgskg god it's all so confusing)...and so I just describe this voice that way because I don't know how else to describe it, even though I'm cynical about whether it actually is a higher calling. Unfortunately the stronger voice in me says \"nope, it's just a messed up repetitive  thought that has something to do with your obsessive mind and years of indoctrination from new-agey sources that have proliferated in the past few decades\"...\n\nAt this point I am unsure if I'm best just spending my energy humbling myself and cracking away at cultivating the discipline and focus I've always run from (I think it's called growing up?) or taking on some grand higher purpose...of course I could just do a little but of the \"higher purpose\" stuff, i.e- a bit of writing here and there....but the old perfectionist in my wants to be an inspirational, ground breaking, insightful, hilarious, world changing maven of some subject or another...god he's such an egotistical dickhead.\n\nI definitely feel like much of what I've learned from decades of flailing and grasping for help from so many different sources could be of use to someone else since we live in a society where it's normal for people not to seek help. Just the fact that I sought help so often gives me some experience that a lot of people don't have, even if I wasn't applying myself as studiously as I could have in all of those wellness pursuits...at least I've got the experience which could be more powerful thank I think. I've come to this realization in recent months, though I'm wary of the ego pumping me up since it's so full of shit so often....though it's nice to think that I might be able to actually help people. I definitely see how turning around and being able to help someone through the mess I've been in could accelerate my own healing and fortify some of the positive pieces of my self image that have sprouted up in lonely corners of my heart in the past few years.\n\n", "permalink": "/r/DecidingToBeBetter/comments/6r1c1o/some_questions_about_brain_fog_purpose/dl9l9ut/"}