{"id": "t5_2tand_t3_6r1c1o_t1_dl25ern", "creation": 1501681569, "origin": "t5_2tand_t3_6r1c1o", "height": 1, "replied_to": "t5_2tand_t3_6r1c1o", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "It's no wonder you have a foggy mind when you're working two jobs and dealing with personal problems. And if you really do have Borderline (or something similar), then your brain fog may be some low scale dissociation (which your brain is doing to give itself a little vacation from the work it's doing all day long). Either way, your day to day life is about doing, searching, and completing, and not for pleasure. If that's what your life is about right now, it can be hard for you to get into something that feels extracurricular, like art or anything creative.\n\nSit down and figure out how long you need to work a second job. Make a plan and decide that this is a temporary situation. Simply making that decision is likely to change your perspective, but knowing exactly how long you have left will really solidify the feeling.\n\nKeep doing the therapy/soul searching for as long as it helps you, and stop the minute it begins to exhaust you. I was glad to see you've tried EMDR because I have personally found it very helpful. I think another underrated form of therapy is simply to go out and do something fun. Take a solo vacation and try to socialize with strangers. Make a habit of laughing at yourself when you're alone. Do something that maybe has no creative purpose, but is still just for fun. There are the things that keep people going, and it's easy to forget them when you're living in your head and dealing with yourself every single day. Creativity is clearly not something you are neglecting or something you lack-- you're just tired AF and right now that part of your mind is taking a backseat to the duties that feel more \"necessary\" to you.\n\nSo much of this is about finding your mojo again. Most people who work long hours and don't have passion projects lose their mojo, or search for it in projects that don't actually inspire passion in them. Don't do the things you think you should be doing, do the ones that brighten you up.", "permalink": "/r/DecidingToBeBetter/comments/6r1c1o/some_questions_about_brain_fog_purpose/dl25ern/"}