{"id": "t5_2tand_t3_nk4zxj_t1_gzbyecy", "creation": 1621899446, "origin": "t5_2tand_t3_nk4zxj", "height": 1, "replied_to": "t5_2tand_t3_nk4zxj", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KermitSamurai", "text": "I have set up a budget for myself to spend less than $50 every week in groceries, and I typically spend between $25-$40 most weeks. I have an Instant Pot and a slow cooker -- I use these, along with recipes I find online or in books, to meal prep for the week. \n\nI avoid most of the grocery story -- most of it is overpriced garbage. I only ever leave the produce/deli section to get spices. I don't even look at anything with a box anymore, if I can help it. It might not seem like it, but you really do overpay when you reach for a package.\n\nAnyway, I find recipes that have a serving of about 4 and portion it out for the week. If I have time I use a slow cooker and prep the work week of lunches and use the Instant Pot at night if I am too tired to cook. \n\nIf you do not have these, that is okay. They are relatively pricey for someone on a budget. My slow cooker was a gift and I saved up for a nice Instant Pot. \n\nCarbs will be your friend, and if you stay away from the prepackaged crap you can find some really healthy options. Potatoes and gourds are great. Also, bananas are a great snack. When you purchase meat, make sure you check for sales in your area as this will be your biggest expense. If you are up for it you can buy a whole roast and portion it out for several weeks if you freeze it. \n\nIntermittent fasting is what I do and allows me to spend so little on groceries. I never eat three hours before bed and I typically eat one meal a day, with lighter snacks/meals if needed.  Intermittent fasting is hard in the beginning if you like to emotional eat, but eventually it is second nature and your body will adjust. There will be a time when it doesn't even say you are hungry until your scheduled time to eat. \n\nHope this helps!", "permalink": "/r/DecidingToBeBetter/comments/nk4zxj/proper_diet_and_nutrition_help/gzbyecy/"}