{"id": "t5_2tand_t3_eoni7c_t1_feet6dx", "creation": 1579040676, "origin": "t5_2tand_t3_eoni7c", "height": 1, "replied_to": "t5_2tand_t3_eoni7c", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Budhungerz", "text": "If you're really ready to quit weed (it sounds like you are), you need to put yourself first. You can't be a pillar of support for your girlfriend and look after your safety when it comes to weed. I say this because weed is an EXTREMELY manipulative and addictive drug. It has the capacity to bend minds into having a smoke for the stupidest reasons. And it is in the early days/weeks and months of quitting anyway, shockingly convincing.\n\nUnless you're both living together, it might be beneficial to explain to her that you both should have a little break with just telephone communication and rely on each other's family and friends who don't smoke (drinking can also lower our defenses and cause us to slip up again, done it countless times).\n\nSome have physical withdrawal symptoms that can last for a couple of weeks. Having brain fog and just feeling  vague and not being able to concentrate, can come and go for many months. What helps this is a healthy diet. Especially with some leafy greens such as spinach. If you don't like spinach, the trick is to not overcook it because it becomes bitter. If boiled for 45 seconds and then thrown into a pan that has cooked some flavoursome sausage and onion and whatever else you like, maybe mushrooms or capsicum etc, it's flavour is much more unoticable. You will see rapid improvement. \n\nAlso, turmeric and fish oil capsules are both extremely beneficial in brain repairing or maintaining cognitive brain function. They would also help you to recover. \n\nYou need to be there for yourself first in order to get strong enough to remain on your sober path. If this girlfriend is meant to be the one, she will understand. Also, often when a couple have used together, getting clean can change the dynamic and it can naturally be the end of a chapter (and sadly, a relationship). Not always of course.\n\nBest of luck to you both. If you're interested in what some of the physical withdrawal symptoms of weed can be, I'm happy to share what mine were with you, all you need do is ask.", "permalink": "/r/DecidingToBeBetter/comments/eoni7c/deciding_to_quit_weed_heres_my_story_and_how_weed/feet6dx/"}