{"id": "t5_2tand_t3_eoni7c_t1_feg8bkj", "creation": 1579081841, "origin": "t5_2tand_t3_eoni7c", "height": 1, "replied_to": "t5_2tand_t3_eoni7c", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "brokester", "text": "The reason why weed doesn't cause physical/chemical addiction is because it's effecting endocannabinoid system(ECS). Other drugs like nicotine, heroine, cocaine, Molly etc are usually affecting the Dopamin/Noradrenalin system. \nThe difference between those systems is that the ECS indirectly affects the dopamine/noradrenaline system and acts more of as a regulatory system. In conclusion weed doesn't effect the noradrenaline/dopamine system directly like other drugs mentioned above.\n\nThe second thing is, that when taking drugs affecting your noradrenaline/dopamine system your body builds up a tolerance by building more receptors for the specific neurotransmitters. Since you have more receptors you need more drugs \"to get high\". This is what you call physical/chemical addiction. When you stop doing these drugs the body \"craves\" more of the same neurotransmitter since you have more receptors for it. Over time they go back to a normal level. During that time you will experience physical withdrawal symptoms. This is basically how physical addiction works.\n\nHowever the ECS doesn't work in the same way. The tolerance of weed is more of a psychological thing. The ECS doesn't produce more receptors and therefore it is not possible to be physically addictive.\n\nIn addition please don't underestimate the psychological addiction of drugs. Especially weed. People act nowadays like it's a little bit harder then coffee. No it's not. I've been smoking weed for almost 10 years now and just like you said I had friends acting like junkies and others who could handle it easily. \nIf you can handle weed in a healthy way that's good. However there are some people with an addictive personality that simply can't. Also just because someone smokes weed every day doesn't mean he is addicted. Some people can simply stop and smoke only from time to time. It is important to note that these people aren't addicts. Everyone can have a phase where they smoke a little bit more weed then usual. Just like when you get a new video game and play for the first week 24/7. Maybe a bad analogy but I hope you get my point.\n\nFor some perspective regarding psychological addiction: \nNicotine is physically addictive for 1-2 days. Doesn't sound that bad right? However most people struggle with the psychological aspect and some fight for years to overcome that addiction.", "permalink": "/r/DecidingToBeBetter/comments/eoni7c/deciding_to_quit_weed_heres_my_story_and_how_weed/feg8bkj/"}