{"id": "t5_2tand_t3_kz0won_t1_gjks2i4", "creation": 1610886713, "origin": "t5_2tand_t3_kz0won", "height": 1, "replied_to": "t5_2tand_t3_kz0won", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "UnendingQuest", "text": "Unfortunately, your life follows you wherever you go.\n\nBy that I mean the reasons why you're struggling are not going to go away just because you move somewhere for a few months. \n\nLogistically, the idea of suddenly making hundreds of dollars per month online with no marketable skills sounds like a fantasy, especially if you're opposed to 'mindless' work.\n\nMindless work is often what you get when you don't have the the qualifications, skills, or experience to get a less mindless job. Is that not a big part of why you're in school?\n\nIf you want to take some time away from school because you don't feel that the degree you're pursuing is going to be the field you want to work in later in life, then that makes a lot of sense. But be prepared to work a mindless job or be dependent on your parent's generosity in the mean time. Sometimes working a crappy job is a good motivator to give college your all when you go back. You can also consider a shorter, less challenging program if there's an applicable career you could see yourself doing.\n\nIf you're just feeling overwhelmed and depressed, but still think you're going to want to continue with your degree, my personal opinion is that you should work through your actual issues where you are now with the support of your family and friends. You could:\n\n- reduce your course load for now\n- get a therapist or counsellor to work on your mental health and learn more about yourself (this can help with your depression, but also with potentially finding your passion or at least your goals)\n- focus on the basics - getting enough sleep, eating right, getting a little exercise, and working on your mental health and find ways to BALANCE that with catching up on and keeping up with your school work. \n\n'Finding yourself' is a life-long endeavour - it never ends; it takes longer than six months. You're always going to have to figure out how to balance working on yourself as a person and figuring out how to relax and learn about and enjoy life WHILE taking care of the necessary life responsibilities. Everyone would love to just run away from their lives every now and then, but then they shake their head, refocus on the real world, and get back to making it all work. \n\nI know, from having been in my early 20's once and having done a LOT of running away from myself and my problems, that I wish I had just stuck to something and stopped running sooner. All of that inner and outer work of mental and physical well-being was still waiting for me when I got back, PLUS the debts from travelling and all the school to get myself into a career. I'm in my mid 30's and only starting my career and its now hard to do things like getting out of student debt, finding a partner, saving for a house or retirement. But I also know from having been young that it's probably the case that none of this will seem important or relevant to you right now and that you're likely going to do what you want to do, but I couldn't help myself from trying to help you see outside of what you're trying to do 🤷", "permalink": "/r/DecidingToBeBetter/comments/kz0won/i_want_to_take_a_breakleave_my_life_for_about_6/gjks2i4/"}