{"id": "t5_2qh5i_t3_mfpf9q_t1_gsouhki", "creation": 1617027695, "origin": "t5_2qh5i_t3_mfpf9q", "height": 1, "replied_to": "t5_2qh5i_t3_mfpf9q", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Lufernaal", "text": "My guess is that looks were and might still be an important thing for you and how you believe people will judge you. \n\nSome people do care about nothing beyond physical appearance to the point that they're willing to accept anything from someone who looks conventionally beautiful.\n\nThe vast majority of us, though, just want someone to be around and to care for us. Attractiveness is part of it, but it's not the only thing most of us care about.\n\nThe way people usually promote crazy standards of beauty today is because they care about the money that comes from these sorts of promotions and not necessarily the actual connections human beings make to one another.\n\nThat's why they put models in the magazines, because they see our superficial attraction to physical fitness as an indicator of what we truly want. Except that's the thing that usually catches our \"animal\" attention, part of our evolutionary makeup. However, that fades and it fades quick.\n\nMost psychological research proves that infatuation and physical attraction doesn't last long. At the end of the day, long term, we care about how the person makes us feel.\n\nIt isn't always easy to remember that, obviously, but it's good that now you're focusing on becoming a better person rather than what the Asian beauty standards say you should be.\n\nOdds are that, if you had succeeded in that, you'd have later found that it was a pointless endeavor, and that people that fit those standards are no more likely to find love and happiness that we all seek than you are. \n\nAs you are now, you have a much better chance to be happy. Welcome to the path of joy and self-love, it's a little scary, but the destination is breathtaking.", "permalink": "/r/happy/comments/mfpf9q/ive_been_hating_myself_for_my_whole_life_i_was/gsouhki/"}