{"id": "t5_2tand_t3_lzfdlr_t1_gq1t7av", "creation": 1615078484, "origin": "t5_2tand_t3_lzfdlr", "height": 1, "replied_to": "t5_2tand_t3_lzfdlr", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Bekah_grace96", "text": "I think the best thing for anyone to do for themselves ever is to see a therapist. Having someone who can walk you through things you’re struggling to understand or can’t have an unbiased understanding of. Growing up with a therapist, I had so much guidance with the social situations I couldn’t figure out. Even now, I find them incredibly difficult and stressful. Not like you, I have not improved with age. However, I do not feel uncomfortable with myself. I learned how to be appropriately direct. I feel comfortable saying things like “I do not understand what I should do, please help.” \n\nI work in a pediatric ICU. Talking to parents is the hardest thing I have ever done. I practice difficult conversations during procedures, in the shower, and even in the car! I’m not ashamed of it. Where my brain lacks in helping me understand the social aspect, it has empowered me to understand the physical aspects, and therefore we save lives. \n\nAnother career I considered and was passionate about was anything to do with animals and animal conservation. After my bachelors degree, I spent a gap year working as a CNA in this same ICU. During this year, I built up anxiety about taking exams to get into medical school, and about doing well in interviews. I very nearly dropped it all and became a zoo keeper! I love animals, and I find that they are much more understandable than humans. \n\nIt sounds like you’ve found something you love, each step you take towards that will build your confidence and passion. \n\nMy advice is don’t worry about your mistakes, don’t over analyze your interactions. Be honest and say you have a hard time with some situations. Move on and learn as you go.", "permalink": "/r/DecidingToBeBetter/comments/lzfdlr/how_do_you_come_to_terms_with_having_a_mental/gq1t7av/"}