{"id": "t5_2tand_t3_mzjsq1_t1_gw1cva9", "creation": 1619521882, "origin": "t5_2tand_t3_mzjsq1", "height": 1, "replied_to": "t5_2tand_t3_mzjsq1", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "strugglinandstrivin", "text": "As someone who struggled/struggles with discipline and lack of energy/motivation a lot, i can say that for me it boils down to just doing it.\n\nThere are many factors which can ignite your motivation and make you do something ( or not), but motivation is fleeting and wont get you far. Maybe for a day, an hour, but never in the long run because there will always be days where you dont feel like it.\n\nFor me, every day is like that thx to depression. So i had to learn how to be disciplined and do shit although i never feel like it and would rather just sleep 24/7.\nAnd unfortunately there are no golden golden Tricks or hints to stay disciplined. IT FUCKING SUCKS.\nI cant count the times i was like \"fuck this shit i would do anything but that. And besides i wanna stay on my couch and chill!\" and then did it anyways.\n\nDont get me wrong. Its hard in the beginning and if youre like me, you think you can never do this... But the more often you overcome yourself, the easier it gets. Its still a battle every single time but im now certain i will win it 9 times out of 10.\n\nI basically started to force myself. Needless to say there were lots of times wasted on sitting around doing nothing, then doing it poorly and so on... But i always forced myself to do it. So if the task for example was writing a book i commited to write that from 1-2 pm and didnt allow anything else. No reddit scrolling, whatsapp chatting etc.and if that meant i just sit there doing nothing because i dont feel like writing that book, i did that.\nTrust me, it becomes boring very fast and theres a point where you would rather do anything than nothing, no matter what it is.\nBecause for a lot of procrastinators, the problem is that they allow themselves to fill that unproductive time with things they enjoy. Sitting on the couch watching netflix, playing video games all day, just going out with friends, whatever. But if you dont allow yourself to enjoy yourselt before you got the work done, you have either do nothing or do the work.\n\nIn the end, life is just a fight against yourself, with yourself. Or its a fight for your self. I seriously dont know. But theres always this mental war going on in yourself, the one who wants to fulfill his dreams against the one who wants to dick around because its way too draining to go after shit.\n\n\nI hope it gives you the right direction to go, but in the end you have to find it out yourself, because everyones different and who knows if my methods work for you.\nAll i can say is you have to treat yourself like a kid you have to care for. The kid never wants to go to the dentist, but he/she has too...now imagine you have to get that kid to go the dentist. The difference is youre both of them, parent and child.\nBecause in the end, we alk have different voices or roles in our head, its not just a shizophrenic phenomenon. You have the procrastinator in you, the opposite guy who wants to fullfill his goals, the child your your parents, the parent of your child, the friend.... And youre not even that. You know. You are neither your thoughts, nor your roles/identities. Theres like a \"bigger guy\" or consciousness in your brain, the one whos above them all so to say and can make the different \"voices/roles\" in your head do what he wants.\n\nSo in the end you, the bigger consciousness, try to collect all the good dudes in your brain and win over the bad guys. So the good guy in your case is the one who gets shit done and the bad  guy the one  who gets nothing done.\nJust remember that when youre faced with your thoughts that go \"i dont wanna do xyz\"\n\nBest of luck! Hope you can overcome that problem, i know how annoying and hard it can be. I was such a super procrastinator i nearly died because i didnt wanna do anything and still found a way.\n\nDont get me wrong i still have no motivation or energy at all and it doesnt get really easier... Sometimes theres even days where i do slip up again. But the difference is astounding and almost unrealistic from the pov of my old self", "permalink": "/r/DecidingToBeBetter/comments/mzjsq1/who_has_unwavering_willpower/gw1cva9/"}