{"id": "t5_2tand_t3_ohjl4c_t1_h4r8ooq", "creation": 1625962401, "origin": "t5_2tand_t3_ohjl4c", "height": 1, "replied_to": "t5_2tand_t3_ohjl4c", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "watermailon", "text": "You’re so welcome! \n\nIt’s really good you’re in therapy, and I’m going to pay you another compliment here and say that it takes a lot out of a person to seek help, and you should give yourself a clap on the back and lots of credit. You have a solid foot in the door. \n\nAs far as my own coping mechanisms, mindfulness has played a big role for me. I try and meditate, take a long walk, or do yoga at least once per day. Honestly OCD is weird and unique because it almost sneaks up on you. Like you don’t know it’s an intrusive thought until you’ve convinced yourself you simply ARE what you’re afraid you are, and you’re spiraling. \n\nMindfulness brings you back to the moment. It doesn’t take OCD away necessarily, but it helps you make peace with the intrusive thoughts. Like yeah, maybe I am a sociopath, psychopath, narcissist, animal abuser, /insert other random “bad thing” here/. But right now, I’m just breathing and that’s all I’m going to do. Or right now, I’m just sitting in my chair and looking at my phone on Reddit. I’ve been doing daily affirmations too, telling myself I am the things I want to be, reminding myself my choices are what make me who I am, not my thoughts. And right now, I’m choosing to be here, and that’s all.\n\nKeep doing what you’re doing. Say 5 nice things about yourself to yourself everyday if you can. Take a few minutes to meditate, if it’s your thing. Really get to know yourself. Ask your therapist about CBT if you feel comfortable, if they haven’t already been practicing it with you. Stop and take time to reward yourself for being you. You’re on the right sub, friend. You’re deciding to be better. One step at a time. ❤️", "permalink": "/r/DecidingToBeBetter/comments/ohjl4c/decided_to_quit_consuming_porn_and_start_becoming/h4r8ooq/"}