{"id": "t5_2tand_t3_ln0376_t1_go05p8b", "creation": 1613741643, "origin": "t5_2tand_t3_ln0376", "height": 1, "replied_to": "t5_2tand_t3_ln0376", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Bro, at this point your clowning yourself, if you are someone that uses weed extensively daily, and cant live without being dependent on it, then clearly you are abusing it because somethings not right in your personal life, that is 99% of the case for EVERYONE. I dont care who the fck you are, the amount of stoners that I have met in my life (Stoner as in smoking morning, mid-day, afternoon, night, DAILY) all had problems that weed was covering up for...\n\nSure, I had the mindset: *if I can smoke forever and be good then why not just be high all the time?*\n\nWant to know why that is a pretty fcking bad idea?\n\nYou start being dependent, if you dont get your dose, you get MOODY as in you get pissed of so easily, not to mention you get side effects such as waking up DRENCHED in Sweat and a lot more depending on people...\n\nAs I said, being a stoner isnt ''cool'' anymore, you are literally fcking up, not only your body, but your mind, I have yet to meet a stoner that hasnt lost kg/pounds of weight that isnt skinny and quite literally ''slow'' in doing basic shit in life it becomes frustrating living with one...\n\nI was classified as still being energetic and getting shit done, but doing things that required going above and beyond from your daily routine, I wouldnt care/bother.\n\n&#x200B;\n\nagain sure not everyone is like that, since you claim...\n\nBut I have yet to meet any stoner irl that isnt a wreck and hiding their pain personally...\n\nJust like any drug, abusing it a srtong no-go, no one can fool me in saying being 24/7 high has helped them..\n\n**PS.** I do still smoke weed every night, once I finish what I have to do I smoke 1-3 joints at night when gaming, chilling with friends or just watcing tv etc...\n\nBut the days where I would wake and bake and smoke 10+ joints a day are long over, and for good reason...", "permalink": "/r/DecidingToBeBetter/comments/ln0376/decided_to_cut_weed_because_my_memory_and/go05p8b/"}