{"id": "t5_2tand_t3_n7ee8r_t1_gxek3h2", "creation": 1620493050, "origin": "t5_2tand_t3_n7ee8r", "height": 1, "replied_to": "t5_2tand_t3_n7ee8r", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AmyLinetti", "text": "Hi guys! I did not expect this sort of reply. I’m so glad it resonated and hope it helps some of you out there. I was very low in my life for many years until I got to the point of knowing I was going down the path of one day taking my life. I couldn’t find a way out and kept digging the hole deeper. My surroundings were unfortunately only making it worse. I saw a very cheap trip on travelpirates.con to Thailand by chance or maybe I think a friend sent it to me. It was a round trip ticket for like $450. I stared for so long. At the time I was unemployed and had like 1,000 in my bank account. I just remember staring at it and thinking I have to go. I have to leave. I spoke to a friend and did some research on line and found out I could get by with like $800 per month backpacking and even less if I stayed put in one town and just rented a spot. I booked it for the earliest allowed departure and latest possible return within that price deal, and began to do everything to save up extra cash. I borrowed a few hundred from my mom, sold items, got money for blood donations. Literally, any way I could scrounge up some cash. I just knew I had to leave or I was going to die. \n\nFrom the moment I stepped foot in that airport until the moment I was forced to return, I was happy. I went from being suicidal, crying daily, binging food and tv, losing touch with my friends from the shame and just slowly dying while alive ——- to feeling hopeful, happy and myself again —— all with a simple separation of my situation. It was financially tight but I was so fucking happy. Of course I had some frustrating days - backpacking ain’t easy! - but I was just so ALIVE! In a world away from mine, I got away from expectations I failed to meet, criticisms of my person or personality, reminders of my misery. I got to be myself without all the hang ups that drag me down, and have wonderful experiences because of it. It reminded me that I’m actually quite fucking wonderful, and just because the world around me and my own inner thoughts disagreed, did not mean the rest of the world did.\n\nThis taught me I didn’t want to die at all. I wanted to live. But I wanted to live in a world where I didn’t live with the constant feeling I was a worthless piece of shit. Sometimes, all you need is a fresh perspective. \n\nWhen I returned, it took about 6 months for me to be right back where I was before the trip. It’s then I learned my second lesson: I’m part of my own problem. Yes, the world around me hurts me, but I have to work for myself. When I found myself low again, I realized I had to go to therapy and my therapist suggested I do volunteer work. It helped a lot. Stepping outside of my own needs and giving my love to others who don’t criticize or reject the love I give gave me a sense of worth and identity again. \n\nThe road away from those redundant feelings of wanting to die has not been linear. But one thing I will say, learning these two things has pushed me to pay more attention to how I function, how things affect me and how I can do better for myself. It’s one step at a time, my friends. The only way out is through. \n\n🖤", "permalink": "/r/DecidingToBeBetter/comments/n7ee8r/i_almost_took_my_life_tonight_but_decided_to_not/gxek3h2/"}