{"id": "t5_2tand_t3_n7ee8r_t1_gxel64j", "creation": 1620493568, "origin": "t5_2tand_t3_n7ee8r", "height": 1, "replied_to": "t5_2tand_t3_n7ee8r", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AmyLinetti", "text": "Side note: as I mentioned before, perspective really helps. There’s a quote from Always Sunny where Frank says, “I don’t know how many years on this earth I have left. I’m gonna get real weird with it.” And I just laugh and remember THAT’s the way to think. Life isn’t promised and I can either spend it getting bogged down by hang ups or just get real weird with it and enjoy ittt. \n\nAlso, just therapeutic things that have worked for me: I do sessions with old versions of me. So, I put on music or shows or do things old me used to do, even old depressed versions of me. I do this ESPECIALLY with phases of my life I sort of ignore bc I think that must be when lots of internal trauma developed which is why my memories don’t like to revisit those years. So I’ll sit and watch a show I loved when I was 24. Or listen to music I used to rock out to at 14. When I “hang out” with old versions of me it does a few things: 1. Brings about particular feelings I had then - some are joyful and some remind me of how sad I was 2. Allows me to see that “me” from a distance and I can allow for some sincere sympathy to develop. I want to give that younger version so much love. My brain then starts to register I am still that person and if old me deserves my nurture, so does current me. So it has been teaching me to support and love myself the way I wish younger me had been. And it teaches me to not talk down to myself as much bc I’ve been mentally abusing my own self my whole life 3. It reminds me how REAL everything felt to me back then but now those things have passed which means that as real as anything might feel NOW it, too, will pass so I shouldn’t give my worries so much weight. \n\nK I hope any of this helps. Maybe not. But I know what feeling hopeless feels like and I share this bc I hope that maybe it will help you like it has me. \n\nLove yourselves.", "permalink": "/r/DecidingToBeBetter/comments/n7ee8r/i_almost_took_my_life_tonight_but_decided_to_not/gxel64j/"}