{"id": "t5_2tand_t3_ivk1uw_t1_g5t574v", "creation": 1600520228, "origin": "t5_2tand_t3_ivk1uw", "height": 1, "replied_to": "t5_2tand_t3_ivk1uw", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "manicboi_vs_mania", "text": "This is your story. \n\nSome people have started behind you and may surpass you. Some people may have started ahead and got addicted to alcohol. Some people seem to have it together and don’t. Some people don’t seem to have it together but they’re on the verge of figuring it out. Your situation is complicated, and no one’s is any simpler.\n\nThis is tossed around so much.. but it’s true:\n“Compare yourself to who you were yesterday rather than who someone else is today.” (Edit: See, u/wiresided beat me to it.)\n\nThe ONLY WAY to be satisfied with yourself is to keep improving. Don’t set a marker for the point at which you can no longer improve, instead lead a lifestyle and follow a goal that requires CONTINUAL IMPROVEMENT. Notice I say “satisfied” and not “happy”. Happy isn’t a beneficial/productive thing, satisfaction is. Happy doesn’t help someone sleep the way a day of productivity does. Happiness can be acquired without satisfaction and sometimes satisfaction doesn’t bring happiness. Sometimes to get that satisfaction with yourself, it can be a very testing and uncomfortable situation. \n\nBe happy when you die. Until then, keep showing *yourself* how good *you* can be. When you can finally say you’re a good man, everyone around you may have already been seeing it and saying it. That wouldn’t matter because *you* don’t know yet. The type of man you’ll become is determined by what you put into yourself, not what others put into you, by what you recognize within yourself rather than how you compare to others. Please take a healthy pride, if not in who you are now, in who you plan on becoming and what you’re doing to get there. \n\nSocial-media is what it is. I’d suggest you narrow it down to people you actually care about. I have 19 Facebook friends and I could even delete some of those. I am, however, a hermit.. your list might be 50 or it might be 10 depending on how close you are with your family and whatever. I *do* recommend you purge that list though, and it’s not like significant life-changing thing.. it just feels like freedom.", "permalink": "/r/DecidingToBeBetter/comments/ivk1uw/i_cant_stop_comparing_myself_to_others_and_its/g5t574v/"}