{"id": "t5_2tand_t3_pnlwwm_t1_hcqsn1r", "creation": 1631569803, "origin": "t5_2tand_t3_pnlwwm", "height": 1, "replied_to": "t5_2tand_t3_pnlwwm", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "neverawake8008", "text": "The key to happiness is wanting what you have, not having what you want. \n\nIf you are having a hard time controlling your thoughts, you need more physical activity. Being physically tired helps tire the mind.\n\nTake up volunteer work. Find something that takes you to the streets like a food truck that provides meals for the homeless. \n\nIf you can find the time, take a trip to a third world country. You can find mission trips, not all are religious based, online. Stay at least three weeks if at all possible. \n\nI bet your dad would be happy to give you the time and the money for such a venture. \n\nThe Red Cross takes disaster relief volunteers. They do on call hours as relief aids to house fire victims. They also activate in national disasters. Going for 3 weeks at a time. \n\nIn my experience, seeing how happy the poorest of the poor can be despite of being hungry, and how grateful they are when you bring them food, makes it so much easier to appreciate what you have. \n\nIt really helps you appreciate family too. As Americans we don’t usually have the quality time with our extend families as they do in other cultures. Having that bond with family is what helps them stay positive in times when most Americans would be besides themselves.\n\nI’d like to know your outcome. You can find a way out of this. It’s a life or death situation for you, humans are great under that kind of pressure.\n\nI get you won’t die wo your luxuries. BUT it will be permanent death to life as you have known it.\n\nLife and death situations change you. My neighbor and I have both survived them. We’ve bonded and become friends based on that. Outwardly it’s an odd friendship but that common denominator is such a strong influence on your life after the fact, all the other differences wash out. \n\nIt’s pretty easy to spot people who haven’t had them. I wish there was a way to teach the wisdom you gain from them. I’m trying to help my adult son figure these things out as well. I haven’t cut him off yet bc I feel like doing so blindly wouldn’t be as effective as setting him up to do volunteer work or take a mission trip first. \n\nI’d like to hear what works for you.", "permalink": "/r/DecidingToBeBetter/comments/pnlwwm/what_advice_can_you_give_to_a_spoiled_brat_who/hcqsn1r/"}