{"id": "t5_2tand_t3_pnlwwm_t1_hctkdjz", "creation": 1631628205, "origin": "t5_2tand_t3_pnlwwm", "height": 1, "replied_to": "t5_2tand_t3_pnlwwm", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "samuraibjjyogi", "text": "As a psychedelic therapist, I have a biased opinion of what happened to you. In my belief, I think psychedelics put you in the looney bin on purpose, which was to wake you up from your dream, and now you have been granted the gift of Buddhism. You recognize that life is suffering!! That is the first step along the path, so congratulations. Now, what do you do? Well learning the basics of Buddhism is a start and since you've mentioned keeping yourself in shape, I think that Brazilian jiu-jitsu would be something that could really motivate, discipline, and humble you. I mean, really HUMBLE your ass so that you understand yourself a bit better. Not to mention, it's a lot of fun and a huge de-stressor from that 9 to 5 you are going to be doing.\n\nWhy should you accept the 9-5 job? Well, for exactly what it is, it's boring and regimented. Don't look at it as a job that is supposed to excite you. It's a job that is going mold your discipline by making it boring on purpose! It's so hilarious that I am laughing out loud at what a comedian GOD is. You have the opportunity to save yourself from reincarnating into living this life over and over again. You recognize suffering, you've been given the way to end your suffering by developing discipline. Go train jiu-jitsu and get humbled, and strong again.\n\nThen, one day you will wake up and have the feeling of wanting to end the suffering of others. You're going to have all these ideas about how you can do that. You are going to use your creativity, compassion, discipline, and help from your family to create a mechanism to help others, and BAM!! Some epiphanies about life and the universe are going to flood your mind. Everything will start making sense and the world will seem brand new to you. I'm getting fucking jazzed up for you man, this is going to be awesome. It's going to suck so hard for you and that is exactly what you need. You need the boredom and the mundane. You NEED to get your ass beat on a daily basis and you need to learn how to get choked out and learn how to choke other people out, respectfully I might add. I hope this helps and I am sending you good vibes.", "permalink": "/r/DecidingToBeBetter/comments/pnlwwm/what_advice_can_you_give_to_a_spoiled_brat_who/hctkdjz/"}