{"id": "t5_2tand_t3_qgawxm_t1_hi5ew4g", "creation": 1635275005, "origin": "t5_2tand_t3_qgawxm", "height": 1, "replied_to": "t5_2tand_t3_qgawxm", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "taylorme", "text": "It seems like a big ask of yourself to just wake up one day and feel great about yourself or find a fulfilling relationship when you’re feeling this down. That’s too much pressure.\n\nCan you commit to going for a short walk in the morning? r/EOOD is a great resource that has helped me. It doesn’t have to be walking, but there are endorphin benefits so I wanted to mention it.\n\nWhat really matters is finding one small, attainable thing that you can do every day. What do you enjoy? You mentioned reading. Can you commit to 10 minutes a day? Even when you’re feeling shitty—maybe ESPECIALLY when you’re feeling shitty—you can prove to yourself that you are capable. This builds momentum slowly. \n\nYou’re also in school! Do you find parts of that enjoyable? Are you excited about looking for a career? Whatever is exciting, lean into it. Whatever is daunting, break it down into manageable goals, go slowly, and ask for help (like you are now!)\n\nWorking out is great! It sounds that you’ve found a routine that works for you! Would you be interested in finding gym buddies so you can expand your support system? Bonding over shared interests can be a great foundation to friendships.\n\nI am sorry you are down my friend. Life sucks sometimes. But a relationship will not fix your feelings. Building self esteem through creating intentional momentum and leaning into your interests can help! I’ve been in that black hole, and I remember hating everyone who said to start small, but it sucks because it works. You’re worth giving it a try, despite how you feel about yourself.", "permalink": "/r/DecidingToBeBetter/comments/qgawxm/i_22mdont_know_why_but_im_not_like_other_guys_my/hi5ew4g/"}