{"id": "t5_2tand_t3_qgawxm_t1_hi6hup5", "creation": 1635290940, "origin": "t5_2tand_t3_qgawxm", "height": 1, "replied_to": "t5_2tand_t3_qgawxm", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "leaguegoderino", "text": "The age old question. I’m 22 right now and was in your boat for a few years. It sucks, and I don’t envy you lol. You have these things you want to do, but seemingly can’t. The reality is that you have limiting beliefs that you’re convince are true. You just have to accept first that not all your thoughts are rational. Especially from a third person perspective.\n\nNow actually things you can do? You need to take care of your health. You’re not going to change it all in a day, week, or even month. Slowly build habits and know it’s okay if you slip up. Don’t try to become your best self overnight. It’s a process. Meditation also works wonders. For however long you’re able to, sit down and focus on your breathing. You can even do it laying down to be honest. Watch your thoughts. Don’t engage or judge them. Just watch it and think “huh, interesting.” Then return your focus back to the sensation of breathing. Through your nostrils, stomach rising up and down, whatever. This slowly strengthens your frontal lobes which in turn helps your cognitive function when it comes to focus and mental clarity.\n\nThere’s no textbook way to do it. I suggest starting a meditation routine for 5 minutes each morning. I’m currently at 20 minutes in the morning and 10 at night. You can slowly scale up. This’ll make it much easier to form other habits like studying, exercising and eating better. You can’t get back the time you “lost” but think of it as necessary time for a learning experience. \n\nKeep in mind you’re still YOUNG. If you were saying this at 35 or 40 I’d be more worried. Still the same advice applies if you want to take control of the rest of your life. Practice gratitude. Realize you already have everything you need even if it may not feel like it. If you’re not in a state of constant desire and want to be something other than yourself, it’ll be easier to actually work on your general goals. Like I said, I had the same issues for long time. It wasn’t until I was patient and kind to myself where things started turning around. It’s still an ongoing process, but I look back with fondness rather than sadness. You’ll get there too man. Good luck!\n\nAlso change your relationship with what it means to “chase” women. If you vibe with someone and want to spend more time with them, potentially romantically, ask them out. If they don’t reciprocate, move on. Accepting rejection is key. Not everyone will reciprocate and that’s okay. Hell maybe a lot of people won’t. Don’t be concerned with that. Be concerned with those who do. I know some dudes out here pulling straight 10’s and they’re not 10s. Sorry for being a bit reductive with ratings. But it goes to show there’s more than just physical attraction. A lot more.", "permalink": "/r/DecidingToBeBetter/comments/qgawxm/i_22mdont_know_why_but_im_not_like_other_guys_my/hi6hup5/"}