{"id": "t5_2tand_t3_qgawxm_t1_hi5j3n3", "creation": 1635276638, "origin": "t5_2tand_t3_qgawxm", "height": 1, "replied_to": "t5_2tand_t3_qgawxm", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "aast69", "text": "then don’t chase after women. you can not chase and still end up with a good woman. But you don’t need a woman to be complete.\n\ni think you ARE like other guys your age, because i have this thought all the fuckin time lmao and i’m 22. and this seems to be a common theme in this dating world. i’m working it out myself but i’m trying to do a couple of things:\n\n1. Hit the gym, because looks matter. Unfortunately. If you’re 5’6 and fat, you can be 5’6 and shredded. I find myself often lamenting things i cannot change, but it’s just a better use of your time to focus on things you can change.\n\n2. Seeing a therapist, and getting to the point where i can stop focusing on past trauma and move on to my future goals.\n\n3. Keeping a job and making money. Not for a woman, but for yourself. You have to have a career or a stable income to be able to support yourself, not to mention another person. Also, don’t spend large amounts money on women that don’t make YOU feel special. \n\n4. This is the big one. Let go of your past resentment. This is difficult, especially when it comes to dating and rejection, because it always stings personally. Sometimes i want to be like “damn all these girls who rejected me are bitches” but then i realize that is just my ego talking, and these girls made the decision they wanted to. Just like when i reject women, It’s not because im evil, it’s because i don’t want to fuck them. Same kinda vibe. Rejection stings a lot tho so i get it.\n\n\nHonestly i feel you dude. I’m tired as shit. Friendships and relationships are hard, but they’re easier when you are taking care of yourself. And you’ll have some bad days but that’s okay because we all take steps backwards and are imperfect.\n\nHope this advice helps. It’s probably a lot of obvious stuff but it’s obvious stuff that takes work to achieve. The past might have sucked but that doesn’t mean the future has to.", "permalink": "/r/DecidingToBeBetter/comments/qgawxm/i_22mdont_know_why_but_im_not_like_other_guys_my/hi5j3n3/"}