{"id": "t5_2tand_t3_qgawxm_t1_hi7096e", "creation": 1635299281, "origin": "t5_2tand_t3_qgawxm", "height": 1, "replied_to": "t5_2tand_t3_qgawxm", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Shitp0st_Supreme", "text": "I’m 27 and a woman. At 22 I was so insecure with myself. I was in a loving relationship but I had no sense of self. Things slowly came into place over the next few years when I got a job I loved, took care of myself, and was honest with my doctors and myself. \n\nI have lost around 50lbs while actually being less active and not cutting out any food groups just by paying attention to portion sizes and choosing filling food first. \n\nI was honest with my doctors about being suicidal and I’ve been on a good medication regiment that has helped me stay healthy. I also have gotten treated for PCOS after advocating for myself (I’ve brought up concerns for around 10 years and I only recently had somebody listen to me). \n\nI also am learning how to dress in a way that is flattering and comfortable for me, I’m less concerned about makeup, and I learned how to do my hair so it’s less frizzy. \n\nThe people who say that your brain isn’t fully developed until 25 are telling the truth; I’m still me but I feel so much better with myself and with who I am. \n\nI think it might be a good idea to talk to your doctor about concerns; whether it be about how you look, or how you feel mentally or physically. They can refer you to providers who can help you get to a better place.\n\nEven though I was actually engaged at 22 (and I’m still with my husband, we just had our 4th wedding anniversary in August and our 9th year together a few weeks ago) I feel so much happier and loved after changing my meds and doing therapy and addressing past trauma and my severe depression.", "permalink": "/r/DecidingToBeBetter/comments/qgawxm/i_22mdont_know_why_but_im_not_like_other_guys_my/hi7096e/"}