{"id": "t5_2tand_t3_p5pg6b_t1_h98olh0", "creation": 1629167530, "origin": "t5_2tand_t3_p5pg6b", "height": 1, "replied_to": "t5_2tand_t3_p5pg6b", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TiredForEternity", "text": "Your \"fear\" is your brain trying to protect you from harm. Being betrayed or having a close, vulnerable attachment be violated are both painful experiences. Emotional pain is the same, and sometimes worse, as physical pain, and just like physical injury, your brain wants to avoid that pain as much as possible - including rejecting what might not be dangerous at all, because even if you're alone, you're alive. Staying alive, and without pain/discomfort is the #1 motivator in the monkey brain. (Monkey brain, or emotional brain, is not the same as logic brain.)\n\nUnfortunately, simply telling yourself to stop doing this cycle isn't effective. It'd be like telling a toddler that doesn't know English to stop crying. You might be able to figure out why they're upset, but be unable to explain anything.\n\nInstead, you have to find your comfort circle. Do you feel safe when hanging out? Does it feel safe to spend time with them? Find the 'I can do this without worry' and separate it from the 'this is uncomfortable.' Then start separating it into 'this is slightly uncomfortable but I can handle it' to 'this scares me.' (Ignoring that you want to do it, because wanting intimacy and working up to it are two totally different things.)\n\nAlso pay attention to the red flags your own brain and body put up. Are you shooting yourself down if you feel attraction? Are there memories of past relationships that come up? Do you feel rigid or tense around them? Knowing what your brain does to cause these negative associations (self-belittling, catastrophizing, etc.) helps you catch yourself when you start to do it.\n\nAnd when you're ready, do baby steps. Teeny tiny steps. Set some goals. If you start to care for someone, hang out with them. See if you can watch a movie, play a video game, talk about life, something not quite 'intimate' but still personal time. (This is an example.) Let yourself worry, because stamping that down just makes it worse in the long run. Ask for reassurance. \"Do you like me as a person?\" \"Is it okay to talk about my issues with you?\" \"Do you mind spending time together?\" As well, ask your mind what's scaring it. Is it the possibility they're lying? Well, if they've never lied before, then they can't be accused, and it's okay to trust them. Is it the fear of saying the wrong thing? Even if you do, they've never lashed out, so it's okay to speak your mind. \n\nAlways be gentle with your brain, even if the 'logic' aka emotional monkey brain is making up a danger that isn't there. It's not very good at measuring actual risk, and wants to keep you safe from discomfort/pain. Seeing it as a part of yourself in this way can help you work with it instead of fighting it.\n\n And take this slow - like. A year long slow. When you try something uncomfortable, keep trying it, and with enough \"it went well\"s that you get you'll build up your comfort circle and be able to work up to more uncomfortable situations like sharing personal struggles or something (example). \n\nI can't really go much further into detail. This is a lot of info and guidance scrunched into one post and I'm not a professional, just someone who's been to several psychology classes + been through years of different types of therapy for different issues. My word isn't gospel (despite me talking like it is), so you can 100% disregard if it feels inaccurate or unhelpful. \n\nIf nothing else, focusing on raising your confidence and self-esteem can help with some of the vulnerability feelings.", "permalink": "/r/DecidingToBeBetter/comments/p5pg6b/i_realized_that_i_try_to_get_rid_of_people_before/h98olh0/"}