{"id": "t5_2qh1i_t3_8yseox_t1_e2degjk", "creation": 1531569797, "origin": "t5_2qh1i_t3_8yseox", "height": 1, "replied_to": "t5_2qh1i_t3_8yseox", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Mirenithil", "text": "I have written this out elsewhere, but since everything I want to say has stayed the same, I'll just copy it here. I had a couple major realizations.\n\nSelf-talk: I was intensely, harshly critical of myself. One day I realized that I would never talk to another person like that, so why should I talk to myself that way? I made the decision to treat myself as though I was a friend who had the same issues. I would treat myself kindly with compassion, and allow myself to be imperfect (even very imperfect.) This is very important: I decided to make a point of noticing what I did right, well, and good in the same way I'd focused exclusively on what I did wrong before. It's important especially for someone in or coming out of depression to see and admit to themselves that yes, they do things right, too. It doesn't matter how tiny or \"inconsequential\" the action is. Did you brush your teeth today? Nice, you brushed your teeth today. Fair warning: This change in behavior will likely feel fake as hell at first, and will continue feeling fake as hell for a long time. It's normal for a behavior pattern you aren't in the habit of to feel fake, but that doesn't mean it IS fake; it's just an unfamiliar pattern. As the pattern becomes familiar, the feeling of fakeness will fade.\n\nThe other thing was that I realized when you are depressed, you naturally tend to focus on what's bad and wrong in life. You don't even notice the good stuff, even though it's still there. If you go long enough noticing only bad things while being oblivious to the good, it can legitimately get to a point where it really, genuinely feels to you like only bad things exist for you and that good stuff doesn't even exist at all. Therefore, I made a deliberate point of noticing what's right and good in life. There's a roof over my head tonight and I have a warm, dry, comfortable bed to sleep in; I have my health; I can have pretty much anything I want for dinner; I am incredibly lucky to live in that incredibly tiny fraction of all of human history that the internet exists; it's a lovely day out today; I lost a couple more pounds; I really do have exceptionally awesome landlords; I was really kind to that person; I got the dishes done today, etc. Fair warning: This is another thing that's going to feel fake as hell for a long time until you get into the habit of it. Expect it, it's normal and fine. I pushed through the fake feeling and it made a life-changing difference for me that I did.\n", "permalink": "/r/AskReddit/comments/8yseox/suicide_attempt_survivors_of_reddit_what_would/e2degjk/"}