{"id": "t5_2tand_t3_nau88v_t1_gxz2s0v", "creation": 1620911593, "origin": "t5_2tand_t3_nau88v", "height": 1, "replied_to": "t5_2tand_t3_nau88v", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "redubshank", "text": "I'd suggest reading Learned Optimism by Martin Siegleman(sp?).  I found it to be an amazing tool for dealing with self-inflicting negativity.  It actually gives you a practical system for changing your mental patterns.  My biggest complaint about most self help books is they just talk about how amazing something is but at the end you are like 'Ok, how to I do all that?'.  This book gives you that missing piece.  \n\n\nFor decreasing negativity further I found the following helps:  \n\n\n\\*If you are on social media remove/hide people that post things that consistently have a negative vibe... even if you agree with the sentiment.  TBH, I had to block my own parents on facebook since they posted so much political stuff\n\n\\*Stop watching the news for a long period of time.  The news knows negativity sells.\n\n\\*Do your best to cut out negative nancy's from your life.  In cases where you can't do it, say a co-worker or whatever, try to use some empathy.  No one wants to be miserable but so many people into the trap of getting a weird, temporary buzz from being negative and don't even realize it.  It's a bad way to live.  They need help.    \n\n\nAs far as stress management goes, this is a constant struggle in my life that I am always working on but one of the biggest things that helps me is taking time for meditation(hear me out).  I want to emphasis two big things, however.  You don't need long meditation sessions, you don't need a mantra and you don't need to sit in a weird position.  Some folks are really judgmental when it comes to meditation practices but in reality it's just taking some time to let your brain relax and just be present.  How you get there isn't important.  Personally, I do 'paradoxical relaxation' which means I am lying down with a sleeping mask on, do a slow, full body scan and relaxing each body part as best as possible and at the end just be present or, if my mind is still going crazy, repeat the body scan.  Some people even do meditation while walking.  I can say when I am doing a trail run where I really need to pay attention I almost hit the same zone because it's forcing me to be so present.  A lot of people use guided meditation like Headspace or free you tube videos.  It's all good.  \n\n\nI can't offer too much advice about being comfortable alone because if I wasn't married I'd live in the middle of the woods in an offgrid cabin and probably be super happy.  Actually get a buzz thinking about it... I guess I am just designed that way.  Anyways, this might be the simplest thing to tackle with simply pushing into being uncomfortable.  I'm not sure what you are into but if you are into outdoors stuff maybe try an overnight backpacking trip.  If that doesn't suit you then maybe a weekend away by yourself at some interesting place.", "permalink": "/r/DecidingToBeBetter/comments/nau88v/habit_change_seeking_tips/gxz2s0v/"}