{"id": "t5_2qh5i_t3_nyiwl7_t1_h1n1k1e", "creation": 1623604314, "origin": "t5_2qh5i_t3_nyiwl7", "height": 1, "replied_to": "t5_2qh5i_t3_nyiwl7", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "jdoon5261", "text": "I found this several years ago. It is as accurate a description of ADHD I've ever found.\n\nADHD is about having broken filters on your perception.\r  \nNormal people have a sort of mental secretary that takes the 99% of irrelevant crap that crosses their mind, and simply deletes it before they become consciously aware of it. As such, their mental workspace is like a huge clean whiteboard, ready to hold and organize useful information.\r  \nADHD people... have no such luxury. Every single thing that comes in the front door gets written directly on the whiteboard in bold, underlined red letters, no matter what it is, and no matter what has to be erased in order for it to fit.\r  \nAs such, if we're in the middle of some particularly important mental task, and our eye should happen to light upon... a doorknob, for instance, it's like someone burst into the room, clad in pink feathers and heralded by trumpets, screaming HEY LOOK EVERYONE, IT'S A DOORKNOB! LOOK AT IT! LOOK! IT OPENS THE DOOR IF YOU TURN IT! ISN'T THAT NEAT? I WONDER HOW THAT ACTUALLY WORKS DO YOU SUPPOSE THERE'S A CAM OR WHAT? MAYBE ITS SOME KIND OF SPRING WINCH AFFAIR ALTHOUGH THAT SEEMS KIND OF UNWORKABLE.\r  \nIt's like living in a soft rain of post-it notes.\r  \n\r  \nThis happens every single waking moment, and we have to manually examine each thought, check for relevance, and try desperately to remember what the thing was we were thinking before it came along, if not. Most often we forget, and if we aren't caught up in the intricacies of doorknob engineering, we cast wildly about for context, trying to guess what the hell we were up to from the clues available.\r  \nOn the other hand, we're extremely good at working out the context of random remarks, as we're effectively doing that all the time anyway.\r  \nWe rely heavily on routine, and 90% of the time get by on autopilot. You can't get distracted from a sufficiently ingrained habit, no matter what useless crap is going on inside your head... unless someone goes and actually disrupts your routine. I've actually been distracted out of taking my lunch to work, on several occasions, by my wife reminding me to take my lunch to work. What the? Who? Oh, yeah, will do. Where was I? um... briefcase! Got it. Now keys.. okay, see you honey!\r  \nAlso, there's a diminishing-returns thing going on when trying to concentrate on what you might call a non-interactive task. Entering a big block of numbers into a spreadsheet, for instance. Keeping focused on the task takes exponentially more effort each minute, for less and less result. If you've ever held a brick out at arm's length for an extended period, you'll know the feeling. That's why the internet, for instance, is like crack to us - it's a non-stop influx of constantly-new things, so we can flick from one to the next after only seconds. Its better/worse than pistachios.\r  \nThe exception to this is a thing we get called hyper focus. Occasionally, when something just clicks with us, we can get ridiculously deeply drawn into it, and NOTHING can distract us. We've locked our metaphorical office door, and we're not coming out for anything short of a tornado.", "permalink": "/r/happy/comments/nyiwl7/i_was_diagnosed_with_adhd_this_week_and_started/h1n1k1e/"}