{"id": "t5_2tand_t3_ovvj05_t1_h7cqc70", "creation": 1627850551, "origin": "t5_2tand_t3_ovvj05", "height": 1, "replied_to": "t5_2tand_t3_ovvj05", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "increbelle", "text": "I go thru the same thing. Like I want company but then I will hermit and not want to be around people at times. In my mind, I justify it as a “boundaries” thing. \n\nNow that I’m working from home and don’t have much of a social life, it’s been really getting to me. But what I’m doing to help me: \n\n- Clean old stale items from my home to donate. Things that no longer serve me or my child (old clothes, toys, Knick knacks, etc). I find the purging almost therapeutic. \n\n- I’m learning to cook! My parents owned their own restaurant and catering business so you would think I would have picked up on something, but I didn’t. I’d always eat something on the go. Now I’m challenging myself to try new recipes. It actually turned out fun experimenting with different herbs and spices. \n\n- exercising, this is a big one. I’ve never been a health nut but sitting at home all day drove me insane. So o watch random videos on you tube. My favorite has been tai chi. It’s slow and simple enough for a beginner and it helps get the body moving. I also bought a stationary bike for some much needed cardio. I had been working a sales floor where I was constantly walking up and down but I’d become quite sedentary when covid hit. Since I’m not getting the same level of movement, it also helps release a lot of energy that would otherwise keep me up at night. \n\n-  meditation, REALLY got into this. It’s been helpful in calming me and just having a moment of stillness to myself. I even did lunar meditations and womb healing. Lots of tears but I felt very uplifted afterwards. Again, YouTube is a great source in guided meditation. Netflix also has an interesting series called headspace: a guide to meditation. Something like that. Really helpful for beginners. It has helped me in bring info up traumas that I didn’t even realize I had. I know one day after a meditation, I was boohoo crying just because of the thoughts that came to mind. But it helped me address the root cause of an issue I was having. If you feel like you have a broken heart, do some digging and see what comes up. Just learn to quiet the mind and fight distractions during meditation. It gets easier with practice. \n\nI think what it’s come down for me, is keeping myself busy. I’m single and I do miss having a partner. But it’s also made me realize even though I want a partner, I’m not ready or where I want to be to start a relationship with someone. I have a lot of “me” work to do, which I don’t think ever ends. You always wanna keep working on yourself. But I definitely want to be a lot more prepared spiritually and mentally before I invite someone to share my life with. I hope any of this resonates and can help you.", "permalink": "/r/DecidingToBeBetter/comments/ovvj05/anyone_know_how_to_combat_loneliness_when_alone/h7cqc70/"}