{"id": "t5_2tand_t3_mmp90c_t1_gtuamdg", "creation": 1617907290, "origin": "t5_2tand_t3_mmp90c", "height": 1, "replied_to": "t5_2tand_t3_mmp90c", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PerfectlySoggy", "text": "Good job stranger, I know this struggle. This helped me: Make your bed before brushing your teeth. The first thing you should do when you finish brushing your teeth is change your clothes. If you stay in the same clothes you wore to bed, chances are you’re going to stay in bed. Put on something you’d never wear to bed, you’d only wear out - your favorite pants and a nice shirt. Put on shoes, then fix your hair, spray cologne or perfume. If you’re like me, this will reset your brain (similar to how your brain resets when you cross a threshold into a different room, like when you forget why you went into the kitchen), and you’ll find it difficult to get back into bed. Your brain should subconsciously comprehend “we’re getting ready to do something.” And even if you’re not going anywhere, then you can at least be productive around the house and feel better about your day.\n\nI’ve found that exercise is one of the only things that *consistently* brings me out of a funk. Getting to actually doing the exercising is the hard part.. but I promise after you’re done, you will feel better than you did before, and you will want to chase that feeling by exercising the next day. If you don’t, buy some pre-workout mixes — sometimes even on the days I can’t drag myself out of bed, if I can manage to slurp down a pre-workout then I’m forcing myself to go to the gym, why would anyone take creatine and caffeine and etc to lay in bed all jittery? Go burn off that fake energy.\n\nI guess in a way life is all about tricking yourself into contently doing things you inherently don’t want to do. Piling mental conditions on top of that already big ask is not easy, so we need to prioritize the things that are scientifically proven to help us mentally - healthy foods, exercise, personal hygiene, avoiding alcohol, taking supplements, etc. It doesn’t sound like your current medication is doing the trick, I’d suggest consulting your doctor about that for sure.", "permalink": "/r/DecidingToBeBetter/comments/mmp90c/i_was_actually_able_to_wash_my_teeth_everyday/gtuamdg/"}