{"id": "t5_2tand_t3_o0dpqr_t1_h1vf48w", "creation": 1623779162, "origin": "t5_2tand_t3_o0dpqr", "height": 1, "replied_to": "t5_2tand_t3_o0dpqr", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bleachdrinker", "text": "TL;DR - Small, continuous improvement.  Forgive yourself your mistakes.  Celebrate and be proud of your achievements, no matter how small.  Make that pride a habit.  \n\nThere are some great comments already, and I agree with everything written, so I'm going to talk about how I made the change at fifty-three years of age, from the state you describe to what I feel is a more healthy/happy state.\n\nQuick background:  I'm successful by middle class standards, had worked in the same job for twenty years, was in (and still am) in a stable long-term relationship.  No kids, two dogs, house almost paid for, reliable car in the driveway, live in a beautiful place.  \nAnd bored, and unhappy and depressed and anxious.  I overate, overdrank,  played too much video games, and bitched about the debt incurred by buying stuff to give me a quick dopamine hit.  \n\n\nI spent a year doing an extra part time job and suffering to pay off my debt.  Big success, much happiness, such pride.  \nI immediately quit my shitty night-bartender part time job, and then ran my debt right back up.\n\nSo, there I was, here's what happened.\n\nMy wife took me aside, and told me that my job was a big problem.\n\nMy company fucked me on a bonus a week later.\n\n1) I  found a new job. It was scary and terrifying to transition,  and I would \\*not\\* recommend it as a first step.\n\n2) I got really positive feedback at my new job,  which gave me some confidence.  This may have helped me to make a change, but it's maybe not critical.\n\n3) I hit three-hundred pounds (probably more - if I'm honest, but I didn't want to step on a scale any time after three hundred).\n\nSo I was in a mixed state,  feeling OK mentally but super not proud of where I was physically and not feeling great mentally.\n\nso....\n\nI started paying attention to my fit bit,  I didn't care if I was hitting my goal, but I definitely wanted to do more today than I did yesterday.  I didn't care if it was only 1 step more.  It was a success.\n\nI started researching diet strategies, scoring high points for long-term weight loss.  \n\nI chose keto, your mileage may vary.\n\nI started weighing myself.  I contented myself with a cessation of weight gain at first.  Then I started losing.\n\nAt no point did I set a goal other than to continue downward.  I also forgave myself the set backs.  It was hard.  But I learned to be content with thoughts like, \"It's OK,  you'll start losing again right now, just don't continue doing the bad thing.\"\n\nCheered for myself at each piece of progress.  Really cheered for myself.  Like you'd train a puppy.  Really.\n\nGot a therapist.  But,  and this is a very careful caveat, the big lift for me was understanding and acting on cognitive behavioral therapy techniques.  Another result was recognizing that a job could successfully be done in small pieces.  I didn't have to concern myself with deadlines for personal jobs/tasks.\n\nAbout four days in to my diet, I actually noticed a physical change.  Whoop,  this is great.\n\nAnd so on.  I'm three months into therapy,  it feels great. I experience genuine happiness and pride in myself.\n\nI'm two months into my diet.  I stopped feeling hungry by the third day, and I'm down twenty five pounds.  I love stepping on the scale each morning.  I laugh a little now when I see the results of my cheat days.  \n\nI feel like this is a pattern, a habit, something with a good chance of being permanent.  I really want this to be permanent, and that is HUGE motivation to keep going.", "permalink": "/r/DecidingToBeBetter/comments/o0dpqr/ive_decided_to_be_better_how_do_i_actually_start/h1vf48w/"}