{"id": "t5_2tand_t3_5zztvg_t1_df2wrei", "creation": 1489808264, "origin": "t5_2tand_t3_5zztvg", "height": 1, "replied_to": "t5_2tand_t3_5zztvg", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "trinityalpha", "text": "This might seem trivial, but I thought similar thoughts until I downloaded Instagram and started following plus sized models. Some of them are size 10 or 12 and some are size 26. It makes me feel confident and good about myself because they're normal women who feel confident in their bodies and they have successful lives. Some have great jobs and model as a hobby. Some have met the love of their lives and it gives me hope that I could meet a person I connect with as well. Reddit hates the body positivity movement, but as someone who has struggled with suicidal thoughts because I had never seen an adult woman look beautiful with cellulite or stretch marks before, this has done wonders for making me feel confident and good about myself. \n\nAt the same time, much like you, I am trying to lose weight and to actively work on my health and happiness. I have lost 40 pounds over two years, and while it's slow, I am the happiest I have ever been. I still eat pizza and local ice cream, because what is the meaning of life without the luxury of good food? I work out, I eat healthier (my job offers free visits to a nutritionist), I look at role models on Instagram every day (despite their size) and my confidence grows little by little. I still have a hard time walking through the cafeteria at work and thinking that people are staring at me because I'm hideous (I'm not, but I am female in a predominantly male company, which can be intimidating). I lift my head up, I walk across the room and I fake the shit out of that confidence. It grows on you. One day you'll look at yourself in the mirror and see yourself as beautiful and you will cringe at the horrible things you used to think about yourself. \n\nI would also say to surround yourself with people who are supportive of you and drop the assholes who aren't. If I ask my friends to support me in my weight loss, they absolutely will do anything I ask. It took me a long time to cultivate a circle of people whom I adore and trust with all my heart. I've met many manipulative and mean-spirited people along the way. Leaving the bad apples behind has been the best thing I've ever done. Your friends will hopefully tell you that you're beautiful  in spirit, character and looks and they'll tell you bluntly which hairstyle or dress-style doesn't look good on you. I wish you luck. Loving yourself can be an extremely difficult and painful journey that requires you to face deeper issues, but you're already taking the first steps by reaching out and taking care of your physical well-being.", "permalink": "/r/DecidingToBeBetter/comments/5zztvg/how_to_accept_myself_for_what_i_am/df2wrei/"}