{"id": "t5_2tand_t3_ft4uzz_t1_fm66673", "creation": 1585787125, "origin": "t5_2tand_t3_ft4uzz", "height": 1, "replied_to": "t5_2tand_t3_ft4uzz", "down_vote": 0, "up_vote": 44, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "emacsismyreligion", "text": "Hey, first of all WOW I am so encouraged by all of your kind words. I read them all, but can't respond to them all, so I will post more here. Thank you to those of you who invited me to their NA meetings! This was actually the crucial support I needed to make it past these first ten days into the bigger journey. . . 1 day at a time :) I have been going to my local CMA meetings online! I have built a lot of connections there & have someone who offered to be my sponsor. I also did a course of a peptide (chain of amino acids) studied for dopaminergic (amphetamine + antipsychotic induced) damage which seemed to completely reverse the withdrawals. Before that, I just could NOT handle the cravings. I am practicing on surfing the cravings out by reminding myself that they pass, because for those that do not have this lived experience, they are INTENSE! \n\nIt is fantastic to be able to get in touch with myself, off drugs, and to find new & exciting ways of dealing with resurfaced trauma, ongoing stressors, et cetera. In just these ten days I have found myself at a renewed capacity to love & be loved, which I know will only increase the longer I go forward on this journey. I view recovery as a spiritual journey, and CMA/NA/12-steps + my own spiritual practices & traditions which I had lost touch with, have been my backbone.\n\nI am so glad I posted because I was very afraid of judgement! And to the one username who posted about psychosis, I relate, because far before meth I had a psychotic break and was diagnosed with schizophrenia. This, I feel, complicates my recovery from addiction, as I will always be less (or... more?) than \"normal.\" Of course the meth just wreaked havoc on my mind, but this past year was the first full year out of any mental institution since I was thirteen years old, so I understood this change was the next thing that was holding me back, that I needed to conquer. Methamphetamine was utterly destroying everything I could call myself. But now I sort of am understanding that it was all just occluded, unrefined, waiting for me to take the initiative to transform into *exactly the person I was truly called to be.*\n\nI don't pretend to be all fine & happy because... well I have only ten days, & here I stand in the wreck I've made of my life. But I am grateful to have the opportunity to pick up the pieces & make something new.\n\nThanks all.", "permalink": "/r/DecidingToBeBetter/comments/ft4uzz/10_days_clean_from_crystal_meth/fm66673/"}