{"id": "t5_2tand_t3_qc6sat_t1_hhexq3n", "creation": 1634765799, "origin": "t5_2tand_t3_qc6sat", "height": 1, "replied_to": "t5_2tand_t3_qc6sat", "down_vote": 0, "up_vote": 31, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "sullysmully", "text": "I know this seems like total bullshit advice, but I was forced to stop smoking to get this job that I really want, and after just 4 days of stopping, I started asking myself « what was I even smoking for? » Even though people say weed isn’t addictive, I think the ritual and habit of smoking is addictive. As soon as I had to stop my normal routine and quit smoking weed, a world of stuff started to open up. Normally I’d rip bong around 11 am and basically pretend like I was doing something productive, but now that I don’t get to rip bong and actually have to find stuff to do, I find myself realizing how much I DIDNT need weed to do stuff. I feel like I’m retaining information better, my heart doesn’t race as much, I don’t feel so dazed and forgetful. I’m hoping this gives you some insight just cause I’ve smoked very heavily (about an eighth everyday too) for 6 years and thought I NEEDED it to relax/destress/be interested in things, but it’s so important to remember that your sober brain needs catering to and that weed can distract us from that sometimes; it’s also good to connect with your sober self and realize that you are capable of many things and that your clear mind is strong and a wonderful asset. I would try working out/reading/studying something new/learn something new like woodworking or cooking or some shit hahahaha it’s good to replace a smoke break with something different. At the same time, if it’s not impacting you a TON maybe just try saving it for special occasions or restrict yourself to only smoke during a certain time like after you’ve finished a project or something like that. Hope this helps in some way, good luck friend!!", "permalink": "/r/DecidingToBeBetter/comments/qc6sat/how_can_i_finally_put_an_end_to_smoking_weed/hhexq3n/"}