{"id": "t5_2tand_t3_nljzo4_t1_gzk4t9y", "creation": 1622061583, "origin": "t5_2tand_t3_nljzo4", "height": 1, "replied_to": "t5_2tand_t3_nljzo4", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "_DrSoft_", "text": "I am so happy this helped you too, it is exactly what this subreddit is about and it has helped me so much so far. \n\nBut putting myself out here and see good responses is even more helpful to me in return. Happyness gets bigger when shared, so I thank YOU too :-)\n\nTo answer your question, I believe it is ok for a manager to invite for a meeting without big announcements. You guys are very busy and sometimes getting stuff out of your mind quick is the only option. (Knowing them, I believe it could also have been an attempt of a \"surprise, look what I did for you!\" effect, we have been waiting for a rise forver...)\n\nAnyway, I don't give my boss the responsibility for my reaction to meeting invitations. In case I would have been super wound up about it, there would have been the posibility (at least with my boss) to ask if I should prepare on a specific project to discuss (I would admit though, that this never occured to me until now, so thanks again, I will use ths next time)\n\nSo yes, transparency is very good but your employees need to feel that they can be transparent too. This is what feels good with my boss. I learned that mistakes can be made but I better come up already with a solution proposal, so that my boss can start from there. \n\nThis is part of being professional to me. I often forget because I tend to just swallow down the pain and get on, but, if I feel unprepared or unsatisfied with my accomplishments, I could also be proactive and ask my manager for input.\n\nWhat I would want from my dream manager is not preventing every bad scary feeling, I would want an environment where taking responsibility for my mistakes with my head up high is possible and actually helps me to learn to do better. \n\nThere is this guy Gary Vaynerchuk on LinkedIn, he gives a lot of great advice for managers and etrepeneurs. Very short and spot on video content. His message embodies what I believe my manager does with us: the manager should work for his employees and ask them how he can support them, so that your employees want to support you in return. This is lived very well in my company. It is so good it is starting to have an effect on me too :-D\n\nI whish you all the best with your carreer and life!", "permalink": "/r/DecidingToBeBetter/comments/nljzo4/i_decided_to_stop_dreading_a_call_with_my_boss/gzk4t9y/"}