{"id": "t5_2tand_t3_4j4ih2_t1_d33skfh", "creation": 1463126264, "origin": "t5_2tand_t3_4j4ih2", "height": 1, "replied_to": "t5_2tand_t3_4j4ih2", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Hi. I'm a full time stripper after having spent 10 years as a stylist and 4 of it working for L'Oreal.  I can relate to you very much.\n\nThis is actually my current dream job, at least within my realm of ability. I can't be a marine biologist any time soon. I have no interest in going back to school. I like to focus on pole tricks to build my physique and then I basically make money at the same time. \n\nEscorting is a bit different since no club full of bouncers to back you up if something goes wrong but you should be fine. You seem smart. Stay safe.\n\nTo find yourself... Travel more. Go alone. Spend the money. It's worth it. Take some odd classes for random things you like. Yoga, horseback riding, calligraphy, welding. Whatever. I look on craigslist in odd jobs to find things too. Sometimes you get to be a part of some really cool events. Take a pole class! \n\nDon't quit your job yet unless you don't care about it being on your resume. It depends how you want to proceed with your career. I quit jobs like it's my job. Don't care. Always another one. I think that people who have trouble finding work are being either too selective or they are really dumb. There is always work. \n\n\"Waitressing isn't a career-career but it did make me happy\"\n\nWhat else matters? My mom didn't want me to be a stripper but I did the grind and was miserable. Now I love my job. That's all that matters in the end. How did I enjoy my time. When I lay on my death bed, what will I have to reflect upon? Spend half my life standing behind a chair being told how to make people look, or getting paid to make the fun happen and get in wicked shape pole dancing and being a circus act? Yeah... Chase all the crazy dreams!\n", "permalink": "/r/DecidingToBeBetter/comments/4j4ih2/hate_my_job_escorting_on_the_side_so_i_can_move/d33skfh/"}