{"id": "t5_2tand_t3_4j4ih2_t1_d36tiao", "creation": 1463351995, "origin": "t5_2tand_t3_4j4ih2", "height": 1, "replied_to": "t5_2tand_t3_4j4ih2", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "wakka54", "text": "The second post is a literal robot. People here program them for amusement to respond to keyword triggers.\n\nAs for the post higher up, /r/TheRedPill is a forum of men frustrated with a lack of dates or sex in their life, which they blame on how they were brought up to act. They think society told them to be a good boy, and feminists told them to respect women, and since they have no success getting sex in their life, they made a theory about it. The theory is that everything they know is wrong, and getting sex is like being Neo in the movie the Matrix. Neo eats the red pill, which lets him see the true reality (the blue pill is the kool-aid, believing what you see, which he rejects). It's a metaphor though. The red pill, to them, means swallowing the hard truths about what causes women to actually have sex with them. Keep in mind these are full grown men who are essentially virgins, so their theories are a little batshit overlogical. They tend to boil down to \"women won't fuck a nice person, only a badass\", \"women are mentally wired to fuck the leader of a group\", \"women are incapable of articulating their desires - their vagina gets wet by certain things, and their mind thinks they desire other things, and they will rationalize anything after the fact\", \"once a woman hits 30, she will stop fucking the bad boys she desires, and look for a wimp to use as an ATM and emotional tampon i.e. get married because she doesnt have the looks to fuck who she wants anymore\". There are many other principles to \"The Red Pill\", you'd have to visit there to figure them all out. The forum is run a bit like a cult - anyone who criticizes The Red Pill canon is instantly banned, they really go all-in to the ideas. A lot of the internet hates them. They have a huge following, too. It's controversial.\n\nSo basically,  \"you are what i read in r/TheRedPill\" means your post was shocking to them, and reinforces that The Red Pills canon is actually correct. They were essentially saying \"you're one of those stereotypical women that fedoraed manchildren gripe about\".\n\nI, personally, think TheRedPill is a forum of shortsighted manchildren who poorly understand reality. They think they are uncovering the truth, but they are actually going from one stupid belief system to a new stupid belief system. They used to treat women as prizes, now they treat women as dogs, and seem incapable of thinking of them as people. They touch on true ideas, but butcher them with their little minds. They are overly logical and most nuance goes over their heads. ", "permalink": "/r/DecidingToBeBetter/comments/4j4ih2/hate_my_job_escorting_on_the_side_so_i_can_move/d36tiao/"}