{"id": "t5_2tand_t3_qf3fh1_t1_hhxq6il", "creation": 1635126608, "origin": "t5_2tand_t3_qf3fh1", "height": 1, "replied_to": "t5_2tand_t3_qf3fh1", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MattTheMentor", "text": "You might also re-examine the beliefs you're trying to prove. Is it essential that there's a kindness to the world, or that it is fair? Those would be nice, yes, but are the essential? What if life is more like a carnival? You have a few tickets, you can spend them where you want and there's cool rides and some are scams. There's some cool people you might meet, but when time's up we all have to leave. It's not really fair or unfair, it's just life and what you decide to get out of it.  \n\nI think you're trying to find a belief system to justify what you think life should be. You might need to ask yourself if life works differently than you want it to be.\n\n(I wrote the below part first, but then I understood your question better and wrote the part above, leaving the first part in case it helps someone....)\n\nTo be honest, I also struggle with the idea that there's a loving deity with kind and loving plans for me. I'm more or less agnostic but the psychological safety and resilience to the hard parts of life is very important, as you mention. I had to find a rational approach since intuition didn't do it for me.\n\nPsychological safety to me is \"Can I be certain my needs will be met?\"\n\n* As long as your expectations are semi modest (food, shelter, a few friends, a few hobbies you enjoy) then this is pretty doable. I have an emergency fund that I can lean on and I know how to make new friends if I lose the ones I have. \n* I don't think leaning on a higher power who is looking out for us is the best answer here if you can have faith in your own ability to take care of yourself\n\nEmotional resilience aka courage and grace in hard times\n\n* For religiously minded people this seems to be \"I trust that God is looking out for me so I'll do my best and leave the rest to God\"\n* Stoicism can cover this base really well too if you let it. Meditations by Marcus Aurilius is phenomenal, it boils things down to \"Can you do something to solve this problem? Then do it. If not, focus your attention on areas where you can have an impact.\"\n* That might not be courage in the same way as \"My God is all-powerful and he will protect me,\" but to be honest your notion that \"good things happen to good people\" doesn't always hold water in my experience\n* Courage can also look like \"I don't know how this will play out and there might not be a God looking out for me, but I'll do my best anyway because that's all I can do\"\n* Grace and serenity can also be cultivated from Buddhism and Taoism in my experience. They encourage detachment, not trying to control life or have too many expectations, and all of those help us find peace in hard times. I've only adopted the non-supernatural parts of both, but they've helped me a lot.\n\nReligion can soothe a lot of areas of human suffering, and if it works for you then by all means go for it. I felt like an imposter too, though, so I had to piece together a worldview that didn't depend on things that didn't make sense to me.  I've got a lot of book recommendations in this area if they would be useful for you.", "permalink": "/r/DecidingToBeBetter/comments/qf3fh1/learning_to_believe_that_the_universe_is_kind/hhxq6il/"}