{"id": "t5_2tand_t3_mj0sje_t1_gt9dq3t", "creation": 1617468733, "origin": "t5_2tand_t3_mj0sje", "height": 1, "replied_to": "t5_2tand_t3_mj0sje", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Alternative_Yak_4897", "text": "If you haven’t read Anti-oedipus: capitalism and schizophrenia, I recommend you do that! You may need to do some background reading before diving in- Marx and Freud for a start if you haven’t already. There are so many ways that capitalism impacts the way we form our identities in the post-modern era. Systematic capitalism renders us thoughtless/identity- less/consuming machines. It’s a form of ego death I think. \nI also recommend studying phenomenology if you haven’t already. A good one to start with I think is feelings of being by Matthew Ratcliffe.\nAlso! Heidegger’s being and time for intro to ontology. \nIf you’re interested in examining your experience in terms of the difference between self being a part of surrounding and self being apart from/observing surroundings those books would be great. If you’re examining your experience from a spiritual perspective, than Carl jung’s work might be of interest. \nI think what you are describing is becoming as increasingly common experience among people living in the post-post- modern world. Now that we have ease of movement, shelter, food, water, and technology, or biological purpose to feed ourselves and procreate is no longer something we work for every day. Basic needs are fulfilled for many people (obviously not all). We need to create meaning because our biological purpose has been fulfilled. Depression is a reaction to this and so is, as you call it, ego death. My understanding is that ego death is short term and more like a complete regression- your identity isn’t changing in ego death-it just simply doesn’t exist. However, I think the definition from a spiritual perspective is a bit different and I don’t know much about that. \nI stayed at a psychoanalytic residential treatment center and one day a man who had been there on and off for years for depression declared that he was cured. He promptly left and returned within two months. I think dissociation often looks a lot like ego death - a response to immense pain and helplessness that acts as a mal-adaptive coping mechanism to the troubled person (depression usually trauma) can live somewhat functionally. In your case, during the pandemic, being alone and staring at walls after/while dealing with depression could probably induce dissociation- a feeling where you are separate from your body.  \nYour experience sounds incredible and I guess who really cares what the underlying psychology of it is if you’re feeling fantastic! I just thought if it were me I would want to know more and those resources gave me some perspective on similar experiences I’ve had.", "permalink": "/r/DecidingToBeBetter/comments/mj0sje/i_underwent_ego_death_without_even_knowing_what/gt9dq3t/"}