{"id": "t5_2tand_t3_akgc2j_t1_ef5sh2l", "creation": 1548663548, "origin": "t5_2tand_t3_akgc2j", "height": 1, "replied_to": "t5_2tand_t3_akgc2j", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Daniel_VO", "text": "Dude, I'm 28 and my wife left me a year ago. I finally got back on my feet about a month ago, and now I'm just making it happen. Best I can. Emotions fluctuate, but I just try and think of it like going through a withdrawal and hold fast.\n\nI drank copious amounts of liquor, lots of sex (don't do this, it just becomes empty and depressing), and let \"friends\" stab me in the back so I wasn't alone. My first important step was learning how to be okay with being alone.\n\nI watched a lot of Jordan Peterson, learned exactly what and why I was feeling was I was feeling so I could process it and made my first goal about where I wanted to be and started moving. r/MakTheBlade is 100% right! Right everything down, and be brutally honest with yourself. BREATH!!! Opening your chest and breathing increases serotonin and relieves stress. Go outside, force yourself to go outside and spend time in a park or somewhere where you can see green and the sky. But the more you stay inside, the more crippling the depression becomes.\n\nOnly you can do this though. You're aware, so make yourself do it. I don't know if this is good (I'm probably developing a split personality lol) but I would verbally stand in a mirror and berate the areas that were holding me back. I would also make sure that I knew I was doing this because I love myself, and I needed to be the one to push me forward. Also read Can't Hurt Me, by David Goggins. Accountability Mirror that shit up and put yourself back on the path.\n\nIf you want/need to chat, just DM me!\n\nGood luck man!\n\n&#x200B;\n\nEDIT: English is really on point today...", "permalink": "/r/DecidingToBeBetter/comments/akgc2j/34m_i_have_no_idea_what_i_should_be_doing_with_my/ef5sh2l/"}