{"id": "t5_2tand_t3_akgc2j_t1_ef5h60s", "creation": 1548650924, "origin": "t5_2tand_t3_akgc2j", "height": 1, "replied_to": "t5_2tand_t3_akgc2j", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Pulsewavemodulator", "text": "I don't know, because I don't know much about you. So, I'm going to just talk about my experience.  \n\nI've always found that I chase the things I love and I've never gotten stuck. Even when I looked stuck from the outside, I never felt lost. I always felt I'd end up in the right place. The people I know who get stuck, usually are letting life around them dictate where they go and what they do. They are chasing the new thing, or the topical thing. If you chase the shiny things, they are old by the time you get them. If you chase things you love, it's always crystal clear what you'd like to do. Then you find yourself doing things you'd never see yourself doing to make it happen. Rather than the everything feeling overwhelming those things become things you'll handle because the bigger goal lights the way. \n\n&#x200B;\n\nMaybe ask yourself:\n\n\\- When was the last time you were happy? What were you doing?\n\n\\- What is the thing in the world you think you could improve (or do better than another person)?\n\n\\- Is there something you want that no one has created yet?\n\n\\- Is there a skill you wanted to learn, but never tried?\n\n\\- What were you doing the last time you lost track of time completely? That might be a thing you love to do.\n\n&#x200B;\n\nAlso, I highly recommend this book \"[Flow: The Psychology of Optimal Experience](https://www.amazon.com/Flow-Psychology-Experience-Perennial-Classics/dp/0061339202)\" It demystifies happiness and really shows how accessible it is. It also will emphasize that the \"in the moment\" flow of an experience is more important than the result, the accolades, the money. \n\n&#x200B;\n\nLastly, don't get caught up in an idea of something, find the work/process/experience that feels good. A lot of things look cool, but are actually a ton of work. If you don't love the work, you won't excel. I have seen a lot of people at work that like the idea of the job, but are exhausted and frustrated by the hard work it takes to do it. I wanted to be a rock star as a kid. Later in life I went on tour, and it was fun for a month or so, but I learned I didn't want that life.", "permalink": "/r/DecidingToBeBetter/comments/akgc2j/34m_i_have_no_idea_what_i_should_be_doing_with_my/ef5h60s/"}