{"id": "t5_2tand_t3_76g6a8_t1_doei2hq", "creation": 1508085005, "origin": "t5_2tand_t3_76g6a8", "height": 1, "replied_to": "t5_2tand_t3_76g6a8", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "skorokhods_rep", "text": "Great progress! Glad to hear you’re getting some recognition from folks in real life, too :)\n\nTo answer your questions:\n\n**1) How the fuck can I start changing this?**\n\nDon’t worry about not being able to pay for PUA classes. Having seen some PUA videos on Youtube (JT Tran, SimplePickup, etc.), I strongly suspect that PUA classes would have been a waste of time. (Keep in mind their primary audience is desperate, and thus easily manipulated into being separated from large amounts of their money.) PUAs sometimes have some useful information, but they also tend to give off a smarmy “salesperson” vibe that people tend to find annoying in real life, which is covered up by hiring an attractive woman to stand next to them (e.g. JT Tran, Mystery). OR, they do REALLY simple things, like start short, polite conversations with strangers, possibly with the addition of interesting costumes (the aptly-named SimplePickup). You probably don’t need to take a class for that…\n\nA better option would be to get dating advice that is tailored to yourself, and your thought or behavioral patterns. Probably the best option would be a female friend who is blunt enough to be honest with you about your weaknesses, but ALSO has 1) the time and energy and 2) the sympathy for your struggles to want to put in the effort to see you improve and find love. Do you have a sister you’re on good terms with, or are you still reasonably friendly with your ex? Ask them if they’d be willing to look over your conversations with women on dating sites, or ask them for feedback on the plans you make for dates. Ask them what personality or behavior traits are unlike-able, or makes someone look untrustworthy. If you don’t have a female friend like this, one of your younger friends might also work. A close male friend who is socially aware and can understand other people’s perspectives is a much better resource for something like this, than a female friend that doesn’t. (Coaching someone into becoming a better person takes a lot of effort, though, so if you get someone to do this for you, you might want to do something nice for them in return.) \n\nYou can also try to develop self-awareness on your own. You managed to have kids with someone, so presumably that person once liked and then loved you enough to have your children. What did they like about you? Did you like that part of yourself? What did they not like about you? Would you want to change those aspects of yourself, or are they important to you? What aspects of THEIR personality did you not like? Do you ever display the same traits? Dig in there deep. Another good thing to do would be to check r/askreddit’s threads for red flags and green flags. Read the threads about red flags that aren’t about dating, too — I think they tend to get better answers.\n\nThen, change the parts of yourself that you can and want to change. This gives you control over your life, rather than passively handing control over to the people you want to like you back. When you are comfortable with yourself and have an attractive personality, people will enjoy being around you, and you will be more successful in dating. (Looks matter less than you might think they do.)\n\n**2) Am I panicking for nothing, or did I set up myself in a nice one-people-only box ? If not, where can I find people like me ?**\n\nA basic principle to remember is that “Like attracts like”. Athletic people tend to like athletic people. Really nice people tend to like really nice people. People who have their shit together tend to like people who have their shit together. Conversely, people who are desperate to get some void filled (often an emotional or financial void), will find someone else who is desperate enough to get their own void filled to put up with the negative consequences of being with them. You don’t want to be in that kind of situation.\n\nYou say you want to “find a woman who could understand me or enjoy the same stuff as I do”. The easiest way to do this is NOT to find someone who has the exact same interests as you do —which is a tall order —  but think about the underlying personality traits or behaviors of someone who understands others and can enjoy other people’s interests, and then develop them in yourself. Can you understand others, and/or have sympathy for their struggles, even if you wouldn’t have taken their actions yourself? Can you see yourself learning about someone else’s interests, and either learning to enjoy them with them OR appreciating their knowledge without getting into them yourself?\n\nSome of your interests sound really common, to be honest. Who doesn’t like orchestra? Who doesn’t like museums? What over-40s person doesn’t hate the annoying radio/club music that dumb kids today like? ;) I would suggest finding and participating in events where people in your age group are more common, and try to expand your social circle there. Friends-of-friends often make the best dates, from experiences in my own social circle. Try volunteering at art or museums, for example — I’d imagine art has a high female:male ratio, too.\n\nOne last politically incorrect tip: women who are older than you (who are actively dating) tend to be easier. Yes, there are a lot of middle-aged single people that are bitter and angry — as most people who aren’t happy or satisfied with how their lives turned out, and feel as if the window to turn things around has passed them by, would be. BUT, you can avoid them and avoid becoming them, and as someone who is ACTIVELY working on getting their shit together, you will be in high demand.\n\nGood luck!", "permalink": "/r/DecidingToBeBetter/comments/76g6a8/huge_changes_two_months_later_but_the_behemoth_is/doei2hq/"}