{"id": "t5_2tand_t3_oav6ix_t1_h3nkxbw", "creation": 1625120731, "origin": "t5_2tand_t3_oav6ix", "height": 1, "replied_to": "t5_2tand_t3_oav6ix", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Snoo9063", "text": "Imma be honest. No one can really blame you for it since media, culture, and even many social circles have a strong undercurrent of constant sexual tension even in semi non-sexual situations. For instance most tv shows have an element of romantic attraction. Most songs and music are about love, heartbreak, and as of recently more often than not sex, drugs, alcohol. In addition lots of advertising constantly perpetuates sexual dynamics and even things like banter with male friend circles has a large part of that going on. Bars, online dating, hookup culture, social media, attention economy so on and so forth. Go to any rave and everyone is half naked taking ectasy and dancing to crazy amounts of stimulus. It's just normalized and maybe not in the way aggressive porn is but there seems to be some of those flavors sprinkled in and marketed towards males. \n\nIt's pretty normal to be attracted to attractive people or care about attractive people's perception of you. The only thing odd would be if it's exclusive to physical attraction since humans care a lot about social dynamics, status, approval in a wide variety of ways as opposed to just physical appearance though that matters as well I suppose. \n\nI know people will say codependency is running high and change habits, thoughts, etc. and that is most certainly true but it seems much easier said than done. Even if you dropped a habit such as porn and continued doing things for intrinsic motivation there could still be a feeling of caring about ones attention from others. I will say that that is more than likely to diminish though as a core part of ones internal image and self-esteem which is important. \n\nI also think if you normalize how you treat others without respect to attractiveness it won't bleed into other parts of your psyche. For instance not doing specific things exclusively to attract hot women but doing things generally because you find them valuable. If you end up having more women friends, or going to co-ed activities, or spending time around variety of types of both men + woman circles it will prolly normalize that since behavior is reinforced and learned. \n\n\nI know people will say intrinsic motivation and recommend meditation etc. or lifting for the sake of it or pursuing hobbies or activities. Agree with it and it has helped but personally for me I have already done all of that at mid high level for instrinsic value and it hasn't quenched that desire by more than 15 percent tbh.  It seems the mind wants what the mind wants even when changing perceptions and identity/self view. \n\n\nHere are some tips I do have that have worked definitively but kinda unorthodox.\n\n1. Excercise. \n2. Involved meditation \n3. Meet people of different strands and walks of life. Talking to people of all types including those attractive girls. It makes you know there is a person underneath the attractive physical body. \n4. Resolving any past baggage. Mind will crave a lot more when it is not fulfilled in the present moment and any past issues lingering will make it so cravings can create dependency. \n5. Being into aesthetics that are not exclusively physical. For instance art, nature, photography, music production, creative outlets. \n6. Good massages or some type of yoga. Anything that gets physical going. I guess humans like touch. I've gotten a variety of types of massages and it relives a lot of bodily tension. Just make sure it's a legit place. \n7. A pet. You will now have a lot of attention. Too much perhaps. Love and bonding chemicals from oxytocin are gonna fly through the roof. People just love animals. \n\nI wish the meditation or even therapy or meds or working on esteem solved that craving attention thing but it's a struggle. I have legit had access to heightened states and it didn't change the fact that I like socializing it attention though I will say it changed the type of attention I was looking for. \n\nThe main shift is realizing that pleasure is most definitely not the same as joy, bliss/tranquility, equanimity so I try to gear things to more long lasting satisfaction.\n\n\nIf the thought or craving attention arises easier said than done but try to view that with light heartedness instead of pushing or pulling such as gently acknowledging those emotions as they arise. See the space around it so that it's still present but now it's kinda floating in an empty sea or ocean. Trying to force your mind in another direction can backfire so this is a slower process. Eventually you will still see attractive people or people giving attention and notice that and notice how your own body, mind, responds to that and it won't be like a dark cloud. You want it to be like a light cloud. \n\n\nNow the hard part is low-key even post heightened states like deep concentration, or absorptions which felt very fulfilling it didn't not change that I was attracted to attractive people. I definitely still noticed and in some ways I noticed even more like if they had positive energy or negative energy which seems to automatically contribute to our like and dislike of something but is normally automatic/habitual. My craving did go down a bit  If it keeps popping up then it's usually an underlying issue though which seems to be the case for me but maybe not for you.", "permalink": "/r/DecidingToBeBetter/comments/oav6ix/craving_female_attention/h3nkxbw/"}