{"id": "t5_2tand_t3_3tbs1c_t1_cx526up", "creation": 1447886815, "origin": "t5_2tand_t3_3tbs1c", "height": 1, "replied_to": "t5_2tand_t3_3tbs1c", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Fordrus", "text": "I'm with you, that video did an awful job of communicating how pessimism can make a person happy.  I do believe that, though I rarely put it that way.\n\nI want to be happy, and so, when my mother-in-law is visiting for a week and being a judgemental harpy to me, I focus on how helpful she is to my wife, how different core experiences, like helping negotiate her parents' divorce settlement, have made my wife a version of herself that I love, and I've learned to enjoy interaction with her even very shortly after I am SEETHING inside about her latest pronouncement of my total inadequacy.  This is to say, I've learned to hope with my optimism, and expect with my pessimism, and I therefore orient myself in the world in such a way that good luck can benefit me, while also protecting myself from extreme cases of bad luck- and in the meantime, I laugh easily and well (usually, but I also cry or have a good scream session as necessity dictates :) )\n\nThe person with ONLY optimism- who sets their *expectations for life* up using only their optimistic outlook, is cruising for a cold bucket of icy reality in the face.  A person who uses only pessimism may be better prepared for reality, but also trends towards a dual catastrophe of *never* being able to benefit from good luck, and also of losing hope/purpose (ex: certain that the idea cannot work, pessimist refuses to bother with sticking seeds in the ground to grow food, remains hunter/gatherer forever- or one level higher, believing he/she will never acquire enough food to get through the winter, pessimist *gives up* and starves to death- or in the other trail in the dual catastrophe, a pessimist even manages to survive pretty well, but before long, takes so little pleasure in surviving that he/she ceases to see the good sense in doing so.)\n\nOptimism and pessimism are both best tempered by *realism*, but until after-the-fact, realism is uncertain- everybody thinks that THEY are the realist in the equation, but only time reveals who actually was (and often not even time will do so!) -so pessimism and optimism are ways to define what you approximately define as 'realism'- and in my estimation, the best way to go is to learn to have separate sets of expectations- high expectations that you deem desirable but unlikely, set using optimistic tendencies, lower expectations that you deem very likely, set using pessimism, and then a certain emotional flexibility about how sad you get over the high expectation set not being met, and increased excitement when your pessimistic expectation set is exceeded.\n\nAh- also critical in this, it seems to me, is thinking about it to a degree, making a decision, and then leaving it alone.  It does seem to me that agonizing over your level of pessimism/optimism is a road into a blind alley. ;). Despite the time I take to meditate on these things, I define myself as an optimist, because I deem that the most generally beneficial and helpful thought-train, and because unlike the video states at the beginning, my experience is of a profoundly pessimistic world- perhaps because when I see good cheer being used as a brazenly obvious sales tactic, it rubs me as *pessimism*, not as *optimism*.  (This despite being often referred to as 'smiley' by my peers- that is, I'm very cheerful, and I do enjoy seeing the world as happy and optimistic, but the veneer of optimism in advertising, etc. Is so thin, I don't even regard it as actually present-day it's like dusting powdered sugar on a rock; that does NOT somehow make the rock into a cake!)\n\nSorry for the ramble, I just got going and didn't want to stop, it's certainly an interesting topics to consider, even if the video seemed to more accurately describe depressive thinking than strictly pessimistic thought as you say (and I do agree with you there :) )", "permalink": "/r/DecidingToBeBetter/comments/3tbs1c/the_wisdom_of_pessimism_pessimism_is_generally/cx526up/"}