{"id": "t5_2tand_t3_q9pljp_t1_hgxq4kz", "creation": 1634437340, "origin": "t5_2tand_t3_q9pljp", "height": 1, "replied_to": "t5_2tand_t3_q9pljp", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "cmiller0513", "text": "Do you by happen to be or were enrolled in a gifted and talented program? Serious question, btw.\n\n\nRegardless, as hard as it can be at first, your best bet is to set strict limits to your social media consumption and STICK WITH IT.\n\nFind some subjects you enjoy and get lost in wikipedia searching things you are interested in but know little about.\n\nAlso, learning to study will prove to be MUCH more useful in your future if you decide secondary education is something you want.\n\n\nAnd most of all, remember that is OKAY to not be good at things at first. Learn from your mistakes and try to take notice of your natural talents & abilities, and your weaknesses & struggles to understand what to focus on and possibly what to use to find enjoyment in life.\n\nThere are outliers that are innately talented at specific things, but most people work on skills needed and practice until they become easier.\n\nHaving a childhood where things come naturally and where the educational experience isn't challenging enough sometimes creates an innate stigma that ALL things should come naturally and often times get discouraged more quickly & intensely than others.\n\n\nFinding something that challenges you a bit may prove more fulfilling than something to just pads the time.\n\nAlso, depression can be a bitch and destroy motivation, and it may due to a variety of things, or it could be nothing at all - which compounds the feelings even more.\n\nYou are not alone in these feelings  I promise. They are temporary as hard as it is to understand\n\n\n\nBest of luck, friend!\n\n\nSorry for flow, writing isn't my thing.", "permalink": "/r/DecidingToBeBetter/comments/q9pljp/how_to_start_enjoying_things/hgxq4kz/"}