{"id": "t5_2tand_t3_gixkk8_t1_fqicv8t", "creation": 1589394309, "origin": "t5_2tand_t3_gixkk8", "height": 1, "replied_to": "t5_2tand_t3_gixkk8", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TomFuckinSawyer", "text": "You have nailed it. This is exactly where I was 2 years ago, and I’m now better than I’ve ever been. \n\nMy ex and I broke up almost a year to the day. In that year, I’d completely turned my professional life around and we were set to embark on the rest of our days together. We were thinking about kids, looking at houses, etc etc. \n\nThen I saw the texts. I confronted her, she denied and denied, she broke up with me, and I left. For about three months I was bothered, and then I said the same thing: ‘thank god she broke up with me’. She had a guy over 24 hours after I left. She went through 9 guys and an engagement in the next year. She’s now with someone she settled for, living in a dump, and has zero friends. Big time PHEW. \n\nI took the same route you did, and I made the changes. I look better, feel better, I bought a new car, a house, the works. She’d gotten wind of what’s transpired in the almost 2 years since, and I guess it pissed her off. Awesome. \n\nDo you, get where you want to be, but I’ll caution you on a couple things: don’t force yourself to be single, and don’t lean too much on those charisma videos. Allow yourself to date, to be dateable, and to be dateworthy. Don’t sell yourself short or think you HAVE to wait. As for the videos, they have the threat of making people come off cheesy. Be yourself, get out there a bit more, and just force yourself to relax, converse, and be involved. Natural you is better than learning to be someone else. \n\nI’m happy for you. You have such a healthy grip on this, and I wish more people could grasp the concept and control you’ve come to have. I wish you all the best, and stick to your plan. \n\nGodspeed!", "permalink": "/r/DecidingToBeBetter/comments/gixkk8/girlfriend_of_25yrs_left_me_for_someone_else_im/fqicv8t/"}