{"id": "t5_2tand_t3_2gfrdx_t1_ckkpaot", "creation": 1410946535, "origin": "t5_2tand_t3_2gfrdx", "height": 1, "replied_to": "t5_2tand_t3_2gfrdx", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "notthemonth", "text": "What are you interests?  Perhaps we can help you better if you are more specific about that kind of thing.  \n\nUntil then, some general suggestions:\n\nMeetup.com.  If you are in a bigger metro area, this could work out well.  They have groups for all different interests.\n\nCheck out if your university has a department of service learning or volunteer programs.  My old university does, and keeps an updated list of local business, orgs, and clubs that need volunteers in many different fields throughout the year.  If they don't have such a department dedicated to volunteerism, check out the departments related to work you're interested in and just walk right in and see if there's something you could help them with.  It may not work out, but it never hurts to ask, and if there's already an established program there, you are sure to meet other students.  \n\nBut lastly, I want to say not to overlook the resources you already have.  I was kinda in the same boat, but mostly because I'm an anxious introvert.  I still like making new friends mind you, but I get social anxiety in that situation.  So, until my 5th yr, I had all the same friends, who ended up dwindling bc I broke up with my bf and in turn lost all the friends I made through him.  \n\nIn the last year and a half of my college experience, I became VP and eventually President of a club I helped to create, worked at the Student Health Center as a peer educator with several people who are still my friends today, and ended up interning there my last semester, quadrupling my hours there, and exponentially multiplying my networking ability since we worked a lot with getting health programming into different campus organizations.  My last year was my BEST.  Don't give up.  You don't have to have a lot of friends to have fun.  Quality is better than quantity.  Talk to those who share your interests, even if you think they're not interested.  If you're kind and open enough, they will likely open up to you if they're worth befriending.  Don't overlook people that are already in your program, which I'm assuming you entered because it interests you.  If you're worried someone you're interested in befriending doesn't like you or already has plans w other friends or something, an open invite to some group event is a pressure-free way to go about it haha.\n\nGood luck!", "permalink": "/r/DecidingToBeBetter/comments/2gfrdx/decided_to_be_more_social_but_my_opportunities/ckkpaot/"}