{"id": "t5_2tand_t3_po4faq_t1_hcufgux", "creation": 1631640861, "origin": "t5_2tand_t3_po4faq", "height": 1, "replied_to": "t5_2tand_t3_po4faq", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Astrnougat", "text": "Good for you!\n\nI had an ex who was diagnosed with issues out the wazoo - and I was always telling him - you can’t medicate trauma away. You have to deal with your issues head on - and the first step for him would be to move away from his toxic family.\n\nBut he would always blame his problems on “headaches” or on his diagnosed illnesses - when the real problem is that he was enabled to death and his mom relies on his helplessness for drama and to make her look caring and supportive.\n\nThe poor guy is 30 years old, and after our breakup he gave up any independence we had forged for him and is back to living in his moms house - still feeling shitty about himself and not taking any responsibility for his own problems.\n\nYour environment is huge. For me, healing came when I was able to live alone, was not dating anyone, and had time to focus on me, and build friendships with people who supported me - but who also held me accountable. The big changes came when I would fuck up, and didn’t have anyone to lean on, and I had to learn how to forgive myself and move forward. I learned how to care for myself, I learned what I liked, I learned my strengths and weaknesses. Narcissist parents don’t leave space for YOU in the relationship - so a lot of healing is about being selfish, about TAKING space for you, discovering you, learning to appreciate you, and eventually, learning to create boundaries around the people that want to take advantage of YOU!\n\nYou have been raised to not prioritize yourself, so you have to keep an extremely proactive eye on the negative self talk, you have to be patient, you have to be observant of your own mental patterns, and eventually you believe the good things others say about you, and eventually eventually - you stop putting up with peoples bullshit!\n\nI’ve been in therapy for around 5 years, learning to recover from my narcissistic mom - and only now so I feel competent enough to smell bullshit from a mile away and avoid it. Healthy people only! I deserve it", "permalink": "/r/DecidingToBeBetter/comments/po4faq/the_most_important_thing_to_understand_is_that/hcufgux/"}