{"id": "t5_2tand_t3_po4faq_t1_hcudl7k", "creation": 1631640120, "origin": "t5_2tand_t3_po4faq", "height": 1, "replied_to": "t5_2tand_t3_po4faq", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Kiwi-Fox3", "text": "> the truth is i’ve just been in a shit situation with work, wfh, and somepersonal stuff the entire time. all of the help i got was like tryingto hook a fish up to a weird system to help them breathe out of water,when the answer is to get them back into the damn lake.\n\nYour words couldn't be any truer. I feel as though my heart matches with yours, as well as with others, when I hear the same course of thoughts...\n\nIt saddens me that in your experience, you had to go through many therapists, only to be invalidated. I feel so utterly blessed, to have found the therapist I have, as she is truly the muse and motherly figure I never had in my life. Her support in me, helped me further find my voice, and sort out the chaos.\n\nThe ironic thing with your case, is that you still had a voice deep within you, telling you, this isn't quite right... something isn't adding up here. I deserve better.\n\nI am a fan of r/antiwork because it validates our grief with shitty companies and toxic work practices. COVID was the catalyst for a lot of us to realize that we ***deserve*** to be treated with respect. We ***should*** take time off from work for Mental Health Days, and not made to feel guilty for doing so, both societaly, & even the mental battle we have with ourselves. We deserve to take time off for ourselves, to work on ourselves, and to admit we may have health issues that impede us.\n\nDon't let anyone make you feel otherwise!\n\n(and yes, obligatory acknowledgment that in ***some*** cases, meds are necessary. This is meant to shed light on misdiagnosis, and over prescribing, while failing to look at the outward problems causing the distress, instead of just pointing the finger at the individual. See my post [here](https://www.reddit.com/r/depression_help/comments/mufgmm/sometimes_its_necessary_to_refuse_medication_and/) for more. & also, for those who dig profiles, I am a mess. lol, I apologize if you review my profile, but please understand that I am doing well in my Journey, and I am growing and learning each day. My history is a testament to my change.)", "permalink": "/r/DecidingToBeBetter/comments/po4faq/the_most_important_thing_to_understand_is_that/hcudl7k/"}