{"id": "t5_2tand_t3_po4faq_t1_hcw8fh6", "creation": 1631668437, "origin": "t5_2tand_t3_po4faq", "height": 1, "replied_to": "t5_2tand_t3_po4faq", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Kiwi-Fox3", "text": "Sounds like a good book to read! Unfortunately my executive dysfunction still is an issue 😅\n\nI took my first dosage back in 2012 I believe, and have since then had seven macro doses. The strains I know for certain I got a hold of were B+ and Golden Teacher. Golden teacher was the one that I had my most vivid experience, and was able to (spiritually) connect with my \"sister cat\", who was also abused by my parents... It sounds absolutely absurd, but, I was able to connect with my (current) kitty and we had a deep, emotional, unspoken conversation. When I began to cry, he went from gazing into my eyes to jumping in my arms and nuzzling the tears on my cheek... It was powerful, in many ways...\n\nIf you're going to adventure into it I strongly recommend having a trip sitter. Someone who is good for your mental well-being and someone who will be able to talk you through if you have any negative experiences. (I have yet to have a negative experience, because I ensure that if I am going to commit to a trip that I'm in a good place, or at least stable.)\n\nThe first time I ever tripped on mushrooms it helped me with my religious trauma and overcoming my fear of Armageddon and the fear of the afterlife and its punishments. I was assured that all things will be okay and that the idea of heaven and hell is merely a construct by humanity used to manipulate us. I don't know a thing about my heritage or ancestry, but the message felt like a warm familiar presence, one of which I have never experienced in my life, as all of my immediate family is extremely abusive (except my brother).", "permalink": "/r/DecidingToBeBetter/comments/po4faq/the_most_important_thing_to_understand_is_that/hcw8fh6/"}