{"id": "t5_2tand_t3_dvyxuf_t1_f7g78f3", "creation": 1573696344, "origin": "t5_2tand_t3_dvyxuf", "height": 1, "replied_to": "t5_2tand_t3_dvyxuf", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ngoldsworthy", "text": "Believe it or not, the discomfort that these conflicting feelings are causing you is a good thing, As you age, you will recognize the good and bad behaviors you’ve inherited from your parents. The good behaviors, such as a strong work ethic (your mother), are the sort of behaviors you want to keep. The bad behaviors, such as being married to someone you don’t love or mismanaging money, are the behaviors you want to leave behind. \n\nYou can be proud of the work ethic that your underprivileged upbringing has instilled in you, and it may not necessarily be due to seeing your parents work hard. It may be because you simply don’t want to be like them, and that’s okay. \n\nYou cannot control the environment into which you are born. However, what do you stand to gain by blaming others for being born into an environment in which they have more privileges than you? Upon closer inspection, are they really more privileged than you? Does it really matter? \n\nThe answer is likely this: you don’t stand to gain anything by comparing your situation to someone else’s situation. You can only play the cards you’re dealt. Moreover, folks with more privilege than you likely have their own shortcomings as well. \n\nYou can only control how you respond to your situation. Take what is good from your upbringing and leave what is bad. If you feel bitter towards your parents, that’s okay too, but remember that they’re also human, so don’t hold onto that bitterness for too long. \n\nAs another poster has suggested, I strongly recommend stoicism as a source to help keep your mind focused.", "permalink": "/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/f7g78f3/"}