{"id": "t5_2tand_t3_dvyxuf_t1_f9hs2y3", "creation": 1575320636, "origin": "t5_2tand_t3_dvyxuf", "height": 1, "replied_to": "t5_2tand_t3_dvyxuf", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BeeBeeDubyu", "text": "If you spend your life looking at how good everybody else has it you will miss out on all the opportunities you have to make something better out of what you have.\n\nFairness does not exist in the real world, it is a human ideal. So complaining about the unfairness of life is like complaining the sky is blue, it is a total waste of time.\n\nWhen you find yourself comparing your life to those both more successful and less successful than you, stop it, it is none of your business how they are doing, it is a dangerous habit and not helpful in any way. At best it feeds your ego and at worst it makes you feel like crap, don't do it.\n\nYou won't get rid of resentment easily, if you even can. But you can reduce the sting by choosing not to waste time on it and avoiding making comparisons to others. Just as you are not responsible for the circumstances of your birth, wealthy people are not responsible for theirs either, judge them on their actions and if they do anything you do not think you would do in their shoes then sure feel resentment, but otherwise, resenting them is absolutely pointless, and illogical too. Why not resent a gorilla for being strong or a cheetah for being fast? It is just as illogical, and even if you spend your whole life focusing on that resentment they will not notice, or care and you will still be yourself and they will still be rich...or strong...or fast. The only difference is you will be old and regret wasting your life on something so silly (not ridiculing your feelings btw, I understand that totally but 'silly' in relation to all the good it will do you).\n\nFocus on your own life and goals, do not waste the life you have by wishing you had another one. If you focus on other people it doesn't matter how good your life is, you will still see it as poor because as soon s you reach a new height you will no doubt cherry pick somebody higher out of habit.\n\nYour post could have been written by me. I am 32 and come from a poor (for the UK) background. It has taken me my whole life to get rid of the chip on my shoulder. I still have bad days but I am better at managing them.\n\nThough my advice won't stop you wishing you had more money or whatever, the fact that life is unfair is absolutely true and the sooner you get that into your mind the easier it will be to accept that it is not about how far you get, or where you or others started, it is all about how far you want to go from where YOU started and how hard you're willing to fight for it.\n\nI was upset about something similar to this recently and one guy gave me a great comment. He said whatever you decide to do, commit to it completely. If you want to improve your life, you fucking go for it like Steven Segeal after a burrito, like Nicolas Cage after a part in a B-movie...etc.\n\nIf you decide to go to war, go to war with an eye for wreaking complete, total and utter destruction upon your enemy. This is how you will make the most of the life you have, not by wishing it away but by focusing on what you have to do to make it better one step at a time. You do that and your resentment will fade to nothing but a bad day now and then.\n\nGood luck dude.", "permalink": "/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/f9hs2y3/"}