{"id": "t5_2tand_t3_dvyxuf_t1_f7ho2q0", "creation": 1573744391, "origin": "t5_2tand_t3_dvyxuf", "height": 1, "replied_to": "t5_2tand_t3_dvyxuf", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MsCrazyPants70", "text": "Money doesn't end suffering, because those same rich people compare themselves to the next level of richer person. They then feel like they didn't accomplish enough.\n\nI can agree with some of the resentment though, because they will generally claim more personal involvement in being rich than seeing how certain privileges got them there. Most people can at a minimum meet the same class level as their parents. That means if you're parents are rich, you only need to put a very moderate effort into being that same level of richness. If your parents only ever owned a trailer though, then without more effort involved, you will likely live your life in a trailer as well. In addition, significant effort into changing that class level is no guarantee of success.\n\nWhat money does give you are the means to pursue your passions instead of being in just survival mode. Money has the ability to buy additional leisure time.  By that I mean you can hire someone to clean your house, mow your lawn and so on, or you have enough money to reduce the number of hours you work to spend more time in leisure. Yes, some people can make money at their passions, but a significant number of people can't. There are more failed musicians, artists, and poets than successful ones.\n\nMoney gives you access to better medical care. You could afford the top in the medical field instead of having to just go to the cheapest. You don't ever have to avoid doctors to save money (I go as little as I possibly can, and have issues from injuries that needed medical care).\n\nAlso, how much effort is enough to expect success?  There are stories told about a person with singular focus, who only wanted one thing. But what if you don't have that focus. What if you only have enough energy to work, go to the gym, and take care of normal life things?  Then if you put kids into that mix, you could make your kids suffer with your pursuit of wealth (ignoring the kids, skimping on what they need, etc.).\n\nSo, I guess I'm not helping. So, how to deal with it. You need to find what does make you happy. For me, it's being out in nature. If I'm hiking in the woods, rich people are the farthest from my mind, and it's a hobby that takes very little money (just transportation to woods). Back when I worked 2 jobs and couldn't get away, my zen moments came when bicycling. If I had a chance of a few hours somewhere, I was on my bicycle. So, what makes you feel at ease with where you are at in life?", "permalink": "/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/f7ho2q0/"}