{"id": "t5_2tand_t3_dvyxuf_t1_f7hnkg4", "creation": 1573744125, "origin": "t5_2tand_t3_dvyxuf", "height": 1, "replied_to": "t5_2tand_t3_dvyxuf", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mackbloed", "text": "I totally relate to where you come from. \nI'd say continue to keep pride in your upbringing. There's no changing it, and it's moulded you into who you are. \nDavid Goggins' book or social media may be useful for you (as it was for me) in terms of embracing the struggle and using it to fuel you.\n\nYour resentment can be your friend, in a way. \nGrowing up, I knew I was in the \"have-nots\" and it made me embarrassed, but largely went away when i moved away for uni. \nI actually felt like the resentment got worse as I started to work full time. \nAll those people my age who still lived at home, saving money, having gone to private school. It felt like they had every opportunity to succeed but attributed it to THEIR own hard work. Ha! \nI get it. Yes, the wealthier people couldn't help their upbringing either, but it drives me nuts when they think they've worked harder than most to achieve what they did. Especially when they can't see like the 10 amazing opportunities gifted to them that you or I would never get. \nCheck out Malcolm Gladwells Outliers book on how even the world's best (bill gates, Wayne Gretzky) are incredibly LUCKY more than they think. \n\nAnyhow, with time, it all comes out in the wash. \nYeh, you'll see some \"wealthy douchebags\" or super privileged people will have the perception of a great life. But then you'll realise behind the scenes that things aren't that great for them. This happened around 30 years old I found. \nAll that humility you had to eat growing up, all those life lessons you had to endure at a young age, the emotional struggles, they are all tools in your belt now. \n\nI found Gary vaynerchuk to be great to listen to as well, when he details his upbringing and where he got to.\n\nYou said your parents spoiled you with what they could. This is also great to hear. They loved you. Alot of people don't even get that. \nIt's all perspective man. \nVolunteer at some organisations with at-risk kids, or do some travel and see how alot of the world live under $1 a day.", "permalink": "/r/DecidingToBeBetter/comments/dvyxuf/how_do_i_stop_being_bitter_about_my/f7hnkg4/"}