{"id": "t5_2tand_t3_p66zxe_t1_h9bnhd3", "creation": 1629228266, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 14, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "azf1R3", "text": "All I can do is send you love & hugs online. I've been through a seriously shitty phase where I'd stare into space instead of doing simple things. I didn't realise how bad it was until I read your post. Your post helped me feel even better about myself as I realised how much I've overcome so thank you VERY much for this.\nI still can't read a book ( use to read a LOT until a few years ago when I went through extreme level of emotional/ psychological/ physical / sexual abuse after which my brain switched itself off ). I SO relate to what you wrote. \n\nI'm 60% better. I workout, I cook sometimes ( I use to cook every day before the assault on my life ) & I'm generally semi functional. I even went out with friends & some dates but generally I'm proud of the workout. I started from just walks in the park. \nIt did take me hell of a long time though, like, I'd plan on going out just out of the house down the street in the morning & would eventually manage to get out DAYS after deciding to do so, generally in the evenings, for less than half the time I would have decided, even if I'd think about it laying in bed or sitting on the sofa with my shoes in my hands for hours, then it would be 3 am & I'd decide to go the next day, so on & so forth. \nI train almost 5 days a week some weeks, others a min of 3 days a week. That's the only thing I've got going on for me right now. I've stopped crying or snapping at people every day. I make my bed most days but I wanted to tell you I'm here. I'm living. I look good. It doesn't matter to me, I'm not interested in attracting people to myself, I'm dead inside, but at least it's something. Makes me feel like I'll get my shit together one day and that's fine. I've been through a lot. I've even dated ( with the intention to distract myself, I haven't been interested in someone for a long time because of what my ex did to me ). \nBut here's me . I was you 2 years ago. \nI'm a lot better now. \nI let everything out. I wrote a journal every day. I talked to random people anywhere. I cried in the gym when hips workout released stored traumas. But here I am, I'm not dead yet. \nThere's hope, buddy. Hold on to it strongly. Write & talk about it. Empty yourself. That's what I can tell you. \nBless you amazing soul.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9bnhd3/"}