{"id": "t5_2tand_t3_p66zxe_t1_h9ct7fo", "creation": 1629247253, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sheraby", "text": "I know exactly what you're describing here. I'm in a really different situation than you but I'm going through something very similar. I wake up in the morning and have ideas for things to do, but I ended up just lying there for hours, go to the bathroom, lie there for more hours. I've been going through this with ups and downs for more than ten years but this is the worst it's been and I feel so alone. (Now I know I'm not!) I'm a lot older than you. But I'm still trying.\n\nLots of great advice here. One thing I would add is not to get overwhelmed by all the ideas. You don't need to do everything at once. Not even two things. One thing at a time is fine.\n\nAs others have remarked, you've written a really good post here. If you read it back to yourself, you might realize that you've actually done a lot for yourself. Although you might feel now that most of it didn't work, it's all good information. Just because a test comes back that seems to not show something or a doctor acts like a jerk, that doesn't mean that what you're going through isn't real. \n\nI'm reading a book now by a psychiatric neuroscientist about how everything little helpful thing you do for yourself makes a difference and literally makes changes in your brain. Just starting with one thing, cultivating one good habit, can help start a positive feedback loop that can support long-term recovery. He lists things you'd expect, like exercise, really good diet, sun exposure, etc,. One thing that I learned is that even thinking about things you're grateful for makes a difference. \n\nI'm jealous of your ability to write. I bet you'd do really well keeping a journal of anything you want to write about, but especially what works for you and what doesn't. \n\nI also want to mention a couple other things. First, executive dysfunction is not a diagnosis of an illness or an innate characteristic. Everyone has an executive function in their brain and everyone can experience it working in suboptimal ways. It's just that people like you and me have developed such strong dysfunctions that they're seriously impairing our lives. We can change that. In addition to all the strategies you're trying and all the suggestions here, you might make a note to learn about the concept of learned helplessness sometime and see if it might be of use to you. \n\nSimilarly, dissociation is an experience, not a diagnosis of an illness. It's often one of the symptoms of PTSD. I have CPTSD also. I've had a lot of therapy and overall I feel it's actually been more harmful than helpful. But it took me decades to realize I was suffering in this way; I was so locked up inside that even the best therapist might not have figured it out. Now that I've had a little bit of help to understand more of what's going on, I've made it a mission to find the right kind of therapist, one that practices embodied approaches and has experience treating CPTSD specifically. For me it also means family systems therapy and acceptance and commitment therapy. Of course, I'm going about this at the speed of a snail. I'm in the US and I tried to get help finding a therapist and the people I hired to do it tried to rip me off for hundreds of dollars. I collapsed for a month or so but now I'm starting to try again to find someone on my own. I have insurance but they're useless; they just want me to go for short-term CBT. \n\nIt sounds like you've got a good grasp on this stuff and aren't letting the labels dictate to you. I wish you the best. I'm also happy to chat, although I'll warn you I'm not on Reddit every day and I'm slow, like everything else for me. Socializing is good however you can get it, even support groups as long as they let me just hang and not talk off I don't want to.\n\nP.S. Do get off any unprescribed pharmaceuticals, especially the modafinil if you don't need it. If there's one you can trust, consult a doctor about whether it's safe to go cold turkey or how to taper down. My ex got messed up in a similar situation. Hopefully this isn't you. And seriously, good luck. You deserved to feel better.\n\n[Edit: learned helplessness, not learned helpfulness. (Although that would be good, too.) There was a book about it, I think by Martin Seligman.]", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9ct7fo/"}