{"id": "t5_2tand_t3_p66zxe_t1_h9c963i", "creation": 1629237398, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "azf1R3", "text": "Yup, I did that too. I would sometimes go for a walk just ONE day a month, but I forgave myself for it. J tried again & again & again every single month. I'd talk about what I want to do with just anyone who listened. \nThe waitress at the café ( example \" Oh, I hope this coffee motivates me into finally going for that walk \"). Driving to the park instead of walking there. Staying in the car with the door open without going out & just sitting there & driving back. Shamelessly forgiving myself every time I failed. And yes, I'm just a shell of a person I was, but hopefully I'll grow into someone stronger on the inside. Some days I even feel happy for an hour or two, it's SO amazing, I didn't even feel that one hour of happiness for MONTHS. Then it started from feeling happy for a few seconds or 2 min a day for a couple of times a day. \nThe key to this is venting & forgiving yourself for the failed attempts. Think of it as a success that you ATTEMPTED & know it will eventually happen one day. \nOne day at a time, buddy. One day at a time. It takes YEARS for even physical injuries to heal. I snapped my back in a sparring injury & it took me a year to even walk. Burns & cuts take their time, make a scab, everything takes time. Emotional & psychological traumas take longer because we can't even apply that ointment to it or put it in a cast, but it DOES heal. You're going to get better. I'm on UK as well. The weather doesn't help much either, but I'm moving & I'm slowly coming to life. I know it will take me another year to feel semi normal & enjoy life but for now, I'm forgiving myself for the bad days & then making my resolve all over again & again & again. I'm not quitting. I'm going to keep moving. \nKeep moving, buddy. Even if around your bedroom ( done that too immediately after my injury. Just walked back & forth in my bedroom). Open the windows for fresh air often. Breathe life. It helps. \nSending you courage & love, buddy. You've got this even when you think you don't.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9c963i/"}