{"id": "t5_2tand_t3_p66zxe_t1_h9ehczn", "creation": 1629289763, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "waltzingmatilda8", "text": "These are all really really good questions to ponder. I wanted to suggest a therapist rather than a psychiatrist too. Labels and diagnoses do communicate a lot but I personally find them inadequate because they are never solutions. \n\n**Relationship-building is the ultimate solution.** We are wired to connect and when you're feeling what you're feeling you need at least one real life person to connect to about that.\n\nWhen I moved alone to a big city, the healthcare options for therapists were awful so I budgeted and found a woman my age and sex who was still completing her training as a psychotherapist. She was excited about her new path, she was cheaper than those with credentials, and she was a way for me to gather my thoughts every week and be vulnerable with someone who phenotypically resembled someone I might befriend in the real world. It helped me learn how to better connect with people generally, and I eventually made some friends--good ones, too, since my \"standard\" was someone who is trained and paid to listen! It made me a better listener, too.\n\nI still live alone and especially after covid isolation is a temptation for me and it sounds like that might be the case for you too. Honest to god talking to myself has helped a ton. I don't mean pep talks but verbalizing my thoughts just so that they *go* somewhere instead of swirling around in my head while I sit catatonic. I have a journal app (DayOne) that transcribes audio recordings, and that's awesome because years later I can go back and also search. I'm getting cats soon too so that I'm no longer just talking to myself ;)\n\nThat's the last thing I'll mention--take some responsibility, *any* amount will do. There's no shame in not being able to take care of yourself the way you want to, or in finding life too unbearable sometimes, it's fucking hard. It's always been way easier for me personally to take care of others than myself, and if you don't have family or friends a pet or two might be a good option to start with. Visit a shelter, see if you feel inspired to make some critter's life better and maybe in time you will have the necessary impetus to do it for yourself too.\n\nI wish you luck and thank you for sharing. I know you can find peace, too!", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9ehczn/"}