{"id": "t5_2tand_t3_p66zxe_t1_h9cai6i", "creation": 1629238018, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SymblePharon", "text": "I can identify with the difficulty in doing simple things, and the paralyzing aversion you're describing as well. In my case it was due to pain avoidance. The fear/anxiety would bubble up and all choices would seem equally bad. I am lucky, I am doing much better with a combo of medication, exercise, and other changes. But one of the central things that helped me get better, which I'm hoping may help you too, was learning to sit with the pain.\n\nI would find myself paralyzed, trying to choose between taking the stairs or elevator to my apartment. Should I try to get a little more exercise? Was I too tired, and should give myself a rest on the elevator? Did I deserve it? If I took the stairs, would I regret it later? All the while feeling more and more stupid and worthless, because I couldn't make this simple decision.\n\nSo it turned out, for me, that being stuck in those choices was just a coverup for seemingly bottomless self-loathing. I didn't matter, therefore neither decision was better; it would amount to nothing. It wasn't until I started facing the pain and tracing its roots that I started getting better. \n\nI think that's not uncommon, but it does seem like everyone has a different path out of it. I can't guess what yours will be, if you do choose to get out of it. I self-medicated with marijuana for years. It doesn't work for me anymore, but it did help. Psychedelics helped also. Meditation really helped, once I figured out how it worked for me. Camping is really good if you can try that. The other things that helped, you've already tried: meds, therapy.\n\nI firmly believe a better life is possible for you, if you believe it's possible, too. That's tough, I know. But you can always hang around and find out.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9cai6i/"}