{"id": "t5_2tand_t3_p66zxe_t1_h9ckfxf", "creation": 1629242775, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 107, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "compadre_goyo", "text": "*Move your fcking body,* man.\n\nThis isn't the cure, but life is an experiment for everyone in it.\n\nAt the very least, we have laws that govern this universe we live in.\n\nNewton's first law of motion describes your current state of current state of stagnant inertia.\n\nA body at rest tends to stay at rest.\n\nA body in motion tends to stay in motion.\n\nYou have been allowing those intrusive thoughts to loop endlessly, because it is way easier to let them debilitate you, than to do something radically pattern-breaking.\n\nAnd I'm not saying force yourself to run a 5k run. That shit's easy. You exhaust yourself, you're done with it, and you gratify yourself immediately with succumbing to the sore idleness of the day after.\n\nI'm saying force yourself to walk around the block, every day, for 1 month.\n\nThen force yourself to build your way up to a jog around the block for the next two months.\n\nThen force yourself to incorporate strength training along with your anaerobic exercise for 3 months.\n\nSo on and so forth.\n\nYou are not your disorders.\n\nYour disorders are the obstacles you must overcome to see the light in the dark moments throughout your life.\n\nBut your disorders will mean shit once you start seeing the sweat and tears turn into ripped muscles, and a peaceful brain.\n\nYou ***are*** comparing yourself to the rest of the world, and that is one of the biggest causes of your stagnation.\n\nI remember when I was in exactly your same position.\n\nBottom of the barrel for two years.\n\nCouldn't form sentences with the exorbitantly loud thoughts of wanting to cry in front of everybody.\n\nBut not only was I allowing myself to stay in that pit, I was craving to dive deeper and deeper.\n\nI was looking online for any and every diagnosis I could pin my problem to, so I could start a medication, or a treatment, in order to surpass it.\n\nI vividly remember reading so much about these disorders, I would memorize the symptoms (since I could relate **EASILY** with them) and complain about it to my doctors.\n\nAnd like you said. Most of them wanted to just keep me alive. So \"here, take this prescription\".\n\nThen I would proceed to read about it, and obsess over the success stories, just as much as I would obsess over the complaints.\n\nIt was an extremely depressing 2 years.\n\nAnd I can definitely relate to how difficult it was to put on a Youtube video.\n\nBut I would only *\"move out of my bed* ***if I had to.\"***\n\nA.k.a. if someone was asking me to.\n\nNot because **I** wanted to.\n\nI promise you, if you really want to get out of that deep abyss, move your f*cking body.\n\nWhenever you decide is best. Morning. Afternoon. Evening. Move. Get out.\n\nYour sh*t thoughts will come along for the ride, no doubt.\n\nBut as you keep the consistency, you will start shifting your attention from your thoughts, to what is happening in front of you.\n\nThe key is the consistency.\n\nAnd I don't know how long it will take for you.\n\nIt took me two years, and counting.\n\nLook at my profile posts.\n\nI'm still hanging around r/depression, and many of my posts are depressive complaints.\n\nBut every time I have a disgusting day, I write whatever I'm depressed about (sometimes I post, sometimes I don't) and then run an inclined 5k (after years of practicing and building up to it), and it is impossible for me to think about whatever is bothering me, while I am gasping for air, spreading my sweat and snot all over the treadmill at Planet Fitness, with half the people looking at me like I want to \"show-off\", ready to pull the Lunk Alarm on a runner.\n\nBut I'm not exaggerating to impress those around me.\n\nI want to run away from the sh*tstorm brewing in my brain.\n\n**Sidenote:** It's also worth looking into your family history.\n\nLearning about how much my grandfather suffered PTSD in Korea, and how he and grandma did a shit job of raising my dad, who did a shit job of \"loving\" my mother, and raising me and my siblings, really helps understand who you are prone to becoming.\n\nThis way, you can correct the mistakes they never even realized they had.\n\nI really hope you find your way.\n\nI'm not a professional.\n\nI'm just a guy who can absolutely relate to the shit you're going through.\n\nYou know what the answer is.\n\nYour body is telling you every day, while your mind clouds you with excuses to extend your survival within this endless loop.\n\nListen to your gut.\n\nI'd love to hear more from ya.\n\nWhether you want to counter this argument, add on top of it, or reflect from it.\n\nReaching out is certainly the first indication of truly ***desiring*** to be alive again.\n\nThe commitment you put into whatever plan you come up with is the second indication of truly ***desiring*** to continue feeling alive.\n\nThe lifelong follow-through battle, against all the chaos that will inevitably continue storm through your life, is the third and final indication of truly ***desiring*** to feel alive until you die.\n\nCheers man. The universe is a part of you, as much as you are a part of it. Believe in it. Much love!", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9ckfxf/"}