{"id": "t5_2tand_t3_p66zxe_t1_h9dxusw", "creation": 1629273609, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Mikkabear", "text": "So, I relate to a lot of this. I have ADHD (PI) , depression, anxiety, and generally garbage self-worth. My spouse has C-PTSD and severe suicidal ideation, so that’s really familiar to me too. We’re trying to deal with getting adequate mental health care with my crappy insurance in the states, and that’s a goddamned nightmare, but it is what it is.\n\nA lot of people have given a lot of advice, and I feel like it’s all very good. I guess I just wanted you to know you’re not alone. I’m trying to get on track taking better care of myself too. As for your body dysmorphia, what’s been helping me cope with being my highest ever weight was focusing on body neutrality instead of body positivity. I have a hard time making myself believe nice things about myself and my body. It feels fake and disingenuine to me.it was a much easier sell to convince myself that I am not my body; my body is just a thing I use to get around and do things. Ironically, telling myself I was done letting my ambulatory meat suit make me sad actually worked, and I’ve been liking how my body looks more even though I avoided body positivity in general. I am now transitioning into working on my health because I am tired of my ambulatory meat suit not functioning well. \n\nSomething else I thin k would help is community. You are a unique individual and no one but you is an expert on your life and your experiences, but that doesn’t mean other people don’t struggle with similar battles. This post is a great start. Try finding other people who feel like you who are also looking for community, even if it’s just lurking in the relevant meme subreddits. The best case scenario would be an accountability buddy. Someone who struggles like you where you can check in with each other to see if you’ve Done The Thing yet today.\n\nI also think you have some grieving to do, and then a lot of self discovery. Try to find something that interests you, anything at all. If you lose interest, don’t beat yourself up, just move on to the next thing that brings you any sense of peace. Use what works, even if it’s unconventional or you feel like you “shouldn’t” have to rely on it. Dishes aren’t getting done? Fuck it, paper plates. Cooking is hard? That’s okay, looks like it’s charcuterie. Snack on some stuff (preferably healthy, but pick your battles) instead of a large meal. Got a block about socks? Eh, so go for loafers pr sandals that don’t need them. Your standards of success are just yours, no one else’s. It’s never bad or stupid if it works, not when you’re feeling so close to rock bottom like it seems you are.\n\n\nAlso, if you can make it work for you, phone alarms can be a godsend. Just expect your executive dysfunction to fight it tooth and nail; mine does. It’s a constant struggle but if you can get a system working that sustains itself, it can be a huge help.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9dxusw/"}