{"id": "t5_2tand_t3_p66zxe_t1_h9cr209", "creation": 1629246136, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "crying-kitteh", "text": "HeyI am not sure if this helps any but... am 60 I recently became a widow. I did not take my husbands death well even tho we knew it was coming.\n\nDuring the first few weeks fter his death I tried to maintain my job. I took no time off as there was no financial help to make up for any lost wages so the morning after they took his body away - I went to work.\n\nNow i must say i felt disconnected to everything after that i was like being there but not being there. most everything was on auto pilot and I did because i was already part of a routine.\n\nHere comes the weird part that I can relate to you about....\n\nne day on arriving home from work - mind you this was the very worst part of my day because I was coming home to an empty house no one was there to greet me anymore and it caused me a pain that i cannot describe I dreaded this part of my day worse than any.\n\nOK this one day about a week to 10 days in to my new life...  found myself physically unable to get out of the car. that's right though I knew my animals  needed me and I was tired and hungry I could not physically make my legs move to get me out of that car. It was insane I tried to open the car door. My arm would rest on the door but I could not get myself to actually pull the lever and open the door. I could not move my legs as though I was paralized like th signal was not going all the way through. I sat there for over 4 hours. I cried  tried to pick my leg up and move it I beat the hell out of the steering wheel. Finally one of my neighbors saw me still sitting there and came over to see if I was ok. I was almost hysterical and could not explain. She took the keys unlocked the door and let the dog out . she opened  he car door and handed me some mail flyers that were on the ground by the front door and for some reason  could get up and move like i moved without thinking about it so it just happened. I tired to explain and they all just figured I could not get up because i was paralized with grief. but there was something more to it than [that.Like](https://that.Like) my reflexes would not obey because they were protecting me from that pain that I could not control.\n\nThis continued to happen fairly regularly and neighbors would wait a hour or so then come over talk to me open the door and at some point i would unfreeze. I found it happened a few times getting ready to leave for work i would get stuck not be able to out on my shoes. I almost became agoraphobic for a time. I was loathe to leave our home. There was something about how you described this activity as often being a mundane activity or function and you just had no control. you could stare at your socks and shoes for hours but could not make yourelf actually complete the task.\n\nAll I can ask is have you under gone some trauma lately like i lost my husband or something emotionally painful that you had to force yourself to get past and do life regardless. For me it feltlike some disconnect between what I took for granted had to be done but my mind said no you do not have to.... sit here and just feel. even if it feel like your life is over and you would rather die than draw breathe fuck you you just sit there and feel this like t or not.\n\nI do not know if that makes any sense to you but  came across your post by accident and went o fuck that sounds like me right after Danny died.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9cr209/"}