{"id": "t5_2tand_t3_p66zxe_t1_h9d61az", "creation": 1629253802, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "jhanschoo", "text": "I've made a number of assumptions, so this may not be applicable to your situation, but I think it may be useful if it is applicable.\n\nThis reminds me of when I had severe depression while a uni student (but mine is a much milder case than yours), especially\n\n> It's just I have no control over what I can or can't do. The best I can figure, I can do something if I'm forced into it.\n\nas well as\n\n> But I'm way behind other people. I've never had any sense of self (intrinsic) value and always experienced that the only way to be liked or cared about was to be successful and achieve. I've never been capable of feeling value for just being me, or being liked for just being me.\n\nAs you mentioned, if you have a support system that you trust that can tell you what to do that you can delegate the executive decisions to, you might be able to limit the damage to your plans about your situation in life.\n\nIf you don't, you need to accept that while you have had a taste of what could have been, you can't get it. You will need to accept that you won't be hitting the milestones your old peers are hitting at the same velocity. That's not your fault, that's the hand you were dealt with.\n\nIn terms of limiting damage to your plans, I strongly suggest taking a leave of absence for as long as you can, since you're completely unfit to perform where you are able to perform in school, and get a basic job that has little job expectations, e.g.\n\n> Can you work part time at a plant store/summer camp/soup kitchen?\n\nyou mention executive dysfunction, so you may have difficulty judging when you might be fit enough to return to school. It's important to try hard, but it's important to also recognize that trying and failing in uni has terrible consequences, and it's preferable to do so in a less risky way. In my case I handled that badly and did not take an LoA sufficiently long, and graduated with terrible results. But if you're in a suitable major, you can consider being able to stick with a coursera course while holding a job as a way to evaluate your ability to excel while handling the stresses of university.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9d61az/"}