{"id": "t5_2tand_t3_p66zxe_t1_h9dxoh9", "creation": 1629273441, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "devon_336", "text": "My dude, I feel for you so much. It honestly sounds like you’ve hit the adhd equivalent of autistic burnout. You’ve had to be “on” for so long just to survive, that you have finally hit the point where you just can’t anymore. \n\nI’ve been there. My mother is an alcoholic and I suffered a lot of neglect and abuse because of it. Around your age, I tried going to college because I thought that was what I was supposed to do and I failed out spectacularly my first year. So I didn’t go back. Instead, my body and brain forced me to spend the next few years literally doing nothing. I was fortunate enough that I could live with my dad and just exist there while I worked on recovering. At least being in the uk, you might be in a similar position even if you don’t have family support. \n\nI was able to see a therapist for a few sessions during that burned out period and I think she seriously saved my life. Mine was one trained in trauma and family systems, maybe you can find someone who specializes in something similar over there? Honestly, it’s going to feel a lot worse once you start the process. For a few months straight, I saw red and just felt absolute rage because of how my mother “raised” me. Just take it bit by bit or day by day. You’ll pull through because you clearly have a strong survival instinct. \n\nI’m 29 now and what my life is like now, is completely different than I would have expected. It’s not glamorous, maybe it’s a small one but I’m largely content with it. A large part of that is due to realizing that I have to adjust my expectations of what I think I should be doing and instead search to figure out what I want to be doing. I moved cross country to a city where I could start over and feel free to define who I was going forward. \n\nAs a final thought, I have adhd as well and I credit it to helping me to crawl out of my childhood. You said you’re on a waiting list to get evaluated for it as well, good! Hang in there. I have similar struggles with executive dysfunction and the biggest benefit I gained from medication was it helping me to overcome the worst of that. Namely, I used to get stuck on my bed knowing I needed to do a specific thing but completely unable to force myself to even blink at times. I went on meds because I had exhausted all my other coping mechanisms at that point and could tell I was headed towards the same unhealthy ones that would lead me to suffering a similar fate as my mother. \n\nFeel free to pm me if you need someone to listen to you. Sometimes more than a professional, we need someone who simply understands and can relate to our struggles. You’re off to a great start by reaching out dude.", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9dxoh9/"}