{"id": "t5_2tand_t3_p66zxe_t1_h9ch841", "creation": 1629241203, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Mcintiresoon", "text": "Hello! Ok for one - you sound very intelligent, and generally are aware of your current and past issues which affect your cognitive behavior and emotional states. Just for a baseline level of clarity in what is evidently an emotionally very dire situation re: depression and anxiety: this is an EXTREMELY good sign. \n\nTo have this basic wherewithal - the knowledge of what your problems are and where they likely stem from - means your chances of recovery from each of them (even the emotionally deepest ones  related to childhood trauma) are excellent, with any time and continued awareness. Many lack this fundamental awareness that tethers them to good outcomes.\n\nBecause the issues you listed spread wide and deep, I only have one piece of solid advice which would likely have a “halo effect” on ALL of the issues you face (and please take it seriously because it may sound trivial but it is fundamental to all aspects of both mood, recovery, and cognitive functioning) - *get between 7 and 9 hours of sleep per night*. As someone with depression, the odds you are chronically sleep deprived are very high, and they are high enough already for the average American (although I don’t know you so of course Im not sure and you may already be doing great at this). However, seriously consider whether you average more than 7 hours per night on any given week.\n\nGetting less than a regular 7 hours of sleep per night will increase stress hormone production dramatically and make anything (even reading a book or story) feel like a life or death task in the long run. You will also become less intelligent as executive function declines the more sleep deprived you are (very similar to being drunk but not knowing it) and your memory will be completely shot. Many people suffer these effects without realizing sleep deprivation is at the center of the decline, and many of your issues appear to fit this bill. Your life can fall apart without knowing why or how, and you are powerless to stop it because there’s no attention to direct or energy to spend. You also “forget” you have a sleep disorder night to night. \n\nResearch suggests that between 4 and 9 days of regular 7-9 hour sleep will produce significant recovery from chronic sleep deprivation. Getting proper sleep will give you the mental energy to focus on the other two levers which I am certain will have the same “halo effect” on your processing of trauma and everyday functioning: regular (intentional) social interaction (seeking out places like sports or game clubs where you can interact with people), and regular exercise. While these two are also great, sleep underpins everything you do. Could be helpful in case it applies! It did for me recently, and I am already seeing the recovery in mood and life (except when I relapse into poor sleep on some nights, which can happen sometimes).", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9ch841/"}