{"id": "t5_2tand_t3_p66zxe_t1_h9brox5", "creation": 1629230028, "origin": "t5_2tand_t3_p66zxe", "height": 1, "replied_to": "t5_2tand_t3_p66zxe", "down_vote": 0, "up_vote": 18, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thenewestenemy", "text": "Hey there, I just wanted to share my own personal experience in the hopes it might help you because I was in a very similar position this time three years ago. I was doing teacher training, meant to be moving in with my boyfriend when my anxiety COMPLETELY overwhelmed me and I couldn’t do anything at all. Got kicked off my uni course, stopped going out, stopped eating, couldn’t do anything except read. Literally one of my challenges was stepping outside into my garden. I got to a point where I didn’t see the point in looking after myself anymore, I thought I would never get better and there was nothing I could do about it and was so distressed I just wanted to die and contemplated suicide multiple times a day, had a plan and everything. But now, three years on, I have a life I never thought I’d ever be able to have again. It’s been hard work but my whole point here is that even when you think recovery is impossible, with the right help it doesn’t have to be. I got referred by my GP to my local crisis team (not sure if they have those in other parts of the country) but they may well be able to help you at A&E. I know it’s probably tough for you to gather the strength to get the help and to get better but I PROMISE you, where there’s a will there’s a way and with the right help and support you can do it. If you don’t have anybody in your life who can support you then I’m here, I’m happy for you to get in contact with me privately but I know you can do this. I hope you can find that tiny spark in you and I wish you more than the best", "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/h9brox5/"}