{"id": "t5_2qh5i_t3_1asb1r_t1_c9ib4y6", "creation": 1366350913, "origin": "t5_2qh5i_t3_1asb1r", "height": 1, "replied_to": "t5_2qh5i_t3_1asb1r", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cablefist", "text": "hey man, my computer is freaking out on me, but I want to talk to you more.I'm going to give you a solid peace of advice and I hope you don't mind, but i'm going to leave you a few quotes for now, they really helped me and I hope they help you too.\n\nFrom me to you: Focus on moving forward. As you move forward in your new life you will find yourself intuitively knowing how to handle situations that come up. Just focus on moving forward and learning to be okay with yourself again.\n\nNow for the quotes:\n\nThis one comes from a reddit user whom I cannot remember the name of:\n\"\"Alright, here goes. I'm old. What that means is that I've survived (so far) and a lot of people I've known and loved did not. I've lost friends, best friends, acquaintances, co-workers, grandparents, mom, relatives, teachers, mentors, students, neighbors, and a host of other folks. I have no children, and I can't imagine the pain it must be to lose a child. But here's my two cents. I wish I could say you get used to people dying. I never did. I don't want to. It tears a hole through me whenever somebody I love dies, no matter the circumstances. But I don't want it to \"not matter\". I don't want it to be something that just passes. My scars are a testament to the love and the relationship that I had for and with that person. And if the scar is deep, so was the love. So be it. Scars are a testament to life. Scars are a testament that I can love deeply and live deeply and be cut, or even gorged, and that I can heal and continue to live and continue to love. And the scar tissue is stronger than the original flesh ever was. Scars are a testament to life. Scars are only ugly to people who can't see. As for grief, you'll find it comes in waves. When the ship is first wrecked, you're drowning, with wreckage all around you. Everything floating around you reminds you of the beauty and the magnificence of the ship that was, and is no more. And all you can do is float. You find some piece of the wreckage and you hang on for a while. Maybe it's some physical thing. Maybe it's a happy memory or a photograph. Maybe it's a person who is also floating. For a while, all you can do is float. Stay alive. In the beginning, the waves are 100 feet tall and crash over you without mercy. They come 10 seconds apart and don't even give you time to catch your breath. All you can do is hang on and float. After a while, maybe weeks, maybe months, you'll find the waves are still 100 feet tall, but they come further apart. When they come, they still crash all over you and wipe you out. But in between, you can breathe, you can function. You never know what's going to trigger the grief. It might be a song, a picture, a street intersection, the smell of a cup of coffee. It can be just about anything...and the wave comes crashing. But in between waves, there is life. Somewhere down the line, and it's different for everybody, you find that the waves are only 80 feet tall. Or 50 feet tall. And while they still come, they come further apart. You can see them coming. An anniversary, a birthday, or Christmas, or landing at O'Hare. You can see it coming, for the most part, and prepare yourself. And when it washes over you, you know that somehow you will, again, come out the other side. Soaking wet, sputtering, still hanging on to some tiny piece of the wreckage, but you'll come out. Take it from an old guy. The waves never stop coming, and somehow you don't really want them to. But you learn that you'll survive them. And other waves will come. And you'll survive them too. If you're lucky, you'll have lots of scars from lots of loves. And lots of shipwrecks.\"\"\n\nThe next one comes from a book series I really enjoy:\n\"Growing up is all about getting hurt. And then getting over it. You hurt. You recover. You move on. Odds are pretty good you're just going to get hurt again. But each time, you learn something.\n\nEach time, you come out of it a little stronger, and at some point you realize that there are more flavors of pain than coffee. There's the little empty pain of leaving something behind - gradutaing, taking the next step forward, walking out of something familiar and safe into the unknown. There's the big, whirling pain of life upending all of your plans and expecations. There's the sharp little pains of failure, and the more obscure aches of successes that didn't give you what you thought they would. There are the vicious, stabbing pains of hopes being torn up. The sweet little pains of finding others, giving them your love, and taking joy in their life they grow and learn. There's the steady pain of empathy that you shrug off so you can stand beside a wounded friend and help them bear their burdens. \n\nAnd if you're very, very lucky, there are a very few blazing hot little pains you feel when you realized that you are standing in a moment of utter perfection, an instant of triumph, or happiness, or mirth which at the same time cannot possibly last - and yet will remain with you for life. [...] Pain is a part of life. Sometimes it's a big part, and sometimes it isn't, but either way, it's a part of the big puzzle, the deep music, the great game. Pain does two things: It teaches you, tells you that you're alive. Then it passes away and leaves you changed. It leaves you wiser, sometimes. Sometimes it leaves you stronger. Either way, pain leaves its mark, and everything important that will ever happen to you in life is going to involve it in one degree or another.” \n― Jim Butcher, White Night.\n\nI hope that helps you find a little peace for now. Just don't let it consume you, man.\n", "permalink": "/r/happy/comments/1asb1r/my_girlfriend_is_amazing/c9ib4y6/"}