{"id": "t5_2tand_t3_6iekik_t1_dj6dca8", "creation": 1498002012, "origin": "t5_2tand_t3_6iekik", "height": 1, "replied_to": "t5_2tand_t3_6iekik", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Thatinsanity", "text": "I have this problem too - you're probably also an Empath :) Us empaths have a hard time with boundaries, and because we take on the emotions of others, we're prone to burn-out and emotional distress. One of the things I've recently begun working on with my therapist (that's my #1 suggestion - seek out a counselor/psychologist/therapist if you don't already have one) is learning to recognize when what you're feeling isn't actually your feeling. Other peoples' shit should be their shit. You can recognize that you're feeling sad because one of your friends is sad, but you then have to engage in some self-care if it's becoming too much. Take some space, let your friends/family know when you're feeling fatigued/burnt out. The other thing that I'm really only recently starting to learn is that part of my problem is that i feel *responsible* for other peoples' happiness, or that if they're having a hard time, I feel a responsibility to fix it/help. You can't turn off empathy, unfortunately, but you can learn to listen to your instincts, and when you find yourslf getting overly involved or feeling responsible for making someone feel better, take a step back. If they get upset, explain to them that you're having a hard time separating yourself from their problems, and that you need a break. I think the key is to listen to your body/brain and recognize when you're putting an unhealthy amount of energy into someone else's wellbeing. Yes, it feels awesome when you *are* able to help, but it's important to realize that it's too much pressure for any one person to feel responsible for another person's well being. ", "permalink": "/r/DecidingToBeBetter/comments/6iekik/how_to_find_the_balance_between_caring_for_others/dj6dca8/"}