{"id": "t5_2tand_t3_26fsna_t1_chqtr3u", "creation": 1401040495, "origin": "t5_2tand_t3_26fsna", "height": 1, "replied_to": "t5_2tand_t3_26fsna", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "blahblah98", "text": "It's not an uncommon realization to occur OP; truth hurts, but look at it this way: you're already a giant step above where you were; you were lower than you realized, at your low point BEFORE you knew this.  It wasn't easy for your friend to say what she said, either, so why did she?  She cared enough to risk your friendship by being honest.  Isn't that what friends should be for?  We need to surround ourselves with people who can be honest with us, who can help make us better through feedback, not just \"yes people\" who stroke our ego & convince us everything is wonderful even when it isn't.  \n\nI used to \"tease\" my friends too, thinking my \"teasing\" was gentle, clever and funny irony.  I had convinced myself of that, but the reality is my \"jokes\" at their expense were hurtful, and I probably did it as a way to deal with my own insecurities & to feel superior, and so it was selfish.  Somehow, despite that I was able to marry a wonderful woman, and even than it was a few more years before I came to realize I was emotionally hurting my long-suffering wife.  \n\nNow you've already changed for the better, but you're not done yet.  When you're going through hell, keep going.  \nYour friends are still there & still your friends, even though your position might be different than you imagined.  You still have OTHER qualities that they value in you that overcame this negative, otherwise they wouldn't have been your friends.  Self-knowledge is self-power; you have good qualities, and now it's within you and up to YOU to become an even better friend, the friend you want to be.  \n\nNext step: reach out to her and other friends (probably one-on-one is easiest), thank them for their honest feedback and let them know you're committing to be better, you're committing to listening, and you appreciate their help and friendship.  The best is yet to come; the highs can be higher than they ever were before.", "permalink": "/r/DecidingToBeBetter/comments/26fsna/yesterday_i_received_the_worst_feedback_ive_ever/chqtr3u/"}