{"id": "t5_2tand_t3_26fsna_t1_chr11jn", "creation": 1401059546, "origin": "t5_2tand_t3_26fsna", "height": 1, "replied_to": "t5_2tand_t3_26fsna", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Hilaryspimple", "text": "I can relate to this.  I am funny, but beyond being funny I also *try* to be funny, which sometimes even gets on my own nerves.  I had a friend or two tell me version of what just happened to you, and I was similarly devastated.  The good news is, its only going to get better. You're going to be a better person for this. When I was told this, my first steps was to make apologies to everyone I knew.  A heartfelt apology.  You still sound pretty vulnerable, so I think it is acceptable to send an email or FB message, let them know you're sorry and working on it, and that you never intended any harm.  Let them know you are starting to work on being a better friend and person, and ask for your help.  \n\nThis next part may sound silly, but it really helped me.  I can get kind of excited around new people or social situations when I have been drinking and get a bit ahead of myself.  Most of my friends like teasing and will tease back, but let me know that sometimes I went too far and they didn't know how to let me know.  One of my closest friends and I actually developed a code word, 'houseplant', that would let me know in social situations to back off, without anyone having to make a big deal about it. I find it works really well, and just to keep checking in. \n\nThe second piece of advice I would offer is to learn how to listen.  There are a couple tricks to listening.  First, obviously, is not interrupting.  If you *do* interrupt, it should be to ask a factual, clarifying, or deepening question (how did that make you feel, etc.) about what they are saying.  Try to get through an entire conversation without bringing it back to your experience  or how it relates to you.  To ensure you are listening, you can paraphrase what they have said back to them to ensure a) you have understood correctly and b) they know you care about what they have said.  This is going to be a slow process of rebuilding trust with your friends because you have flagrantly disregarded it without paying attention to the reactions of people around you. I can say that because I did the same thing.  Let me know how it goes - I've got a shit ton of tips on humbling oneself in front of one's friends if you need more advice on working on yourself. :)", "permalink": "/r/DecidingToBeBetter/comments/26fsna/yesterday_i_received_the_worst_feedback_ive_ever/chr11jn/"}