{"id": "t5_2tand_t3_kpxfzw_t1_gi0ps68", "creation": 1609723505, "origin": "t5_2tand_t3_kpxfzw", "height": 1, "replied_to": "t5_2tand_t3_kpxfzw", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Oddelbo", "text": "You should find a therapist, they will be able to help you through the healing process. \n\nI believe that the negative thoughts you are having are caused by low self-esteem. When you have low self-esteem, the mind makes negative predictions about what will happen when you take an action. You are at a stage where you want to take a positive step in your life but your mind is telling you that it will not go well. In reality, your friend will happy for you, a little sad that the good times you have shared will come to an end but he will be supportive of you. \n\nA hypothesis: It sounds like your self-esteem might be tied, in most part, to your appearance, and that you feel scared that a negative comment about your appearance will affect your whole worth as a person. \n\nSome initial steps you can do while you contact a therapist: Talk to yourself as you would to someone you really love. Make a list of all the things you are good at. For example, I can see just from your post that you are kind, intelligent, not scared to reach out for help when you need it, you get along really well with your friend. Repeat this to yourself every day. In the beginning, your self-doubt will talk back to you and tell you this is not true. You might go to do something and hear your thoughts being negative. These thoughts are actually only trying to protect you. Comfort this part of yourself and show it love.  \n\nYour therapist will take you through much more than this and also help you to fix the problem on a deeper level by addressing any previous emotional trauma that could have led to a feeling of low self-esteem. \n\nTake a look over at r/codependency too", "permalink": "/r/DecidingToBeBetter/comments/kpxfzw/serious_issues_with_selfassertiveness_and_putting/gi0ps68/"}