{"id": "t5_2tand_t3_gqpwuu_t1_fruemup", "creation": 1590472098, "origin": "t5_2tand_t3_gqpwuu", "height": 1, "replied_to": "t5_2tand_t3_gqpwuu", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "herfjoter", "text": "I don't know if it's been said already, but don't worry too much if you don't see a lot of results from the meds. My anti-depressant and anti-anxiety medications took about a month to start really taking effect. And sometimes the meds you take just aren't quite right for your body chemistry and you'll end up needing to try something different. The meds I'm on took a sec to start working, but they've been great for me for the past 3 years. Meanwhile my mom has been on a bunch of different meds throughout her adult life because it's been a struggle to find the one that works just right. \n\n\n\nI didn't even know it was an option to be able to live my day to day life without wanting to commit suicide every single day. But that's my reality now! There's still some days I can't get out of bed. I still get nightmares and panic attacks and stuff associated with my PTSD. But overall my quality of life is so much better. \n\n\nI'm so happy for you that you're getting help! The journey to finding the right medications may take a minute, but don't give up and remember that it really does get better. That's not just a cutesy Pinterest thing. It really can and will get better! \n\n\nI also want to suggest some things that I had a really hard time doing before I was medicated, but after I got medicated these things really improve my quality of life. Some things that help stabilize my mental health include yoga and stretching, meditation, going outside (even just to sit quietly or walk up the block, doesn't have to be a major activity), eating a fruit and a vegetable every day, drinking a ton of water, and getting on a set sleep schedule. Again, these things were nearly impossible for me to do before I was medicated. But now that I am, I find doing these things really helps with stress and reduces my anxiety. \n\n\nSorry for the long rambling reply, but I've been in your shoes and I hope this can give you some reassurance and a little advice :)", "permalink": "/r/DecidingToBeBetter/comments/gqpwuu/update_one_upvote_and_ill_admit_myself_to_the/fruemup/"}