{"id": "t5_2tand_t3_ivunth_t1_g70x6hb", "creation": 1601349379, "origin": "t5_2tand_t3_ivunth", "height": 1, "replied_to": "t5_2tand_t3_ivunth", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gcf391", "text": "There are soo many things I wanna comment on because this is really inspiring!\n\nFor me, I think I was very fortunate and lucky in certain aspects of my life. I say lucky because sometimes I feel as if all the successes and good things wouldn't have come to be if it were for my initial failures. And I kind of see it in your story as well. Something clicked for you, but it took a lot of pain to get there. The person you are and became isn't necessarily new, but grew from the old you who remembered what it felt like to suffer and didn't want to feel like that anymore. The change in mindset is incredibly admirable. I have good days but a lot of bad ones as well, so it's hard to want to decide to do better. I'm really happy for you!\n\nAlso, loving how you live life by philosophies! I do the same. My friend also gave me similar advice. His was, *\"Why do things tomorrow if you can do it today?\"* I repeat this to myself whenever I feel like putting things off and it helps for the most part.\n\nI do want to comment on one of the big advices:\n>I am in the position I am in because of me. No one else put me in this position and no one will get me out of it other than my own decisions.\n\nI agree for the most part and I find this thinking admirable! But if there's another thing that's helped me, it's the mindset of loving and forgiving yourself. I feel we probably agree on this as well and maybe your advice is written more for succinctness and impact. But for those reading this right now and want to take OP's advice to heart, please consider this as well:\n\nWe all live very different lives and I believe some are just luckier than others. It sucks because thinking this way feels as if we don't have things in our control. It feels like maybe we are meant for bad things when they do happen. **You aren't.** Like OP said, *\"no one will get me out of it other than my own decisions.\"* So, yes, take the bull by the horns and decide to be better! But also, remember that you didn't want a bad life for yourself. You didn't wake up one day and think: I'm gonna sabotage my life. You will always be your own worst critic. You did the best you could at the time, but now this time you can do better. And this time, you will be better.\n\nNot to take away from OP's advice because I love the entire post! But for those who are really hard on yourself, please recognize that you need compassion as well. Treat yourself with kindness, like OP did. Things may suck now, but your personality and abilities are not stagnant. You always have the capacity to grow and that ceiling is limitless.\n\nTo OP, I'm so incredibly happy for you! Not only have you changed, but I think you inspired thousands to as well! I definitely feel inspired. There's so many things I wanna accomplish and reading this makes me feel like it's definitely within reach! Lastly, you **definitely** are not a horrible writer. In my field, it's necessary to write in an engaging and impactful way, and you definitely did that. I'm also a sucker for good formatting and headlining. Quite the opposite of horrible, imo, because it's really well done.", "permalink": "/r/DecidingToBeBetter/comments/ivunth/i_went_from_no_hs_diploma_job_or_car_to_working/g70x6hb/"}