{"id": "t5_2tand_t3_ivunth_t1_g5uhnco", "creation": 1600541499, "origin": "t5_2tand_t3_ivunth", "height": 1, "replied_to": "t5_2tand_t3_ivunth", "down_vote": 0, "up_vote": 120, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GoodRetina", "text": "OP here. I wanted to share some more things I learned. I made the latter half of my story sound like it was a breeze (high GPA, landing a job) but it was far from that.\n\nSCHOOL:\n\nSchool is hard. Even the easiest degree at the easiest school still takes the effort to show up. Navigating enrollment, getting the correct classes, affording it, books, school/life balance, it takes a toll. And not knowing there is a real end to the journey (a stable job) makes it all essentially a leap of faith. Here are a few tips to getting good grades that worked for me:\n\n\\-*GO TO CLASS!!!!! I can't stress this enough*\n\nThe harsh reality is... no one cares if you go to class or not. Your professor doesn't. This isn't high school where you are forced to go. But I promise you that you won't fail if you show up. \n\n*Build relationships with your professors. They won't fail you if you use their office hours, participate in class, and ask for help.* \n\nProfessors want to help the students who want to learn. They have office hours for a reason. Show up. Turn yourself from a name on a roster into a person. If you need help... ask for it. They know what is going to be on the test and there is no one more qualified. \n\n*Get into a study group with the hard working students and contribute. The APP GroupMe will be a life saver. Make sure you are a part of it.* \n\nIt is significantly harder to pass hard classes by yourself. Talking out large concepts, teaching each other, delegating work, and creating bonds with other students is VERY valuable. But hard working students don't like freeriders, so you need to make sure you are also an asset. \n\n*First day of class, use the syllabus to make a calendar for when things are due. It is very easy to miss an assignment. Don't.* \n\nI would make weekly and monthly MILESTONE dates. I knew when every test was and when big assignments were due. This is also important to chip away at stuff. Lots of assignments is overwhelming but splitting it all up into small bite size chunks makes it all manageable. You don't study the night before. You study everyday but paying attention in class, doing the assignments, and attending office hours. The big studying before the test should be review, not the first time you see the material. \n\n*Triple check your path to graduation every single semester. It is very easy to accidently find yourself in a situation senior year where the credit you need isn't available and you have to wait an entire semester to take one class. It happens way too often. Don't let it happen to you.* \n\nThat's it for school... on to... \n\nWORK:\n\nI am still new to the career world so I won't pretend to know it all. I still suck at knowing how to ask for raises. But here is what I've learned:\n\n*Be the person who can work with anyone. Being easy to work with will get you far.*\n\nI was never the smartest person in the room or had the most experience. But I always made sure no one wished they weren't in my group or team. Management wants workers who don't bring drama. So don't bring drama. \n\n*Never say you don't have the time to do an additional task but also don't be afraid to ask for support.* \n\nManagement wants workers who can get stuff done. But they also want workers who bring problems to their attention early. Admit when you are unfamiliar with something if asked to do a task but assure them you will do your best and you'll reach out if you need help. This goes a long way. \n\n*It isn't about how much you know but how well you can google the answer. There is so much information on how to do stuff out there if you know what to look for.* \n\nDo yourself a favor and learn intermediate ways to google search. Basic computer programs can do some amazing things if you know how. \n\n*Don't bring a problem to a superior without a solution.* \n\nThere is a fine line between bitching about something and noticing a real issue that requires a solution. Bringing a solution (even if it isn't the best solution) to your group or leader shows that you aren't complaining but you actually put thought into it. \n\n*Make sure your supervisor knows your goals. They can't help you get to where you want to be if they don't know you want to be there.* \n\nLet them know where you want to be then have them tell you what you need to do to get there. Then do that. I can't stress this enough. It gives you both accountability. \n\n*Be on time. Be dependable.* \n\nGoes without saying. Show up. Don't be late. Be transparent with why you are late when it happens. Also if they ask for something by a certain time, make sure you know they can count on you. \n\nOkay.. and last but not least... the things I've found that somewhat apply to every facet of my life. \n\nLIFE:\n\n*Obtaining your goals is a very lonely road. A lot of things are going to stand in your way and you will lose friends as you move forward in life. It is a sad truth but an important one.* \n\nYour inner dialogue will become your best friend. Learn to pump yourself up. Find whatever motivates you and do your best to memorize it, write it down, listen to it, or watch it. Your brain doesn't want you to succeed. It wants to exist, eat, procreate, and die. Learn to win those arguments with yourself. This is key. \n\n*if it takes 5 minutes to do, do it! Do it now. Seriously. Stop reading this right now and go do it!* \n\nIt is amazing how many 5 minute tasks hold everyone back. Responding to an email, making a phone call, paying that insurance online, calling your bank, applying for a job, making your bed, doing the dishes... the list goes on. These are 5 minute tasks that will GREATLY improve your life, both internally, financially, and long term. \n\n*Make your bed every morning. This will be a bigger improvement to your life than you think.* \n\nSuccess is momentum. It is about assigning task and crushing them one after another. So why not start that first thing when you wake up? A messy bed is a messy room. A messy room is very hard to feel good about. Feeling good is the best way to make your life better. It takes ONE minute to make your bed. Do it. Eventually it will become a habit. \n\n*You will hear NO. You will fail. Failure isn't a bad thing. You will have good days and bad days. You learn more on the bad ones. Embrace them.* \n\nFail forward. Losing, taking a step back, and figuring out how to do better is part of the equation. The master has failed more times than the pupil has even tried. You learn more in failure than in success. Don't let it get you down. \n\n*Balance your life. Give time to your social life, personal hobbies, work, school, and family. This is harder than it sounds once you're in the thick of it but it is required for long term success.* \n\nSome days need to be about 12 hour work days. Others might be about studying until the early morning. But this can lead to burning out. Don't burn out. Give yourself breathing room where you can. It is okay to take a personal day for no reason and do nothing. Your body and brain require recharging from time to time. \n\n&#x200B;\n\nOkay this is all I have for now :-)", "permalink": "/r/DecidingToBeBetter/comments/ivunth/i_went_from_no_hs_diploma_job_or_car_to_working/g5uhnco/"}