{"id": "t5_2tand_t3_ivunth_t1_g5wd45s", "creation": 1600564154, "origin": "t5_2tand_t3_ivunth", "height": 1, "replied_to": "t5_2tand_t3_ivunth", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ambo424", "text": "I love how well you’ve broken everything down. I’d like to add a few more points about school that learned when I went back as an adult. \n\n-Pick your classes strategically. I used to chose based on what schedule sounded most desirable, but it was a toss of for the quality of class I would end up in. Utilize sites like ratemyprofessor.com to pick professors that are rated highly for approachability or extra credit assignments. This is especially important in the early classes, like English 101, where there may be 60+ different professors. For the advanced classes in your program, ask around. See if any classmates can recommend good professors.\n\n-Sit in the front. Even if class participation isn’t part of the grade, it will make a difference. I personally found that I was less distracted, the professors called on me more, and it almost felt like private tutoring. It’s your education, you’re paying for it, you can be selfish about it.\n\n-When you register for classes, jot down the dates for withdrawal. There’s usually cut offs for full refund, 50%, 25% and last day to drop. If a class is over your head or seems to be one you’re really going to struggle with, drop it. Be real with yourself. Don’t try to be the hero and just “push through.” It’s not failing if you drop it, it’s keeping control of your mental health, your work load, and your GPA. If you need to have a full course load (for scholarships or loans), you should also know there are typically “late start” classes that are 8 or 12 week semesters. Have one picked out in case you need to drop a class.", "permalink": "/r/DecidingToBeBetter/comments/ivunth/i_went_from_no_hs_diploma_job_or_car_to_working/g5wd45s/"}