{"id": "t5_2tand_t3_pie77l_t1_hbq77ze", "creation": 1630873646, "origin": "t5_2tand_t3_pie77l", "height": 1, "replied_to": "t5_2tand_t3_pie77l", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dissociationplaybook", "text": "There is no wall. For male or female or whatever you are. No wall. Don’t fear a nonexistent wall.\n\nHowever old people dying in hospitality usually don’t regret not working more. They regret not pursuing their passions, their personal interests, and spending time with loved ones. You have already achieved so much in your main job also. Can you consider dropping the side jobs so that you have more time for vacations, friends, romance? \n\nYou can take solace and pride in your 4 facts above, that is fine. But try to hit the reset button and have new, non-academic or work related goals. Get to experience new cultures, places, people. Do a stint overseas building housing for the less fortunate. Go to nature preserves where you can volunteer for a time to learn about animal species and protecting them. Whatever interests you the most. You will meet many like minded friends on these trips and have rich and rewarding life experiences. \n\nIf I met you and you were like : I am so successful at work, plus I have 0 vices, PLUS I went to NUS!!!! No offense I’d be like ok dude that’s great but what can we talk about? What moves you, what is your passion?\n\nI highly encourage you to enjoy work but not be consumed by it, to do all the hours you want but still leave time for fun, relaxing and vacation. You “have it all” yes but even you have seen that all work and no play is not a balanced life. \n\nPlease don’t pressure yourself into marriage or babies. It’s not for everyone and if you’re perfectly happy as you are why change it? I would just ask you to add some fun or down time in for yourself so you don’t get burned out my friend", "permalink": "/r/DecidingToBeBetter/comments/pie77l/turned_29_this_year_and_im_having_a_quarter_life/hbq77ze/"}