{"id": "t5_2tand_t3_pie77l_t1_hbp6l9f", "creation": 1630857391, "origin": "t5_2tand_t3_pie77l", "height": 1, "replied_to": "t5_2tand_t3_pie77l", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rinzen_C", "text": "Oh boy, this reminds me of me. I grew up in an Asian family, where the mantra had been to study well, get a good job and get married. It's part of the dream we sell to our children, that getting a good education and a good job and a good husband (I'm F) is the key to happiness. It had been so ingrained as a way of life that I always had fully accepted and never questioned it. Not until, like you, I started feeling unfulfilled, I had been an excellent student, yet there were organizations I worked in that made me question corporate life and why I had struggled to have a career that made me unhappy? I felt unhappy after dating the men \"I was supposed to date\" ie well educated, successful, a parent's dream, etc. And for the longest time I didn't realise why I was unhappy even after doing all the \"right\" things like you summarised. It took time, reflection and therapy to understand that our parents had a tough life and financial progress for them was only through getting a good education or getting a good job or marrying well. And while their advice meant well, that doesn't necessarily hold true today. Our parents' generation has worked so hard to create options for us, but their very life advice blinds us to these options. There is no right way to be happy! Don't date because everyone else is dating, don't work a corporate job just because that's the only thing you know how or were told to do. Nothing changes at 30, trust me, nothing does! Take out a pen and paper, write down things you want to do - long term and short term and start planning for them - baby steps if need be. However, don't forget to schedule things for today and now because life is what's happening currently while one is busy making plans for tomorrow. Anything small but pure, that brings you joy, start practicing it now. You'll see your quality of life become richer slowly. You have already started your journey by joining the gym, so you are already on the right path! Just keep at it man - do what you love and enjoy, and do a little more of it every consequent day! My best wishes!", "permalink": "/r/DecidingToBeBetter/comments/pie77l/turned_29_this_year_and_im_having_a_quarter_life/hbp6l9f/"}