{"id": "t5_2tand_t3_8z9bp7_t1_e2qfy1o", "creation": 1532106233, "origin": "t5_2tand_t3_8z9bp7", "height": 1, "replied_to": "t5_2tand_t3_8z9bp7", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dogger6", "text": "I think tattoos really have to be about your own interpretation of things, but I'm going to give you my personal inspiration to hopefully spark your creativity a bit and find out how you interpret these concepts.\n\nPositivity is about potential, right? It's about the future, specifically that tomorrow is full of bright possibilities. I see a sunrise. Placement? How about your arm/shoulder?\n\nIf you're looking for a single word, I'd like to tell you a quick story. Before she was known as the woman who \"broke up the Beatles\" Yoko Ono was a pretty strong figure in the art world. A lot of her work was avant garde, but one piece of hers struck me so powerfully that I'll never forget it. The piece is a ladder set up in a dark room. Above the ladder, there is a white board hanging from the ceiling, and dangling nearby is a magnifying glass. So when you walk into this, you're not quite sure what you're looking at, but then you climb the ladder, you grab the magnifying glass, and you look at the board hanging overhead - it's a lot of trouble to go through for a piece of art. But then you see it, right there plain as day, a single word. Yes.\n\nAnother symbol for me is a piece I'm working on for myself that's meant to serve as a reminder to be grateful, but also as a call to action. For so much of my life, I kinda lived like I was on hold, waiting for the right day to start living. Then I realized that I couldn't wait for life to start because it already had. To commemorate my new spirit, to not wait to live my life, I'm building a sleeve that is a grim reaper/skull surrounded by roses and a clock face. Not the most innovative symbols, but aesthetically awesome and a constant reminder that death won't wait for me, so why should life?", "permalink": "/r/DecidingToBeBetter/comments/8z9bp7/want_to_be_more_appreciative_and_positive_help/e2qfy1o/"}