{"id": "t5_2tand_t3_cs1nnp_t1_exc8tq8", "creation": 1566145554, "origin": "t5_2tand_t3_cs1nnp", "height": 1, "replied_to": "t5_2tand_t3_cs1nnp", "down_vote": 0, "up_vote": 24, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "fishyronin", "text": "Since you say that you have been working on your problems, you might already know about what I'll say but I'll put them out just to let you know you're not alone in dealing with this.\n\nI do face almost identical issues as well, I can't say how similar it is in terms of severity but I too have been trying to work on my social anxiety and self confidence. Through my experience, it just comes down to accepting what we can or cannot change. On what we can change, it comes down to how much we want it and subsequently what we are prepared to do for that change.\n\nYou've come to see the problems that you have and want to change for the better. Good. Ask yourself this. What are you gonna do when in the future, you are put in those situations that you mentioned about changing? When you feel the anxiety and awkwardness, will you push through or find a way to escape? If you choose to push through, you might end up looking like an idiot but so be it. It's only temporary. What you want to take away is the lessons that can help your change.\n\n&#x200B;\n\nOn what we can't change, we just have to roll with it. I'm a pretty short guy and it comes with some confidence issues at times during public situations but height is something I can't change at my age, unless you talk about surgery and such. So I've learned to accept it by being optimistic about it. (Property and credit card sales people don't pester me that much as they assume I'm too young)\n\nIf you think you gain too much attention because you're tall then think about those who wish people paid them more attention or people who wish they were taller. There will be people who look up to you one way or another.\n\n&#x200B;\n\nAnother thing I'm coming to accept about being in public is, people are just as concerned about what you think of them as well. If you and I can feel anxious or awkward, so can the next fella. In a conversation with someone, you might think that there's nothing wrong but the next fella could be worrying about whether what he said to you was weird and thinking that he should've not said so much.\n\n&#x200B;\n\nSo be thankful for what you have, focus on your goal and stay consistent. Every step counts, try looking at things on a larger scale or reflect on where you are when you feel that you're having bad days. There will be bad days but there will be good days as well. Things can only get better if you really put in the work. Don't worry about failing, worry about not learning from failure. \n\nI'm far from being where I want to be so just take this as a sharing of what I know. It can be right or wrong for you. I hope my rant helps and sorry if it's a bit winded, I'm learning how to be more efficient at this as well.", "permalink": "/r/DecidingToBeBetter/comments/cs1nnp/how_to_be_comfortable_in_your_own_skin_and_stop/exc8tq8/"}