{"id": "t5_2tand_t3_cs1nnp_t1_excjszy", "creation": 1566152415, "origin": "t5_2tand_t3_cs1nnp", "height": 1, "replied_to": "t5_2tand_t3_cs1nnp", "down_vote": 0, "up_vote": 44, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "totallymanlytears", "text": "I’m about in the same boat physically, and used to have this problem, especially when I was younger and didn’t know how to deal with being on a pedi stall due to our height. \n\nHere are my tips:\n\n1. Have good posture. This sounds basic, but think about it. Right now, you know you look awkward bc posture, so it makes your anxiety worse. Imagine knowing you had perfect, healthy posture - you will know you don’t look awkward objectively. Being tall makes this 10x more important. Shoulders back, abs hold slight tension, etc. plenty of specific tips to fix this online!\n\n2. Relax your facial muscles and breath thru your nose slowly and steadily. Don’t clench your teeth- it’s like my last point, you know it’s a sign of stress so it makes your thoughts worse. Additionally ppl can tell your holding a lot of tension, which might as well be a visual sign of anxiety. Keep your tongue on roof of mouth, mouth closed, teeth lightly touching, breathing so let they nose. It’s the default, comfortable state. Slight smile might help too, up to you. Look in the mirror and see what looks content - these things tend to become feedback loops. \n\n3. Think about only your senses, not the past or future. Feel the warmth on your skin, notice the smells that waft thru the air. Think about whatever brings you pure peace in this moment. Thinking about yourself in the 3rd person, for this purpose, is not helpful or good. Don’t think about dinner later, or how you’ve felt in the past, just think - am I comfortable physically right now? If so, you literally have no reason to be anxious, literally. \n\n4. Internalize that you have everything you need, right now. Other people’s opinions don’t actually matter if you want nothing from them. People can see this and will naturally, ironically, be drawn to you because you don’t have any intentions except to just be you. \n\n5. Work on all of this, plus your diet. You’d be shocked how much out guts health impacts our happiness and overall wellness. \n\nGood luck, get out of your head, perfect yourself and the rest will literally come naturally once you stop fighting who you are and what you want from others and yourself", "permalink": "/r/DecidingToBeBetter/comments/cs1nnp/how_to_be_comfortable_in_your_own_skin_and_stop/excjszy/"}