{"id": "t5_2qh5i_t3_9viz3h", "request": ["3fa9d278-6200-4503-908d-5c456f8aa87c"], "text": "It’s 3am so this happened just about two hours ago. I go to this old diner late at night every once in a while when I’m feeling down, because hey who doesn’t love good coffee and amazing donuts? Well last time I was there (maybe three weeks ago?) I decided to mess around with the only cash I had and try my hand at dollar bill origami, which ended up with me making a t-shirt and a sword. I got a few compliments from people that passed by so I decided I’d leave it like that for the waiter to find.\n\nI was back there tonight, to get my usual small cup of black decaf and cream on the side. The server brings the cup over and lights up when he sees me and says something along the lines of “hey it’s you! You’re the one who left the folded dollars! I found them last time you were here and showed it to everyone in the back, we hung it up for a few days and everyone loved it!” I beamed and thanked him and we both went back to our own stuff. It really made me happy knowing that because I decided to mess around with a few dollars I was able to put a smile on peoples faces even if it was briefly. So of course I had fo do it again! I ended up leaving a lotus and swan made of napkins (no cash this time unfortunately). On my way out the same server stopped me and told me that a gentleman had overheard the conversation about my origami and had seen me folding the current ones and offered to pay my tab. I had already paid but the gesture made me smile on top of everything else.\n\nTLDR; I made dollar bill origami and left it as a tip a while ago, the server who picked it up somehow remembered me from weeks ago and told me how everyone enjoyed it. Man over heard the exchange and saw me making new origami and offered to pay my tab. It’s nice to know the small things still make a difference in people’s lives :)", "url": "https://www.reddit.com/r/happy/comments/9viz3h/a_t_shirt_a_sword_a_swan_a_lotus_and_coffee_at_1/", "title": "A T- shirt, a sword, a swan, a lotus, and coffee... at 1 am", "social_network": "reddit", "user": "stxrlxrd", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1541754501, "permalink": "/r/happy/comments/9viz3h/a_t_shirt_a_sword_a_swan_a_lotus_and_coffee_at_1/", "nsfw": false, "first_save": 1635438997.1488636, "replies_charged": false}