{"id": "t5_2qh5i_t3_gq0e7", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11"], "text": "And what a year it has been!  My adorable, fun-loving, sweet, honest (ok, ok) SO and I dated one summer in high school.  He left for college and turned into a badass raver kid, and I remained in our small hometown as a goody-two-shoes art geek.  Like any high school summer romance, it ended.  We remained dear, but distant friends throughout the years--going to schools hundreds of miles a part, keeping in touch from time to time.\n\nSerendipity seems to have brought us together.  He moved to DC about four years ago for work, and about three years ago, I moved to DC for law school.  \n\nHe sent me an email almost two years ago (which he will kill me for quoting): \n\n\"Omg hi! Quick formalities: Hope you've been well, we have to catch up soon! Are you still in the area? (I'm in DC now)\n\nK so the real reason I came looking for you is because I think I've lost something precious to me. My 'infectious personality'! Over the past couple years I've let it slip away, and I want it back! You were always good at analyzing me, so I figured if anyone could save me, you could :)\"\n \nSee?  I told you he was the cutest person ever.  I, however, was seeing this despicable, controlling, cheating bastard who told me I couldn't talk to boys (quite literally).  \n\nSo, I replied: \"Hey, I am preparing for finals right now, so I am pretty busy.  For now, I would just say-- keep your chin up.  You're in a great city.  And maybe get out and try to pursue any opportunities that are available to you in the city--there are several.  Or read some new books? Hope you get your \"groove\" back soon (As in.. Groove...the lamest movie ever)\"\n\nAside: \"Groove\" is a lame-raver movie that he made me watch with him when we previously dated in high school.  \n\nI know, I know.  I eff'd up here, but someone or something took pity upon me... thank goodness!\n\nMove forward eleven months....\n\nFinally, with that crappy ex out of the picture, I sent my current SO an apologetic email: \n\n\"I am so sorry that I was so stand-offish and rude when we spoke a few months back.  I was hindered by law school and a very controlling boyfriend.  Now, law school still makes me a little jaded, but I am no longer chained up by the boyfriend (he didn't want me to talk to anyone I had dated ever before-- I tried to explain we \"dated\" when I was fifteen and only then for like a month, but he wasn't having it).  \n\nAnyway, I'd really love to see you and catch up over coffee or something\"\n\nSeveral email-exchanges later, we met up for a drink and chatted. After more meet-ups and play-dates, he (attempted to pick a rose and) asked me to be his girlfriend. \n\nAfter a year of... putt putt golfing, cooking together, snuggling, playing with his turtles, making trips to our hometown and other places on the east coast.... I could not be happier.  I know relationships take a lot of work, and we are both willing to put this work in-- but for now, I am wallowing in one-year-anniversary bliss.\n\nTL;DR: Dated hottie in high school a couple months.  We meet up ten years later in the same city, four-hundred miles away from our home town, and now we've been together a year.  HAPPY! HAPPY! HAPPY! (lucky lucky lucky!!!)", "url": "https://www.reddit.com/r/happy/comments/gq0e7/after_a_ten_year_waiting_period_my_so_and_i_just/", "title": "After a ten year waiting period, my SO and I just celebrated our one year anniversary...", "social_network": "reddit", "user": "painteddreamer", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 37, "down_vote": 0, "creation": 1302798325, "permalink": "/r/happy/comments/gq0e7/after_a_ten_year_waiting_period_my_so_and_i_just/", "nsfw": false, "first_save": 1635439212.600626, "replies_charged": false}