{"id": "t5_2qh5i_t3_12mr40", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "   I hate to bitch about being fortunate enough to have been raised by a well-off family, but it set me up for a lot of predetermined high standards. My grandfather is a millionaire, with 4 sons and my mother. All of my uncles are entrepreneurs yet my mother was sort of the rebel hippy. She's pretty much never worked, and now lives off of my step dad's and grandfather's income. She, and the rest of my family expect me to go to college to become something great, so she can have something to show off. Plus all of my cousins are going to school too and that adds pressure.\n\n   Anyway, I got into a car accident last year ( I promise this story gets happier), a pretty tragic one. A man died as a result of a few seconds of my distraction and his lack of motorcycle gear. I was devastated. My license got suspended. The guilt was overwhelming. Luckily my family's soft side was shown in their empathy, and I am fortunate enough to have an amazingly supportive boyfriend to get through everything.\n\n   A year later, I am living with that supportive man, even though it's not in my mother's best interest, and I'm not in college. I'm working at a deli, but I'm proud of that for now. It pays the bills. My license is still suspended, but I bike to everywhere I need to go. It's great exercise and it turned into a fun hobby. I can officially say that I am happy.\n\n[Modest Mouse- Float on](http://www.youtube.com/watch?v=CTAud5O7Qqk)\n\nThank you for reading :)\n\nTL;DR: Family always pressured me into college, got into a bad car accident, but now I'm living for what is in MY best interest. I got a job at a deli and moved in with my boyfriend. I am happy. \n\n\n", "url": "https://www.reddit.com/r/happy/comments/12mr40/float_on/", "title": "Float on", "social_network": "reddit", "user": "fruitcakez", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1352066383, "permalink": "/r/happy/comments/12mr40/float_on/", "nsfw": false, "first_save": 1635440882.8409781, "replies_charged": false}