{"id": "t5_2qh5i_t3_92xce9", "request": ["89f969a3-3a22-4eff-8a40-d1d5b9658c57", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "Hey everyone, wanted to give you guys a brief telling of my life journey thus far. I grew up in a religious cult that was incredibly strict and very sheltered, we didn't have a tv, I was home schooled, and I went to church 5 times a week at my peak. The one thing that I was allowed to play and loved was computer games on our 386 my dad purchased for the house. That inspired me to teach myself how to program, and I started messing around with qBasic and making my own simple computer games starting around 11 years old. \n\nFast forward to 17 and I am finally able to move out of my house, I had an okay job at the time, and was doing okay in life, although I was completely sheltered and had zero clue how to set boundaries for myself, how to handle money, or any basic life skills that didn't involve christianity. Life skills were seen as somewhat unnecessary since I would always be in the church and under their control and wouldn't have to make my own decisions so why would I need to know that?\n\nI got involved with drugs gradually more and more, starting with weed, then doing cocaine, then basically branching out to anything I could get my hands on, it's a common story with kids that end up leaving that church, you have no clue how to set personal boundaries for yourself, or how to have self control just for the sake of it and not because you might go to hell. Luckily I didn't get addicted to any of the drugs I was doing at the time, and I was doing pretty good at my job.\n\nFast forward several years and I had stopped partying, and was doing alot better in life, but I had a terrible employment record and absolutely terrible credit from job hopping, getting evicted from apartments for not paying, taking out loans and never paying the first payment etc. I had a job at a call center and was sitting most of the time, as well as spending all my time at home on the computer, and I had terrible posture, so I would routinely blow my back out and ended up going to the doctor and was prescribed pain pills. \n\nThis was the beginning of serious trouble for me, I had dabbled with pain pills before this but I had never taken them on a consistent basis, and they hit me like a mac truck. All of the emotional pain, depression, and anxiety I had struggled with my whole life seemed to melt away into a cloud of euphoria and I immediately abused them, and they eventually cut me off of them. Unfortunately I was already chemically dependant on them and suffered withdrawals and couldn't work, so I started getting pills from the streets. \n\nAbout this time I found a job with a tiny financial company making about 40k a year programming and designing websites for them, my addiction quickly escalated with all the extra money I had and before long I was spending 3k a month on pain pills, taking about 240mgs of oxycodone a day, eventually my money supply started drying up as the company wasn't making enough money and I took a paycut, and it force me to switch to heroin. I had shot heroin way earlier in my life a couple times and when I switched from pills to heroin that was the method I used. I spiraled out of control until finally I was really hitting my rock bottom and decided I am DONE WITH THIS I AM GETTING SOBER. \n\nI went cold turkey about 7 times and would last a couple weeks, but because it takes a long time for your body to adjust to not having heroin, I would have insomnia for weeks and it would wear me down until I would relapse just for some sleep. I realized it wasn't working to do it on my own and sought help from specialist and was put on methadone. \n\nMy life immediately started to improve, and I cut off anyone in my life that had anything to do with drugs, including my old job, it turned out the boss was an addict and at the end we were sharing supply with each other, he begged me not to leave because I was his only connect, but I just couldn't stay, I hooked him up with my connect and changed my phone number. Fast forward almost 4 years, and I have been completely clean and sober 3 and a half years now and steadily decreasing my dose of methadone. I just landed an excellent job as a web developer with an amazing company with amazing pay and amazing benefits, I get a month off paid every year!\n\nI am proof that if you want it bad enough, you can achieve it! You just have to decide it's what you want above all else, and you have to accept help and get healing for the real causes of why you became an addict in the first place. For me I was raised thinking being gay was wrong, and I was gay and hated myself for it. I came out of the closet and worked everyday on accepting myself for who I am, and my life has never been better.\n\nThanks for reading if you did, I just figured you guys might enjoy reading my incoherently written life's story!", "url": "https://www.reddit.com/r/happy/comments/92xce9/from_heroin_addict_to_sober_to_web_developer/", "title": "From heroin addict to sober to web developer making great money!", "social_network": "reddit", "user": "danielnogo", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 18, "down_vote": 0, "creation": 1532892820, "permalink": "/r/happy/comments/92xce9/from_heroin_addict_to_sober_to_web_developer/", "nsfw": false, "first_save": 1635440650.910439, "replies_charged": false}