{"id": "t5_2qh5i_t3_76upzf", "request": ["44cd61d3-f01a-4909-b162-9daae7dd79b2", "c15214d3-1d77-40d5-ad12-df4ba3bdb7b2"], "text": "I've never posted to r/happy before, only scrolled and been inspired, but finally today I feel halfway worthy of posting. An attempt at quick background:  All my life I have been fascinated by medicine and science but always assumed I wasn't smart enough to be a real doctor, typically scoring average or only a little above average. About 4 years ago after my first year in undergrad I had a drastic change of attitude and decided I will never be what I want I don't try... I am currently on my 5th and final year of my Biology degree with all additional credits for both the MCAT and required by US medical schools. I struggled and literally scraped by all the chemistries, re taking general 2 and organic 1 twice. I got an academic scholarship to an out of state school so there I went, only to find out that the scholarship only lasted 4 years. This year I am full out of state tuition, and I ALMOST had to transfer back into my state for only  my final year, which would completely change where my degree was from, even if I went to USC for 4 of 5 years. Due to some amount of privilege I am ever grateful for, my parents are just barely able to financially support me through my last year in combination with some student loans, but it HAD to be my last year (of undergraduate).\n\nAlongside these facts my final requirement for the MCAT and medical school (other than highly specific biology courses to finish my major) is the notorious physics class I am in now, the physics of electricity, magnetism and optics. Again I must re iterate friends I am no genius, in fact I often feel like I'm pretending among other really smart people, but this course wasn't an option if I want to even apply to medical school. So I go to class, take notes etc, read the text book, all normal requirements, and I got a whopping 3 points on my first exam. For writing my name correctly, impressive. \n\nCome one month later my second exam is coincidentally timed to be on the exact date (today) that my university has declared the cut off date to drop a course with out WF- which is basically quitting halfway through with out failing, but you get no money back. This course alone out of state ran me over 3 grand. I studied so long and so hard but I was sooo nervous I had no idea how it went. There was even a small riot at the end of the exam, people demanding we get out scores before the cut off date. \n\nIt seemed like everything was on the line... This evening my poor friend I studied with texted me and said, the scores are up, I got a 3 again, I have to drop. I knew I was fucked, this guy was so organized compared to me, scatter brained and freaking out. I got an 82 on the exam!!! I really got a B on this exam. I just want to cry. Everything seems to be okay again, and the delayed gratification combined with surprising myself is the sweetest satisfaction I can possibly think of in this moment. \n\nI hope anyone reading this (and anyone in general) has had a happy day as well, and if not there is tomorrow, there is always tomorrow!!\n", "url": "https://www.reddit.com/r/happy/comments/76upzf/over_3_grand_and_my_graduation_date_were/", "title": "Over 3 grand and my graduation date were dependent on one exam score- and I pulled through!", "social_network": "reddit", "user": "datbeckyy", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 28, "down_vote": 0, "creation": 1508198301, "permalink": "/r/happy/comments/76upzf/over_3_grand_and_my_graduation_date_were/", "nsfw": false, "first_save": 1635442440.9712117, "replies_charged": false}