{"id": "t5_2qh5i_t3_gsu25f", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "So I come from an abusive home, and was homeless from the age of 17 to 20 as a result of my abusive parent (I am now 23). Being homeless and moving from state to state and city to city, I had to be able to judge people's characters very quickly to keep myself safe. My gut is usually right about things. However, I recognize that when we're in danger, the skills that were appropriate while we were in a dangerous situation aren't always applicable in other situations in life. For example, the alertness that a soldier has during battle is totally appropriate and can keep them alive, but for a veteran re-entering society, that alertness becomes paranoia, and is a detriment to their social lives.\n\nAs a result of my three years of being in the proverbial trenches myself, I am not quick to trust people. I was under tremendous amounts of emotional strain from being abused by people I was staying with, people attempting to assault me, etc. When I typically had a bad feeling about someone, I was right. But now, I feel like sometimes I'm hyper-vigilant. I hate liars and people who take advantage of others, and if there's even a tiny inkling that someone is that kind of person, then I stay away from them. But I feel like this \"filter\" that I have also sometimes filters out good people too.  Having been hurt by so many people makes me not really want to be social at all - I'd rather swallow a handful of grapes all at once than talk about the weather. I've also just had 3 large friendships end over the last 2 years because they were lying to me in some *really major* way, or taking advantage of me, so I'm very cautious. What's weird is that I work a room really well, make people laugh, and do some public speaking stuff(and I'm told I'm pretty darn good at it). So people insist that I'm an extrovert because I'm charismatic and great at networking and socializing, but in reality, it really drains me unless there's something to gain from it (a new client, potential job, a passion of mine that I'm volunteering for, etc.) and Id rather be home cuddling with my dog and watching Unnus Annus.\n\nI decided to be a lot more social now that COVID has hit. Even though I'm kind of antisocial, it doesn't mean that I'm not lonely. I've been doing pretty good at it too! I'm making it a point to actually follow-up with people that I used to talk to, but my time trying to survive homelessness made it too hard to keep up with those relationships. I now have a new friend I've met on Reddit that I chat with every day, and she's super neat, and another girl who's in the same field as me (also met through Reddit) that I'm going to visit through Animal Crossing, as well as some of my mentors that I usually only talked to about work stuff that I'm now working on developing personal relationships with. Those have been going awesome! And I'm working with my therapist to address the underlying issues that make it hard for me to make friends. I just talked for two and a half hours last night with this senior developer (I'm a junior software developer) that I met once because we were both stranded on a train that managed to crap out on us haha. It was so nice to both chat with someone that had a similar mindset as me AND worked in the same field as me.  I feel like this has all been affecting my mood in a really positive way, and it's a little scary, but I plan to keep it up c:", "url": "https://www.reddit.com/r/happy/comments/gsu25f/ive_actually_started_to_make_friends_for_the/", "title": "I've actually started to make friends for the first time in a few years!", "social_network": "reddit", "user": "CaliBounded", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 12, "down_vote": 0, "creation": 1590762755, "permalink": "/r/happy/comments/gsu25f/ive_actually_started_to_make_friends_for_the/", "nsfw": false, "first_save": 1635438909.690183, "replies_charged": false}