{"id": "t5_2qh5i_t3_1x90bn", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "In short I didn't do so well in college. I wanted to be a marine biologist but that didn't work out in my first semester. I got a C- in Bio and had to drop Chem.  I hid my anxiety behind weightlifting, binge drinking and video games; when I wasn't doing one I was doing the other and it's became a constant cycle for over a decade. I hate the job I have, not because it's a bad job but out the handful of reasons I do hate it the most apparent is that I feel I'm capable of something more fulfilling, enjoyable and better suited to my skill set. With that, last year I decided to go back to school to become a doctor. All in. Literally. I didn't have enough money to go full time so I went to a local state school and took one class. Chemistry 135. I did ok one the first test, aced the second and now on to the third of four.\n\nI look at the test and the first question almost literally paralyzes me. I didn't even understand what the teacher was asking. I stare at it for 30 minutes. The same question. 30 minutes. I shake myself out of the trance... kind of. The rest of the test looks Greek to me (I don't speak or read Greek) and I'm seeing black spots before my eyes and I can't even read the paper. Luckily it was multiple choice for most of it so I just filled in answers the best I could and left. \n\nAs I'm driving home I stop to get gas and I'm crying uncontrollably. Before I can get out of the car I start crying exponentially harder than I ever have in my life. I can't help but curl into a ball in the drivers seat and sob and scream for what felt like forever but really was just under an hour. I considered not driving home and staying at a motel since my eyes were burning so bad and I was shaking. This was all I had left. It was my last chance. How could I let my fiancé down like this? Let myself down? What more could I have done?\n\nI manage to make it home and sleep it off...somehow. I keep going to work and through some intense studying, groveling and hope I managed an A in the class, a class I dropped a decade before. It was also my first A in a real class (I don't count \"intro to web design\"). \n\nFast forward a year later and I'm in the second more advanced chemistry course at a much better school. \n\nMuch better school = more difficult. \n\nQuiz one rolls around tonight. I studied my ass off for this, I'm talking 3 hours of sleep for 2 weeks. The car ride over is rough - breathe in, breathe out. I'm going to make it. Quiz comes - 4 questions. I don't even understand two of them. It's not so much that I didn't know the answers per-se but they were asking for a level of detail I didn't study for since the homework questions and textbook didn't seem convey the idea this was all that important. I was wrong. It wasn't all Greek but pretty close. \n\nI could have panicked. I could have gone into a ball and cried but I didn't. I made it through the quiz, talked to the teacher after class a little and e-mailed him a few questions when I got home. \n\nI likely failed the quiz but I won over my anxiety. I called my fiancé and she was very proud that I was able to overcome the situation. It was a real serious win for me. I'm so happy. Now excuse me, I have to go study. \n\n\nTL;DR: I didn't have an anxiety attack in a situation where I previously had a very crippling attack and I am happy I was able to get through it. ", "url": "https://www.reddit.com/r/happy/comments/1x90bn/i_may_have_failed_the_quiz_but_i_won_over_anxiety/", "title": "I may have failed the quiz but I won over anxiety.", "social_network": "reddit", "user": "facetothedawn", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1391750337, "permalink": "/r/happy/comments/1x90bn/i_may_have_failed_the_quiz_but_i_won_over_anxiety/", "nsfw": false, "first_save": 1635438852.558803, "replies_charged": false}