{"id": "t5_2qh5i_t3_2lhgsl", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I'll try to keep this brief.\n\nI wake up at about 4:30ish to get ready for work, practice my morning meditation, and head out the door. My girlfriend and three kids don't get up for school until 6:45 or so.\n\nFor the past year, every weekday morning at 5:30 there's a man who drives a very loud, unmuffled truck and he drives out of town on his way to work. He revvs the engine as he leaves, rattling our windows and waking everyone in the house. At that time I'll be wrapping up my meditation and it's rather disturbing.\n\nFor the past year I've contemplated various ways of dealing with this rather inconsiderate fellow, none of them particularly skillful. I thought about filing a complaint with our police, who I knew would do nothing about it. I contemplated waiting outside for him one morning for an angry confrontation, I even contemplated something as childish as vandalism. I never did any of those things.\n\nOne evening, I was standing in my yard with my girlfriend when this guy pulled up in his truck to visit the bar next door. I thought this would be a good chance to finally get to the bottom of the problem. But how? What would I say?\n\nAfter some conversation with my girlfriend, I got up my nerve, and walked over to the bar. I went inside and found the man.\n\nI walked up and introduced myself. \"Hi, I'm Casey\" he responded. I explained calmly and rationally what was going on in my house when he drives out of town every morning and how disturbing it is to us. I told him I would greatly appreciate it if he waited until he was a little farther out of town before he gunned it.\n\n\"Ok\" Casey said. That was it. I walked out.\n\nSince then, the mornings have been much quieter. Everyone sleeps through 5:30. I still hear Casey's truck leaving while I meditate, but it's not the ear-crunching rattle it was before.\n\nI saw Casey at the bar again last night. I said hello and thanked him for being considerate, and bought him a drink. \n\nEverything turned out well.", "url": "https://www.reddit.com/r/happy/comments/2lhgsl/i_solved_a_problem_with_a_noisy_neighbor/", "title": "I solved a problem with a noisy neighbor. Everything went better than expected.", "social_network": "reddit", "user": "Gullex", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 404, "down_vote": 0, "creation": 1415290719, "permalink": "/r/happy/comments/2lhgsl/i_solved_a_problem_with_a_noisy_neighbor/", "nsfw": false, "first_save": 1635439340.5698433, "replies_charged": false}