{"id": "t5_2qh5i_t3_8koptz", "request": ["c889a480-189a-4ed9-aa88-81c300413196"], "text": "Here's the thing. \n\nI never really believed in love. I was very indifferent towards it and thought it was a big hoax or something, so I spent life just living for me, doing what made me happy, and growing as an individual. I focused on graduating from university. I focused on personal goals. On my friends. My family. And whatever else made me happy. I was just doing me, you know? Just living my life and, over the past few years, I have REALLY climbed out of my shell - I am so happy with who I've become. \n\nHe and i have known each other for four years as friends. I always had a little crush on him but it wasn't a crazy crush, maybe because I was too afraid to fall. A few weeks ago we hung out and he confessed to me, but I didn't choose fear that day; I chose love. And i said, \"Yeah, me too. I really like you, too. Honestly, I always have.\" \n\nAnd now we're together. We're so happy. Everything I've always wanted in a partner, I see in him. He's kind, loving, caring, intelligent, hilarious, hard-working, and so, so sweet. Oh, and he's DAMN cute. We share the same values and have different hobbies which is what I love. I'm just so happy. I NEVER in a million years saw this coming at ALL. I was just living! I was happy on my own! I never understood love and never even believed in it for heaven's sake, but now I do.\n\nAll my friends are teasing me now because I was always the single one giving everyone else relationship advice, I was always the one who doubted love/didn't believe in it, and BOOM look at me now hahaha\n\nGod damn it though we are SO comfortable with each other. No walls up. Nothing hidden. I just had to blurt this out somewhere on the internet, thanks for reading haha :P  ", "url": "https://www.reddit.com/r/happy/comments/8koptz/my_longtime_friend_and_i_have_fallen_for_each/", "title": "My longtime friend and I have fallen for each other and I am OVER THE MOON!", "social_network": "reddit", "user": "txmsh3r", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 31, "down_vote": 0, "creation": 1526769973, "permalink": "/r/happy/comments/8koptz/my_longtime_friend_and_i_have_fallen_for_each/", "nsfw": false, "first_save": 1635441449.7719104, "replies_charged": false}