{"id": "t5_2qh5i_t3_dpyn83", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I have been working in my field for about 2 years and I was suddenly reassigned (told on Thursday that I'm moving departments the coming Monday).\n\nI was freaking out: my old group were all more experienced than me but I got moved to my current group as the dedicated \"expert\" in my specialty.  From my perspective, my old supervisor essentially tossed me to the wolves and protected his older, more experienced employees from an experimental trial.  I had to adapt and overcome the big change, especially because if I did not succeed, I had to go back to the old group as a failed guinea pig.\n\nI just had my interim job evaluation with my current supervisor and I am on track with what she wanted and has future bigger, more complex projects in mind since I'm \"a quick study, willing to learn new skills, and was always willing to participate and help with extra work\".\n\nWhat got me was this: she said that she was only going to take me from the old group if my previous supervisor allowed it, and if he refused, she would have gambled with a job opening; not even considering the older, more experienced employees from my previous group.  Let me tell you, my previous supervisor never told me this! he made it sound like I was punished/banished to this group, \"but don't worry, if it didn't work out, you always have a spot back in my group\".\n\nI have been recharged and revitalized by her overwhelmingly positive review of me and now I'm determined to prove her right and continue to grow.  I'm so fortunate that I now have a great boss (who knows how to communicate) and a supportive team.  \n\nI hate to admit that I needed that validation, but it meant a lot to me.", "url": "https://www.reddit.com/r/happy/comments/dpyn83/i_got_a_great_evaluation_at_a_newish_job/", "title": "I got a great evaluation at a new(ish) job", "social_network": "reddit", "user": "awkwardly_competent", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 25, "down_vote": 0, "creation": 1572577712, "permalink": "/r/happy/comments/dpyn83/i_got_a_great_evaluation_at_a_newish_job/", "nsfw": false, "first_save": 1635440866.4587975, "replies_charged": false}