{"id": "t5_2qh5i_t3_2es5cb", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I'll keep this short. I discovered that the social circle of people I have grown to know over the past 10-15 years in my local community are true friends.  \n\nAs the title suggests, I got accepted to film a home makeover programme for UK TV. My SO and I were assigned by the programme Directors to completely revamp 2 huge rooms in our house.  \n\nOn one day 5 friends turned up to repaint the bathroom totalling 35 man hours between them. I was constantly fetching beer and pizza and thanking them all.  \n\nThen there was my friend who is currently working 14 hours a day with a 3 hour bus commute and he made time to install a Victorian fire grate into the front room and wallpaper 12ft high walls in an expensive and complicated pattern. Took him 2 days.   \n\nOne morning, details unimportant, I was home alone and following a raging angry phone call over circumstances beyond my control I felt threatened knowing this person was 15 minutes away from banging on my door. One phone call had 2 friends (one is HUGE and muscly) round in a ridiculously short time. They dropped everything to drive over immediately. I couldn't even *spell* grateful at that time.\n\nWe don't have the money to pay these people, this humbled me and I hope one day I can pay them all back individually.  \n\nI am determined to ensure good karma gets paid back to my wonderful friends whenever I can.", "url": "https://www.reddit.com/r/happy/comments/2es5cb/no_diy_skills_and_7_days_for_a_tv_makeover/", "title": "No DIY skills and 7 days for a TV makeover. Friends help all hours of the day sweating to ensure we meet the deadline", "social_network": "reddit", "user": "RedBanana99", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 3, "down_vote": 0, "creation": 1409189117, "permalink": "/r/happy/comments/2es5cb/no_diy_skills_and_7_days_for_a_tv_makeover/", "nsfw": false, "first_save": 1635442854.0251377, "replies_charged": false}