{"id": "t5_2qh5i_t3_o1pjo2", "request": ["4311bf71-6ec2-4c3b-aa15-1f9a3223e07b", "e78e5c86-dbf1-4ab8-a98c-e9d544934b7c", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "I’m incredibly happy with who I’ve become over the past 10 years and just wanted to share with someone. \n\nI was raised in a small town where diversity was not celebrated. My family was very anti homosexuality so I ended up doing the same. I moved out and went to my states University where I met the first person to logically call me out on my shit. I said, “no homo” because that was a thing at the time, and he justifiably called me out. Became good friends and even lived together for a year. \n\nI ended up dropping out of school to work, moved out and lost touch with him. In the 10 years since I’ve met the best friends in my life who are an interracial married gay couple. Growing up a straight white male in the environment I did, this was not something I thought would happen. I am ashamed to admit but in middle school I argued all gay people should be sent to an island separate from the world. I blame the sheltered town I lived in but mostly myself for accepting that reality where nobody told me it was an incredibly hateful, insensitive idea. \n\nTonight I went to dinner with my best friends and saw my first openly gay friend at a table across the room. I didn’t want to intrude on his groups dinner and I’m a coward so I simply asked the waiter to anonymously pay for his tables meal. My friends were surprised and I got to enjoy an incredible moment explaining that if it wasn’t for my original friendship with that man, that I wouldn’t be enjoying this dinner with them at all. I very well could have still been a sheltered racist bigot. \n\nI am smiling wide in reflection of how I’ve grown and am genuinely happy. \n\nThanks Wayne.", "url": "https://www.reddit.com/r/happy/comments/o1pjo2/i_was_raised_a_bigot_and_tonight_i_got_to_pay_for/", "title": "I was raised a bigot and tonight I got to pay for my first openly gay friends dinner.", "social_network": "reddit", "user": "Captain_Linebeck", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 1075, "down_vote": 0, "creation": 1623908007, "permalink": "/r/happy/comments/o1pjo2/i_was_raised_a_bigot_and_tonight_i_got_to_pay_for/", "nsfw": false, "first_save": 1635442010.3075578, "replies_charged": false}