{"id": "t5_2qh5i_t3_jb4pbx", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb", "2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "For quite a while now I have been in a hopeless place personally, I feel like this stems from me developing extremely unhealthy coping mechanisms due to past trauma in my personal life and me not managing that correctly.\n\nSome examples of the unhealthy place I have put myself in\n\n- I consume alcohol daily, very often at times I know that I shouldn’t.\n\n- I smoke cigarettes like there’s no tomorrow.\n\n- I abuse pharmaceutical drugs that I am scripted by a doctor on a daily basis.\n\n- I take what I have for granted, which is an extremely supportive and tolerant family, my amazing girlfriend, my job and my gorgeous little dog.\n\nI am writing this post not in the hope that anybody reads or responds to it but purely to outwardly express my desire to better myself and to properly acknowledge these feelings.\n\nI turned 33 yesterday and was massively surprised by my partner going to a lot of effort by hanging childhood photos of myself with friends and family on string from balloons all around the house along with beautiful little signs and arrangements everywhere. I am still struggling to absorb how this made me feel. Nobody has ever showed me how much they love me in such a way and it made me realise how truly amazing what we have is and how I should be cherishing every single moment of it. \n\nShe is truly the sweetest human I have ever enjoyed encountered and even though I’ve always been extremely loyal towards her and treated her well I feel I’ve been emotionally distant due to the place of numbness I have somehow managed to bring into the relationship - we both have similar issue from past trauma. \n\nI recognise that I have a massive impact on how my partner feels and goes about her life. At heart I am a very creative and passionate person and I have managed to convince myself that I am not that any longer.\n\nI am making the conscious decision to let myself be happy and work my way from the awful person I have created within myself.\n\nI will no longer take advantage of what I have.\n\nI will no longer consider myself as being ‘hopeless’ and ‘worthless’.\n\nI will no longer allow myself to standby as I go through life unconsciously on a self-destructive path.\n\nI will no longer let my past trauma define me.\n\nI will be happy.\n\n\nJosh\n14/10/2020", "url": "https://www.reddit.com/r/happy/comments/jb4pbx/realisation_about_myself_upon_turning_33_and_my/", "title": "Realisation about myself upon turning 33 and my vow to be the person I want and deserve to be.", "social_network": "reddit", "user": "joshg_yz250", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2, "down_vote": 0, "creation": 1602695000, "permalink": "/r/happy/comments/jb4pbx/realisation_about_myself_upon_turning_33_and_my/", "nsfw": false, "first_save": 1635438908.9891005, "replies_charged": false}