{"id": "t5_2qh5i_t3_g6huwt", "request": ["8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "It was late (relatively), and WinCo is one of the very few places still open after 9. I got there at 9:30, giving me just half an hour of shopping after work, myself being an 'essential' retail worker. Between being sore and tired from my shift on my feet and having a bad knee that has me walking with a cane, I'm amazed I made it through the store in only half an hour, getting to the register right as they're announcing it's closing time. \n\nWhen I get to the lone open register, I'm surprised to see there's only one person in front of me, and it's such a relief knowing I'll have less of a wait than I was dreading. And as I'm standing there, behind me come two more shoppers, each with a small handful of items. So I hobble myself back and to the side a bit, and wave you both forward. You both try to protest, but I've got more than double what you two have put together, and I don't mind waiting a little longer. You both thanked me and wished me a good night when you were done, and I did the same, and it was just such a pleasant thing to see people being so polite that it was worth the less than five extra minutes.\n\nAnd I'm not sure which of you it was, but thank you so much for the $20 you snuck to the cashier to put towards my bill. It was a genuinely sweet thing to do that I absolutely appreciated, and it still makes me want to cry just sitting here typing this. I wish both of you the best, and hope life is as kind to you as you were to me.", "url": "https://www.reddit.com/r/happy/comments/g6huwt/i_know_theyll_probably_never_see_this_but_to_the/", "title": "I know they'll (probably) never see this, but to the ladies at WinCo last night:", "social_network": "reddit", "user": "OneTrueSneaks", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 61, "down_vote": 0, "creation": 1587624338, "permalink": "/r/happy/comments/g6huwt/i_know_theyll_probably_never_see_this_but_to_the/", "nsfw": false, "first_save": 1635442179.8997397, "replies_charged": false}