{"id": "t5_2qh5i_t3_5unjmf", "request": ["3fa9d278-6200-4503-908d-5c456f8aa87c"], "text": "I am pretty much your average 17 year old guy, nothing super wrong with me but I still have mild problems getting myself to be overly social just like most people. I have had a crush on a girl for about the last month and a half and have slowly befriended her meaning to ask her out and just get to know her. As day after day went by, I would plan on asking her out only to fall short. It was extremely frustrating that I couldn't get myself to do this simple thing, and I honestly wouldn't mind if she rejected me once I did. Until today...\n\nToday was the last day before winter break, and I knew that if I \nhadn't done it, I would feel extremely depressed over winter break and like a loser. I decided **today was the day**, and told myself that no matter what the situation was, I was going to ask her out, no matter how embarrassing it might be, or how scared I was. I found her at the end of school, (it was a half day) and went up and asked her if she had any fun plans for break. Fast forward to 30 seconds later and I did it. I said \"Hey, this is totally random, and feel free to say no, but would you maybe wanna hang out and get dinner over winter break?\" I could tell she was kind of nervous, but she didn't say no. While she didn't say no, she also didn't say yes. She told me that her parents were super strict about dating, how she had dated a junior and they had been super cautious about that, and how her dating a senior from California (this takes place in New Jersey) would not go too well with them. She didn't say yes, but she didn't say no! ¯\\_(ツ)_/¯  **AND I FLIPPIN DID IT!** I finally overcame my fear and asked her out! I told her I completely understood and told her to have a good break. I'm sure she thought that I was somber on the inside, but I was smiling as I walked away. I was beaming. If I could do it, anyone can. It is inside of you. It was inside of me the whole time, and I finally pushed myself to do that which I so deeply wanted to do. I am just so happy that I finally accomplished this. ", "url": "https://www.reddit.com/r/happy/comments/5unjmf/i_finally_asked_out_the_girl_i_have_been_meaning/", "title": "I finally asked out the girl I have been meaning to, and she didn't say no!", "social_network": "reddit", "user": "Nightshire", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 27, "down_vote": 0, "creation": 1487353997, "permalink": "/r/happy/comments/5unjmf/i_finally_asked_out_the_girl_i_have_been_meaning/", "nsfw": false, "first_save": 1635438993.1826842, "replies_charged": false}