{"id": "t5_2qh5i_t3_tz87n", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "Yesterday was Victoria day and as many of you know, Prince Charles and his wife Camilla were in Oromocto. I had the great pleasure of meeting them both at a private gathering and wanted to share with you bit of our conversation.\n\nWhen he first arrived, he apologized for being late then he grabbed a cup of tea and started chatting with another family there. When he made his was over to me, I was introduced to him by a soldier that was assigned to this event. I chatted with the prince and introduced him to my mother, grand mother and sister in law. He said that he felt weird being the only one drinking tea so he had someone bring my grandmother a cup of tea (she now has bragging rights that she had tea with a price, lol).\n\nHe asked about my husband and if he had always wanted to be in the military. We told him stories of how he would gather his friends when he was little and play army in the woods. He told us stories about Prince Harry always drawing army pictures when he was little and how they were sure that he would follow in his fathers foot steps.\n\nPrince Charles talked about how he hasn't flown a helicopter in almost 30 years now but remembers doing his training in Oromocto. He said that he would have to fly around and drop people off at their target spot. He said it was quite terrible because everything here all looks the same from a helicopter, trees everywhere! He chuckled and said that if they missed their target they would get 'thumped' for it later!\n\nHe said that he did get to go in a Apache with Price Harry once and commented on the fact that its designed for the play station generation and that he would have no idea what to do any more.\n\nAfter he left us Camilla came over to chat. She is a very kind woman and much more soft spoken and gentle then the media makes her out to be. Both her and the prince were very down to earth and it was almost like talking to friends.\n\nIt was the coolest thing I've done in a long time and I am so thankful to the CSM personel at CFB Gagetown for inviting me to this amazing event!\n", "url": "https://www.reddit.com/r/happy/comments/tz87n/a_royal_victoria_day_x_post_from_rfredericton/", "title": "A Royal Victoria Day (x post from r/fredericton)", "social_network": "reddit", "user": "goldy_locks", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1337694503, "permalink": "/r/happy/comments/tz87n/a_royal_victoria_day_x_post_from_rfredericton/", "nsfw": false, "first_save": 1635442255.6643782, "replies_charged": false}