{"id": "t5_2qh5i_t3_8hbsu7", "request": ["4161666b-4b17-4c22-bb40-42efca26f347"], "text": "   Sitting here in my first house, owned by my husband and I, I’ve never been happier or more fulfilled. \n   I feel very proud of myself and the few selfless people that reached out and helped me save myself. I have had to stay very private about my past for various reasons, but today for my anniversary I would like to share my goodbye letter to heroin that I wrote shortly after getting clean as part of my NA program. Hopefully this will help someone. \n\nH-\n   I’ve thought about writing this letter to you many times, and now sitting down to do so is very difficult and strangely sad for me. When we met, I didn’t know very much about you, hardly anything at all. I was told you could make my pain go away, that you could make me happy and whole again, that I could easily control our relationship. From our first moments together, it was only too easy to believe these lies about you. I didn’t understand at the time how vicious you are. How you could mercilessly take from me everything that ever mattered. How you could abuse me while I abused you too. I say you “took” these things from me- my health, my trustworthiness, my money, my home, my happiness, and my mind- but really, if I’m honest with myself, I gave them freely. I gave these things thinking that it could make our relationship better. Isn’t sacrifice one of the main aspects of a healthy relationship? But the more I gave, the more you took. Your power over me grew exponentially every day, until I no longer could recognize the monster I had become. I wanted so badly to walk away from you for so long. But every time I tried to leave, you always found a loophole, a tiny crevice even, to crawl back into my mind, my body, and what came to feel like my soul. \n   Of all the promises you made to me, you broke them all. So now I’m writing to you to simply tell you good bye. I’m sure you’ve been wondering why you haven’t seen or heard from me in forty five days. I’ve been in recovery, surrounded by loving and good people that support me in my endeavor to not only get away from you, but to stay away from you. This past month and a half I have been able to start rebuilding my life and gaining the parts of me back that I surrendered to you. It was hard for me to believe at first, but I never lost my soul to you. I have, in many senses, come back to life. No longer do I wade through life as a zombie, I am not perpetually sad anymore, and I can now have healthy relationships untainted by your poisonous presence. I’m not back to my “old self”, the woman I was before I met you, but I am recovering and steadily growing into a better me.\n   I am better without you. You will never see me again. You will never hurt me again. I can’t promise I won’t miss you on some rare and difficult occasions, but I can promise that I will never wish for you back. I can honestly say that I wish you dead, and I don’t even feel the least bit bad about that because I don’t want you harming anyone else. \n   ROT. IN. HELL.\n\nWith zero love,\nTheJester4", "url": "https://www.reddit.com/r/happy/comments/8hbsu7/today_not_only_is_it_cinco_de_mayo_but_its_also/", "title": "Today, not only is it Cinco De Mayo, but it’s also my five year anniversary of getting clean from heroin and meth. I just wanted to share something, now that I’ve come this far.", "social_network": "reddit", "user": "TheJester4", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 51, "down_vote": 0, "creation": 1525568466, "permalink": "/r/happy/comments/8hbsu7/today_not_only_is_it_cinco_de_mayo_but_its_also/", "nsfw": false, "first_save": 1635440976.4502509, "replies_charged": false}