{"id": "t5_2qh5i_t3_kpljki", "request": ["e660e09a-842d-44ca-8826-ddfa61319574", "a0e8eae7-000b-41d9-95ab-e3fc3447f7db"], "text": "There I was just looking for a challenging game of Scrabble and unbeknownst to me, I was about to meet one of the most engaging, intelligent and charming people in my life.\n\nThe connection was strong, the messages were of quantity and quality and the smile was getting wider and wider the more I got to know her. She said that I was good with words yet somehow, I always managed to run out of ways to explain how she always found a way to make me smile even more and ended up with a rather well used phrase “You’re amazing”.\n\nI think at some point, she wanted more words than just that, so she asked me for the reasons why I said that. I tried my best to explain but it never felt enough to me, though to her, she felt it was more than enough, even bordering on me being insane (or maybe she thought I was definitely insane).\n\nWhen I tried to explain why she was so amazing and unique and special and tried to let her see how I see her, she didn’t really believe me much and thought I was just saying it or that I was biased and didn’t really see her objectively.\n\nWell as analytical as this might sound, here is a rather objective view of her, and why I think she’s amazing regardless of my perspective. 😊\n\n\\---------------------------------------------------------------------------------------------------\n\n**Intelligent –** She beat me at Scrabble. That is evidence enough! I kid of course, she is very intelligent. Many evidences such as the work she does, the deals she makes, the information she knows and the way she can bring up previous conversations and tie them in, the way she is able to discuss subjects and show sides that people are not looking at, even if she is just playing devil’s advocate. Her love of books got me reading again and her attraction to intelligence and love of learning inspired and motivated me to complete a qualification. Speaking of qualifications, she was **chosen** to attend INSEAD, the top business school in the world! That is not subjective at all.\n\n**Kindness / Good Hearted / Caring** – How can I give specific examples as evidence of kindness when her entire essence is one of kindness to all? She cares about everyone and always wants to help, even doing more than she has to. She is supportive and listens to any issue and if she can help in any way she will do – even if that means telling someone what they don’t want to hear. She will see someone’s weaknesses and make them forget they exist or even make them feel special for them. She will make them feel confident in themselves and be able to be themselves, their real self without hiding anything. She is complimentary and makes everyone feel better about themselves. I personally went from feeling that people usually talk to me when they need me, to feeling wanted and valued.\n\n**Witty / Funny** – Her humour is absolutely fantastic and even though she might say that people think it is too much after a while, I disagree entirely. She is very funny and not just in a jokey way but in a conversational sense; she can tie in previous stories and jokes. Her humour is intelligent, it is not just a bunch of “knock-knock” jokes, but far more than that. She is very witty and can keep anyone on their toes but in an enjoyable way, talking with her is always engaging and never dull or boring. It could be months or years of talking to her and there is no way the subject matter would ever dry up just because of how she can keep a conversation lively, even if it is a conversation that has been had before. I truly believe that this is one of her most amazing qualities.\n\n**Positive / Strong / Brave** – Personally, she is my role model; she is one of the bravest and strongest people I have ever met. With everything she goes through and all the pain I have seen her deal with, she still gets through the day and is more productive than most people I know. She may have a whine here and there and complain about something, but she is human and that is something everyone should be able to do. She used to ask me why I never get tired of hearing her complain and it is because I see how much she fights to improve and be strong and improve and I will never get tired of hearing about it and trying to help her because I feel inspired to do so from her own actions. There are people who complain and do nothing and define themselves by their issues but she is someone who defines herself as this awesome person. She is an inspiration in how, even with any issue, she still faces everything the day has to bring and actually wins every day. I feel really proud and happy seeing her progress since I have met her.\n\n**Fair / Just / Protective** – She once told me that one thing that always angers her is when people bully others and she always wants to stand up for them. She stands for justice wherever she can and will always try to help people out and protect them, even if it is from themselves and their own thoughts, or in my case protecting me from family members’ bad habits and actions. She talks about equity over equality, and unlike many people who consider feminists to be about just females, she considers it more important that everyone is treated properly, including the other way around where men are put down. She has never made anyone feel less of themselves; an example would be me telling her how I cry in loads of stuff but she never uses anything I say to say I am less of a man. Instead, she is right there to say that that makes me a better person. I will never forget how she talked about the day where women fast for their husbands and how it is not fair and should be vice versa too, and how she ties a string for Happy too.\n\n**Beautiful** – I leave this point to last because she will correctly point out that beauty and art is very subjective. However, she is beautiful, objectively; all of the above shows just how beautiful her soul is. When a soul is this beautiful, of course it will shine through on the outside. Her radiant smile, her wavy hair, her gorgeous eyes – whilst all of those are subjective to people generally, there is no denying that they are all beautified by her character. Anyone who knows her character and personality will automatically see that beauty personified in her features. Her positivity coming through in her smile, her lips open wide showing her mouth. Her lively active side as she laughs and moves her face with her hair waving through the air. Her eyes shining brightly and sparkling whilst simultaneously looking deep into the soul of the person she looks at, silencing them in awe. This is pure, mesmerising beauty.\n\n\\---------------------------------------------------------------------------------------------------\n\nThe only conclusion anyone can get from this is that she’s absolutely amazing. Maybe she doesn’t see a lot of this in herself but I hope by reading this, she does see herself as she should. This is only a summary; there is so much more I could write about each day with her that was an experience of its own. Each day added something to my belief that she was amazing, and I didn’t need to analyse it. I felt it.\n\nShe will notice that I grouped a lot of those characteristics together – that isn’t because they are synonyms. Each of those has its own special evidence and meaning, but all of those characteristics are so linked together that they made sense to write together; in fact, every single one of them is linked to each other in some way – it is all one big pot of characteristics that simultaneously totals this special woman, and at the same time doesn’t, because she is so much more than the sum of those.\n\nI know her argument might be that this is all normal and it is what anyone would do, or should do, but all these characteristics in one person still make them amazing. It is not normal at all to be like this and these summaries don’t even go into the depth of how strong each of the characteristics are (or all the ones left unwritten).\n\nNo matter what else she has going on, all the above is her personality and will never be lost. She was scared of forgetting who she was and becoming something else, but this will never happen because of this base character, she will always be this person and when she is not this person, she just won’t feel right and will make sure she fights hard to feel right again.\n\nI hope that no matter what is going on, whenever she doesn’t feel good, she can use this to remind her. This is what she is, this and so much more that I can’t even manage to complete anything without remembering more and more and more.\n\nThere may be little things here and there that she may not like, she may think her humour is too much or her health is not good at times, or anything else, but it does not change that as a whole person she is truly, truly amazing and that none of those things define her more than the actual person she is.\n\nShe is special and a unique combination of naughty and nice, sugar and spice. She is the sunshine to the darkness and happiness to the gloom.\n\n***She is Amazing.***", "url": "https://www.reddit.com/r/happy/comments/kpljki/this_is_a_story_about_a_special_person_i_met_over/", "title": "This is a story about a special person I met over lockdown", "social_network": "reddit", "user": "msameja1990", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1609684330, "permalink": "/r/happy/comments/kpljki/this_is_a_story_about_a_special_person_i_met_over/", "nsfw": false, "first_save": 1635439377.2322705, "replies_charged": false}