{"id": "t5_2qh5i_t3_2p5jt2", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "This is long so I apologize in advance.  \n\nWhen my husband got out of the army 3 years ago we were unprepared for what \"real life\" held in store for us.  Right off the bat we were in the worst financial situation we've ever been in. I worked over 80+ hours a week to put my husband through college on top of his GI loan and BAH to barely keep our heads above water.  We made exactly $16 over what the state set the line for assistance for.  We missed funerals, weddings, birthdays and could barely afford dollar store toys for our son's birthday and Christmas.  I didn't even put up a tree for the last 2.5 years because I couldn't stand the thought of it being empty.\n\n\nMy husband graduated in May and got an amazing job.  We slowly were able to pay off most to all of our debt.  There were a few hiccups with untimely deaths and he switched jobs before we could save up for it but you know what?\n\nI put a tree up this year.  And with the help of coupons and keeping informed with deals I was able to fill our tree with gifts for my son.  He just turned 5 and this is the first year he's seemed interested in Christmas so the fact that we were able to afford what little we do have this year makes me so profoundly happy.  \n\nOh and did I mention my husband is now putting me through college full time now too? I feel so amazing and happy that everything my husband, my son and I went through for 3 years feels like it was worth it.  I just wanted to tell someone and share how relieved I feel\n", "url": "https://www.reddit.com/r/happy/comments/2p5jt2/my_bright_side_is_finally_here/", "title": "My bright side is finally here...", "social_network": "reddit", "user": "Jacmia", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1418452030, "permalink": "/r/happy/comments/2p5jt2/my_bright_side_is_finally_here/", "nsfw": false, "first_save": 1635438855.1268816, "replies_charged": false}