{"id": "t5_2qh5i_t3_p8x6wy", "request": ["2293bc08-7671-4d63-b63f-dbe4a3a4858a"], "text": "ummm so I'm not sure what to put in the title because it's kinda complicated but I guess what I said works. just a warning that this gonna be a long post also lol.\n\nlately i've been making so many new friends. local friends!! i didn't have a lot of local friends previously (people from my country) as i has to cut off people from my old school, and now i am not inside my country's education system either. most of my friends are overseas, my bestfriends are almost 13,000 miles away. \n\ni've always wanted to have people i could go hangout with. people with the same timezone to hangout with. people to talk about shit going on here, not ones that i am just explaining the whole situation to, but one that shares an experience. \n\ni've first met this friend through a facebook group. i had a post that went viral and he added me. he then commissioned my art. i then found out we're the same age and like a lot of things in common. i was really happy to have a new local friend. he also let me send him happy mail and i made him a rick roll card!!\n\nthen i joined his discord server and got to meet his classmates. his friends are really nice to me so we soon became friends too. i send them happy mail. i help them cheat on their online exams and their english homework. we have now talked about maybe hanging out at the amusement park when covid gets better. my friend says that i'm like the unofficial 46th student of their class because of how much I interact with everyone. i feel so accepted. its so nice.\n\nthen i met my friend's other friend. it was actually just a day ago. we hung out and talked on call and it was so fun!! i asked if i could send him mail too and he was really enthusiastic. and told me i can send as much as i want and he will keep a collection.  then this new friend introduced me to his gf and shes likes stationery!! she was so excited when i told her i do snail mail. she said she had never done it before and would love to write with me.\n\ni was really scared that i would somehow not be able to hangout with these people because of what happened in the past. but now im literally doing nothing but being myself and i am making so many friends!!!\n\ni just feel so fucking happy rn. i am making so many new friends. i will get to use thai language more. i could probably even HANGOUT with them in MY COUNTRY now!!! they actually all live in a different province from me, so it's not like i can see them all the time, but it's not super difficult to meet them either. IM SO EXCITED. I FEEL LIKE I AM FINALLY GETTING THE CHANCE TO EXPERIENCE A LIFE OF A TEENAGER IN THAILAND. I thought I wouldn't have a chance as I'm about to not be a teenage very soon. I have voice calls and video calls to be in all day. Like I've always dreamed of. People are enthusiastic at what I do and I don't have to only care about what they like. It makes me feel so fucking full inside I'm bursting with joy.\n\nI know this post was quite long and I maybe didn't even make that much sense but thank you so much for listening to me!!\n\nAlso, if anyone wants to know what happened about my old friends I can tell you. But only via a letter lol. (i just really like to write letters so i had to say that lmao)", "url": "https://www.reddit.com/r/happy/comments/p8x6wy/kinda_finally_getting_the_thai_teenager_experience/", "title": "(kinda?) finally getting the thai teenager experience.", "social_network": "reddit", "user": "BitchImGhastly", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1629572478, "permalink": "/r/happy/comments/p8x6wy/kinda_finally_getting_the_thai_teenager_experience/", "nsfw": false, "first_save": 1635441069.525139, "replies_charged": false}