{"id": "t5_2qh5i_t3_9m55x", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "Hi /r/happy, wanna hear a happy story?\n\nSure you do. :D\n\nLast Thursday I brought my bike to the repair shop (both the brakes were busted == not so good safety :\\), so yesterday I took the bus to my study place. I take the number 73 bus that goes to 's-Hertogenbosch central station and from there walk to my study place. \n\nI started working on integrating Thrust (a library that looks and feels like Boost except for your GPU) into my project and wrote a tutorial about that and put it on the school's forum. Anyway, when I was walking back to the train station after a long day of wrapping my head around the craziness of parallel computing, I decided to take the 73 bus back home. I should have taken the 68 bus, which would have taken me very near to the bike repair shop, but I would rather take a bus which I knew and then walk for a bit then take an unknown bus and spasming out the whole time.\n\nAnyway, I was sitting in the bus, all thinking about parallel computing, when I hear a voice next to me.\n\n\"Does this bus go to the Rompert mall?\"\n\nI look next to me and see it's the attractive young woman I saw entering early. Now, I think it was because my mind was completely numb and distracted, because instead of overthinking and saying \"Uhh yeah uhm... no, I, uh... hmm... yeah... I think so.\" I said \"No, this bus doesn't go there, but it does go to the Hambaken, from there it's about a 15 minute walk to the Rompert.\" \"Damn, I knew I should have taken that other bus, but I just saw this one and jumped in. I just saw \"Rompert\" and figured that was it.\"\n\n\"Oh, but there are two buses: Maasport via de Rompert and Hambaken via de Rompert. Rompert is bigger than the mall. I'm going to the mall too by the way.\"\n\n\"Do you mind me walking with you?\" I was like, lol wut, and then I was like like \"Sure.\"\n\nSo I walked with her to the mall, chatting (!) and bantering (!!) along the way. Turns out she just finished a tourism study at my college and was looking to become a police officer. I told her that I'm not very good with people (eye contact is a BITCH), but that I didn't mind walking with her to the mall.\n\nAll in all, it made very happy to be able to help a random stranger in an unknown part of town and hear a bit about their life.\n\nStuff like this never happens to me. :)", "url": "https://www.reddit.com/r/happy/comments/9m55x/hmm_stuff_like_this_never_happens_to_me/", "title": "Hmm... stuff like this never happens to me...", "social_network": "reddit", "user": "knight666", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 93, "down_vote": 0, "creation": 1253369165, "permalink": "/r/happy/comments/9m55x/hmm_stuff_like_this_never_happens_to_me/", "nsfw": false, "first_save": 1635440716.3325207, "replies_charged": false}