{"id": "t5_2qh5i_t3_jplk8l", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb"], "text": "I (25M) grew up in an extremely abusive situation. I'm autistic and physically disabled and that was taken advantage of my entire life. I was extremely depressed, suicidal and I felt hopeless.\n\nI met my now-wife online when we were both 16, and she brought so much light into my life. I never knew that I could be loved - despite everything I was always told was \"wrong\" with me. At 18, I moved halfway across the country so we could be together.\n\nFast forward to now: I've had two major surgeries in the past year that have given me the ability to finally walk normally, the most amazing wife, an extremely healthy relationship overall, our dogs and cat, and her family has accepted me as a part of the family. I have a great psychiatrist who has helped me overcome the trauma I've been though, a great team of doctors who continue to help me stay healthy and comfortable. My severe chronic pain from a genetic connective tissue disorder is finally managed. I was able to follow my lifelong dream and start my own business - an affordable CBD company - to help others while securing a future for myself, my wife and our future child. I finally have financial freedom, personal freedom, and I couldn't be happier.\n\nI'm sitting here right now, at 1AM, with my new 3 day old nephew. My wife and I will be spending the night with him 3 days a week while my sister in law and her husband rest and recover. Every time I look at him, I'm filled with love, a reminder of how far I've come, how lucky I am, and how much a family means even if they're not blood.\n\nPlus, they have blueberry muffin cereal here. Could if get any better than that?\n\nI hope everyone has had a great day!", "url": "https://www.reddit.com/r/happy/comments/jplk8l/8_years_ago_i_never_thought_id_ever_find/", "title": "8 years ago, I never thought I'd ever find happiness. Today, I love my life.", "social_network": "reddit", "user": "aescuo", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1604728151, "permalink": "/r/happy/comments/jplk8l/8_years_ago_i_never_thought_id_ever_find/", "nsfw": false, "first_save": 1635438908.2585826, "replies_charged": false}