{"id": "t5_2qh5i_t3_c7zngb", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "One would think that happiness is something that slowly gets less and less as we get older. Our body gets weaker, we see more and more people around us die, we ourselves get closer and closer to death. Why would anyone be happy about this? (if you dont wanna read, here is the same info in a quick video: [https://youtu.be/EkVV5DAUGtg](https://youtu.be/EkVV5DAUGtg))  \n\n\nWell, as it turns out though, we are actually the unhappiest when we are in the \"prime\" of our lives, around 50. This is when we are in the infamous midlife crisis. After that people's happiness steadily increase, a phenomenon called the u-curve of happiness. After 50 is when we start to become aware of how short life actually is, which in turn allows us to value the time we still have on this planet. We become more present to the moment and manage to appreciate the small pleasures of life. \n\n&#x200B;\n\nhttps://preview.redd.it/m2om65z84r731.jpg?width=650&format=pjpg&auto=webp&s=a5d4fe8b8429949a8ae1fc82313e7e59fa7ee75e\n\nFurthermore, by the time we pass 50 we realize that not all of our dreams in life will necessarily come true and we make our peace with that. For many people this is actually a huge burden that gets lifted from them!\n\n&#x200B;\n\nI believe that this is a good outlook! We will get happier and happier, almost until the time we pass away! For me, this makes me look forward to getting older and already makes me happier today!", "url": "https://www.reddit.com/r/happy/comments/c7zngb/we_are_the_happiest_when_we_are_old_heres_why/", "title": "We are the happiest when we are old. Here's why.", "social_network": "reddit", "user": "garlin88", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1562012725, "permalink": "/r/happy/comments/c7zngb/we_are_the_happiest_when_we_are_old_heres_why/", "nsfw": false, "first_save": 1635442234.1785114, "replies_charged": false}