{"id": "t5_2qh5i_t3_bwddmd", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11"], "text": "  \n\nCrazy but true. The mind is a random rascal, yet your *entire* life experience takes place there. Take control of the mind’s on/off switch and live happier every after. Once you get it, you’ll not forget it.\n\nBeliefs: They are not the truth. They are the result of a perspective we adopted from our family and community at a young age. Left unexamined, they take take the wheel and we follow. You know a belief isn't serving you when you feel unhappy or disconnected. Time to look at it for what it is - a thought you keep thinking. Nothing more.\n\nPerspective: There are as many perspectives as there are people. Learning how to see things through another's eyes teaches love and patience. Perspective, like belief is either chosen or a default mode of viewing the world.\n\nInterpretation: There is nothing in this world that is not subject to interpretation. Not a building, a piece of artwork, or even the purpose of a tree. Becoming mindful that interpreting is another aspect of perspective requires awareness and a willingness to let go and allow.\n\nHappiness is letting things go that don't fill you with joy. By mastering the Triad of Perception (Belief, Perspective, Interpretation), we begin to wake up and live a life we love. All negativity falls away because that too, is just interpretation.\n\nThe technique is simple and unforgettable. More is available in Follow Your Bliss, Not Your Blisters: How to Live Unconditionally Happy.\n\nhttps://www.amazon.com/dp/B07JYT63Q8", "url": "https://www.reddit.com/r/happy/comments/bwddmd/happiness_is_a_state_of_being_not_a_mercurial/", "title": "Happiness is a State of Being, Not a Mercurial Emotion", "social_network": "reddit", "user": "happinessexpert", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 1, "down_vote": 0, "creation": 1559582953, "permalink": "/r/happy/comments/bwddmd/happiness_is_a_state_of_being_not_a_mercurial/", "nsfw": false, "first_save": 1635439201.587141, "replies_charged": false}