{"id": "t5_2qh5i_t3_bwxfte", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "I have spastic, left-sided, hemiplegic cerebral palsy. Basically, it’s a long phrase that means the left side of my body is super tight and doesn’t work the way I want it to due to a brain hemorrhage I had from being born prematurely.\n\nI’ve learned to do lots of things mostly one-handed: Dressing, putting on makeup, and eating.\n\nI’ve worn eyeglasses since I was two years old due to a few eye conditions I had: Strabismus, astigmatism, and amblyopia.\n\nStrabismus is eye misalignment.\n\nAstigmatism is an irregular cornea shape (football instead of a soccer ball) that affects how light is focused on the retina, a layer of tissue that detects light.\n\nAmblyopia is when the brain and the eyes don’t communicate effectively, affecting vision. My brain pretty much said, “I don’t feel like it.”\n\nAdd to that:\n\n* Partial retina detachment of the left eye (retinopathy of prematurity) and surgery\n\n* Two strabismus corrective surgeries (all three surgeries happened before I was two years old)\n\n* Eye patch amblyopia therapy, eight to twelve hours a day, until I was nine years old. This forced the brain to individually communicate with the uncovered eye, and the covered eye was alternated daily.\n\nI quickly learned **a lot** about how the eyes worked and what was different about mine.\n\nMy vision isn’t actually all that bad despite those conditions, and my eyeglasses were mostly used to maintain those proper parameters.\n\nHowever, cleaning them was difficult, and they always wound up covered with smudges and eyelash dust by the end of the day. That was the main factor why I didn’t wear them as much as I should have after graduating high school.\n\nSkip forward a few years, and I now want to get back into golfing and obtain my driver’s license. Sunglasses overtop eyeglasses was always a hassle, and sometimes I’d cheat by looking over or under the lenses. You can’t do that with contacts.\n\nI had my fitting appointment today (6/4/19) and it went well. Everyone seemed to be thoroughly impressed that I could insert and remove the lenses with only my right hand. I desensitized my blink reflex by touching my eyes at home.\n\nGranted, I goofed when putting them back in the second time, as I put the right one in inside out and my eye proceeded to wig out.\n\nWhen the doctor checked my eyes with the magnifier, she said that I must have had a high tolerance, as she could see that it wasn’t properly oriented. Toric lenses must be properly oriented and face down for the best use.\n\nCue me thinking, “Oh, it’s **not** supposed to be this uncomfortable.”\n\nI quickly removed, flipped, and inserted the right lens again, and this time it was properly oriented where it should have been.\n\nWe went through the do’s and don’ts of the maintenance and I found it to all be very straightforward.\n\n* Proper cleaning and sanitation\n* Check for tears and proper direction (If it’s shaped like a cereal bowl, it’s good and facing the proper way. If it’s shaped like a taco shell, it’s bad and facing inside out.)\n* Replace every two weeks/fourteen wears\n* Never sleep/shower/swim in them (infection risk)\n* Dispose of old lenses when ill/don’t wear (infection risk)\n\nI also got a goody bag of supplies. It had a bottle of cleaning solution, eye drops, a storage case, a [special tray](https://images.app.goo.gl/inDH9ahDMLNEHkKo8) to use when inserting and removing lenses, and a pair of spare lenses.\n\nI wore them for four hours today with an increase of two hours each day. I wasn’t expecting the temporary poorer/blurry vision, but my eyes and brain are confused right now until they adjust. They’re biweekly Acuvue Oasys lenses for astigmatism.\n\nOverall, I’m happy and excited. I go back in two weeks. Anyone have any tips or tricks? And, any fun uses for repurposing old lens cases? They should be changed every three months, like a toothbrush.\n\nI’m happy to answer any questions, if anyone’s interested in my experience.\n\nEdit: Formatting", "url": "https://www.reddit.com/r/happy/comments/bwxfte/22f_i_have_cerebral_palsy_and_i_finally_got_to/", "title": "(22F) I have cerebral palsy and I finally got to attempt wearing contact lenses today!", "social_network": "reddit", "user": "PolarbearSafari", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 18, "down_vote": 0, "creation": 1559701603, "permalink": "/r/happy/comments/bwxfte/22f_i_have_cerebral_palsy_and_i_finally_got_to/", "nsfw": false, "first_save": 1635441313.3381758, "replies_charged": false}