{"id": "t5_2qh5i_t3_i70abr", "request": ["5b81e8b4-a0f8-4747-8a7a-0e37aae01c43"], "text": "We haven’t been together for very long but it’s both of our first serious relationship so we decided early on that we would be taking things somewhat slow as to not feel stressed and pressured about things. We ended up having a belated birthday dinner for him with his parents tonight at their house and it was so lovely. I was so nervous to seriously meet them and talk to them but it went so well!! I felt really comfortable and happy being able to be welcomed into a family like that for the first time :)\n\nAfter dinner, we ended up back in his room just sitting and finishing a movie we had started before and my heart just felt so so full and warm, I wanted to tell him SO bad I swear to god I was about to burst. He’s had a lot of bad past experiences with girls and them not being serious about their feelings leaving him with some trust issues so I’ve been nervous about saying I love you to him in case it scared him off. He ended up walking me to my car when I was leaving and had this certain Look on his face so I pressed him about it and he just kinda looked at me and asked if he could tell me something. My heart legit went STRAIGHT to my throat so I said yes and he just said it after a little moment of silence. It was so quiet outside, it felt like we were the only 2 people in the world. I ended up saying “you do?”, he said yes and then I said it back without hesitation. I felt like I could’ve blasted off to the moon with how excited and happy I got after, it was such a lovely feeling!!!!! I was smiling so much on my way home. \n\nAs soon as I turned onto the street my apartment is on, it hit me that someone in the world loves me in the way I’ve always been convinced would never happen for me. I teared up immediately after the realization, and I cried so hard for so long. He sees beyond my flaws, loves the weird parts of me and it just blows my mind.. I’m tearing up again typing all of this out lmao\n\nI hope anyone that feels how I felt for so many years, convinced that I would never meet anyone and just forever watch everyone be happy and in love with their partners, knows that it really, truly does happen when you least expect it. Please always remember that you deserve to be happy, have good things and the warmest love in your life that could possibly exist. \n\nTo wrap up this post: Past me, the girl that spent so many nights crying herself to sleep because she was just so tired of being sad and alone, if only you could see yourself now; happy crying because there is so much love and good in you for another person that feels the same way towards you. ❤️", "url": "https://www.reddit.com/r/happy/comments/i70abr/my_22f_first_boyfriend_24_and_i_said_i_love_you/", "title": "my (22f) first boyfriend (24) and I said I love you for the first time tonight", "social_network": "reddit", "user": "nicmichey", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1597044037, "permalink": "/r/happy/comments/i70abr/my_22f_first_boyfriend_24_and_i_said_i_love_you/", "nsfw": false, "first_save": 1635443020.6231525, "replies_charged": false}