{"id": "t5_2qh5i_t3_t65xm", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb"], "text": "I wrote this keeping in mind the emotions I felt during this experience. I hope it comes across. It's a long one but I refuse to give this a tl;dr\n\nI was walking home today from the bookstore. I had waited until later than usual to head out, I wanted it to be evening when I came back to it would be cooler. I was walking up the hill a few blocks away from my house when I saw the first firefly of the year. \n\nFireflies have a lot of significance to me. When I was a child and we lived next to a river, we would spend a lot of time catching them and trapping them in jars. I remember one night in particular spent in one of my sisters friends front yard. Chasing bugs, trying to predict where they'd light up next. It was the most fireflies I've seen to this day. It's a beautiful memory from my childhood, where beautiful memories are few and far between in the front of my mind. They've always meant 'summer' to me. It made me remember a toast at the new years party we had at my new place. Myself and a bunch of people I hardly knew toasted, for different reasons each I'm sure, to to the knowledge that this year would be better than the last. \n\nIn 2011, my father died, and as sad as it was, it freed me from a lot of emotional weight. I hit the depth of my depression and found out I could climb my way out. I was adopted by a new circle of friends who pushed me forward and refused to let me stagnate or regress. I found employment for the first time in my life at a job I loved doing, even if I didn't agree with most of the companies actions or liked the people there, and I had a solid work out routine thanks to another new friend. I was spending 3-4 days a week at the gym and lost almost 20 pounds in 2 months. I had moved out and now lived with friends I'd had the majority of my life. My life consisted of working, working out, and going out with friends most nights of the week. Everything seemed primed to kick off a new year.\n\nI lost my job in the first couple months of 2012 because of lack of work. My work out buddy lost her job too, and was unable to work out with me anymore because of a new work schedule. I did not have a car and could not continue the same routine. The people I was going out with all the time... one could barely afford living where he was from the start and had to move, the other had complications that required him to work even more than he was, as well as balancing school, so that stopped as well. I could no longer afford therapy, and thanked whoever an agnostic thanks that my anti depressants were free. A lot of things took a step back this year, many plans went on hold, and nothing was easy. Still though, walking home tonight, I saw that firefly and I remembered that toast. \n\nI was lost in though when an old lady approached me from her yard, and I could tell she just wanted to talk. Her hands shook, she had terrible liver spots, and bulging eyes like my father had gotten as his health deteriorated. She toyed with a lanyard about her neck and talked about a lot of things. How she hated where she worked. How she wanted to just quit. How her daughter lived just down the road but her boyfriend was there, and how it was different when he was around. She talked about younger brothers and sisters that would outlive her. She talked about growing up in small town Pennsylvania, how her parents had died there not too long ago and the daughter that had lived in their house and taken care of them. She wanted to go visit them but from some reason seemed hesitant. More than anything, how she didn't know why she was alive anymore, and wasn't sure if she wanted to be. She was 72 years old.\n\nI talked with her about my dad dying, encouraged her to go see her daughter, told her life is what you make it, and you just have to keep on. I don't know who I am telling someone over 3 times my age how to live life, but I could feel the urgency in her talk and the way it spilled out. She just wanted someone to talk to. Someone who wouldn't patronize her just for being old and doddering. She just wanted to talk to somebody. Of all the feelings in the world, I think I know that one the best. Her grandson came out once to try and get her to come back inside but I could see her almost fear in that. I told him it was ok, that we were talking. After awhile I said my goodbyes and said I needed to leave, I could see her grandson spying on us through the window. He must of been eavesdropping as well because he came back out and said as much. She agreed. I went to hug her. She put just one arm around me and I don't think she was expecting the full hug I gave her.\n\nI am 21 and I have to run from my depression everyday and fight it when I have to. I have felt lost, hopeless, helpless. If this was a book, I'd know just how to interpret the foreshadowing of what had happened, but thankfully life a book you write yourself, one day at a time. I just hope that someday, when I'm 72 and don't know why I even go on, that somebody will have the kindness to talk to me plainly, and show compassion, and I hope that while the sun went down over the hill that I'd brought a ray of sunshine into her life.", "url": "https://www.reddit.com/r/happy/comments/t65xm/rhappy_i_had_a_hell_of_an_experience_on_the_way/", "title": "r/happy, I had a hell of an experience on the way home tonight.", "social_network": "reddit", "user": "prophecy7777", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1336097171, "permalink": "/r/happy/comments/t65xm/rhappy_i_had_a_hell_of_an_experience_on_the_way/", "nsfw": false, "first_save": 1635438962.125538, "replies_charged": false}