{"id": "t5_2qh5i_t3_xz3ig", "request": ["e660e09a-842d-44ca-8826-ddfa61319574"], "text": "Inspiration from Patients:\n\n•Life itself is enough of a celebration for me.\n\n•Patient: just remember, you can’t drink a fifth on the fourth and go forth on the fifth.\n\n•Me: Last day! Are you going to celebrate?!\nPatient: Yea, I am.\nMe: What are you going to do?\nPatient: Just be happy.\n\n•It could always be worse, right?\n\n•Me: Are you celebrating tonight?\nPatient: Well…anymore I try to celebrate every day.\n\n•Patient: It really is all about the little things. Don’t forget that.\n\n•Just remember to always tell people you love them.\n\n•Never give up. We’ve got too much to do yet in this life, too much to live for.\n \n•Damn it; let’s get this done with so we can go on.\n\n•Don’t take anything for granted. I like to say what I think and do what I want to do.\n\n•You are the person that knows your body more than anyone. If there is anything different, go in. demand to get results. Don’t wait a week or a month to see what happens.\n\n•Third time is a charm. I’m done with this stuff. I refuse to die from cancer.\n \n•(Song ‘I hope you dance’ playing in the background): I hope you dance, Stephanie. You should always dance.\n \n•I’m going all in, I’m not half assing this. That’s no way to live life.\n \n•Patient: thanks so much for this. I’ve got to get you something for giving me this. \nMe: Nah, you’ve already given me enough.\n\nFunny Patient-isms:\n\n•Therapist: ”I’m just gonna undo your pants” Patient: “When I was younger I used to love hearing that”\n\n•Patient: “Yea they’ll say ‘how’d you do that to your eye?’ and you’ll have to respond ‘oh, got hit with a button unbuttoning some guys pants’”\n\n•Are you gonna give me my tattoos of naked ladies now?\n\n•You’re gonna draw on my tit?!\n\n•Therapist: “we’re going to give you tattoos now”\nPatient: “you’re shitting me!”\n\n•Do you come around here often?\n\n•Noooo, I gotta go number 2 and this isn’t gonna be a fast process.\n\n•Anything to make the time go faster.\n\n•Prostate patient with a small tattoo on his pubic bone:\nMe: I’m just gonna try to find this tattoo…\nPatient: Yea that’s a tough one. I can’t find it, my wife can’t find it, my neighbors can’t find it…\nMe: Neighbors?! Those are some good neighbors.\nPatient: Yea, great neighbors. But they really didn’t look.\n\n•I was the cat’s meow in college.\n\n•Patient: I’m a cranky old bitch today.\nMe: Don’t make me kiss you!\n\n•I told my wife I haven’t dropped my pants this much since my 20s.\n\n•I get to come here every day and drop my pants in front of 3 women. \n\n•Man that music you had playing…I almost jumped up and started dancing. That lady gaga, damn she’s sexy.\n\n•I’m 67 years old and you ask about pregnancy. I don’t even mess around.\n\n•Male patient: I used to be a swimmer in high school. I was awesome at the breast stroke (grinning).\n\n•Me: how are you today?\nPatient: just shitty.\n\n•This place got a suggestion box? Because I’ve got one. You need a stripper pole and a kegger.\n\n•Therapist: do you sit a lot?\nPatient: every chance I get.\n\n•Patient (who thinks I’m married): tell your hot blooded lover to keep his hands to himself\n\n•Patient (after the treatment table shifts into position): it’s locked and loaded.\n\n•I’m a PITA. Pain in the ass.\n\n•Me: I like your bright pink shirt, it’s very summery.\nPatient: Oh do ya? I use it to cover up my little boobs. They just go pffftttttt. Enjoy them while ya got em.\n \n•Therapist: go ahead and lower your pants.\nPatient: oh right! I’m not used to being asked to lower my pants.\n\n•Me: we’ve been telling everyone about your fuck cancer t-shirt…\nPatient: oh yea? I’ve got a pair of underwear that says that too. Right across the butt.\n\n•I’m really gonna tear up some beers this weekend.\n\n•Well tickle britches…\n\n•Male patient: There’s two things keeping me from dragging you outta here with me.\nMe: Oh yea? What’s that?\nPatient: My wife and your hubby.\n \n•Patient: Hey, you did something different with your bangs today. I like it. Or as my friend in Philly would say….rawrrrrrr.\n\n•Patient’s hat: as the hurricane said to the coconut tree, hold onto your nuts this isn’t gonna be an ordinary blow job.\n\n•(Talking about my 8K run): patient: if I ever get the urge to run I usually just drink a beer and it goes away.\n", "url": "https://www.reddit.com/r/happy/comments/xz3ig/in_the_words_of_a_cancer_patient_heard_by_a/", "title": "in the words of a cancer patient (heard by a radiation therapist)", "social_network": "reddit", "user": "sfunnell", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1344564842, "permalink": "/r/happy/comments/xz3ig/in_the_words_of_a_cancer_patient_heard_by_a/", "nsfw": false, "first_save": 1635439406.2402084, "replies_charged": false}