{"id": "t5_2qh5i_t3_9x7qm6", "request": ["f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "A few weeks ago, I got out of relationship where the power differential between myself and my partner caused us to lose our ability to communicate with one another. We were living together in the same house, so our relationship kept going because of the fear of us breaking up and potentially being without a home. We stopped taking about serious problems that were affecting our personal lives and our relationship as a whole, which just made the romance disappear over the last few months. After a breaking point and a 6 hour long conversation late at night, we decided that we should go our separate ways and things started to feel better from then on. \n\nSince then, my self confidence has started to improve drastically and I feel like I can worry about myself first instead of worrying about the needs of the other person in my relationship over my own. I've started counseling to work on putting myself first, I've been spending time with friends more, and I even have been talking to others that see me as romantically available. One of my peers and I actually went out on a date tonight and it felt wonderful. Our conversation was just about getting to know each other and share what we wanted to with each other. I felt comfortable being myself and felt like what I had to say mattered to my date. I think my well being is better right now than it has been for a long time, and I'm thankful for it. Plus at the end of the date, when I asked her if I could kiss her, she said yes and that was pretty fucking neat. \n\nTL;DR:\nAfter getting out of an unhealthy relationship that went on for 5 years, I just went on a date with someone who made me feel special again. I felt like I was listened to and appreciated instead of just being tolerated. I'm excited for the next date. Feels good man. ", "url": "https://www.reddit.com/r/happy/comments/9x7qm6/first_date_after_long_unhealthy_relationship/", "title": "First Date After Long, Unhealthy Relationship", "social_network": "reddit", "user": "TheNamesTeaPotts", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1542255385, "permalink": "/r/happy/comments/9x7qm6/first_date_after_long_unhealthy_relationship/", "nsfw": false, "first_save": 1635443330.0801435, "replies_charged": false}