{"id": "t5_2qh5i_t3_a80g8j", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "In December of 2017, I was overweight to obese depending on the day, felt overwhelmed and unfulfilled in my job, lonely and depressed due to a year-and-a-half relationship ending due to her cheating and exacerbating emotional abuse, was a chronic drug and alcohol user, had no close friends, and lived just far enough from family to be isolated after a recent move. Oh, and I was in debt. So I made a simple resolution. To work as hard as I could, every day, to turn that shit around. \n\n----\n\nIn 2018 I have lost nearly 80+ lbs of fat and added a lot of muscle to replace it. For the first time in my adult life, I am happy with and confident in my appearance and body. I ski, I go hiking, I go to the gym 3-4 times a week and love it now. \n\nI've taken on a new role in my company that is higher paying, lower stress, and plays much more strongly to my knowledge and skills.\n\n I've met someone new, and fallen more deeply in love than I ever have, and ever thought I could at the beginning of the year. \n\n\nI've been welcomed with open arms to 2 groups of wonderful people that get together at least once a week to sing karaoke, go bowling, go to an arcade, play video games, or play tabletop games (we love our D&D and CAH) and have never felt more loved. \n\n\nI learned to moderate my vices, or altered them (went from a daily stoner to an occasional weekend toker with friends, from a cigarette smoker to an ecig user, from needing 4 cups of coffee to get through the day to just some green tea in the morning, and from a daily drinker to a social drinker when out). \n\n\nI've made habits of visiting my family at least twice a month for something as simple as lunch and am now eager for a wonderful holiday with them. I've paid off my car, my student loans, started contributing to my 401(k) and no longer live paycheck to paycheck by any definition. \n\n\n-----\n\nOh, and I rescued a husky-mutt. His name's Sebastian. He's the sweetest, derpy-est boy you've ever met, he's slightly whatever-the-opposite-of-cross-eyed-is and his ears flap when he walks. He loves to cuddle with my girlfriend and I in bed and get his hair everywhere and sneezes like all the time. I love him so much. \n\n\n-----\n\n\nI love my life now. 2018 has been the most constructive, positive, happiest year of my life and for all the sour shit that seems to be going on in the big picture, I just wanted to share this little kernel of joy with you all. I hope 2019 is just like these past few months have been all year.  ", "url": "https://www.reddit.com/r/happy/comments/a80g8j/i_am_so_much_happier_at_the_end_of_2018_than_i/", "title": "I am so much happier at the end of 2018 than I was at the beginning.", "social_network": "reddit", "user": "ThatOneRussian", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 31, "down_vote": 0, "creation": 1545328250, "permalink": "/r/happy/comments/a80g8j/i_am_so_much_happier_at_the_end_of_2018_than_i/", "nsfw": false, "first_save": 1635442882.804282, "replies_charged": false}