{"id": "t5_2qh5i_t3_qdenq1", "request": ["d616ef6b-b663-4224-82e4-e87b0aff3562", "b3574414-2d10-4990-bb3e-d9be8a3b6716", "b0c0a1d6-df85-40fe-9afc-934b125e4d6a"], "text": "Edit: My first reward, thank you so much~! ☺\n\nI can't describe how I feel right now, but I think this is the happiest I've ever felt!\n\nSince we're both a bit shy, we ended up confessing to eachother through music!\n\nOn my way to visit home yesterday, I sent him a song that reminded me of him, and last night, as we were saying goodnight he sent me Beautiful brain by Mabel Ye and told me it reminded him of me! I listened to and realised but was still unsure and nervous, so this morning I sent him Day 1 by Honne as a reply and after listening to it he told me that he has a crush on me!\n\nWe met a month ago, which is quick I know, but we've been living as university flatmates.\nAs soon as we started hanging out, I started to feel something for him, and despite only knowing him for a short while - he's amazing and wonderful and so kind!\n\nWe bake together and he makes me dinner, he spoon fed me some while I was washing up,\nHe listens to Christmas songs with me while baking just because they make us happy,\nWe have so much in common and so many differences at the same time! But I feel like I've learnt so many new things from him,\nWhen he felt a drop of rain while we were walking, he pulled my hood for me without a word,\nHe let's me cuddle into him while watching movies and does the same to me - when I fell asleep on his shoulder he didn't move at all,\nOne of my flatmates started getting mad at me for something, but he stood up for me and defended me!\n\nWe talk everyday, and even when we're not physically together, we always text eachother!\nHe's made me feel more safe, comfortable and happy than anyone ever has!\n\nHe's typing right now, so I'll have to leave this here! We're just two shy people that like each other a lot!", "url": "https://www.reddit.com/r/happy/comments/qdenq1/the_guy_i_really_really_like_just_told_me_that_he/", "title": "The guy I really, really like just told me that he has a crush on me!", "social_network": "reddit", "user": "babeforconspiracies", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 96, "down_vote": 0, "creation": 1634901228, "permalink": "/r/happy/comments/qdenq1/the_guy_i_really_really_like_just_told_me_that_he/", "nsfw": false, "first_save": 1635439044.0630808, "replies_charged": false}