{"id": "t5_2qh5i_t3_6bbnyg", "request": ["ea4a7795-7887-476a-9ab2-4c77d117a852"], "text": "Edit: Wanted to add.. He spent the week before that scaring the life out of me by telling me that his mother is extremely strict and that she wouldn't like me at all and that she probably already doesn't. I was so nervous! He was just messing with me and everything went really well :) \n\nThings have been strange with the boyfriend of 6 months because of the lack of definition in our relationship. I didn't even know if I could call him 'my boyfriend' until this weekend (Mother's Day). Everything has been great between the two of us really, the only thing holding it back was his hesitancy to commit to a 'long term romantic relationship' - I dunno, all this was very confusing but the point is I wasn't really sure what we were doing despite liking each other very much and spending a lot of time together. \n\nBut this past weekend was Mother's Day. He took me to his home and I met his family (they were lovely, his dad said 'can we keep her?' and his mom said she thought I was 'delightful' :D). I'm assuming you don't introduce the person you're dating to your parents unless you're fairly serious about it... Or maybe not, I dunno but the point is that I am very happy! And I guess we're finally referring to each other as a girlfriend/boyfriend - a meaningless title change but still. That made me happy too!\n\nStill waiting until July to figure out if we're gonna give this a proper shot and try to make it work until the end of *\"forever\"* and that is a looming decision but for now...\n\nI am very happy! :D :D :D <3 ", "url": "https://www.reddit.com/r/happy/comments/6bbnyg/met_my_boyfriends_parents_for_the_first_time_and/", "title": "Met my boyfriend's parents for the first time and it went really well!! :D :D", "social_network": "reddit", "user": "Zedevile", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 69, "down_vote": 0, "creation": 1494868171, "permalink": "/r/happy/comments/6bbnyg/met_my_boyfriends_parents_for_the_first_time_and/", "nsfw": false, "first_save": 1635440223.274554, "replies_charged": false}