{"id": "t5_2qh5i_t3_nrkut8", "request": ["ec625709-7f64-46c7-8416-e278a4a2b110"], "text": "Hey! Yeah so I (m21) just kinda realized that I've got incredible luck with compliments. I practically never get compliments from strangers, like most men, it just never comes up and I totally get that. I'm not **fishing** for compliments ever...that said though:\n\n* First time I ever wore my new Doc Martens (and first time I'd ever worn boots anyway, so I was sorta nervous) a nurse, that I'd never met, complimented me on them during a doctors visit and said I look great in them.\n* First time I'd gotten a super close fade, shaved on the sides really low and was nervous about it, a random girl who'd never seen me without that haircut said she liked my hair and it looked good.\n* First time I ever wore glasses after getting them, total stranger older dude said he liked my glasses and it had reminded him of someone he used to work with.\n* Just recently wore a tank top for the first time, a guy in line said he was jealous of me because he used to wear tank tops but couldn't since he grew beer gut, said it's a good look.\n* And today I wore some new shoes I bought that weren't my usual style, some like...loafer boat shoes? And a pair of red chino shorts...Definitely not my usual style but it's too hot out so I needed new clothes. Got complimented TODAY about my outfit!!!!\n\nPoint is is that I don't get compliments **ever**...….unless it's my first time wearing/doing something or looking a certain way that makes me a little nervous. Each compliment checkpoint makes me more confident and I couldn't begin to explain how much I've sat and thought and recalled these memories! :)", "url": "https://www.reddit.com/r/happy/comments/nrkut8/i_have_the_best_timing_with_compliments_and_i/", "title": "I have the best timing with compliments and I just really wanted to share some of that :)", "social_network": "reddit", "user": "TheClinicallyInsane", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1622746286, "permalink": "/r/happy/comments/nrkut8/i_have_the_best_timing_with_compliments_and_i/", "nsfw": false, "first_save": 1635441858.9637582, "replies_charged": false}