{"id": "t5_2qh5i_t3_99twp0", "request": ["4161666b-4b17-4c22-bb40-42efca26f347"], "text": "In January, I got out of a 2 and half year relationship and it left me emotionally vacant. the relationship needed to end, but I lost my best (and pretty much only) friend in the process. I focused on studies for the last semester hoping it would help fill the void. It didn't. Come graduation and summer I had gained weight, felt more empty, and lost towards what I wanted to pursue as a career. My self esteem hit rock bottom (have body issues), I missed my best friend, and longed for the life I had the previous year.\n\nCome June I had more free time as school ended as my preschool job had pretty light hours. For whatever reason, I tried to hit up the gym, get back into reading, being outside more, eat well, etc. It would be a weekly cycle of one week on the wagon, one week on a bender or self pity, food, and my own sadness. BUT, in early august, I said fuck it and went to the beach for the first time all summer. I was self conscious as can be and just wanted to be alone by the water and read. While there someone came up to me and asked what I was reading. We ended up talking for about an hour, exchanged numbers, and then she was gone.\n\nWe started talking for a couple of weeks over text. She went on vacation shortly after meeting at the beach and didn't come back till a few days ago. She got back yesterday and we went on our date tonight. It was everything I didn't know I needed. We talked, ate ice cream, got drinks, and hung out by the water all day. She complemented parts of me I didn't know were appealing to anyone, she showed care in my interests, and she seemed to genuinely care about what words I had to say. She leaves for school tomorrow so we won't get to see each other for a little while, but she said she hope I visit soon to have a second date.\n\nMy heart has been racing since I got home. Someone showed care for who I was as a person, all the while months prior I was a ball of self conscious thoughts. She appeared interested in areas I once had doubts, which helped bring up my self esteem a little. Even if this is a one and done, she did so much for me than she could imagine. This is the happiest and most fulfilled I've been all year. AHHH\n\nTL;DR: Months of self hatred momentarily alleviated by a wonderful person who asked me a simple question and agreed to shared ice cream with me.\n", "url": "https://www.reddit.com/r/happy/comments/99twp0/first_first_date_in_a_long_while_was_amazing/", "title": "First first date in a long while was amazing", "social_network": "reddit", "user": "GoddardFucks", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1535080080, "permalink": "/r/happy/comments/99twp0/first_first_date_in_a_long_while_was_amazing/", "nsfw": false, "first_save": 1635440982.3374784, "replies_charged": false}