{"id": "t5_2qh5i_t3_kcx6oo", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "\nWell I guess we have already been friends for a long time but we haven't talked too much since highschool. I am pretty good at making friends but I've only had like 2 other real best friends in my whole life.  Kinda a thought dump but thinking about it is making my night.\n\nAfter losing my job and doing covid gigs outside my major (still am), I started playing more video games.. then warzone dropped. He saw me on and we found out he and another dude (who I met a hand full of times in the past) were all really good. During the lockdowns we'd play near half our days away catching Ws. \n\nThen i got invited to the group chat after a couple months of this. Quickly after me and the aquantiances guy started hanging without my main bud. Even went to his birthday party back home and drank with his party friends. He's been hinting for a while that he wants me to start a podcast/ stream duo games with him. Even potential be roommates. \n\nFast forward and the main bud comes back home to my state to have a snowboard trip with me,  one of my few close friends, and his buds. Planned all over xbox party chat primarily. It was a blast! We just happen to be on the same skill level. He told me im his oldest and best friend he's had and it's wild were back in contact after 5 years of light chatter. Now we talk everyday, give either advice, uplift each other in our goals/say wild shit in the group chat, and send memes to one another.\n\nHe moved to Hawaii recently tho but says to always hit him up when he visits and expects me to visit him sometime. Now I'm planing on visiting him in Hawaii next year where he will host me for a week. Things really do change fast af.. Im happier than I've been in a minute.", "url": "https://www.reddit.com/r/happy/comments/kcx6oo/im_greatful_the_pandemic_made_play_warzone_made_a/", "title": "Im greatful the pandemic made play warzone. Made a best friend and gave me a new social circle", "social_network": "reddit", "user": "incognito_mode227", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2, "down_vote": 0, "creation": 1607950820, "permalink": "/r/happy/comments/kcx6oo/im_greatful_the_pandemic_made_play_warzone_made_a/", "nsfw": false, "first_save": 1635442846.8565927, "replies_charged": false}