{"id": "t5_2qh5i_t3_9ng2ay", "request": ["608fc108-cf44-476e-8378-c59ee7483909"], "text": "I just accepted a job offer that is going to solve a whole bunch of problems in my life and let me start something truly joyful. It's basically perfect for my ideal life plan. \n\nI have to tell a several year long story to really impart the significance. \n\nI met my SO online 7 years ago. He lived in England, me in Pennsylvania. We clicked so well we stuck out the long distance for 5 years before he was able to get a job in the US in DC. International long distance is freaking hard, btw. So I was super eager to move down to be with him. DC isn't a great place for my industry, but the government regulatory body for my industry is there, so I figured I'd get myself a job there! I got a verbal offer in December 2016, so I moved. Well, January 2017 came with the new administration, and the hiring freeze lost me my offer. I ended up being unemployed for almost 8 months because I had moved prematurely. My savings took a big hit, as well as the strength of my resume. \n\nOnce the hiring freeze ended, I began interviewing again for a few positions with the agency. As soon as one gave me an offer, I had to take it, even though it seemed like a really poor fit on paper. Well, it was a really poor fit in reality too. I was woefully underpaid, working a job I despised, but I was stuck in it because my resume needed the strength of the new position in order to start recovering from the unemployment. \n\nIt's fine though, right? I was finally with my favorite person in the world, so it was more than bearable, yeah? Nope. On my first day of orientation, he accepted a promotion that had him move to NYC. So I was stuck in this awful job, getting paid just enough to visit him on weekends and not have negative savings. I was away from my friends and family and I was away from him too. It was a rough year. I was awfully lonely, and I isolated myself from people who could have been friends during this time, because I was just counting down the months until I could leave. \n\nThese past few months have been really tough as we've realized how terrible our financial situation is, living in two of the highest cost of living cities in the country. Every weekend was spent obsessing over finances and being scared for our future on top of being miserable in the present. So I started looking for a new job. \n\nLast week I finally got some movement on my search. I managed to get interviews for two jobs this past weekend, and I got an offer from BOTH. I even managed to unintentionally leverage one offer to get a salary that I thought was way out of reach for me! \n\nI'm so, so excited. I accepted a job that not only lets me move back in with my fiance after a cumulative 6 years of long distance, but it also pays really really well, and it's exactly the type of job I want (R&D engineering). I'll also get a whopping 22 days off per year, which is honestly crazy for this stage of my career. I'm so incredibly excited to start a job that makes me proud, that teaches me all the things I really want to learn, and challenges me to be better. We're also going to buy a property together, start wedding planning again, and if I can convince him, we'll get a curly haired doggy to shower with affection. \n\nWe edited all our finance spreadsheets with the new numbers, and our financial life is about to take a complete 180. I'm so excited for the peace of mind this will bring us. Just... Absolutely everything is about to get better. I'm so happy!", "url": "https://www.reddit.com/r/happy/comments/9ng2ay/i_just_accepted_a_job_offer_that_is_going_to_let/", "title": "I just accepted a job offer that is going to let me start the life I really want", "social_network": "reddit", "user": "0vinq0", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 31, "down_vote": 0, "creation": 1539308325, "permalink": "/r/happy/comments/9ng2ay/i_just_accepted_a_job_offer_that_is_going_to_let/", "nsfw": false, "first_save": 1635441481.4851322, "replies_charged": false}