{"id": "t5_2qh5i_t3_aawqdo", "request": ["77a5a12a-14c1-468d-b6d8-4b6928ce40ae"], "text": "I’ve always struggled with my weight and height and have always been under the impression that I’m not decent looking enough. This guy who’s new to town this year confronted me late September about being friends. Guys never talk to me so I was actually kind of confused; he’s well dressed, very very attractive, has a very distinct look (guys here are all very basic and wear the same stuff and act the same ways) and was obviously very nervous to talk to me. We become awkward friends but we tried. A week later he subtilely suggests that we should go out. My anxiety got in the way cause I’ve never experienced a romantic relationship before. Almost 4 months later and he’s already the love of my life. He does everything in his power to make sure I’m happy and comfortable, he goes at my pace, is a great cuddler, very gentlemanly, and makes sure that I know he’s there whenever I need him even in the dead of night. There’s been a couple of minor problems previously, but we’ve worked them out within the day or next day and are very good with communication. I’ve always been afraid to show my friends and even family my interests cause they find them weird or gross, like my passions for bones and spiders. He loves it though. We share a common favorite t, the Goliath birdeater and I could not be happier! He knows I’m a little obsessive when it comes to my very favorite things such as my favorite YouTuber. I watch this channel during my depressive bouts even if I’ve seen the videos tons of times before. My boyfriend describes the channel as “valid, brilliant, goofy” and has no problem binge watching my favorite series from this channel. He’s loved me when I can’t love myself, he’s there when no one else is, and he reassures me my insecurities and doubts and regrets and self hatred is all in my head and he’s helping me get through depression and anxiety and I’m doing my best to return the favor. \n\nAnyway, sorry for the wall of text ~ I’m just so happy he’s in my life and I don’t know how far off I’d be right now if it wasn’t for him. ", "url": "https://www.reddit.com/r/happy/comments/aawqdo/finally_have_my_first_boyfriend_at_18_and_hes/", "title": "Finally have my first boyfriend at 18 and he’s just the best", "social_network": "reddit", "user": "averillaann", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 33, "down_vote": 0, "creation": 1546183769, "permalink": "/r/happy/comments/aawqdo/finally_have_my_first_boyfriend_at_18_and_hes/", "nsfw": false, "first_save": 1635440763.1338408, "replies_charged": false}