{"id": "t5_2qh5i_t3_bht89", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "Today was a comedy of errors. Sometimes this can leave me feeling frustrated. By choosing to look on the bright side it was actually a pleasure.\n\nI went for an eye exam in a nearby town. Traffic was horrible, but instead of being frustrated by that I relaxed and enjoyed listening to a radio program which I otherwise would not have heard.\n\nI showed up across from what I thought was the ophthalmologist's office only to discover that they had moved several years ago, oops. I phoned them, and got the new address. Since I was a bit late and the doctor was running a bit late also, I did not have to wait as long.\n\nI stopped to get my car inspected and failed on a defect of the paint on my license plate. So, off to the DMV to exchange for a new plate. I sat next a a nice couple from Italy and had a great conversation with them during the long wait. Nice folks. I enjoyed our talk.\n\nOn the video display was an anti-terrorism warning to watch for suspicious activity and report. I looked around at the crowd of DMV patrons and asked the folks sitting nearby if all the people in front of looked suspicious while pantomiming dialing my phone. We all laughed.\n\nMy plate exchange was rejected do to a 5 year old parking ticket and a 2 year old excise tax bill. So new obstacles kept piling up. More driving, more lines, antiquated bureaucracies, problem at the bank, a call to my brokerage firm, spotty cell coverage, and racing to do business at two city hall buildings ensued. Throughout, the lingering effects of eye drops meant I could not see well close up \n\nAnd guess what. Instead of feeling frazzled, it turned into a fun adventure. \n\nIt was funny, and absurd, and challenging. After I got home and everything but the plates were sorted out (the DMV close 5 minutes before I returned there), I realized that I had wonderful day today. ", "url": "https://www.reddit.com/r/happy/comments/bht89/nothing_went_to_plan_today_what_might_have_sucked/", "title": "Nothing went to plan today. What might have sucked turned out to be enjoyable.", "social_network": "reddit", "user": "JEdwards", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1269473902, "permalink": "/r/happy/comments/bht89/nothing_went_to_plan_today_what_might_have_sucked/", "nsfw": false, "first_save": 1635442256.4888704, "replies_charged": false}