{"id": "t5_2qh5i_t3_9p0gwf", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "I haven't been this genuinely happy since I was 9 years old, and I'm 23 now.  This is not a joke or an exaggeration, throughout all that time between then and now I've been depressed.  I recently stopped going to therapy because I don't feel like I need help anymore.  And I'm finally on medication that works for me.  Every little achievement brings me joy because I'm finally not miserable.  I stopped hating myself, and I'm productive.  I even wake up at 8am without an alarm to annoy me.  I used to stay in bed until 7pm!  But now I'm opening the blinds every morning and letting the sun illuminate my room.  It makes me happy.  \n\nThank you for reading, I just needed to share.  <3\n\nEdit:  Some of you wanted me to share how I got this way, so I'll tell you and do my best not to write a book.\n\nI've been depressed since I was nine because my parents moved our family from New York to Florida when I was eight.  I left all my childhood friends behind, as well as my sister who decided to stay behind.  We were in bumfuck nowhere Florida and everything was at least two hours away.  Why is this important?  Because I get incredibly carsick and every trip to school or the store was hell.  I developed a phobia of cars, and I would panic when my parents said it was time to go somewhere.  BOOM, anxiety problems.\n\nI had previously been enrolled in a now closed catholic school, and there were very strict rules there.  That wasn't a problem, but going to public school after spending my early years in a catholic school made it hard for me to make friends.  The children were so different in Florida.  BOOM, loneliness.  \n\nRemember that car phobia?  It turned into irritable bowel syndrome.  What made it more painful?  Anxiety.  I actually didn't get a proper diagnosis until I was 16.  Basically I'd get horrid cramps at the mear thought of the car.\n\nI was a menace in middle and high school, snapping at people, talking too much and too loud, and breaking out in tears when I was confronted about it.  I thought I was just a bad kid, but it turns out I couldn't fully control how I was feeling.  I also started 'seeing' things.  I started therapy when I was 17 and was finally diagnosed.\n\nSchizophrenia \n\nBipolar disorder \n\nOCD\n\nIntermittent explosive disorder\n\nGeneralized anxiety disorder \n\nI was a mess.  I was started on Lithium and Seroquel, with awful side effects.  The lithium burned my already sensitive stomach and the seroquel made me twitch uncontrollably.  They also gave me enough lithium to tranquilize the fuck out of me, and I became a zombie.  I started to refuse the meds my mom gave me, and my mom helped me tell the doctor that his meds were bad and he should feel bad.  So they started me on this foul stuff I don't  remember the name of.  I had to place it under my tongue and it burned.\n\nI tripped the HELL out.  That stuff worsened my hallucinations to the max and I had to be hospitalized.  I stopped all medication.  And my behaviour in school worsened.  A teacher I liked sat me down and told me he was going to write me up, but only because he wanted to get me mental help.  I was 'Baker Acted'.  Put away for two weeks in a place called The Centers, a glorified mad house.  Around this time my OCD got worse.  I just wanted to control SOMETHING in my life, so I started controlling what I ate.  I annoyed the fuck out of my mom in the process. \n\n \"Did you was your hands?\"\n\n\"This doesn't have spice in it right?\"\n\n\"Mom I'm vegan now.\"  (HA.)\n\nI just wanted a normal fucking gut damnit.  Then I saw hope.\n\nAfter nine years in Florida we moved to New Jersey!  It wasnt New York but damn it was close!  My sister even came to live with us.  But that was just the begining.  Since I was a teen, I slept during the day and stayed up at night.  My sleep schedule was fucked.  I BEGGED my mom to let me go to college.  She was reluctant because of my issues.  Before I could enroll in college, I HAD to go back to therapy.  I went through more pyschs than I could count, each telling me aggravating things like 'Have you tried BREATHING?'  'Just meditate!'  'It's all in your head.'  Well no fuck!  It's called a MENTAL disorder for a reason!\n\nThen I found him, my British-Jewish angel.  The best psychologist yet.  He LISTENED to me, he didn't talk AT me, and he didn't treat me like I was dangerous or crazy for feeling the way I do.  I was with him from age 21 to just recently, when he decided to go into private practice.  At the same time I was seeing a psychiatrist who wasn't the kindest person.  He put me on a horror pill.  My worst enemy, Latuda.  I had never felt so suicidal.  My mom noticed this and immediately took me off it.  I was put on clonazepam.  It made me dead to the world.  Then propranolol, it put me to sleep.\n\nBut then he NAILED it.  A mixture of Zoloft, Zyprexa, and Benzotropine.  I even saw a gastroenterologist and he gave me meds to stop the painful intestinal spasms.  I was in New Jersey, where every thing was like 15 minutes away.  I lost my fear of cars, the medicine calmed me.  I've had to have my meds adjusted a few times, upped and lowered, but I feel like I hit the medicine jackpot.  I got back to a normal sleep schedule and finally convinced my mom to let me go to college.\n\nI'm a Certified Medical Assistant now and I'm currently trying to earn my associate's in health science.  Next year I start earning an associate's in mortuary science.  \n\nEvery little thing makes me feel good now, from the sunlight, music, and my pets.\n\nI lost my father to diabetes while I was in Florida, but I say goodnight to his ashes every night and tell him good morning every day.\n\nThank you for reading.  Have a good day.  \n", "url": "https://www.reddit.com/r/happy/comments/9p0gwf/nobody_irl_seems_to_understand_so_im_going_to/", "title": "Nobody irl seems to understand, so I'm going to share this with all of you! I'm sooo happy!", "social_network": "reddit", "user": "thelivingtypo", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2121, "down_vote": 0, "creation": 1539795522, "permalink": "/r/happy/comments/9p0gwf/nobody_irl_seems_to_understand_so_im_going_to/", "nsfw": false, "first_save": 1635439329.4084063, "replies_charged": false}