{"id": "t5_2qh5i_t3_fjwa8o", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181", "2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "OK, I realize that this could easily go on r/pcmasterrace, but considering how much joy it's brought me, I might as well post about it here.\n\nEver since I first played the online game *World of Tanks* back in 2012, I decided that one day, I was gonna get a PC powerful enough to at least run it smoothly on decent settings. Then, when I got my first job in 2015, I decided that building my own PC was gonna be the best way to accomplish this. I had to put off my dream for about a year because I was using money not only to get a car, but also to buy Christmas gifts for my whole family.\n\nFast-forward to 2016, and now that I had the money, I read various articles on Wikihow and Lifehacker about how to go about doing it. Once I had the know-how and the parts, I spent much of Sunday, July 24, 2016 building the thing, and once it was all put together, I capped off that day by watching the John Carpenter movie *Dark Star*. Unfortunately, when I went to turn it on the next day, it wouldn't fire up. I got depressed at the possibility of having to buy new parts for it, so I asked my second-youngest brother - who probably frequents this wonderful website somewhere - to help me iron out the bugs. \n\nOwing to a family vacation and unfavorable scheduling issues on my brother's part, he wasn't able to come over (we lived in different houses at the time) to check it out until Friday, August 12, 2016. Fortunately, with his help, I got all the bugs ironed out. As it turned out, the installation of the graphics card had interfered with the power supply actually being able to turn the computer on. On a lesser note, a RAM chip also hadn't been seated properly. \n\nNevertheless, once those were out of the way, installing the operating system and the graphics card drivers was a snap, and my 1st PC build has made gaming awesome ever since. Granted, it has had an occasional blue screen of death, and it's not exactly the most powerful terminal on the block, but still, it's good enough for what I need it to do, and that makes me happy. Wanna know more about the machine? Just ask!", "url": "https://www.reddit.com/r/happy/comments/fjwa8o/almost_four_years_ago_i_built_my_first_pc_and_it/", "title": "Almost four years ago, I built my first PC and it has been a joy ever since", "social_network": "reddit", "user": "NewEnglandSynthOrch", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1584407254, "permalink": "/r/happy/comments/fjwa8o/almost_four_years_ago_i_built_my_first_pc_and_it/", "nsfw": false, "first_save": 1635440869.6367998, "replies_charged": false}