{"id": "t5_2qh5i_t3_31q6xf", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "I'm an intermediate-to-advanced computer science student in university, tutoring beginning students, and I've never actually had a real job before, so first of all, hell yeah, finally gonna get some money and be able to afford a GPU by the end of the quarter. I'd helped friends with programming before, and typically been paid in weed, so getting paid in actual money (and pretty good money, too, for that matter) is a surprising and welcome change—not to say that I minded getting smoked out every Sunday, but you know.\n\nAnyway, that's all nice setup, but the important part is what actually happened during my first shift. I showed up for my assigned Monday morning lab section, wrote my name on the board along with a message telling the students to ask me if they needed help with anything, and then spent most of the shift doing my own homework, with the exception of this one girl, whom we'll call Sammy (I actually don't know her name) who came up to me with this lost and confused look on her face, like she'd been banging her head on the wall for an hour and was on the verge of giving up. The following is a dramatization of what actually occurred.\n\n>Sammy: \"Teuast?\"\n\n>Teuast: \"That's me. What's up?\"\n\n>Sammy: \"I can't figure out how to get Zoog's legs to line up with his body. I have the head and eyes and body, but the legs just won't line up.\"\n\n>Teuast: \"Well, let's go take a look then.\"\n\nSide note: the class is taught in the Processing environment, which, if you're not familiar, basically works by allowing you to use numbers and methods to manipulate shapes in a window. It's essentially Java for noobs. Zoog is an alien the students have been tasked with recreating within the program.\n\n>Sammy: *shows me her code* \"So here's the bit that draws the body, and here's the bit that draws the legs.\"\n\n>Teuast: \"Hmm. I see what your problem is, you seem to be misunderstanding how line syntax works.\"\n\nThe next bit took a good long while, because the Processing syntax is pretty unintuitive and is complicated by the fact that X increases as you move right, like normal, but Y increases as you move down. Eventually she figured out that the first two numbers are the X and Y of the first endpoint, and the second two are the X and Y of the second endpoint, and was very excited to have figured that out. She then decided to experiment with the numbers, and seemed baffled as to why some of the things that were happening, were happening. At this point I determined that she still didn't understand the coordinate system, so I decided to improvise.\n\n>Teuast: \"Give me the keyboard for a second. I'm going to write a quick function that'll hopefully explain a few things. It uses some things you aren't going to run into for another couple weeks, but just bear with me here.\"\n\n     void mousePressed(){\n       println(mouseX + \", \" + mouseY);\n     }\n\nI clicked the run button and proceeded to click around the window a few times, indicating the coordinate printouts each time. Then I looked at her for a reaction, and saw comprehension dawn on her face.\n\n>Sammy: \"Oooooohhhhhhhhh! Oh wow, this is so helpful! This explains so much! Can I keep this function for a reference?\"\n\n>Teuast: \"Yeah, sure! Hell, show your friends, if it helps them then my job is easier.\"\n\n>Sammy: *takes the mouse, begins furiously clicking around the window* \"Oh my gosh, thank you so much! That was amazing!\"\n\n>Teuast: \"Sure thing. You need anything else, I'm right over there.\"\n\nI don't plan on being a teacher, but damn that made me feel good.\n\n**TL;DR Tutoring is a fun and fulfilling job. Also it pays well.**", "url": "https://www.reddit.com/r/happy/comments/31q6xf/today_was_the_first_day_of_my_tutoring_gig_and_it/", "title": "Today was the first day of my tutoring gig, and it was excellent", "social_network": "reddit", "user": "teuast", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1428394563, "permalink": "/r/happy/comments/31q6xf/today_was_the_first_day_of_my_tutoring_gig_and_it/", "nsfw": false, "first_save": 1635438848.6664536, "replies_charged": false}