{"id": "t5_2qh5i_t3_6rm4gu", "request": ["f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "I wasn't interested in the first guy and that was honestly the first time it's happened to me since I didn't get out much before I started becoming busy with.. well being an adult? Haha. Anyways, the second guy kept staring at me and we were going the same way and waiting at the transit center. I thought it was creepy because he wouldn't say anything, but when we got on the bus he told me to come look at his phone. I was so curious, I loved it! He wrote \"I'm deaf but I saw your smile and liked it want to get to know each other?\" I smiled so hard because when I was younger I was watching this show on MTV where they would follow people around with interesting stories and this girl had a deaf boyfriend which I thought was adorable. Now I'm not saying we'll be together, but his vibe is amazing and I'm really happy that we're going to make plans together. The biggest shocker to my family when I told them about him, was that he has VERY broken English BUT wait for it, ASL (sign language) is universal! So I can teach him English, and he'll teach me sign language. He's pretty new to the USA and it's really cool. I always told myself there's no barriers for me with relationships and I guess I was right about myself, I just want someone with a connection and sometimes the person doesn't have to say a word for you to feel how genuine and strong the connection is. I'm trying not to be too giddy about the whole thing, but I have learned a couple phrases in sign language already and I understand his English enough to write back and forth. So yeah, finally something good is happening to me!\n\nTl;dr: 2 guys gave me their numbers and I liked the 2nd guy more who happens to be deaf and has broken English but sign language is universal so we're going to teach each other our languages as we get to know one another :)", "url": "https://www.reddit.com/r/happy/comments/6rm4gu/i_had_2_guys_on_the_train_give_me_their_numbers/", "title": "I had 2 guys on the train give me their numbers...", "social_network": "reddit", "user": "QweeQwag", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1501868434, "permalink": "/r/happy/comments/6rm4gu/i_had_2_guys_on_the_train_give_me_their_numbers/", "nsfw": false, "first_save": 1635443331.329872, "replies_charged": false}