{"id": "t5_2qh5i_t3_ceu93q", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "https://i.imgur.com/PK6J9n4.jpg\n\n[Five days post surgery](https://i.imgur.com/Nix7vrW.jpg)\n\n[Four weeks ago three months post surgery](https://i.imgur.com/QqHT6zw.jpg)\n\n[Today](https://i.imgur.com/aqtRrTo.jpg)\n\nMax Power came into our lives over 16 years ago. He's been with us through the thick and thin. We have three other dogs, two other shi-tzus and a Samoyed, and Max has taken the alpha male role around the house. He's got a system, and when he's not feeling well we all feel it. \n\nLast February Max stopped eating regularly, and started losing weight. He was slowly declining and fading away. After several trips to the vet we were told it was the beginning stages of kidney failure but it could be treated. He did fine with the kidney treatments, but by this point he stopped eating entirely. He acted like he wanted to eat, but just couldn't. \n\nSo I started syringe feeding him at this point to keep him going until we could figure out what was going on. Finally we were able to get him to an ultrasound and found the problem. Pyloric Stenosis, a condition where the pyloris thickens and creates a situation where food can not be ejected from the stomach into the colon. So he essentially always felt full. \n\nWe decided despite his age we wanted to take the chance on surgery. We know him, and we know he wants to fight so we have him that opportunity. Surgery was on a Wednesday last April. And even though he seemed better Friday, he began a serious decline that weekend. He still had no interest in eating or drinking, he was fighting his syringe feedings, and even worse he was vommitting. Monday morning I took him into the vet, and the doctor told me that Max's intestinal wall wasn't healing, and wasn't likely to. We decided to give him until Wednesday, but I didn't know if he would make it. Things we're looking grim. \n\nMonday night was a nightmare. He laid on the couch in the same spot, staring off into space, his eyes were cloudy with death, and the look on his face was that of a dog who gave up. He had thrown up most of what I fed him that day, and he was declining FAST. He could barely walk now, and it was obvious he didn't want to. My wife and I decided to put him down that Tuesday morning, and spent Monday night with him keeping him comfortable and happy, telling stories about his epic 16 years on this planet. Monday night I decided since he would be gone the next day, I would skip his medication, and his feeding since he hated them so much, and when Tuesday came and he was still or less the same I also skipped breakfast and morning meds for him. My wife stayed home Tuesday so we could say goodbye to Max as a family. \n\nThen around 10 AM something miraculous happened. We noticed Max was more awake, alert and was now following us around the room with his eyes. There was life there when there wasn't before. We knew we might be just seeing what we wanted to see, but we took it and ran with it. We spent Tuesday cleaning, singing and being as positive as possible. And sure enough little bits of life returned. Not much, but it was enough to make the decision to hold on longer. I started to research some of the meds he was on, and realized of the eight different medication he was taking, five of them had side effects of lethargy, excessive drooling, innapitence, nausea, vommiting, depression and anxiety. So I took him off of all of his meds except for his antibiotics, put him back on CBD, began a probiotic treatment recommended by my sister, and started using a special dog food diet for intestinal issues. \n\nThe following Wednesday and Thursday were nothing short of miracle days. Slowly but surely all the things he hasn't been doing over the last few months began returning. He spent most of those days wanting to go to the dog park, following me around the house, barking at me too give him food, playing with toys, and peeing on the couch which is a sign that he's feeling better as that's been his spot for the last decade and he hasn't hit it in months. All of his routines and habits are coming back at lightening speed, all he needed to do was poop, to confirm the surgery worked, and to try to eat on his own. The following night he pooped and the next morning for the first time in months he ate breakfast on his own. He started to return to life as if none of this had every happened. \n\nAll of this is completely surreal to us obviously. He was a sick sick sick dog, and we said goodbye to him so many times, but we didn't give up on him when he showed those signs of life. While this is what we were hoping for, it's not at all what we we're expecting even in our wildest dreams. It's been such a long emotional road, I haven't slept in months and have dropped 13 pounds because I wasn't eating as well. I feared going to bed every night for the fear that the next day would be the one where I would have to say goodbye to my best friend of 16 years, my boy. But we didn't give up on him. \n\nNearly 60 hours of syringe feeding, 20 hours of administering IV fluids at home, another 30 or so hours at vet visits, speciality clinics, and ultrasounds. IT WAS WORTH EVERY SINGLE SECOND OF IT. MAX POWER WON. HE BEAT DEATH AND HE DID SO WITH MAXIMUM POWER. \n\nThere's a quote that has stuck with me through this whole thing:\n\n“If only…the saddest words in the English language.” ― Kristan Higgins\n\nI didn't want to spend my life wondering \"If only...\" And I'm so thankful I don't have to. I'm well aware that Max's case is the exception, and not the rule and that at his age we don't have much longer. But for the time we have left I will treasure every single day as if it's not only his last but mine as well. I'm so thankful for the lessons and challenges this ordeal has brought for it's made me, and my family that much stronger. \n\nIt's now been several months since he's been getting better. Last year he was 18.8 pounds, three days after surgery he was 12.4 pounds, yesterday he was up to 14.8 pounds. all he wants to do now is eat and play and explore. It's almost as if he's getting younger again. \n\nWe are back to business as usual. We spent this morning, as we do every morning at the dog park. And as usual he came home, ate a big breakfast and is now happily passed out on my lap. \n\nI am happy.", "url": "https://www.reddit.com/r/happy/comments/ceu93q/meet_max_power_i_saved_his_life_and_he_saved_mine/", "title": "Meet Max Power! I saved his life and he saved mine, and for that I am happy!", "social_network": "reddit", "user": "TriggerHippie77", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1563465167, "permalink": "/r/happy/comments/ceu93q/meet_max_power_i_saved_his_life_and_he_saved_mine/", "nsfw": false, "first_save": 1635440711.4179873, "replies_charged": false}