{"id": "t5_2qh5i_t3_2byhik", "request": ["89f969a3-3a22-4eff-8a40-d1d5b9658c57"], "text": "This week has been a real turning point in my life, I expanded my comfort zone in three very different ways and I feel as though I have grown as a person:\n\n(1) I have a fear of heights. A few late nights ago I decided to take a detour while walking home and tackle on some of the most terrifying looking bridges above the motorway near mine. As I walked up the stairs I could already feel the panic, skin starting to feel hot, a feeling as though my brain is constricting, inability to breathe etc. Rather than letting this feeling defeat me and retreating, I stayed. I stayed in that spot, feeling worse and worse, but I persisted, until the feelings slowly subsided. I continued on up the stairs until I got to the very top. The feelings returned many times but I kept going until I was comfortably at the middle of the bridge. Words cannot describe the euphoria I felt when I realised how okay I was with being there, watching the cars fly past below, it was beautiful. I did this which a bunch of other bridges and rewarded myself with a beer and view each time, ended up getting home at 5AM (left my friend's place at 1AM).\n\n(2) I've kissed a fair number of women before, but every now and then I'd meet a woman and decide on the spot \"She's out of my league\", and wouldn't even dream of making a move on her. Even talking to these women I'd put on the pedastal would make me nervous. Well the other day at this house party I encountered one of these so-called 10/10s whom I'd met a few months back. I started talking to her, and while her beauty did not dissipate, I really started to realise that this is just a human being I am speaking to. This realisation really came to fruition when she stepped outside and slipped over. Later on that night I thought \"fuck it what's the worst that's going to happen, are the Out-Of-Your-League-Police going to come after me?\" so I struck up another conversation, then just went for a kiss. I didn't manage to escalate it any further as she didn't seem to want anything more than a that (and my game is terrible), but she definitely reciprocated when I kissed her, which is infinitely more than the me from two months ago would have expected to happen.\n\n(3) I've always had a habit of letting people walk all over me at places where I work, and let the anger build to the point where I would do something drastic like make a scene and storm out - quitting on the spot. At my current part-time job my supervisor was getting really stressed out and generally being a dick to everyone. At one point he held me (very lightly) by the collar, which sounds a lot worse than it really was, he didn't tug or anything but it was enough to stop me in my tracks. He had a go at me for getting some stuff mixed up and said \"Listen mate, I'm about to start fucking shouting cos I am up to here right now\". After some stressful work, he went off for a much needed cigarette. I decided \"fuck it\" and followed him out of the building in my kitchen uniform (we're not supposed to do that). I interrupted a conversation he was having with one of the bar-staff, apologised, and said \"X - I need to speak to you for a couple seconds\". I calmly said \"Look mate, at the end of the day it's your job to give me a bollocking every now and then, but I'd really rather you didn't grab me by the scruff of my neck like that\". He seemed surprised that I was bothered by his very light grab, until I responded with \"well I actually found it to be quite threatening\" in a calm but DEAD SERIOUS tone. He seemed very taken back by this and showed remorse, I said \"As long as we've got an understanding, we're cool\" and walked back into the building without saying anything else. This may not seem like a big deal to some but this was a huge thing for me, for someone who has been pushed around left right and centre and has a serious fear of confrontation, this was a tremendous victory. He was super nice to me the rest of the day, and we were jokingly talking about all kinds of stuff like how we were going to call dibs on the gorgeous two new women who had joined the bar-staff team (neither of whom are out my league as I have established).\n\nThank you kind internet stranger for reading this rather long text, it means a lot to me. I hope my actions this week may inspire some of you to go out into the world and face your fears. One final thing I want to say is this - fear always feels the same, it never goes away. It's that warm feeling of hope, of self belief, that \"fuck it\" just waiting to happen, that's the thing that needs to be nurtured. Stop trying to fight fear and instead nurture hope, and love yourself because you are a fantastic human being that deserves it.\n\nTl;dr: Faced my fear of heights, gorgeous women, and confrontation of authority figures at work all in the same week", "url": "https://www.reddit.com/r/happy/comments/2byhik/this_week_has_been_a_real_turning_point_in_my/", "title": "This week has been a real turning point in my life, faced three totally different fears", "social_network": "reddit", "user": "SecularSamurai", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 12, "down_vote": 0, "creation": 1406565737, "permalink": "/r/happy/comments/2byhik/this_week_has_been_a_real_turning_point_in_my/", "nsfw": false, "first_save": 1635440655.0004578, "replies_charged": false}