{"id": "t5_2qh5i_t3_esg072", "request": ["d9021d56-8bfa-490f-87b8-52154c0b1b05", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I am not a person who likes to brag so most of the time I’ve always been very low key about my accomplishments. In fact, I have always been self-deprecating so that others will be more accepting of me. This is a habit I’ve been actively trying to stop because I shouldn’t have to downplay my success in order to be liked. But the fact is I don’t really have friends or much family to share with, and the friends and family I do have seem to not enjoy my successes with me. I thought maybe I could share it with you fine people. I’ve heard of how awesome this community can be and even though I’m scared of getting even more negativity thrown at me I’m going to do it anyway. Fear is a part of living right? \nSo both my husband and I come from very humble beginnings. He grew up in a trailer park with young and inexperienced but loving parents who taught him the value of hard work but had no experience with money. I grew up moving a lot between states with parents that should have had money due to good career choices but were always struggling due to poor decision making. I was also subjected to sexual abuse from the time I was born until I was 14 from my grandfather and received little positive affection during my developmental years. \nThat being said, when I met my husband my first dream came true. We met and married young. I was fresh out of high school and he was a senior in high school. A lot of people out there believe that if they are in a committed relationship too early, they will miss out on a lot of things life has to offer. And while that may be true for them, it hasn’t been for us. We’ve grown into adults together, experienced wild and crazy things together, have had sexual adventures together, traveled together, failed and learned together. No topic has ever been off-limits and no experience is off the table with us. We also never had children and neither of us ever wanted them. After being married for 19 years and having only one major fight in our first few years of marriage I can say that I believe we are soul mates. I know a lot of people don’t think they exist, but we do… we’re just extremely rare. I think the larger the population gets the rarer we become. \nAnyway, we set life goals together early on. Neither one of us was used to having any kind of money growing up. And having nice things were few and far between. We didn’t really have any huge life dreams we wanted to achieve. I honestly just wanted to be loved and to be safe and to have a home. Maybe… if I were to dream big… that home would have a pool. Maybe even an inground pool! \nSo, we set up our plans and thankfully my husband was born with this ability to manage money as he certainly wasn’t taught how to. Over the years he’s taught me so much about how to handle finances and has helped his family learn and achieve as well. His instincts were always spot on and instead of planning out some huge dream scenario we paid attention to the opportunities that would come our way and together discussed whether to take them or pass on them.\nOver the years we put on some weight and I began to develop some health issues which put a strain on things, but never to the point I was ever worried about our happiness. Thanks to my husband and his researching skills he found the Keto diet and I’ve lost 20 lbs already and am working on my last 20 now. I feel amazing and have more energy and confidence in myself than I ever have before. He also has lost 20 lbs and looks fantastic. He always carried his weight well and was never fat like I think I was but together we’re now living our best life. We are more active and capable. After all this time together he’s still the only man I fantasize about and want to be with and I’m thankful daily to have him in my life. \n He ended up purchasing an existing business from a man who was ready to retire and a year after that another business associate wanted to retire so he bought that business and merged them together. I ended up quitting my job (receptionist work so nothing I went to school for or honestly cared too much for) and joined him at the business. And so my second dream become a reality! Now we operate it together and I have found that not only do I enjoy it, I’m really good at it too! I wake up in the morning and for the first time in my life, I don’t dread going to work. I don’t lay there and wonder if I could play hooky without getting fired or in trouble. And I have discovered that all the people I had worked with and bosses that I had over the years that tested me in some way shape or form have in fact taught me a valuable skill that I utilize in the operation of this business. Everything ended up meaning something.\nDuring all the time that we were building up to the business dream we bought and sold our first home at a profit, just skating in under the wire of the 2008 housing crisis. We continuously lived as far below our means as we were comfortable with, and without children, we were able to save a lot and invest it wisely. I can honestly say that we are both very lucky people, but we also worked very very hard to achieve our goals. We didn’t just let life happen to us. We planned it, we worked at it and we never stopped trying to go forward. We earned this life that we made and I am so excited!\nThis year is the year we are going to build our dream house! With a pool! Maybe even an inground pool! We’ve picked the plans and are choosing our builder and looking for the date to break ground. Our next dream is really going to come true and I am so excited I can hardly stand myself! \nThank you for reading! I feel like I’ve been busting at the seams with happiness and wanted to share with someone! Anytime I’ve tried to share my joy with those physically in my life I’ve been met with silence or they change the subject back to them. It’s gotten to the point where I feel like I cannot share the good or the bad with anyone. I wish all of you could feel what I feel and that your lives are filled with joy and happiness as well!", "url": "https://www.reddit.com/r/happy/comments/esg072/my_dreams_are_coming_true_life_may_be_hard_but_it/", "title": "My dreams are coming true! Life may be hard, but it can be wonderful too! (long)", "social_network": "reddit", "user": "smileycat", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1579717652, "permalink": "/r/happy/comments/esg072/my_dreams_are_coming_true_life_may_be_hard_but_it/", "nsfw": false, "first_save": 1635442644.9039767, "replies_charged": false}