{"id": "t5_2qh5i_t3_msk62b", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716", "1d9bc0bf-4a1c-437e-94e7-5a07c99811fe"], "text": "There is a lot to say, my journey wasn't easy, and even as I continue my journey, I know sometimes it will get harder and harder. Yet, for the first time, I finally feel happy. Truly happy. Not just the happiness that comes from the aftermath of an exciting event. No, this happiness comes from deep within my soul, and I can feel it. I look at myself in the mirror, and I don't criticize the blemishes and scars of my body. I feel love for myself. I no longer seek it in others. I am content with me. For so long, I didn't want to be me. I tried to hide, desperately hoping for the day I would cease to exist. Finally, I can look myself in the mirror, and be able to wholesomely love the person I see. I don't know what changed. But, I finally realized I'm so much more than just merely a face. I am me, with my battle-scars and broken bones, I am me. And I deserve love, I deserve to love myself. Not constantly hurt her with words. I would crush myself whenever something would go wrong. Completely and utterly destroy her, beat her up so much that I cause her to stop drinking and eating. I realized how awful I was to myself, how much I denied myself of love, and of the opportunity to be content. As I look back, I wish I had been kinder to myself, I wish I hadn't nitpicked the flaws in my body.\n\nFor the first time, I am happy. A pure, authentic, genuine happiness. I am so happy I got here. And I thank those who helped me get there. But most importantly an apology to myself.\n\n*Dear Self,*\n\n*I am sorry I hurt you so much. I am sorry I didn't listen to you. I'm sorry I starved you. I am sorry I made you feel so miserable. Despite everything I did to you, you kept fighting, you kept going, you believed in me. Thank you. Thank you for not giving up on me, when the whole world did. Thank you for always giving me love and comfort even when I hurt you in unimaginable ways. I am sorry I was so harsh to you when all you did was provide me with a home, I couldn't live without. I love you. You are so worthy of love. Thank you for sticking with me and not giving up.*\n\n*Yours*", "url": "https://www.reddit.com/r/happy/comments/msk62b/finally_learned_to_love_myself_after_many_years/", "title": "Finally Learned to Love Myself After Many Years", "social_network": "reddit", "user": "Inner-Connection-145", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 17, "down_vote": 0, "creation": 1618634388, "permalink": "/r/happy/comments/msk62b/finally_learned_to_love_myself_after_many_years/", "nsfw": false, "first_save": 1635439607.860672, "replies_charged": false}