{"id": "t5_2qh5i_t3_3wz6o5", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "I began swallowing painkillers just before my 18th birthday. I grew up in my grandparents house, both of whom were very hardy people who were prescribed everything and anything for their pains, but refused to dope themselves up for fear of the effects. I never caused trouble at home and I've never had a better relationship with anyone like I did with them, my grandmother in particular, who really saw me as her own. For two elderly people living in an Irish suburb, they couldn't have been any more liberal. The first CD they bought me at age 10 or 11 was Limp Bizkit's Hotdog Flavoured Water (It was the spirit of the time and I was into it), and nothing was ever censored for me nor was I ever censored. One of my favourite memories is of watching the Lethal Weapon movies with my grandmother every Christmas, she loved wise-cracking action heroes the most.\n\nThe first time that a strain began to show on my relationship with my grandparents was during my first year in college, at age 18. My grandmother had found the four empty boxes of Spanish Tramadol and god knows how many empty Tylex trays in our medicine cabinet. When most of your time is spent dribbling on yourself on cloud nine, every small negligence collects into one big puddle of fuck. I had, by god and my country, swallowed everything in the space of two or three weeks. Before I took the first four 30mg pills, I had never gotten high on anything like them before, but I took to them quickly.\n\nJust to clarify, even at my very worst, I never lashed out at or stole from my grandparents. I'd raid medicine cabinets like a strung-out pirate, but I never got to a point (Which I'm very lucky for) where stealing money or non-psychoactive possessions was an option. If there's anything I can be proud of after six years of regular dopings and repeated failures, it's that I never strayed so far that I became 'that junkie living in the bedroom.'\n\nAnyway, everything was said to me. Years went on and excuses and lies kept building until the mental and physical toll of drugging myself daily became too much to bear. My family still loved me, but the constant suspicion was driving them crazy. I couldn't keep a girlfriend for too long because I couldn't offer them anything, emotional or physical. I was barely keeping up in college. That I graduated is a miracle that I still haven't come to terms with, like falling asleep at the wheel and finding that you've parked the fucker perfectly between two ice-cream trucks. At 22 years old, I was exhausted, horny, and ready to kick the habit. And I did just that, with great difficulty at first, but the bike was an easy ride after I rediscovered my legs.\n\nOn September 11th 2013, my grandmother died of a heart attack. I hadn't touched anything in months and my drinking was under control. I was about to start my second year in college. I'd just been approved for a student grant. Then one night, I went out for a few pints with my grandfather, a rare occasion, and when we got home, she was dying.\n\nI went back on them and went back on them hard, only this time the goodies were scarce. Oxycontin is incredibly rare in Ireland, but I found them and I ate them. I was washing down Valium and Xanax with whatever cheap piss beer was on sale in the local supermarket. When I couldn't get anything worthwhile, I made do with OTC codeine and cough medicines. I wasn't even getting high on the codeine anymore, I was taking between 12-16 12mg tabs a day just to get the tiniest buzz. I spent another two years in complete limbo. Withdrawing and repeating. I stopped writing, stopped playing music, couldn't be trusted on nights out with my friends because they didn't know what Liam they were going to get that night. I refused counselling, lied about everything, lived in a constant state of constipated anxiety, and I scared away all my emotions with whatever I could get my hands on. At one point I actually rewarded myself for going a week without opioids by buying a bag of weed, three ecstasy tablets, and a bottle of wine, and spent the night losing my mind in my rotting apartment.\n\nI'm 24 years old now and graduated last September. I was still using then, but nowhere near as heavily as when I'd been in college. The Summer back at home had seen me right. I hung out with good friends, spent time with my family, and began to enjoy the little beautiful things like looking at mountains and forests and the sky, and shit. Getting out of that college town had brought me back to a place where I could see beauty again and appreciate things as they should be.\n\nToday, I'm writing to you with a huge Christmas tree lighting up the living room, listening to \"Loveless\" by My Bloody Valentine, and slowly filling up a notebook page of ideas for a short story I want to submit to my favourite horror magazine, something I haven't even thought about in three years. I didn't think I'd ever make money by writing anything, but just last week I received my first cheque for a copywriting job, one that may lead to more work if I play my cards right.\n\nFor the first time in a very long time, I don't feel flaccid, upset, physically ill, and dying for any kind of numbness. Over the space of five months I've shaken off all urge or need to take anything, and simply seeing how things have turned around is enough imperative to never go back again. I'm going to sit down this Christmas with my family and watch Lethal Weapon under the Christmas tree, get some beers in with my friends, listen to some music, write some horseshit stories, and plan for a future I hadn't really cared about until now.\n\nTL;DR: Disgustingly high teenager wakes up to find himself in the body of a 24 year old man, acts accordingly to rectify his situation.", "url": "https://www.reddit.com/r/happy/comments/3wz6o5/i_dont_feel_like_a_drug_addict_anymore/", "title": "I don't feel like a drug addict anymore.", "social_network": "reddit", "user": "PinguD", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 22, "down_vote": 0, "creation": 1450207271, "permalink": "/r/happy/comments/3wz6o5/i_dont_feel_like_a_drug_addict_anymore/", "nsfw": false, "first_save": 1635441326.3503468, "replies_charged": false}