{"id": "t5_2qh5i_t3_pqbb0w", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716", "e9d5c1b3-4f2e-427b-a98e-af434f9cf1da", "b0c0a1d6-df85-40fe-9afc-934b125e4d6a"], "text": "My boyfriend and I are both in our mid twenties and just had our four years anniversary.\n\nHe is a gamer and I saw a plushie of one of his favorite games and wanted to buy it for a while now but there was no reason for it and my boyfriend doesn't like getting presents just randomly and even for his birthday or holidays he doesn't want much. I am basically the same, I don't like that it's all about spending and huge gifts. I didn't got presents at all as a child or to make up for mistakes and \"prove\" I was \"loved\" so I am kinda allergic to huge expensive presents myself lol.\n\nHowever the plushie wasn't expensive, it was just too much to buy it without a reason. He was soooo happy and like a little child and oh my gosh his eyes sparkled and I fell in love with him even more.\n\nHe got quite afterwards and a bit sad and said he wanted to remember our anniversary but forgot and didn't had a present because he didn't knew what to get me.\n\nBut.. He randomly brought me my favorite ice tea on this day which is only available close to his office.\nAnd that's just the best present I could ask for. He thought of me. I was in his mind. He thought \"Oh let's get girlfriend her favorite ice tea just to make her happy\" and that means so much to me. Also because I don't even know what he could got me myself. When we make each other presents we always say only small things, not more than 50$ and I just have everything I need and want right now. I wouldn't even be comfortable getting an expensive present. \n\nSo long story short: I am just so happy and thankful for my boyfriend and relationship. Sounds cheesy but he's the best that ever happened to me and he's one of the very few people who were there for me when things were really difficult. He was always supportive, listened, cuddled me when I needed it and motivated me to get help and get better. He himself is already the best present.\n\nTL;DR : title sums it up basically", "url": "https://www.reddit.com/r/happy/comments/pqbb0w/my_boyfriend_gifted_me_my_favorite_ice_tea_on_our/", "title": "My boyfriend gifted me my favorite ice tea on our anniversary and i am just so happy about it", "social_network": "reddit", "user": "Whysocomplicat3d", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1631921331, "permalink": "/r/happy/comments/pqbb0w/my_boyfriend_gifted_me_my_favorite_ice_tea_on_our/", "nsfw": false, "first_save": 1635439582.371851, "replies_charged": false}