{"id": "t5_2qh5i_t3_n6wixw", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "I mean, don't get me wrong, I love both of my adoptive parents. But it's a bit different with my adoptive dad since he's the only dad I've ever known. My actual dad passed away shortly after I was born, and my mom passed when I was 9. When I first moved in with them, I actually gravitated towards my adoptive mom more simply because she reminded me so much of my actual mom. But me and him? Well, it was pretty bad.\n\nMostly just shouting back and forth and me calling him mean names, simply because I didn't trust him because of what I went through with my previous foster dad. There were times when I legit hated him. Really. But all that would change because of a panic attack I suffered and I went to therapy. After my temperament started to change, we both kind of let our emotional walls down and opened up to each other. Me about what happened with my foster dad and he about the miscarriage my adoptive mom suffered years prior.\n\nThe night he told me about it, I had a small angry breakdown in front of him because of how awful I felt for treating them like I did, and about everything in my life up to that point. He reached out and wrapped me in his arms and said \"Oh baby girl. It's okay. It's okay, I'm here\". I held on to him like I was about to fall through the floor and didn't want to let go. I nearly made myself sick crying so hard and so loud. And when he first called me that, even he almost got emotional.\n\nFrom then on, day by day, things steadily got better between us. They really did. I eventually started coming to him for more serious questions about things and he always fully listened to me. Every time and still does. And, even though my adoptive mom would be the one to give me \"the talk\" (yeah, that one lol), he still talked to me about it to make sure I grasped the seriousness of it all and always answered any questions I had to the best of his knowledge.\n\nEven just his character and demeanor I love. He's not a \"dad dad\" like Ned Flanders or some cartoon character. He's not like something out of TV. He's usually soft spoken but confident and maintains a serious demeanor most of the time. But he is always friendly with people until he needs a reason to be otherwise. And when he gets really angry with someone, it surprises everyone nearby, even me. He's essentially a big teddy bear.\n\nI'm basically the center of his world next to my adoptive mom. He doesn't smother me or anything like that and knows I prefer to be left alone when I want to, but he always puts on a smile when he's near me. Always asks me how my day was, if I need help with anything, how my friends are, you name it. He's just...awesome. Best word I can think of. If I had to compare him, he's the Joel to my Ellie (video game called Last of Us) in almost every way, minus the obvious zombie apocalypse.\n\nNo real reason for posting this. Just wanted to do it out of appreciation. Whatever makes a great dad, he's it to a T.", "url": "https://www.reddit.com/r/happy/comments/n6wixw/i_love_my_adoptive_dad_so_much_hes_the_perfect/", "title": "I love my adoptive dad so much. He's the perfect balance of protective, caring and just a great person all around", "social_network": "reddit", "user": "vacant_helper", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 42, "down_vote": 0, "creation": 1620387704, "permalink": "/r/happy/comments/n6wixw/i_love_my_adoptive_dad_so_much_hes_the_perfect/", "nsfw": false, "first_save": 1635438932.7451289, "replies_charged": false}