{"id": "t5_2qh5i_t3_lev9su", "request": ["2293bc08-7671-4d63-b63f-dbe4a3a4858a", "0344ec6b-2528-4c06-8dba-4c3095c02293"], "text": "So I just turned 24. I'm sitting down, in an Airbnb, enjoying the weather and my time. I'm relaxed and happy. \n\nToday means so much to me because this is also the first birthday where I'm actually happy. I'm not stressed with bills or life, I'm not sad. Growing up, my birthday was basically barely noted. It was like everyone was just tired and completely shrugged off mine. As I got older, it was treated as an annoyance. So I began to treat it like it didn't matter to lessen the inevitable blow. \n\nAs I got older and moved out, my most stressful time of the year was Jan-late Feb, including homelessness in 2016 and 2018. So I *really* began to treat my birthday as a 'whatever' day. \n\nBesides that issue, I've also struggled with financial instability for years and living paycheck to paycheck. I had nothing to save because it ALL went to bills or stuff I needed.\n\nBut today, I just ate some good food. Listening to music. Drinking pop. Gaming. Enjoying the weather, enjoying my vacation, excited to tour a college. I'm honestly so freaking happy and I haven't felt this degree of careless joy in such a long time that, in a way, it feels weird. I have money to blow and STILL cover all my bills back home. I should be just fine until my next pay. And if, for some reason, I'm not I have enough in savings to cover me. I'm getting trained for a new position at work when I get back home that increases my pay and hours. This is all so exciting!\n\nAfter years of struggling and unhappy b-days, today I am happy. I am relaxed. I feel so at peace. I feel so at ease. I feel ready to take on whatever hits me back home. Todays been a good day so far and I hope it gets better. \n\nI hope whoevers reading this also has a great day! Now then, time for me to return to Ark. Gonna try and tame these argys and scorpion I found!", "url": "https://www.reddit.com/r/happy/comments/lev9su/todays_my_birthday_and_for_the_first_time_in_my/", "title": "Todays my birthday and for the first time in my life, I'm having fun and I'm DOING things. And for the first time in a long time, I'm experiencing what it's like to be financially secure.", "social_network": "reddit", "user": "chrisissues", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 86, "down_vote": 0, "creation": 1612731190, "permalink": "/r/happy/comments/lev9su/todays_my_birthday_and_for_the_first_time_in_my/", "nsfw": false, "first_save": 1635441034.6079593, "replies_charged": false}