{"id": "t5_2qh5i_t3_p38mul", "request": ["ec625709-7f64-46c7-8416-e278a4a2b110"], "text": "Sorry for any mistakes, english isn’t my first language.\n\nMy (19F) life is going so great at this moment. \n\nEnd 2020 and beginning 2021 were hard on me. I stopped at the university I was going to, mostly because it was draining me emotionally and physically. The time I spend was work or study and it just was all too much for me. \n\nEnd 2020 I got in contact again with an old colleague (21M). And well, since new years eve we’re officially together. We really had the honeymoon phase and we grew out of it, which was a pretty hard time. He went a little too far with a girl friend he hadn’t seen in a while at a party. \n\nSo it wasn’t really a very hard time, but mostly emotionally draining and I was just tired of everything. \n\nBut when I knew what kind of study I wanted to try next year, things suddenly got better. I’m going to study to become a math teacher. And in the country where I’m from, there is an enormous shortage of teachers. So I thought, why not send an open application to my old high school. You can always try! And I really wanted a different job, since my school is only one day in the week. \n\nWell, I got the job! I am a teacher next schoolyear! And I love it! So I am going to study for something I have passion for, and I will be working as the thing I’ve been dreaming about for years?!?? It is a life goal for me to achieve.\n\nMy boyfriend and I made up after having a rough time and even had many dates and weekends away to get closer to each other. He is really a great guy and he is trying so hard to help me trust him. He suprises me with flowers time to time, he takes me out on dates, listens to my problems and is ALWAYS understanding of things I don’t feel great about. Our relationship is thriving!\n\nBut it is even getting better. My boyfriend and I wanted to move out of our parents houses, but we couldn’t find anything and it was no priority. It isn’t really common here to move out when you are 18. My dad has a small rental house in his backyard (the literal translation for it is a “summerhouse” or as we call it a “zomerhuis”). And the girl who lives there, is moving. So me and my boyfriend are going to move in end of this month!!!\n\nWe are renovating right now. And I just really wanted to share. My life really couldn’t have been any better. Great school, my dream job, my dream man and a house!", "url": "https://www.reddit.com/r/happy/comments/p38mul/i_19f_am_having_so_much_luck_in_my_life_i_am_so/", "title": "I (19F) am having so much luck in my life!! I am so happy!!!", "social_network": "reddit", "user": "qxvntx", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1628801626, "permalink": "/r/happy/comments/p38mul/i_19f_am_having_so_much_luck_in_my_life_i_am_so/", "nsfw": false, "first_save": 1635441820.5729544, "replies_charged": false}