{"id": "t5_2qh5i_t3_nqh5r1", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716", "af00f57d-0c85-41f5-985c-7cc20793bcbb", "0344ec6b-2528-4c06-8dba-4c3095c02293"], "text": " \n\nA bad mood is something that everyone experiences once in a while or maybe more. The stress of being in a bad mood and the frustration for not being able to snap out of it is something we all have felt.\n\nHere are some practices I follow to try and get rid of my bad mood:\n\n1. Shift my perspective\n\nWhen I’m in a bad mood, I’m most likely to see things and situations negatively. To make myself feel better, I focus on shifting my perspective from a pessimist to an optimist. When I look at the brighter side of everything, I understand that I have so many reasons to be happy about it. Even the fact that I’m alive and breathing every day is a reason to be happy.\n\n2. Taking a break\n\nWhenever I find myself in a bad mood I make sure to give myself a break from whatever that I'm currently doing. I make sure I do something relaxing which lets me unwind. It is essential to take time for yourself to keep your mood in check.\n\n3. Eating my comfort food\n\nEat is always the best stress buster for me. I always make surer to eat my favourite ice cream when I'm in a rut. It’s these small self-care practices that help me look at the brighter side.\n\n4. Talking about my issue\n\nWhenever I’m in a lousy mood I make sure to share my feelings with a loved one. Sharing what’s making me upset, brings another and often positive outlook to the situation.\n\n5. Rewarding myself\n\nYou are your most significant support. Whenever I’m feeling down I make sure to reward myself. Doing things that make me happy. Gifting myself things that I want. Doing things like this reminds me that it’s just a phase and I will be over it in no time.\n\nIt’s imperative to do things that make you feel better when you feel low. Everyone has different ways to deal with their bad mood. The main thing to focus on is self-care. Treating yourself once in a while a taking time to relax and unwind.\n\nHere is the reference article:\n\n[**8 Ways To Get Rid Of Your Bad Mood - LiveLife**Get rid of your bad mood with these simple methods. Learn the ways to getting rid of your bad mood in an instance. How some simple practices can help you get you out of a bad mood.https://www.livelifeapp.com/8-ways-to-get-rid-your-bad-mood/](https://www.livelifeapp.com/8-ways-to-get-rid-your-bad-mood/)", "url": "https://www.reddit.com/r/happy/comments/nqh5r1/things_i_do_help_me_get_rid_of_my_bad_mood/", "title": "Things I do help me get rid of my bad mood.", "social_network": "reddit", "user": "Repulsive_Broccoli_5", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1622623363, "permalink": "/r/happy/comments/nqh5r1/things_i_do_help_me_get_rid_of_my_bad_mood/", "nsfw": false, "first_save": 1635439608.882419, "replies_charged": false}