{"id": "t5_2qh5i_t3_7azwae", "request": ["ea4a7795-7887-476a-9ab2-4c77d117a852"], "text": "So, yeah, I'm really feeling it today, and in all honesty, why is that abnormal? I mean, can we just take a moment to appreciated the fact that we're sitting on a little rock in space, yet there just so happens to be so much to love about it? Like, seriously, we get to make art, we get to enjoy music, we get to tell jokes, to laugh at jokes, to eat ice cream, to drink water, to feel the breeze, to see the sunset, to have friends, to ask a random person on the street for a high-five and probably get one, to think, to do whatever the hell makes us happy! For god's sake, we have birds! BIRDS! Just these things with feathers that fly around and sing! That's just there for us to enjoy! You ever seen a person with a nice smile? Why do smiles exist? What are the odds that something capable of smiling just happened to develop naturally in some weird rock moving around a ball of fire? Why are we not all smiling all the time? We live on Earth, you maniacs! Far as we know, this is the best place in the universe! Stop being not happy! Go play with a dog or something, I don't care, but enjoy it, because you only get a short time to do it. Wait, hold on, no, you get 80 GODDAMN YEARS! What are people talking about, \"ooh we only get a short time in this life look at me i'm a nihilist.\" How does 80 years not strike you as a mindbogglingly long time? Do you know how many seconds that is? According to Google, it's 2.523e+9 of them! Did you know that? I didn't! FUCKING GOOGLE!\n\nFUCKING!\n\nG O O G L E !\n\nI just hit ctrl+t, typed a few simple words, and found out how many seconds are in 80 years, without having to do any math! That's insane! We're basically gods! When did you last stop to appreciate how nuts the internet is? Ever wondered how many species of butterflies there are? Me neither! Apparently it's ~20,000, though. I know that now. How can it be possible that I know that without ever having studied butterflies at all? You want a picture of a tree with a hat? [Boom!](https://cdn.decoist.com/wp-content/uploads/2015/12/Small-cowboy-themed-Christmas-tree-with-hat.jpg) Why does that picture exist? Because the human race is delightfully off its absolute, ever-loving, monkey-brained fucking rocker, and if we want a cowboy hot on a Christmas tree, we're damn well going to get a motherfucking cowboy hat on a motherfucking Christmas tree, and it'll be the cutest damn thing ever to bless your stupidly beautiful eyes, because seriously, have you ever seen an eye that wasn't fucking gorgeous? Eyes, man! Looking at eyes is reason enough alone to stay alive! So, listen up: next time you feel shit, just keep in mind that none of this - NONE of this - ever had to come about, but it did, and now you're at the culmination of 13.772 billion years of development, and you get to look at eyes!\nSo, sadness, you cowardly piece of shit, listen to my words, and quake in your stupid, ugly boots: life is fucking incredible, and you can just suck my dick! So put that in your stupid pipe, and\n\nJust.\n\nFucking.\n\nSmoke it.\n\n^Also, ^my ^Prozac's ^working ^again. ", "url": "https://www.reddit.com/r/happy/comments/7azwae/ive_just_been_really_digging_this_whole_life/", "title": "I've just been really digging this whole \"life\" thing today, and I want to put it out there.", "social_network": "reddit", "user": "Wombat_cannon", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1509912063, "permalink": "/r/happy/comments/7azwae/ive_just_been_really_digging_this_whole_life/", "nsfw": false, "first_save": 1635440224.0953445, "replies_charged": false}