{"id": "t5_2qh5i_t3_f2rlut", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "2019 was a very up and down year for me. At the end of 2018 I landed an amazing job, working for an amazing company. The salary/commission was better than expected, benefits package was amazing and my wife and I would be able to do things we never thought possible due to our new financial position. It was very much an emotional high for me and the job was going to enable me to dig out for under massive student debt and be in a house within 4-5 years.\n\n2019 rolls around and I'm doing very well at my job. 3 months into the job (January of 19), the boss calls me into his office after giving the rest of my team their yearly reviews/raises. I start to think \"uh oh....what'd I do?\" and start worrying. Turns out he thought I was doing so well that I deserved a raise!!!! What!? This was awesome!!!! I was ecstatic.\n\nThen April of 2019 rolls around and myself +about 300 others were laid off in a very sudden and unexpected manner. I was absolutely devastated and thrown into a depressive panic. \n\nI was able to find another job at a small B2B software company that I thought was a great opportunity. Was able to negotiate a 10k increase in my \"salary\". I was happy. That turned very quickly. That job turned out to be one of the worst mistakes I've ever made. I was brought on to a sinking ship (which I found out after about 2 months). I also found out I was being paid commission plus a non recoverable draw (not salary plus commission like I was told) and the stress was so bad that I lost 17 pounds and started getting gray hair.. I want to lose weight but not like that.\n\n It got to the point where I put my two weeks in with no other job lined up. Thankfully the boss I spent 11 years working for called me and asked if I could help him out for the holiday season (retail). I ecstatically told him yes. They've been able to keep me on board while I've been looking for another job.\n\nAfter months of looking I've finally received an offer from a company I am very excited about. I negotiated a better salary and signed their revised offer! I start on March 2nd! Part of onboarding is training on the west coast for 3 weeks. Just an added bonus as this also allows me to see one of my best friends who I lost contact with and recently reconnected with.\n\nI'm super happy and optimistically looking forward to 2020.\n\nTL;DR; 2019 sucked so bad... looking forward to a new job opportunity, better salary and a happier life overall in 2020", "url": "https://www.reddit.com/r/happy/comments/f2rlut/2019_was_simultaneously_one_of_the_best_and_one/", "title": "2019 was simultaneously one of the best and one of the worst years of my life. Just landed a new job that I'm super excited about! Here's to hoping 2020 is better", "social_network": "reddit", "user": "G3mineye", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1581515958, "permalink": "/r/happy/comments/f2rlut/2019_was_simultaneously_one_of_the_best_and_one/", "nsfw": false, "first_save": 1635441986.4454198, "replies_charged": false}