{"id": "t5_2qh5i_t3_bi9thb", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "Back in January or so when I first started picking up on the fact I had feelings for this girl, I assumed I didn't have a chance in hell with her. From my perspective, I thought she was the girl that would only ever be with the kind of guy that was super popular, good looking, etc. In other words, not me of all guys. I always have considered myself to be just average - not bad in the slightest, just not exactly what a girl like her would ever be looking for - but I knew a somebody like her was worth at least trying for. This all explains why I didn't start talking to her until around the end of February; I didn't want to be shot down by a girl as wonderful as her. Well luckily enough for me, I am exactly who she wanted to be with too. We talk all the time now, and both of us feed off each other's energy. When one of us is ever sad because of outside stuff going on in our lives, the other is always there and we help each other through the toughest of times. These times only strengthen the two of us, and whenever one of us is stressed out about school, family, friends, etc., we always know we can count on the other to help calm ourselves down and make things easier to handle. I love this girl so much. She makes me so happy and I always look forward to being able to spend time with her. She is hands down the best part of my life. When I look at her I see nothing but perfection. Being with her motivates me to do all I can to become a better person. She's everything I could ever want and more. I do not have the words to explain how lucky I feel to be with her. I look so forward to the many more great memories and experiences the two of us will share together.", "url": "https://www.reddit.com/r/happy/comments/bi9thb/2_months_ago_i_decided_to_make_a_move_with_a_girl/", "title": "2 months ago I decided to make a move with a girl I figured was way out of my league. Today, the two of us are some of the happiest people around!", "social_network": "reddit", "user": "loganroger17", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 33, "down_vote": 0, "creation": 1556446441, "permalink": "/r/happy/comments/bi9thb/2_months_ago_i_decided_to_make_a_move_with_a_girl/", "nsfw": false, "first_save": 1635439363.4024587, "replies_charged": false}