{"id": "t5_2qh5i_t3_edqcw7", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb"], "text": "\"Dear u/merlinman75 ,\n\nCongratulations on your academic accomplishments at [Redacted University name]\n\nEach term we compile a list of students who qualify for the Dean’s List. To qualify for the Dean’s List, a student must complete at least 12 hours of work and achieve at least a 3.30 grade-point average for the semester, with no incompletes or grades below a C. We are pleased to inform you that your name is on this list for the Fall 2019 term.\n\nThis honor places you among the select few college students who produce such an outstanding record. We want you to know that we appreciate your fine work. Our faculty is honored to have students with academic abilities as strong as yours.\n\nNormally, students who take advantage of their opportunities to study and learn while in college find rich rewards in their lives after graduation. We hope you will continue your fine work and that your college experience will prove valuable to you.\n\nSincerely,\n\n[Redacted Name]\"\n\nI recieved this email after a long, stressful semester, a few days before Christmas even. I cried out of happiness knowing that all of my work was worth it.\n\nMy classes were mainly online at a week by week basus, but because I didn't have a classroom to attend, due to some acute ADD I had to stay on top of myself to push through, if anyone is wondering my GPA, it was a 3.7 for the semester.", "url": "https://www.reddit.com/r/happy/comments/edqcw7/i_made_it_on_my_universitys_deans_list_this_is/", "title": "I made it on my University's Dean's list. This is the email I received this morning after a stressful semester. Identifying factors removed for privacy:", "social_network": "reddit", "user": "merlinman75", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 19, "down_vote": 0, "creation": 1576937654, "permalink": "/r/happy/comments/edqcw7/i_made_it_on_my_universitys_deans_list_this_is/", "nsfw": false, "first_save": 1635438910.001772, "replies_charged": false}