{"id": "t5_2qh5i_t3_38z0fs", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e", "a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "Okay, apologies in advance for any cheesy, corny things I am about to say. I just need to tell the world about this!\n\nI split up with my ex-girlfriend a few months back so I decided to just go looking for NSA sex. I signed up to OkCupid and had a fling with someone but we didn't see each other again.  I got back on the site to continue my search. I wasn't looking for anything serious but if I found someone special, I would see what would happen.\n\nI should probably mention that I am vegan so, every now and then I would filter vegans just because it takes a lot of hassle out of a relationship when you have something like that in common and it's always nice to share similar points of views with someone.\n\nNow normally I would filter girls in my area, which makes sense, but for some reason I decided to search world wide. I have no idea why I did it. One of the first profiles to appear caught my eye. I have a look and not only is this girl's profile really awesome but she is absolutely stunning! Seriously gorgeous. Even though it said on her profile she was from Ohio (I am from the UK) I decided to message her. As a joke, I messaged her saying 'So when are you moving to the UK?' NEVER thinking she would reply but she did.\n\nIt turned out she was actually going travelling to Europe in a couple of months, one of her stops being the UK. At first we made small talk and said maybe we should meet up for drinks. After a few days of increased chatter, we added each other on facebook and continued speaking. As time went on we started to realize that we have a lot of things in common and speaking to her was just an absolute pleasure. We began to get closer and closer and eventually added each other on skype and start speaking on webcam.\n\nEverything about this girl is amazing and I just can't get enough of her. I started getting this intense connection towards her and after about 2 weeks of chatting she tells me she likes me and I tell her the same thing back. At first I feel like things are going slightly fast because of my past experiences with relationships I tend to be a bit cautious, but this felt different. I am 28 and have had quite a few relationships and experiences over the years but this really was something special that I have never ever experienced before.\n\nWe are so similar in every way, it's crazy and her goofy sense of humour is exactly like mine. We laugh so much every time we speak and have the same opinions on music, comedy, films, politics etc. Anyway it's barely been 3 weeks and we confess our love for each other after not being able to hold it in any longer. I know, 3 weeks over skype and we have fallen in love? I couldn't have imagined it either and I am normally one to pace these things but this feels so fucking right! The crazy thing is she feels exactly the same. She is constantly saying how happy I have made her, how handsome I am and how perfect I am for her and how lucky she is that I have found her and decided to message her. \n\nWe have had quite shit experiences with relationships in the past and we just want to treat each other as best as we can. She has said to me things like if I am with my friends she has no problem with me not messaging her as much, she has said she is not one of these types of girls to play mind games and won't be passive aggressive by not telling me what I have done wrong if she felt something was on her mind, she said if there is anything that is bothering me that I want to bring up that I should tell her and she would instantly attempt to stop. Not that there is anything wrong with her in any way! Like me, she doesn't want kids, which is great. She plays music and enjoys video games. She is also very sexual, which I love. There is just an insane amount of respect and equality from both of us.\n\nSo now it has been a month and it has gone from meeting up for a few drinks, to seeing me for a whole month and eventually moving to the UK! I swear to god she is the one and we have both said multiple times how special this is and we know we want to spend the rest of our live's together. Part of me hates saying that because if were to hear a friend say that to me I would be very skeptical and wary and would think 'slow down' but you know what? At this moment in time I couldn't give a fuck what anybody thinks because there is nothing we both want more right now.\n\nI am currently bottling all this up inside because telling anybody would cause them to jump to conclusions, which is why I had to get this out. I really want to make her happy. I never ever thought this would ever happen to me. Before all this I could see myself finding someone but not being completely happy with them or not finding anyone at all, especially because finding a vegan is greatly narrowing down the margin.\n\nI can't wait to show her off to the world. For the first time in my life I can officially say I have found the love of my life and am the happiest guy on Earth. Permission to vomit.\n\nTL;DR: LOVEY DOVEY.\n\n\n\n", "url": "https://www.reddit.com/r/happy/comments/38z0fs/i_finally_found_her_i_never_thought_it_would/", "title": "I finally found her! I never thought it would happen!", "social_network": "reddit", "user": "Enzil", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 69, "down_vote": 0, "creation": 1433726002, "permalink": "/r/happy/comments/38z0fs/i_finally_found_her_i_never_thought_it_would/", "nsfw": false, "first_save": 1635438844.0100696, "replies_charged": false}