{"id": "t5_2qh5i_t3_50cjdi", "request": ["608fc108-cf44-476e-8378-c59ee7483909", "af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "I don't know exactly where to start, it's been kind of hard to believe that things are going so well. \n\nIn around 2008 I began spiraling into a depression. I couldn't find work, and I wasn't getting accepted to any of the grad programs I was applying for. I was in a relationship that was already having some trouble. \n\nIn 2013 I was married, and with issues of fidelity a concern (among other problems), we separated at the beginning of 2015. I found out about a month later that my mom had cancer. She had a few surgeries and a lot of complications, and I spent a lot of time taking care of her and going to doctor's appointments.\n\nAt the beginning of this year I started a new medication that helps with some of the psychological issues I have, including the depression. I resolved to do whatever I could to improve my life, because I was sick of how bad things had been for so long. I couldn't handle another year like 2015.\n\nI couldn't save my marriage, and we got divorced a month or so later. \n\nSince then, what I expected to signify the start of another terrible year, things have been getting better and better. \n\nMy mom has recovered from her surgeries and has been declared cancer free. \n\nI'm respected at my place of employment; I regularly work with some of the most important people here and almost all of them have praised me to my boss. \n\nI got accepted into a grad program, and they've been so eager to have me join them they waived roughly half of the entrance requirements for me. \n\nIn the last 8 months I've gained about 30 pounds of muscle, and I'm in the best shape I've ever been in. \n\nI moved into a new place where I'll be saving approximately half of my previous budget for rent/utilities. \n\nAnd I guess the thing that's most inspired me to post, I met a girl. She's amazing. From the day I met her, we clicked. We can talk for hours, about anything. Literally *anything*: we've had disturbingly detailed conversations about bowel movements, lengthy explorations of our mutually morbid sense of humor, conversations about our hopes and dreams for the future, about our childhoods, our opinions, and preferences... and we can talk about nothing at all and just enjoy one another's presence. My mom loves her, and though her family has been notoriously critical of the guys she has had in her life before, they love me. We have almost identical interests and preferences, and frankly, I've never met anyone I was so compatible with; we even have roughly identical libidos. And she's stunningly gorgeous, to the point that I was surprised she would even be interested in me; but it seems as though we are mutually almost exactly the other's \"ideal type.\"\n\nI've never met anyone who made me feel so alive, and optimistic about the future. Who makes me excited to see what happens next. I've never been so compatible with someone, where our flaws are perfectly complimented by the other's strengths, and we inherently seem to want the same things without compromise, and we instinctively take care of the needs of the other because we want to without any kind of prompting or request. We both have friends/family who, without knowing about our romantic situation, have mentioned how much happier and \"ourselves\" we've seemed since the two of us began talking. I could honestly go on forever about it all.\n\nI used to sub here because I was deeply unhappy and wanted something to remind me that life could be good again. \n\nIt's still hard to believe I'm not dreaming. I don't think I've ever been as happy as I've been recently, and things just seem to keep improving.\n\nAnyway, just wanted to share, and say thanks for helping me through all of the bad times, /r/happy. Hopefully anybody reading this going through dark times will be reminded that things will turn around eventually. ", "url": "https://www.reddit.com/r/happy/comments/50cjdi/happiest_ive_been_in_longer_than_i_can_remember/", "title": "Happiest I've been in longer than I can remember", "social_network": "reddit", "user": "happythrowaway010", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1472580640, "permalink": "/r/happy/comments/50cjdi/happiest_ive_been_in_longer_than_i_can_remember/", "nsfw": false, "first_save": 1635441493.4743176, "replies_charged": false}