{"id": "t5_2qh5i_t3_jz7dwc", "request": ["258e332d-215f-495f-8bee-bccd57229f62", "4311bf71-6ec2-4c3b-aa15-1f9a3223e07b"], "text": "Hey Redditors! My film premieres on Thanksgiving on Amazon and in select theaters! Hello neighbors! My name is Ricky Borba, and I’m a film director. This Thanksgiving my second film, Hope for the Holidays, will debut on Amazon, iTunes, Google movies, YouTube movies, and iScreening Room. Earlier this year, my first film, My Brothers’ Crossing, was in theaters nationwide right before theaters were shut down. \n\nHere is a link to the trailer: \nhttps://youtu.be/1RrF4R7uJoE\n\nHope For the Holidays is a film I began working on in 2017. It stars Oscar Nominated and Golden Globe winning actors and actresses. The basic story is that a mother, played by Sally Kirkland, finds out she has cancer. Her son, played by George Stults, goes into panic mode and decides to rob a bank to pay for her medical bills. He gets caught, goes to prison, and the rest of the film is a race against time for him to see his mother one last time before she passes away, IF he can get out of prison.\n\nThis is where things get really personal and beautiful for me. Yes, beautiful. Just two months later, that July, my own mother called to tell me she had Stage IV cancer, and she died just 7 weeks after finding out. My mother and I were as close as a son and mother could be, so this was incredibly difficult.\n\nHowever.\n\nWith the permission of the original writer of the script and the producer, I was able to almost completely rewrite the character played by Sally Kirkland, to say in the film, the same exact things my mom told me on her seven-week battle with cancer. Without exception, almost every scene in the film, Sally's character Georgia is saying verbatim, what my mom said in real life. \n\nIt was a truly cathartic and beautiful way for me to honor my mother. To direct a film, my first film at the time, about the story of a mother and son, a mother who has cancer and wants to see her son one more time. I feel truly blessed and thankful that I was able to honor my mother this way, and that is one of the many reasons I can't wait for you to see this film. It's my hope that it encourages and inspires you, and at the same time is a film that you agree is made with excellence.\n\nSo please give it a watch this holiday season and let me know what you think. I'd love to hear your thoughts.", "url": "https://www.reddit.com/r/happy/comments/jz7dwc/hey_redditors_the_first_film_i_directed_premieres/", "title": "Hey Redditors! The first film I directed premieres this Thanksgiving on Amazon, iTunes, Google Movies, select theaters and more!", "social_network": "reddit", "user": "borbafett1", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1606092418, "permalink": "/r/happy/comments/jz7dwc/hey_redditors_the_first_film_i_directed_premieres/", "nsfw": false, "first_save": 1635440697.0826023, "replies_charged": false}