{"id": "t5_2qh5i_t3_bgrlt3", "request": ["74704fa2-216a-4299-aa5c-2674d62eb4e5"], "text": "It’s a whole long, romantic story about how we met (he cries when he tells it, it’s adorable), but suffice it to say it was when I was just starting my second divorce and he was at the beginning of the end of his engagement. My abusive STBX was still attending the same spiritual center so we kept it quiet when we started dating, and when the other women in the community found out the engagement was off, they were all over him. Neither they nor I knew yet that the first second he saw me he knew he was going to marry me, but he politely kept them all at a distance. (He didn’t tell me that he knew immediately until the night after he proposed, 6 months later, and that’s the part of our story where he always cries.)\n\nFast forward over 13 years. We’ve been married for over 12, and just now when I came into the bedroom and looked at him asleep, my heart just overflowed with gratitude — yet again — that I’m the one who won the jackpot, i.e., the heart of this wonderful man. \n\nHe’s not perfect, but he is freaking amazing. He’s trusted me to help him heal emotionally and is genuinely grateful for that — and tells me so — and he has supported me to heal. Despite the fact that I developed a debilitating, painful chronic illness less than a year into our marriage, he will never cheat on me or leave me, he’s even incapable of flirting with other women. I’m on a weirdly restricted diet and he goes out of his way to read ingredients labels to make sure I can eat what he wants to buy. He posts a romantic meme and a sweet comment on my FB wall. Every. Single. Day.  His “hiking wives” tell me that when they’re out hiking he often talks about me, about how great our marriage is, and about how much he loves and appreciates me. Unlike my wusbands he’s widely respected among our friends, and has been in all three of the spiritual communities we’ve belonged to since we met and eventually moved across the country, and — also unlike my wusbands — I’m extremely proud to be married to him. \n\nThe most important piece though is the level of commitment he has to us having an extraordinary marriage, and the level of deep emotional work he’s been willing to do as his part for us to get there. We both came into this marriage far more emotionally damaged than we knew; I know very few men who even have this radical vision of what’s possible, let alone who are actually willing to do the hard work to achieve it, *cuz it definitely ain’t for sissies.*\n\nI’m just so d*mn grateful to finally have the marriage of my dreams, and he feels exactly the same way.", "url": "https://www.reddit.com/r/happy/comments/bgrlt3/im_so_happy_and_grateful_to_be_married_to_my/", "title": "I’m so happy and grateful to be married to my wonderful husband.", "social_network": "reddit", "user": "Anonymous0212", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1556089893, "permalink": "/r/happy/comments/bgrlt3/im_so_happy_and_grateful_to_be_married_to_my/", "nsfw": false, "first_save": 1635442130.8419657, "replies_charged": false}