{"id": "t5_2qh5i_t3_6xi1bz", "request": ["ba0d1102-e426-4cb2-aee0-676868a519e8"], "text": "I'm new to writing and recording music, so I'm not very good at it. I put a song together for a potential album I want to one day publish, and posted it to YouTube to share my creation with the world. The video only ever got 16 views or so, but I was happy with the outcome! I came a long way from not knowing anything a few months ago, and I still struggle with different DAW's, but for the most part, I was really happy with the progress.\n\nI eventually hit a writers block. I'd write out a rhythm in a Midi pattern and trash it because it wasn't exactly what I was looking for. I've been mad at myself because I kept hitting a roadblock with melodies and basslines, or rhythms and harmonies.\n\nThen a Twitch streamer played my song by complete chance during his stream, and the chat lit the hell up with people commending the song. Once they realized I was in the chat, and the author of the song, everyone started tagging me with praise, to the point the streamer could do nothing but smile as I kept typing \"THANK YOU EVERYONE!!!\" for it to be buried by other audience members praising the song.\n\nI've never felt so proud of myself, and happy in my ability to create. I feel like my writers block is gone now, and right after making this post I'm going to keep working hard at improving. It was a huge wake-up call to me to never strop trying and to never be depressed or mad at myself for not achieving my own goals quickly. It opened my eyes up to hard work eventually paying off.\n\nWhile it may have only been 3 minutes of my life, it was the most surreal 3 minutes of my life.", "url": "https://www.reddit.com/r/happy/comments/6xi1bz/a_twitch_streamer_played_my_song_today/", "title": "A Twitch Streamer played my song today", "social_network": "reddit", "user": "MajorMeme95", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1504305528, "permalink": "/r/happy/comments/6xi1bz/a_twitch_streamer_played_my_song_today/", "nsfw": false, "first_save": 1635441421.3847952, "replies_charged": false}