{"id": "t5_2qh5i_t3_1vs5gw", "request": ["c889a480-189a-4ed9-aa88-81c300413196"], "text": "Now, I know this may get buried under the rest of the posts, but I really wanted to write about it and thought that this would be the most suitable place for it. Now, I am a car enthusiast through and through, and on Saturday 11th January, 2014, I got a rare - at least, to me - opportunity. On the night of the Saturday I had gone to pay my uncle a visit, a spur of the moment surprise kind of thing. Anyway, spent a good while chatting to him and my aunt - and had told him about the few driving lessons I had had and that I was really keen to master all the skills as fast as possible, and since I really really fancy his Audi RS4 (its supercharged and quicker than many supercars) I had asked to go for a ride; meaning that I thought he was going to be doing the driving.\n\nFast forward a few minutes, at the exit to the estate he parked up, looked at me, and said \"Nate, shall we swop?\". This was an opportunity that I just could not refuse, having wanted to drive the car for a good long while. I got into the bucket seat, my legs literally shaking from the nerves - the most powerful car I'd ever driven prior to the RS4 was a bog standard Suzuki SX4, i.e. compared to the RS4 in terms of power, it was a bicycle. I strapped myself into the drivers seat, adjusted it so that I was seated just right, put the car in neutral, and pressed the starter button - if I had thought that there was a lot of feel when being driven around in the passenger seat, well, it was nothing compared to being in the drivers seat of a 600+ horsepower beast, even the feel of it being in neutral was electrifying. \n\nNow, I had mastered clutch control in the Suzuki, but the clutch and gearbox in the RS4 are something else completely (the gearbox is from a Lamborghini Gallardo, mind). It went into first gear easily enough, but the clutch was strange - however not something that you can really explain, but feel. The next few minutes of the drive were nerve wracking, especially considering what I was driving, but my uncle reassured me that I was handling the car better than most people who have been driving for decades - I haven't even been driving for a year. The drive was perfect, just driving with the radio off, at ease once the initial nerves had settled, just listening to the amazing sound of that V8... Gosh, that V8, heaven only knows why you'd need a radio when you have that to listen to. I had found a new happy place, clear roads, windows down, cool delicious night air rushing into the car and carrying with it the sound of the motor and supercharger. Simply amazing.\n\nThe speed, the sensation of the car and everything was unlike anything I'd driven before, and it is just addictive. Thus is the story of my new happy drive in the RS4, and it was spectacular", "url": "https://www.reddit.com/r/happy/comments/1vs5gw/a_drive_to_remember/", "title": "A drive to remember", "social_network": "reddit", "user": "BMW4LifeNate", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 30, "down_vote": 0, "creation": 1390330420, "permalink": "/r/happy/comments/1vs5gw/a_drive_to_remember/", "nsfw": false, "first_save": 1635441456.3005064, "replies_charged": false}