{"id": "t5_2qh5i_t3_1n6ujc", "request": ["25d24ca5-f502-424e-a8f8-3466abfbbd33"], "text": "I've been in love with my best friend since the time I met him. He's always been the basis of what I want in a significant other. I always put him away on a shelf where I couldn't have him, since I doubted he felt that way about me. We met when I was in high school, and we would skype for hours a day, falling asleep while talking. We've spent the most time in each other's lives than anyone else ever has. He knew I liked him, but he also knew I had a lot of growing to do, and he didn't want to interfere with that. He taught me a lot about life, but always avoided trying to show me he reciprocated my feelings. \n\nI went to college, and I slowly cut him out of my life so I could pursue other people, flings, etc. He couldn't exist in my life while I tried to fall in love with other people. It wouldn't be fair to the person I was seeing if he existed in my life. I was supposed to go visit him this summer for the first time in a good 4 or so years, but I got hit by a semi and my car was totaled, so I planned instead to see him in September. It was all supposed to be platonic, since I was seeing someone else (had been almost two years) at the time when I planned this trip. About a week before my visit, I finally broke things up with my ex because I had fallen out of love with him over a year ago, when he told me he didn't see me in his future (we were also long distance). Me and the ex had turned into pretty much FWB, only seeing each other 2-3 times a month and talking maybe 20 minutes a day on the phone. \n\nSo, I visited my best friend. Feelings came rushing back, and he admitted to me that he's been in love with me for the past 3 or so years. He's always been there, he's always been my rock. I'd go back to him when I had heartbreak, or crushes, or anything, but then had to cut him out when I really was pursuing a relationship. I'm realizing now that everything I tried to get before was just looking for someone like him. \n\nIt's funny, because after breaking up with the ex, I was determined to be single, ride it out, have fun, seeing as I'm trying to go to medical school next year and this is a very transitional period for me. For the first time in my life, I was perfectly happy being with no one. He is literally the only person who could have made me sidetrack from those plans. He blindsided me, and I'm feeling things I've never felt before. I'm back to puppy love, which I haven't felt since I first crushed on him. \n\nI'm believing in the one again, and it's freaking me out. I don't want to be irrational, I don't want to be stupid. I didn't want another long distance thing, and now this guy is even farther than my last long distance! When I wake up, my heart is beating hard because he's the first thing I think about. The weekend I spent with him felt like a lifetime, and as he said, he's never felt more at home in his life than when I was with him. I'm stupidly happy, but I'm also trying to contain it, because I don't want people to think I'm rebounding. Trust me, if I was rebounding, I'd have chosen a much easier target. But, the fact of the matter is, I've talked to this man for hours and hours on end, and we never get tired of each other. I'm so euphoric, but terrified at the same time, since this means our friendship can never be the same again. Either we end up together for good, or we end for good. I can't imagine a life without him. He's already imagining what our garden is going to look like. \n\nI guess I've written all of this to say that I'm happy! I have no where really to share it, so I'm writing it all out here. \n\n*TL;DR* I've finally found the one I've always been looking for. It's terrifying, but so exciting at the same time. He blindsided me, but I've never been happier about it. If this is what my love story is meant to be, I don't mind at all. ", "url": "https://www.reddit.com/r/happy/comments/1n6ujc/just_found_out_my_best_friend_of_seven_years_is/", "title": "Just Found Out My Best Friend of Seven Years is in Love with Me. He's always been the one that got away, but no more.", "social_network": "reddit", "user": "mangodroplet", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 288, "down_vote": 0, "creation": 1380217441, "permalink": "/r/happy/comments/1n6ujc/just_found_out_my_best_friend_of_seven_years_is/", "nsfw": false, "first_save": 1635440666.263961, "replies_charged": false}