{"id": "t5_2qh5i_t3_91kniw", "request": ["89f969a3-3a22-4eff-8a40-d1d5b9658c57"], "text": "Hi, my name is Justin and I’m 26 years old. Recently, I was able to finally make contact with my birth parents, and it was the best experience of my life.\n\n(Photos are in the Imgur link at the end of the story)\n\nA little backstory before I get into it, though.\n\nGrowing up, my adoptive mother always made sure I knew I was adopted, and it was something I grew up embracing about myself. I never felt the negative stigma of being adopted.\n\nMy adoptive mother always made sure I knew that my biological mother loved me and wanted to keep me, but she wasn’t able to support life for a baby at the time and wanted me to have every opportunity available. \n\nOver the years, I’ve always been curious about my adoptive mother, as I only had 2 things to go off of: my mother’s name (For privacy reasons, let’s call her Lisa Jones) and the fact that my mother’s father was a pastor. Her name was very common, and made it impossible to find her through online research. I sent many messsges asking many suspect Lisa Jones over the years if they had a son who they gave up for adoption in 1992, and I received many “I’m sorry but no”s.\n\nFast forward to present day.\n\nMy adoptive mother sent me an article about a man who might possibly my grandfather. He was a pastor in a town about an hour from where I was born, And things looked hopeful.\n\nI did a little digging with the name I found, and I found the pastor’s obituary.\n\nHe died 3 weeks ago.\n\nI thought to myself “is this him? Has he really died?” After I read the obit, I saw the “survived by” section along with a few names.\n\nOne of them was Lisa Jones as the daughter.\n\nI couldn’t believe this. There was no way it was a coincidence. After trying her name again, I still came up with nothing for her name, so I tried searching the pastor’s wife’s name on Facebook.\n\nI ended up finding her and comparing her to the photo of the pastor and his wife. There was no mistaking it. That was his wife. \n\nI ended up searching through her friends list, desperately hoping she would be Facebook friends with my biological mother.\n\nShe was.\n\nI looked through her photos and immediately saw my own features in her face and I cried. I immediately messaged her.\n\nIt took a few days for her to reply because Facebook messenger is weird if you aren’t friends with the person.\n\nI sent that message that I had sent so many times to so many people out one last time.\n\nIt was her!\n\n(My initial message and her replies are in the Imgur link)\n\n\nShe was absolutely ecstatic. We talked for a while and she revealed to me that not only are both my biological parents still together, but that I also have 2 FULL-blood sisters, one 16 and one 19.\nThey also only lived an hour away from where me and my girlfriend were living in central Florida!\n\nLong story short, Obviously we decided to meet. We scheduled to meet next Friday at her home, and I had never been more excited about anything in my life.\n\nCome the day of, my girlfriend and Mom are riding with me, and we pull up at the house. I told them I wanted the first moment to be between only me and my biological family, since this was the first time meeting them, and they wholeheartedly agreed.\n\nI walk up to the door, about to knock, and my hand just won’t stop shaking. I know that when this door opens, my life changes forever. \n\nThey open the door and there stands my beautiful mother, father, 2 sisters and grandmother. All in tears. I get a rush of an emotion I’ve never felt and I just lunge into my Mom and hug her, immediately sobbing and squeezing her.\n\nAfter hugging her for about 2 minutes and crying, I hug everyone else. I feel happiness and euphoria as I see my own face in theirs. It’s a feeling one can only know if they’ve gone through this.\n\nAfter we all cry and hug, we sit down and we talk. For hours and hours and hours. I asked my mother about my grandpa, and she said he had passed away 3 weeks before I made contact, and the whole family was devastated he meant so much to them. \n\nShe said nothing was ever more “meant to be” than this because of how he passed away and then they find their biological son weeks later.\n\n“The worst thing ever happening and then the best thing ever happening within a month” was her wording. \n\nTo write everything we talked about would be a novel, so I’ll keep the rest short and say that I’ve met up with them several times after that. Every single time has been better than the last, and the whole situation has had an earthquake effect on both my biological and adoptive family.\n\nPhotos of meeting them, the first hug, and the messages are in the imgur album!\n\n[Photos and screenshots from the story are here!](https://imgur.com/gallery/bxgqJGE)\n\nThank you so much for taking the time to read my story of a lifetime!", "url": "https://www.reddit.com/r/happy/comments/91kniw/hi_my_name_is_justin_and_i_recently_met_my/", "title": "Hi! My name is Justin, and I recently met my Biological parents for the first time. I want to share what happened with all of you!", "social_network": "reddit", "user": "KungPowKarma", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 42, "down_vote": 0, "creation": 1532461277, "permalink": "/r/happy/comments/91kniw/hi_my_name_is_justin_and_i_recently_met_my/", "nsfw": false, "first_save": 1635440650.5002925, "replies_charged": false}