{"id": "t5_2qh5i_t3_3blshy", "request": ["0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "This is something I remember from ages ago, when I was about 11. \nMy home had a tree in the front yard that would always have a robin's nest in it and it was low enough that we could look right into the nest just by standing on the ground (in hindsight, I never did scare the mother away fortunately). \n\nEvery year, in late spring, my front yard would be full of these baby birds when they left the nest, usually a couple of days later they would have gotten the hang of flying and left by then.\nHowever, one day I was walking home from school when I heard chirping coming from the sewer drain right in front of my house and sure enough one of the baby chicks had fallen in there and was just sort of staring to get out. \nI was kind of hysterical in trying to get it out for a few minutes (I really love animals) and my puny arms weren't exactly helping reach for it. At one point I actually scared it away FURTHER into the sewer drain and that's where I actually became very guilty and anxious, thinking I doomed the chick. \n\nEventually I get the (perhaps arrogant to think so) genius idea to grab my fish net from the aquarium to try and extend my length. When I ran back to the spot the chick actually returned to where it was and actually didn't move away when I tried to get it up again.\nHere is where I thought the chick actually understood what I was trying to do (at least I hope it did), the length with the fish net was actually not enough to reach the bottom directly, so the chick began to jump up against the wall to actually come within reach. This went on for a good five minutes and I finally managed to catch it and lift it delicately back up out of the sewer vent. At this time I was almost shaking from excitement and finally returned it to its nest. \n\nIt promptly jumped out and scurried into the bushes in my front lawn. \n\nI figured I'd share this since every time I look back on it I always can't help but smile about it. \n\nTL;DR: A robin chick fell down a sewer vent and I got it out with a fish net. I was happy about it. Wowzas and yahoo and whatnot. ", "url": "https://www.reddit.com/r/happy/comments/3blshy/saving_a_robin_chick_when_i_was_little/", "title": "Saving a Robin Chick when I was Little", "social_network": "reddit", "user": "PrussianBrigadier", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1435646654, "permalink": "/r/happy/comments/3blshy/saving_a_robin_chick_when_i_was_little/", "nsfw": false, "first_save": 1635440896.4564867, "replies_charged": false}