{"id": "t5_2qh5i_t3_hksxhu", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb", "e9d5c1b3-4f2e-427b-a98e-af434f9cf1da"], "text": "Earlier today the postman knocked on the door. Wifey was on the phone so I took the parcel.\n\nIn those two seconds I noted it has my wifey's name on and the parcel had tell tale pictures and information on the box to know it is a piece of hobby equipment I have wanted for a few years but have never been able to justify getting.\n\nShe's patiently listened to me chat about it from time to time and I always talk myself out of getting one as I can't justify the triple figure cost for my hobby.\n\nIn that brief moment, I heard my daughter shout out as the dog accidentally knocked her over when she rushed past to greet the postman.\n\nI took advantage of that to quickly drop it down, say thanks to the postman, rush away and comfort our daughter who was not really hurt at all.\n\nWifey finished her call and shouted upstairs if all was well. I said our daughter had a bump and shouted back \"she got knocked down by the dog so I'm checking she is okay. Can you sort the parcel? I just had to throw it down and run up here.\"\n\nI peaked from upstairs, saw her pick it up, sigh with relief, smile, wrap it up in a bag and take it away to hide it.\n\nShe shouted back that it was a seat cover for the garden chair and I've been happily appreciating her since. She never makes a big birthday fuss and usually forgets so I'm so incredibly touched. I won't need to practice being happy and surprised in a month as I'm so excited.\n\nI'm really happy that circumstances meant I could cover up that I found out.\n\nI dropped a \"we need to step back from ordering house stuff, we're getting too many parcels\" an hour or so later and she half smiled before saying she'll try and cut down with a sparkle in her eye.\n\nIf you're reading this then thank you so much as I really wanted to tell someone as it is such a wonderful surprise.", "url": "https://www.reddit.com/r/happy/comments/hksxhu/my_wifey_has_purchased_an_amazing_gift_for_my/", "title": "My wifey has purchased an amazing gift for my 40th next month, she doesn't know I know and I'm stunned with the thought and effort she has put in.", "social_network": "reddit", "user": "AdequateHusband", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 114, "down_vote": 0, "creation": 1593817587, "permalink": "/r/happy/comments/hksxhu/my_wifey_has_purchased_an_amazing_gift_for_my/", "nsfw": false, "first_save": 1635438907.5910742, "replies_charged": false}