{"id": "t5_2qh5i_t3_fy6rdm", "request": ["d9021d56-8bfa-490f-87b8-52154c0b1b05"], "text": "I just want to tell you guys about my best friend Jasmine. The reason I think everyone should know about her is because she’s the type of rare human that you would kill to have in your life. If you have someone like her in your life, consider yourself beyond blessed and make sure you cherish that person forever. Genuine, humble, caring, thoughtful, empathetic and selfless are just a few words to describe her. She’s a diamond in the rough. She’s the type of person who would literally go out of her way to feel your pain with you just so that you’re not feeling it all on your own. She’s truly one of a kind. Anyone who comes into contact with her can immediately feel her genuineness. She’s the most non-judgmental and accepting person of every human being, even the ones who have done her wrong. She loves with all of her heart and gives all of herself to her loved ones and anyone in need. She has gone out of her way multiple times to save people’s lives. (No exaggeration) She’s also one of the heroes who are risking their lives nursing COVID-19 patients back to health right now. I just wanted everyone to know about her and how amazing of a person she is. I have so much respect and admiration for her. It brings me to tears when I think about how thankful I am to have her in my life. She’s my role model and inspiration. If I can be even half the woman that she is, I’m grateful. Please believe that there are pure hearted and wonderful people like her in the world.", "url": "https://www.reddit.com/r/happy/comments/fy6rdm/this_is_what_you_should_look_for_in_any_human/", "title": "This is what you should look for in any human being you choose to keep in your life.", "social_network": "reddit", "user": "sissa113", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1586487230, "permalink": "/r/happy/comments/fy6rdm/this_is_what_you_should_look_for_in_any_human/", "nsfw": false, "first_save": 1635442645.3272102, "replies_charged": false}