{"id": "t5_2qh5i_t3_hkfjoc", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142", "0344ec6b-2528-4c06-8dba-4c3095c02293", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "I do need to preface this with a word about the challenges I was facing. Mental and physical health and a bad environment, and it is still a process to heal. But that is not the point of the story.\n\nMy two best friends are inside my apartment. One who I love more than anything in every possible way, sleeping, safe and happy after a long drive to see me. The other, playing her favorite game, relaxing after a long day, who I love just as much, but not in the same way.\n\nI was not ready for sleep, so I made a bowl of ramen, went to my driveway and sat on my old desk that is waiting to find a new home, and let the moonlight infuse every pore and cell of me with peace. I turned on music that sounds like night and faeries, but the kind that slip past you as you doze away, putting your meds in a slightly more visible place and pulling your covers over your bare shoulder as you are leaving the waking realm.\n\nSitting here, with my ramen and the moon and the stars and my music, I felt like I had entered a life that could only be the 3 am animal crossing experience in our world. That sense that everything was right - that though the world is big and scary and painful right now, that it will turn out alright... That something, if not someone, is looking out for us, wants us to succeed \n\nI realized that the crises of faith I had been having - I had time to work those out at my own pace. And really, if my gods and goddess existed and I turned away from them, they would love me no matter what and still send what guidance they could. And if they didn't exist and I chose to believe in them, to make them real for me, the universe would give to me what it could.\n\nBut most of all, I realized that for the first time in many years, I was safe, secure, and happy all at once. That even if I knew the aftertaste when it passed would be bittersweet it would come again. That I could love myself, that people loved me, that I could be my authentic self and that I was a good person and could even be an extraordinary one. That I was secure, that I was safe, that I was happy; all at once. \n\nIt's a lot to process, to be sure. But maybe that's why I knew I needed the moonlight - to remind myself to be soft and gentle and kind, to provide myself with rest after a long day of being a sun, I could be a moon to the world that is me.\n\nEverything will be okay.\n\nEverything will be okay.", "url": "https://www.reddit.com/r/happy/comments/hkfjoc/a_simple_wish_granted_peace_or_everything_will_be/", "title": "A simple wish granted: peace; or Everything Will Be Okay", "social_network": "reddit", "user": "sunshadowsburn", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1593765729, "permalink": "/r/happy/comments/hkfjoc/a_simple_wish_granted_peace_or_everything_will_be/", "nsfw": false, "first_save": 1635441292.3652585, "replies_charged": false}