{"id": "t5_2qh5i_t3_cden4b", "request": ["608fc108-cf44-476e-8378-c59ee7483909"], "text": "Today was interesting. It started with me going with some co-workers to explore the big island of Hawaii, which I will admit, was actually pretty awful. I've tried to make nice with them for like 7 weeks and they still just talk shit and are generally unpleasant to be around. Today a few folk from another island came over and we went on a little road trip to explore while they were here. The guys from the other island are chill, but my direct coworkers were there so I really didn't feel welcome by default. \n\nFast forward a few hours and I'm just not having the passive aggressive slights oozing out of my co-workers. I decided to just go back to town instead of waste the rest of the day feeling unwanted. Only problem: public transit on the Big Island is less than ideal and I didn't want to impose and ask a coworker to give me a ride home. \n\nSo, for the first time in my life, I stuck out my thumb and hitchhiked. I never really had enough confidence to think it was possible, but after long enough, I found some people and managed to get back to town. \n\nAnother big reason I wanted to go back was to catch an open mic night at a small studio in town. When  I got there, I figured: \"I just hitchhiked 30 miles to get here, what's going up to perform in comparison\". I had been working on a little comedy bit for the last few months, but never had the courage to actually perform it. But, with the support of the studio organizers and my  hitchhiking afterglow, I just went for it. \n\nAnd people actually laughed. People actually enjoyed it. I had people coming up to be afterwards telling me that it was awesome and they actually had a genuine laugh. It was one of the best feelings ever.\n\nAs a little cherry on top, I think I finally found a bit of closure with an ex. For the first time in months, the anxiety and self pity went away and I finally felt better about how things ended. We still need to have a good talk about what's going on, but I'm happy that now I can go in with a clear head, but more importantly a clear heart. \n\nAnd if there is a stripper unexpectedly reading this: I'm ready to talk again.\n\nEdit: commas and minor phrasing", "url": "https://www.reddit.com/r/happy/comments/cden4b/i_performed_standup_for_the_very_first_time_at_an/", "title": "I performed stand-up for the very first time at an open mic and everybody loved it!", "social_network": "reddit", "user": "Jakeofob", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 26, "down_vote": 0, "creation": 1563177504, "permalink": "/r/happy/comments/cden4b/i_performed_standup_for_the_very_first_time_at_an/", "nsfw": false, "first_save": 1635441481.9035707, "replies_charged": false}