{"id": "t5_2qh5i_t3_7ts74s", "request": ["d2695e58-e735-4b4e-a3b9-4ea28b82b28e"], "text": "Last year in July I met my other half, somewhat surprisingly on a mainstream dating site. My heart was pretty beaten up from a previous sad/ depressing relationship and I was very casual about this young man at first. Over the course of the next few months I realised I was falling in love and that there was a person right in front of me who had fallen in love with me too. When it hit me, it was hard to comprehend at first, because I was so sure love was gone from my life after the previous chapter had ended.\n\nYou know what makes me the happiest? That he is HERE. That he is and wants to be INVOLVED in my life, that he treats my friends and family with respect, fondness and kindness. That he listens to what I have to say and doesn't just wait for his turn to speak. He enchants me with the best self-made dinners, putting in it the kind of effort that only love can fuel.\n\nLast night I laid in my bed and laugh-cried tears of happiness. I will never cease to be amazed by his never ending positivity, by his power to motivate people around him, gently, wisely pointing out exactly what you need, never harsh, never cruel. When he holds me close, I forget every trouble I ever had with anything and there's just warmth, affection, assurance that everything will be okay. Actually, more than okay - everything will be great if we work for it, supporting each other through it. \n\nWe talk, we communicate, we understand each other. And if we don't, we will explain and make it a learnng experience. We don't tell each other the \"I love you\" phrase every single day - our deeds and thoughts we share reflect this mutual feeling more clearly than three words ever could. And when an \"I love you\" is written or said sometimes, it is all the more special and all the more true. \n\nHe is my best friend among my other wonderful closest friends, who I've known up to 20 years. He and I know each other just a bit over half a year, though somehow I feel like we've always been there, waiting for our paths to cross, meanwhile dating other people and searching our way in life. Sometime during our childhood, we lived in neighbouring apartment buildings and went to the same school a few grades apart, but never met before our 22nd and 25th year. Life is funny - in the best way possible.\n\nWhen he said to me he wished this would last forever, I made a promise to myself that I would do everything in my power so that it indeed would last forever. I will learn, love, make mistakes, laugh and cry with him and at the same time will never forget the fundamental truths of love:\n1. It comes from within yourself. To love someone else, you must first love and respect yourself to the best of your abilities.\n2. You are your own person and so is your SO. Always keep that in mind and don't try to change who they are. Love them in the current moment and repeat that every moment.\n3. Never be deliberately hurtful. Critique is constructive and also comes from a place of love,\n\nI'm just very, very in love and so happy about all the things i've learned about love and life by simply just loving someone.\n\nHope you all have a great day! <3", "url": "https://www.reddit.com/r/happy/comments/7ts74s/i_have_finally_found_my_other_half_and_his/", "title": "I have finally found my other half and his existence makes me overwhelmingly happy every single day", "social_network": "reddit", "user": "madamedgarderobe", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 26, "down_vote": 0, "creation": 1517231492, "permalink": "/r/happy/comments/7ts74s/i_have_finally_found_my_other_half_and_his/", "nsfw": false, "first_save": 1635440638.726807, "replies_charged": false}