{"id": "t5_2qh5i_t3_2ulxdd", "request": ["25d24ca5-f502-424e-a8f8-3466abfbbd33"], "text": "Title is weird, but it's the best I could think of, to understand it, keep reading :)\n\nSo about 3 months ago my girlfriend of 10 months had broken up with me due to her falling out of love with me. This absolutely destroyed me! I was a reck and of course, my first reaction was to turn to drugs. I had always been a casual pot smoker but I completely abused it after the break up. I had smoked at least once a day minimum and for about 6 weeks, there wasn't a day where I was sober for a complete 24 hours. By the end of this I hated who I became and really wanted to change, but everything still hurt so much.\n\nIn the end I had decided there will be one last big bing and I will stop and hopefully better myself.\n\nI attended a festival called Rainbow Serpent which is an all age, spiritual, huge, crazy, drug filled festival with weird, awesome music.\nThe people at this festival is what mainly changed me for the better. They were the most welcoming, loving and accepting people I have ever met.\n\nOut of the 5 days I camped there, I didn't see a single fight! Over 15000 people all on different drugs, some sober, and not a single fight. Instead everyone just shared and gave and received, it was just one big beautiful community where anyone was accepted and loved.\n\nHowever, I did emerge myself in the drug culture of it all, and in those few days I was there, I consumed more drugs (besides weed) than I have ever consumed in my whole life. Spending probably about $500 on all different types of drugs including psychedelics and party drugs that would bring me up and happy and just a massive cocktail of drugs went inside of me. \n\nBy the end of it, I didn't want to touch another drug or smoke or anything for a very long time.\n\nI came back home and left the drug side of me at the festival, maybe to indulge myself only a fraction of what I did next year but be a lot more wary about it next time coming.\n\nI did however take the experience from the festival and the way of life and brought it home with me. I have become more accepting and caring, giving and just loving towards others.\n\nI have started meditating and it is really so great for me, I get this euphoric feeling that I never got from the drugs, and I also started working out 5-6 days a week and I am all about self improvement!\n\nSo here I am, still not 100% over this girl, but I have never felt better about myself and my life than I do at this point!", "url": "https://www.reddit.com/r/happy/comments/2ulxdd/i_am_my_new_drug/", "title": "I am my new drug.", "social_network": "reddit", "user": "MuffinMan12347", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1422942659, "permalink": "/r/happy/comments/2ulxdd/i_am_my_new_drug/", "nsfw": false, "first_save": 1635440668.2118602, "replies_charged": false}