{"id": "t5_2qh5i_t3_hqg76v", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "So, life has always been pretty tough on me, dealing with mental illness, abusive brother and my last boyfriend was just an awful person and made me feel awful. I recently had to move back home to take care of my parents, and even with COVID, I had to leave my job to protect them, especially since both have been in the hospital this year. Bet let me rewind a second, a few weeks after I moved back in October. \n\nI had a friend that I made while working at a grocery store back in 2013. We became great pals, shared an interest in video games, food, cocktail culture, etc. We never tried dating back then since I was dating someone else at the time. I lost my job there a few years later after my own health took a nosedive. I decided to peruse school and since there was a lot of family drama going on, a friend across the state let me move in and go to school. Several years later of living my life and having a relationship circle and finally go down the drain, I get kicked out of my ex’s, adopt a cat, and move back home. (My folks were all for the cat, so that wasn’t some sort of impulse.) \n\nI reconnected with my old friend (granted we texted quite often, and we would grab a drink when I was in town,) and started hanging out. After a few weeks, he asked me if I wanted to start dating him. I thought I might as well, and really enjoyed our first date, getting dinner and watching a movie. \n\nSeveral months pass, and we take our first road trip across the state together, and had a fantastic time! He got approval from my friends in that town, got to see a ton of my favorite places, and we will need to go back again for more. \n\nHis parents really like me, getting me gifts from their trips, makes extra servings of food in case I drop by, their dog gets excited when I come by, and was an absolute doll when she met my cat! \n\nNow, what made me realize that I am in love, and really sets my heart a flutter; he is patient, kind, and considerate. He does what he can to lower my stress, respects when I try to tackle problems by myself, and is understanding that I have quite a bit of baggage and works around it. \n\nHe complements me, sees us as an US and doesn’t mind helping me out financially. We plan on moving in together in a few months and knows full well that I cannot pay a cent upfront since I am not making any money while taking care of my parents. (Mom cannot move, and Dad is walking with two canes.) \n\nHe makes sure I get away from the house every few days since it is super high stress. (Dad wants to sell the house and get himself and mom into a better living arrangement.)\n\nHe compliments me on things I never considered. He is the smartest guy I know, but he loves that I am very clever with how I have been able to survive what I have been through. He loves my determination, my kindness, my almost Disney Princess level of bonding with animals, my creativity... \n\nI know he wants to marry me, and have kids with me. He would like to see me go back to school if I want to, and he really wants to make sure I am happy. And these Ideas make me happily blush! Even my mom, who hasn’t met him in person, (she doesn’t like people seeing her in her current condition) can see it on my face and told me that if I love him, I need to say it often, and I do. My dad is cool with him, my niece is excited, and even my brother seems to be cool with him.\n\nTonight, we are having a macaroni and cheese night when he gets off work, just for fun. Gonna make my famous Pesto mac, and see if I can get some wine or a cocktail to go with it. (Would a mojito pair well? I have so much mint in my garden!) \n\nI can gush on and on about him! <3", "url": "https://www.reddit.com/r/happy/comments/hqg76v/over_the_last_few_months_i_am_slowly_growing/", "title": "Over the last few months, I am slowly growing aware that I am actually in love!", "social_network": "reddit", "user": "clancycats", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1594650426, "permalink": "/r/happy/comments/hqg76v/over_the_last_few_months_i_am_slowly_growing/", "nsfw": false, "first_save": 1635441310.3601854, "replies_charged": false}