{"id": "t5_2qh5i_t3_5cj04z", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "**I accidentally put the wrong video in the post before :( But I updated it so it's correct now**\n\nI feel extremely fortunate right now. I'd rather not talk about anything negative in this post, so I will just say that my life has improved immensely in the past five weeks.\n\nMy grandfather and his girlfriend are moving to Florida soon. As it started getting colder here up north, he asked me if I wanted to go with him for a few weeks to help prepare the house. At first I hesitated to go with him, but I decided almost at the last minute to take the drive down there with him. And so started the fortunate times that I haven't seen for years in my life.\n\nWe spent two days driving down there. It was very nice. This is probably the last road trip I will have with my grandfather and I am fortunate to be able to spend time with him. His Florida tasks weren't as daunting as he made them out to be. So essentially I just got to relax (and search for jobs) for the majority of my stay. We also got to visit Kennedy Space Center, which was awesome!\n\nThe Florida trip allowed me to de-stress. My mood changed within a couple of days of being there. I was exercising more. Eating healthier. Overall my habits and mood changed for the better. The best part is that I fixed my sleep schedule. I have been consistently waking up early for five weeks now. An unimaginable record.\n\nAfter our road trip came to an end, I finally came back home to enjoy living in my humble garage. On day one, the stress piled back on and I was still unemployed. But I adapted to cope with it, thanks to mindfulness techniques. That all lasted until Monday, when I got an email from an employer that said they'd contact me when they were ready to hire. Long story about that.\n\nSo I went in for an interview that Tuesday. It went very well - stayed for almost two hours chatting about the job and the office. On Wednesday, they asked for my references. And finally on Thursday, I started working. I am finally an employed man! I have nothing holding me back now. I can finally afford to do so many things I've been planning to do, which leads me to my next point. \n\nI got home from work yesterday to find that my new YouTube channel had gained its first real subscriber!! I could not have asked for a more perfect day. I made a video reflecting on how fortunate I was for all of these puzzle pieces to fall so perfectly recently.\n\n**You can check out that video here.** https://www.youtube.com/watch?v=hW4KXw3__2g\n\nIt is my dream to become a fairly large content creator on YouTube. My goal is to get that 100K subscribers plaque in the mail one day. Even though I spend 50 hours per week working, I will still dedicate my free time to making YouTube videos. Now that I have some income, I can afford equipment that will help me start streaming and equipment that will improve the quality of my videos. Eventually I hope to move out of the garage and into a place where I can have a small studio to record in. \n\nI've loved YouTube since I was a kid... But years ago I was under a lot of peer pressure to quit... So that's what I did. I regret quitting YouTube all those years ago. I tried to start up another channel in 2014 but I was not feeling confident in myself to continue. But this time is different. I am confident in what I'm doing and I'm not going to let any hater take from me what makes me happy. Life's looking up for me. [Here's a direct link to my channel if you're interested.](https://www.youtube.com/channel/UCEXgR6f-_qv7nWHYHp-Ftdw) I make videos about whatever I feel like making, but primarily I will be sharing gaming clips and comedy videos.\n\nIf you got to the end of this then thanks so much for reading. I really appreciate it. Even if you didn't get to the end, that's OK too. Have a wonderful day!", "url": "https://www.reddit.com/r/happy/comments/5cj04z/hello_everyone_ive_had_a_lot_of_success_recently/", "title": "Hello everyone! I've had a lot of success recently and I want to share with you all. I'm so grateful for all the wonderful things that have happened to me in the past five weeks.", "social_network": "reddit", "user": "Convexus", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1478927238, "permalink": "/r/happy/comments/5cj04z/hello_everyone_ive_had_a_lot_of_success_recently/", "nsfw": false, "first_save": 1635440878.4348338, "replies_charged": false}