{"id": "t5_2qh5i_t3_b0y3j", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "God dammit.  I loved that woman.  For those of you who were born to miserable families, I'm sorry.  For those of you who think man is born inherently evil, I'm sorry.  For others who have lost faith in humanity, I'm sorry.  I wish my grandma was your grandma - you'd have a different outlook on life.\n\nThis woman would make all of you cry with her beauty.  She would slaughter your face with kindness.  If she faced the Pope in a peace-off, that motherfucker would lose in a heartbeat.  Cats would cross the street just to walk beside her.\n\nThere was never a more generous or nice woman ever invented.  If Mother Theresa had met my grandma, she'd cry at what a failure her own life was, and probably run to confession.  My grandma was the best.  \n\nThere are angels that walk among us, and my grandma was one of them.  I loved her.\n\n(i dont know why i'm posting this in happy, when i am so sad... but my grandma would probably prefer to be in happy, as opposed to science, or wtf, or shitty facebook or twitter)\n\n*Edit* - you guys rock... thanks for the notes of kindness.  I APPRECIATE IT!  You seriously cheered my day up.  Strange how that works...  Thank you.\n\n**edit 2** - man.  you guys and gals are the fucking best ever.  i am serious.  you took a shitty day, and made it a good one.  you should all go home and know that you affected a random dude on the internet in an amazing and uplifting way.  i seriously thank you all.  How does one thank a group of anonymous internet peeps anyway?  Perhaps pics of [happy dogs](http://kecute.files.wordpress.com/2008/01/happy-dog.jpg).... or [boobies](http://www.bocephus.net/wp-content/uploads/2006/11/boobies.jpg)?  Whatever your pleasure, i salute you.  Thank you so much!", "url": "https://www.reddit.com/r/happy/comments/b0y3j/my_fucking_grandma_died_today/", "title": "My fucking grandma died today.", "social_network": "reddit", "user": "smakusdod", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 223, "down_vote": 0, "creation": 1265914215, "permalink": "/r/happy/comments/b0y3j/my_fucking_grandma_died_today/", "nsfw": false, "first_save": 1635442241.2277405, "replies_charged": false}