{"id": "t5_2qh5i_t3_2ak80y", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "Hi reddit,\n\nI've never posted anything like this so I apologise in advance for not following the rules or the massive block of text that will follow. But I hope this gives all you hope that there is someone out there for you, no matter who you are.\n\nI’d just like to let you know about my girlfriend, she is my everything. We met at university back in late September 2013 and started dating on November 17th when I asked her to be my girlfriend at 11:34PM. She was 19 and I was still 18. She had her birthday a few months later and was 20 for three months until I became 19, this may have annoyed her a bit. :) She is so cool, her games, musical and movie taste are all fantastic. She has shown me some of the best, most emotional and moving things I have ever seen since I can remember. My life revolves around this girl. I would be lost without her.\n\nI try to spend every moment with this girl. She is just so pretty and cute, perfect and kind, far too good a person for me. She has made me so happy since I met her and it’s as if the light in my life has just been switched on and I have finally found what we all search for. For a long time I didn't have a plan. No clue as to what I would do with my life. Now, I know. I will do everything I can to make her happy.\n\nI couldn't sleep for a week because of her; she was always in my mind. I eventually fell asleep when sleeping pills failed me and had some weed (for medical reasons). When I first told her I loved her it was nerve-racking. Did she feel the same? But she fell asleep soon after I confessed. She accidentally let it slip that she loved me a few months later when I said “I'm in love with a psycho.” I was washing up and she said “So am I.” I couldn't believe she said it, especially by accident. I tried to play it cool and pretend she didn't say it. She was blushing.\n\nLife is tough and we have both been through some shit. It’s just what happens. I fuck up a lot in our relationship but she forgives me at every turn. I thank her so much for that. \nWe recently went to Rome together, it was an interesting week and we saw a lot and had a lot of fun and she bought an amazing mask like those worn by Ezio at the Carnivale in AC2 (One of our favourite video games). However, everything has its ups and downs and we ended up losing two friends over the holiday but managed to gain two new ones (and one of them is a redditor…woah right?). Also, I'm proud for us to have lost the second necklace I bought her in the Vatican. It was a lovely heart necklace that had rusted somewhat (Apparently silver plated jewellery rusts. Note taken). I would always put the necklace on her before we went out.\n\nI miss that. We are apart for the summer and it is more difficult due to my overbearing super religious family that won’t allow me to go out. \n\nI just want to cuddle her and hold her hands again, she has the softest skin. It’s unreal, and her touch….it’s so smooth and gentle. She has seen me cry many times and seen me near my worst. But she stands by me and helps me with anything and will always try to make me smile. I guess I don’t appreciate her enough and that’s why I have and will devote a lot of my time to being a better boyfriend (help me out with ideas).\n\nI feel like I'm rambling but I’ll get to the point. I was a wreck before I went to university and met her. My life had no real purpose. I'm a weird guy, I stay up late and play video games and listen to screamo and classical music and lie on the floor occasionally and especially when drinking. I confuse and weird most people out with my oddness (I'm serious, I will hug anyone). But she loves it and she embraces it. She has always accepted ME for who I am and I will always do the same for her. I just wish I could show her I loved her in ways other than saying it. We have had so many perfect moments together and I hope we have thousands more. I want us to work together, have a beautiful, small wedding, have kids and then grow old together. I wish for nothing more and nothing less. \n\nAll of you, everyone in the world can find your perfect soul mate.\n\nEven if you think you are better off alone, you won’t know. Love is crazy, it’s irrational and makes you vulnerable but I’d rather be vulnerable to her than feel nothing at all.\n\nI love her more than anything in this world and I always will.\nThank you for reading this.", "url": "https://www.reddit.com/r/happy/comments/2ak80y/ive_never_been_so_lucky_to_have_asked_just_one/", "title": "I’ve never been so lucky to have asked just one question.", "social_network": "reddit", "user": "fallelena", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1405224093, "permalink": "/r/happy/comments/2ak80y/ive_never_been_so_lucky_to_have_asked_just_one/", "nsfw": false, "first_save": 1635438856.754292, "replies_charged": false}