{"id": "t5_2qh5i_t3_ebf9tn", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "\nThere’s a lot about myself I should be happy about. I could very well be dead right now but fortune has it that I’m not. Whether it be of one disease or another, I’m still around kicking it. I’ve made serious progress with a lot of things from when I was younger and I’m slowly but surely getting better socially, which I would consider my main flaw at the moment. I’ve received offers from great universities where mostly A*s are required, showing my hard work has paid off. I’m reasonably happy with my health and fitness (though can always improve). My confidence is growing by the day working a part time job where speaking to people is necessary, where my sales figures aren’t ok (I think). I’ve learnt you can’t please everybody as someone will always dislike something about you, but that’s good. It’s helped me come to terms with just being who I want to be. I’m more confident with my appearance now then ever. Yes I gotta grow up in some regards but I’m gonna let it come naturally. I’m looking forward to the next day nowadays and I’m reddy for the next challenge that comes my way.\n\n(I just wanted a place to put this so I can look back on it in the future when I have an off day.)", "url": "https://www.reddit.com/r/happy/comments/ebf9tn/i_need_to_stop_being_so_hard_on_myself_because/", "title": "I need to stop being so hard on myself because I’ve come so far since I was 16. There’s a lot about myself to be proud about.", "social_network": "reddit", "user": "Apples-taste-horribl", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1576503665, "permalink": "/r/happy/comments/ebf9tn/i_need_to_stop_being_so_hard_on_myself_because/", "nsfw": false, "first_save": 1635440871.0675216, "replies_charged": false}