{"id": "t5_2qh5i_t3_lwo7cf", "request": ["0344ec6b-2528-4c06-8dba-4c3095c02293", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "After months of hearing my parents drilling, \"When are you gonna get a job?\" into my ears, I finally get a job with a higher than the average salary and it's related to my Master's Degree!\n\nIn 2020, I was in my last semester of Master's. The semester focuses on doing my thesis only and even during then, my parents expect me to have a job WHILE doing my thesis. Not only that, jobs were scarce during the pandemic, even the part time ones. I've applied ALL KINDS of jobs, and they all ignored me. Some even say that I'm too old for a clerical job? (I'm only 28 for goodness sake)\n\nIt was a pretty devastating few months, had so many breakdowns and general anxiety attacks that I lost count, thinking that I'm not good enough for anything. When I finished my studies, I went back to my hometown. Even at home, some days, I just lock myself in the room because I can't stand another, \"get a job\" lecture. But I understood why they feel that way; they just want me to be secure and safe financially.\n\n(Just to be clear, I came from an Asian household in an Asian country. So staying with my parents is not only a norm, but expected of Asian children who finished their studies)\n\nI'm just happy that I found a job that I can actually apply my skills and knowledge on. I can finally relax and not feel restless all the time. Moreover, I don't have to make my parents worry anymore.\n\nMy advice for job seekers: Don't lose hope, please! I know how empty and unfulfilling it is to look forward to NOTHING during the present time, but keep applying hundreds of jobs. The one that's meant for you will come to you eventually.", "url": "https://www.reddit.com/r/happy/comments/lwo7cf/i_got_a_job_after_so_many_months_of_being_jobless/", "title": "I got a job after so many months of being jobless!!!", "social_network": "reddit", "user": "kejennaan", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 65, "down_vote": 0, "creation": 1614756999, "permalink": "/r/happy/comments/lwo7cf/i_got_a_job_after_so_many_months_of_being_jobless/", "nsfw": false, "first_save": 1635442713.9735475, "replies_charged": false}