{"id": "t5_2qh5i_t3_dk3x7d", "request": ["5bcd7a82-c8bf-45e5-9556-cc778b964467"], "text": "I’m not bragging about my relationship I’m really happy with my wife and I and just want everyone to know. The key I feel like is being goofy. Immature but also mature at times. Let me know what you guys love about your relationship and funny things the significant other does to make your day better.\n\n   I just wanted to talk about my relationship with my wife and how much fun it is. It’s like we’ve been in the loving phase for 6 years. We’ve been together for 6 but married for 3. We have our issues of course with common things and disagreement or hangry arguments but 90 percent of the time we are so freaking happy. I think the key is being goofy and just out right silly and know when your being a baby about something small. Most of the time is me being the baby. \n\nI will dance around the house with Alexa playing some Russian techno music or belt out regular songs like I’m gifted with singing. I’ll be playing my pc in the other room and she will tap on the wall and make weird noises to get my attention because she’s getting lonely watching tv or a book. I usually go out there for a couple minutes and just entertain not that I have to but because I want to. I hope everyone can find a relationship like this. Just be yourself most of the time the other person is probably going to be just as goofy and if not then it’s not. \n\nThanks for reading even though it’s not much of a info post!\n\nTL;DR I just love my relationship and it’s working great for me!", "url": "https://www.reddit.com/r/happy/comments/dk3x7d/i_sure_do_love_my_wife_shes_a_blessing_to_my_life/", "title": "I sure do love my wife! She’s a blessing to my life I hope everyone can be as happy as I am in a relationship!", "social_network": "reddit", "user": "zavagedcarparts", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 27, "down_vote": 0, "creation": 1571492510, "permalink": "/r/happy/comments/dk3x7d/i_sure_do_love_my_wife_shes_a_blessing_to_my_life/", "nsfw": false, "first_save": 1635439163.5863843, "replies_charged": false}