{"id": "t5_2qh5i_t3_io10z9", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11", "89f969a3-3a22-4eff-8a40-d1d5b9658c57"], "text": "\n\nI’ve been pretty down for a good long bit. A good 3 years of constant drudgery. From major depressive episodes to explosive emotional setbacks. These past two days have been phenomenal. I have no memories of being this at peace in any other time in my life. And it’s not for any particular reason. I tend to attempt rationalizing things no matter how tedious it is, so naturally I assumed this was due to a recent surgery. I had my wisdom teeth removed, and I assumed I was \nA) I was coming off of the effects of anesthetics and my brain was just becoming more active over a period of a couple days. \nB) not feeling as much pain in my jaw or \nC) I was not eating as much, so I didn’t feel as lethargic.\n\nI then broke the day down.\n\nI went fishing for the first time since the surgery and a friend came with me. She didn’t fish, she just hung out and read a book while I fished. I had company. It was 78 F out. The water was very high, and there was a constant breeze. Not too much sun, ever so slightly interrupted by clouds. I caught four fish, 3 baby striped bass and a snook. Nothing big or spectacular. I hadn’t lost any gear, my knife didn’t get wet. I wasn’t tired afterwards, I didn’t get sunburned, I wasn’t hungry, I wasn’t dehydrated. We were in a semi isolated spot that couldn’t be seen from the rest of the park. I drank a small mango smoothie. I listened to music and laughed. And I was happy. I was filled with a grand euphoria of which I have never known.\n\nI was in bliss.\n\nAnd I was the next day too. But what happened that \nnext day?\n\nNothing of note. At least to anyone without a habit of over-analyzing.\n\nI rode my bike and picked up a prescription from the pharmacy. I rode my bike through town to pick up some soap. I realized I left my card at home and went back to get it. I returned and bought my soap and came home. A suture from surgery fell out of my mouth. Nothing happened that was out of the ordinary. And yet this day I felt such peace and happiness.\n\nThese past two days have been the best I’ve experienced in the past 6 years of my life. I have never    Felt such peace and bliss. And I don’t know why. If it wasn’t the little things, what was causing such joy within me?\n\nMaybe such a pure and meaningless joy is somewhat foreign to me in recent years. That’s okay, I suppose. I’m happy. And I haven’t felt this good in so long.\n\nI never want it to end. It will, but that won’t stop me from trying.\n\nThankfully this happiness bout has come about right after... something. I genuinely don’t know how to describe what happened.\n\nRemember aforementioned friend? Maybe a couple of weeks before the last couple of days she said “you are tired, aren’t you? You seem, like, hollow. Full of static.” I asked what she meant and she said, “I don’t know, it’s just like a light in your eyes.” I stood up and walked home. And I don’t know what she meant.\n\nThis change of pace is a welcome one. It’s so entirely minor and insignificant. But I’m loving not dragging my unwilling soul behind me.", "url": "https://www.reddit.com/r/happy/comments/io10z9/a_nice_change_of_pace_brought_on_by_who_knows_what/", "title": "A nice change of pace brought on by who knows what.", "social_network": "reddit", "user": "nabbyy10", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1599453587, "permalink": "/r/happy/comments/io10z9/a_nice_change_of_pace_brought_on_by_who_knows_what/", "nsfw": false, "first_save": 1635439195.2941608, "replies_charged": false}