{"id": "t5_2qh5i_t3_96y2om", "request": ["44cd61d3-f01a-4909-b162-9daae7dd79b2"], "text": "Hey there just wanted to share with you how awesome my year so far has been.\n\ntl:dr - It's a friggin awesome year! And not only do I feel good, but I can put a hand on my heart and say: I'm truly happy!\n\nWall of text comming so bear with me. Why's my year so great? Starting with the big stuff:\n\n* **Finished my masters:** Two months into 2018 I finished my master thesis. And it was a hell of a mountain to climb. Reminded me of Tyler Durden: *I'll bring us through this. As always. I'll carry you - kicking and screaming - and in the end you'll thank me.* And he was right. I pulled myself through. Now, not only having a diploma in mechanical engineering but also a M.Sc in computational engineering. Which enabled me to dive even deeper into my field of work.\n* **My sister got married:** We're a family that always has been close, but such a major event pulled us together even more. It all started with me (the older brother) joining her and my mom one day to look for accessoires for her wedding dress (the dress itself was already chosen two weeks earlier). And just being part of that made me so incredibly happy, because I could see my sister being happy. The wedding itself was ... perfect. Speches that swept everybody of their feet, my sister singing a few songs herself (she's part of a choir, so nobody ran away, which would've been the case if I had sung), all friends and family that were invited made it, and nothing broke or went wrong. And it's just so satisfying to see someone that's important to you, marry their best friend and love of their life.\n* **I was asked to be a godfather:** No, not some Don Corleone like stuff (I probably couldn't pull that one off anyway), but very good friends of mine, invited me over (coincidentally one day after my sisters wedding) put their newborn daughter (3 months) in my arms and said: 'We need someone to be her godfather. We want that someone to be you, Vectoranalysis!' I was speechless. Knowing that your friends trust you that much with something so incredibly valuable is an honor. And left me shaking. However as I realized that this little bundle of life dozed off in my arms I ... don't know exactly how to describe it ... felt so lighthearted. This baby felt comfortable enough to sleep in my arms.\n* **I realized that I want to be a dad:** Thanks to my goddaughter I spend now quite some time with her family. Including her older sister (3 years) and her older brother (7 years). I adore them. And they are super happy to see me. Gets me everytime. Now I know that despite all the troubles I witness, I have probably still seen the children on their 'good times' and still know very little about all the struggles that come with children. But, having them around I lost my fear of screwing it up somehow. As if being a godfather is just a very short test drive, but even that gave me enough understanding to finally accept that I somehow are meant to be a dad (as my mom and sister always pointed out).\n* **I finally moved into my first own flat:** Anybody who lives in Germany knows that shared flats ('Wohngemeinschaft') is pretty common among students. And that's how I lived for nearly 10 years. It was cheap, I lived with friends and it was a blast. But now I had the chance to move. So I started looking for a two room flat for myself. I was incredibly privileged and lucky to find a newly built flat within a month! Within my budget and lanlords that are super friendly. Sure it's new so I need to buy some more stuff, but having finally a place on my own feels so incredibly freeing.\n* **I got a job that I enjoy:** As an engineer in a small consulting office I get to work with different customers (and thus different problems) day in day out. I Love to be on site as I have the chance to visit different engineering branches each week. A printer company this week, a machining firm the next and a construction office the following. On top I have a great boss that's straight forward. Oh and we have an office cat.\n* **I'm best friends with my ex:** Now I know the usual 'Let's be friends' talk, but for us it worked. We split up last year (we simply don't work as a couple), and we both agreed on just letting things roll and see how we get along. After 3 months seperated we went for a first coffee as 'exes' and immediately we had that connection again. Something we felt during our relationship. This time though, without the 'pressure' of being a couple and all that (yeah, we were weird). Since we value each other as human beings it was only a matter of time before we had our friendship back. And I'm truly truly grateful for that.\n* **I started a small YouTube channel for my gamer pals:** This is really just an upcoming project but having already some people thank me for those tutorials is a huge deal. I wanted to give something back to my gaming community I am part now for so long. It's not much, but if somebody could learn something from my stuff? AWESOME!\n\nFinally: Please note that my life before 2018 was not in any form bad or something. I lived a great life so far. It's just ... only since that year I can fully appreaciate everything that I have (and I don't mean monetary stuff). And coming to those terms is a huge boost in my happiness. Writing all that down for you beautiful strangers, lets me smile even more.\n\nI think that alone is the purpose of this post, to make it even more visible to me. Thanks for reading!", "url": "https://www.reddit.com/r/happy/comments/96y2om/2018_thats_my_year_let_me_share_with_you_why_that/", "title": "2018 - That's my year. Let me share with you why that is!", "social_network": "reddit", "user": "Vectoranalysis", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1534165032, "permalink": "/r/happy/comments/96y2om/2018_thats_my_year_let_me_share_with_you_why_that/", "nsfw": false, "first_save": 1635442438.707807, "replies_charged": false}