{"id": "t5_2qh5i_t3_8gnzi3", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "I have gone through one failed engagement, a marriage and quick divorce, a serious relationship that ended in the guy faking a deployment to avoid me and throughout almost all of it all I had a friend who would come when I needed a cry (if he had time, it was not an on demand service... he seriously pissed me off in his lack of attention for a year or so) and would fuck me when I got horny and didn't want random sex.\n\nI spent the last year or so in therapy trying to figure out how **I** screwed up. And even though there is plenty of blame for the people I chose, I was the root of the problem. I never let things be. I was driven. I had my five year plan and if a dude wasn't on board, he was kicked off the ship after a night. I controlled myself and other people and put them down and never let things flow like they should, except in this one minor respect... this guy who I wanted and didn't want and wanted because I didn't want him.\n\nBut after the divorce and trying hard to realize patterns I started fixing my shit with LOTS of therapy and writing and this dude stuck around. He spent the night when I started getting off anti-anxiety meds and had mini seizures, held me when the biggest gap in my life was contact with humanity and never treated me like I was too smart to fight or too dumb to fight with (fight~debate.... heated discussion of differences in a respectful way... we are technically polar political opposites, but only because we disagree on fixes, not issues). \n\nI know I am not beautiful and I am overweight, but I don't feel guilty or ugly when we wake up together and nuzzle and cuddle in that space between deep sleep and awareness and I go make coffee without clothes or makeup so we can cuddle (and he learned how to touch my itchy eczema skin without hurting me!) and listen to the news in bed and talk and cuddle and yell at Alexa to turn on opposing podcasts. I have teased that I want to be his girlfriend (he is an engineer and I do statistical econ so I make math jokes about him being above my 3rd standard deviation from the mean), even though neither of us are dating anyone else (since like November), so I sort of default am, but he is skittish of the term and I am skittish about repeating mistakes, so against my nature I never forced it.\n\nHowever, this morning, in bed with a kale smoothie for me and coffee for him he referred to himself as my boyfriend and I jumped and did a hideous endzone-style dance to the NPR's morning edition music.\n\nI have to leave by June 30 (about 2000 miles away, probably) and he has out of state training most the time between then and now, so it is almost meaningless in a way, but it was a victory. It was a \"relationship\" I didn't manipulate or force (I mean, I made a lot of bacon and always had his favorite ice cream on hand, but that is small potatoes.... comparatively). I restrained my desire to control and even if I didn't get exactly what I wanted, I at least got acknowledged as worthy without manipulation.\n\nIt almost feels better than being cared for outright (knowing there is a deadline and uncertainty). I am cared for in spite of, by someone who knows my default is to \"trap his ass\". I am able to attract someone who cares without forcing them and that is a beautiful thing to know. Someday, all the \"cared for\" statements will be replaced with \"loved\" and it doesn't matter if it is by the guy who cuddled me tonight or someone in the future, because I know I am changing to be someone who deserves more that a man who I managed to \"trap\".\n\nI don't know what I was thinking in my early 20s. I am almost 31 and things seem bleak from the outside, but I am so much better off on the inside. My career is shot to shit, I am unemployed with three degrees and significant community service/leadership experience. My love life seems pathetic from the outside, because most people don't know I got to play and experiment when I was a confident adult instead of accepting a status quo. That also means I got to figure out and insist on what I need from partners and got to practice doing that. I am glad I fucked up my 20s. I am glad I am finding people I appreciate and who appreciate ME in my 30s for who I am.\n\nTL;DR: Don't force shit. Don''t feel like you failed anything at all. All you did was learn.  You have no obligation to anyone or any convention to be happy or \"right\" ASAP. You can take your time and make mistakes and then, when you finally do something good, you can appreciate it with understanding, depth and self-compassion. You can be happy for yourself and the person/people who care for you. You can know you can stand losing it and that loss will only make the lake of your love deeper.\n\nGood luck kiddos.", "url": "https://www.reddit.com/r/happy/comments/8gnzi3/after_a_history_of_forcing_relationships_a_man/", "title": "After a history of forcing relationships, a man called himself my boyfriend this morning, without me forcing it. (I am 30 and its a first)", "social_network": "reddit", "user": "pro_forma_life", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 23, "down_vote": 0, "creation": 1525324574, "permalink": "/r/happy/comments/8gnzi3/after_a_history_of_forcing_relationships_a_man/", "nsfw": false, "first_save": 1635440716.0313554, "replies_charged": false}