{"id": "t5_2qh5i_t3_q3xe8m", "request": ["e9d5c1b3-4f2e-427b-a98e-af434f9cf1da", "f99849f1-c5ed-4a2e-9fa7-a30fa9b108d8", "4311bf71-6ec2-4c3b-aa15-1f9a3223e07b", "0344ec6b-2528-4c06-8dba-4c3095c02293", "410541ae-d9ba-4732-8b05-a2de1b3d7065", "e78e5c86-dbf1-4ab8-a98c-e9d544934b7c", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "**The student I mentored in a scientific research field which I wanted to pursue achieved the goals I'll never be able to do.**\n\nOne time, I brought a college kid who resembled the skills and characteristics I had as an undergraduate back then to our country's top university research lab I used to worked at as a researcher. I knew him through a career help subreddit. He became an intern to the project I was working on. A bit of background, I originally wanted to become a full-pledged scientist with the Ph.D and a research career but unfortunately I had to become a family breadwinner at an early age so I quit and got into tech corporate for the money. I left this college kid and I can still remember how he felt so nervous that he might not be as smart as the people in our lab as he came from a country-side university. I assured him that the people there are nice and will never look down upon him. I used to study from a country-side university too so I understood how he must have felt.\n\nSix months later, corporate tech is uninspiring and everyday lately felt like I'm losing my soul and motivation in life. Only good thing is I am paid 3x more now which goes into student loans and family debt. Then, today this student sent me an email that he got into a prestigious research lab in Europe! He'll do another internship there and after he graduates he will pursue higher studies on the same EU lab!!! We're from a third world country so this is really great news. He sent me an expensive gift(he is from a well-off family) as a way of saying thank you for the opportunity. I never expected anything! I am overjoyed that someone who resembles so much of my younger self is pursuing the dreams and goals I abandoned. \\*relaxed emoji\\*", "url": "https://www.reddit.com/r/happy/comments/q3xe8m/happiness_is_guiding_others_to_a_treasure_i/", "title": "Happiness is guiding others to a treasure I cannot posses.", "social_network": "reddit", "user": "Psychological_Job_97", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1633698441, "permalink": "/r/happy/comments/q3xe8m/happiness_is_guiding_others_to_a_treasure_i/", "nsfw": false, "first_save": 1635441124.0208216, "replies_charged": false}