{"id": "t5_2qh5i_t3_dtt52l", "request": ["c889a480-189a-4ed9-aa88-81c300413196"], "text": "From the first moment we met it was as if we already knew each other. There was an immediate bond that felt familiar and right and perfect and fitting. We spent every moment together and the memory of it was like a shining light in the darkness of the years that followed for due to circumstances I had to move away to another country. We stayed in contact for a while but life kinda just carried on for both him and me. For both of us, during the next 30 years we each went through some really difficult times, (as most people do), circumstances that, although extremely painful and difficult, tempered us, like a mud brick is pretty useless until it gets put in the furnace to fire it and make it strong. It’s horrible being in that fire, it’s literally hellish, but once you’ve gotten through, you are better for it. It was like that for each of us in our own ways, in our own fires. Then one day he called me saying he had dreamed of me. I realized that I now had the opportunity to visit him and within days we were reunited again after 30 years. Immediately there was that bond again, that absolute fitting together. In all those years he had never been with anyone else. Had never even contemplated being with anyone but me, because, as he said, it could never be anyone but me. No one else. Ever. I was it for him and always had been. (This became a running joke in his family over the years, hey J, when are you going to settle down and find yourself a nice wife etc? J -  “if I were to, it would only ever be with OP” commence the eyerolls from his family. Because that was considered mere wishful thinking after all these years, right?) \nI wish I had been so steadfast. Instead I went through a series of disastrous relationships, culminating with me ending up in a shelter for abused women, which was absolute heaven compared to decades of the hell from which I had finally managed to escaped from. So now we are together again. He is absolutely the only person on earth that totally gets me. We light up each other’s life. We are complete and we share our completeness with each other. After losing my family since they’ve passed away, his family has embraced me as their own. It’s been four years now and we love each other deeper each day. Life is beautiful and we are so blessed and grateful to the Divine forces for bringing us together and finally allowing us to find our purpose and place in this world where we continue to grow and blossom side by side.", "url": "https://www.reddit.com/r/happy/comments/dtt52l/we_were_best_friends_as_teenagers_now_we_are_in/", "title": "We were best friends as teenagers now we are in our 50s and never been so happy.", "social_network": "reddit", "user": "HappyEverAfterlife", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1573286635, "permalink": "/r/happy/comments/dtt52l/we_were_best_friends_as_teenagers_now_we_are_in/", "nsfw": false, "first_save": 1635441443.4949095, "replies_charged": false}