{"id": "t5_2qh5i_t3_2cvb1o", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "As a child I never learned how to ride a bike. I was born with a rare facial disorder which meant I spent most of my childhood in and out of the hospital and, because my ears are severely deformed, my sense of balance has always been poor. In short, I never learned how to ride and the short time I tried as a child I never got past my training wheels.\n\nI graduated college this year and for a present my best friend of 21 years bought me a single speed bicycle. I picked it up last night, hung out with him for several hours then went to sleep. Tonight at about midnight, I put on my pads and helmet, took my bike into my driveway and proceeded to fall down...a lot.\n\nI fell to the left, I fell to the right, I even went over my handlebars once. Finally after 45 minutes of falling I pedaled for 5 feet and then I fell. I got back up, sat on the bike and pedaled for 15 feet and then I fell. I got back on and pedaled for 25 feet, past where I park my car, and I got way too excited and this is where I went over my handlebars. I got back up and pedaled, wobbling from side to side, and pedaled, and pedaled and I made it to the end of my driveway, probably a good 50 feet and only stopped because I don't have a light yet and it's really dark past my driveway...and then I pedaled all the way back without falling.\n\nI feel amazing. There were a lot of people who said I would never be able to balance well enough to ride and I just proved every single one of them wrong. I have a lot to learn but it's never too late to make our dreams a reality.", "url": "https://www.reddit.com/r/happy/comments/2cvb1o/at_25_years_old_i_rode_a_bicycle_for_the_first/", "title": "At 25 years old, I rode a bicycle for the first time", "social_network": "reddit", "user": "Copo55", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 444, "down_vote": 0, "creation": 1407402399, "permalink": "/r/happy/comments/2cvb1o/at_25_years_old_i_rode_a_bicycle_for_the_first/", "nsfw": false, "first_save": 1635438945.4347937, "replies_charged": false}