{"id": "t5_2qh5i_t3_7mrtkw", "request": ["e660e09a-842d-44ca-8826-ddfa61319574", "c889a480-189a-4ed9-aa88-81c300413196"], "text": "Roughly a year ago around this time, I got into a relationship that most would consider less than phenomenal and surprisingly it didn't last as long as we tried to shout to the heavens that it would. Thankfully whenever the contemplation of moving in together started to formulate it became abundantly obvious that I was simply falling out of love with him. I broke it off mid July and sort of just lost myself. I started floundering at my job and simply not taking care of myself. Focused more on just getting to the next check, paying the bills on time and mindlessly shuffling through everything. I was glad I could keep the roof over my head and my car to actually get to and from work but past that I was just a worker drone who went to and from work, silently choking the chicken in my apartment. \n\nLife at that point wasn't good.\n\nThen in the middle of September, Hurricane Harvey swung its ugly head through my neck of the woods and flooded out my place. With nothing but what little clothes I managed to salvage from the flood, my computer, and my car, I was given the greatest thing anyone in those troubling times could receive. \n\nA place to stay, with friends.\n\nMy supervisor, offered up her home to me while I was in between finding a new place to live and coping with the flood. She, like the saint that she is, also let several members of her family stay with her. That's when I formally met her twin sister for the first time, and found myself kind of crushing on her. It was really weird at first, coping with the fact that the woman was my boss was oddly attractive with a completely different personality. Through the multitude of interactions me and her have had in our short tenure together in our temporary place, we decided to try it. \n\nNeedless to say, otherwise this would have ended up in other sub, we hit it off beautifully. We had our first 'official' date last night, and it was the greatest 4 hours in traffic that I ever spent with another person. She's so charming, witty, beautiful, and any other positive adjective you could imagine to describe someone you've recently fallen in love with.\n\nI know it's early to celebrate this greatly with a hilariously vague Reddit post, but who cares, I'm happy for the first time in a while, and that's what the sub is about, isn't it? ", "url": "https://www.reddit.com/r/happy/comments/7mrtkw/lifes_good/", "title": "Life's Good", "social_network": "reddit", "user": "Swagnix", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1514519211, "permalink": "/r/happy/comments/7mrtkw/lifes_good/", "nsfw": false, "first_save": 1635439397.8426707, "replies_charged": false}