{"id": "t5_2qh5i_t3_mhzfds", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716"], "text": "I work at a grocery store, and I am autistic. The following story happened to me during the last half hour of my shift.\n\nMy usual task at work is to sweep the store. When I got to the deli department, a customer asked me where the hot soup is. I showed her where it is. She told me that she saw a man outside the building who may be homeless, and wanted to give him something warm to eat. I told her, “Wow, that’s really nice of you to do that!” We were both struggling to get the lids apart, and I told her that I think I was having trouble with it because my weak right hand. She asked why it’s weak. I asked if she’d have a problem if I got too personal, and she said that it’s fine. I told her that I was born prematurely, and besides having autism, I had a brain aneurysm that made the right side of my body weak. She apologized out of sympathy, but I just told her, “Don’t apologize! I lived with it my whole life. It makes me have something that not many people have.”\n\nAfter getting the soup, she tells me that she needs to buy a few more things. I tell her that I can help her look for them. While we were walking, I asked if she’s been to the store before. She said that she hasn’t been there in a few years. She also opened up to me about how she moved back to town with her dad because she’s been struggling with mental issues. I could tell that she was comfortable enough to tell me that. And I totally understand that sometimes, customers just need someone to listen to them. I really appreciated that. She talked to me like I was an old friend of hers. At one point, she even offered to buy me a lunch, but I told her that my shift was almost over, so I didn’t need anything. But I let her know that I really appreciated her offering.\n\nBy the time I walked to to a register to check out, my shift was over, and I still needed to complete the store sweep, but I didn’t care. She thanked me for helping her. What she told me next really surprised me. She said that she would love to see me again, and go out for lunch or something. I told her that that would be awesome, as pretty much all of my friends live out of state. I have a set work schedule, so I told her which days I work. I told her that I had a stressful day (everyone getting ready for Easter), and she made my day so much better. She gave me a whole bunch of hugs, introduced herself to me, and told me she’d see me later. I ended up making a new friend. Emily, if you happen to read this, thank you for being so kind. You have a good heart, and you are a beautiful person. I hope this will be the start to a great friendship.", "url": "https://www.reddit.com/r/happy/comments/mhzfds/something_amazing_happened_to_me_at_work_yesterday/", "title": "Something amazing happened to me at work yesterday.", "social_network": "reddit", "user": "TheGirlWithTheLove", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1617295583, "permalink": "/r/happy/comments/mhzfds/something_amazing_happened_to_me_at_work_yesterday/", "nsfw": false, "first_save": 1635439607.4486527, "replies_charged": false}