{"id": "t5_2qh5i_t3_9o1ikb", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "&#x200B;\n\nTL;DR  at the bottom \n\nThere are little mementos from my childhood about my mother that stand out, like the hair tie with little beads on it that she wore in labour with me, and continued to wear throughout the years, or the way she smelt like home, up until she moved in with her boyfriend, whenever I hugged her.\n\n&#x200B;\n\nWhen I would go in her room to sneak extra cuddles or say goodnight she would be in her bedtime routine and would put on this tinned lip balm. I remember vividly watching her do this throughout the years and how it made me think of her mom too. The tin had an old timey photo on it and the balm smelt like cinnamon. \n\n&#x200B;\n\nOnce, when I was visiting from Uni, I noticed she was running out of the lip balm. I was thrilled at the thought of getting her a new container of it for her birthday in March. Unfortunately, the company had long since stopped making the scent (who would have thought after over 20 years ha). I clinged to this memory though and I wasn't ready to lose another childhood comfort. \n\n&#x200B;\n\nI emailed the company explaining how my mother had had the balm forever and how I would like to know if they had any at all. The lady was very friendly and told me the other options they had available. I couldn't just give my mom a substitute scent, so I put it to the back of my mind. \n\n&#x200B;\n\nThe middle of October rolls around and I get an email from the company \"Dear Friends,\n\nWe heard your requests, and we brought them back—Cinnamon Bay and Chai Rose Lip Balms are here once again!\" \n\nThey listened, I can't imagine anyone else was requesting this scent but, the company listened and they brought it back! \n\n&#x200B;\n\nExcept, only in the United States, and they don't ship to Canada. I was committed. I ordered FIVE lipbalms-no longer in tins sadly but thats okay-to my dad's house in the states, and had him bring them over when he visited around Christmas. \n\n&#x200B;\n\nMy mom was surprised to find them in her stocking and is happy to have her lipbalm in more than one place. \n\n&#x200B;\n\nI am happy to know I can be reminded of my granny, say goodnight to my mom, and admire her as she goes through her bedtime routine.\n\n&#x200B;\n\nTL;DR Moms favourite lipbalm was running out,  I contacted the company and they brought the scent back for a Christmas special months later. :)\n\n&#x200B;\n\n&#x200B;", "url": "https://www.reddit.com/r/happy/comments/9o1ikb/good_company_helps_extend_childhood_memory/", "title": "Good Company Helps Extend Childhood Memory", "social_network": "reddit", "user": "missthatisall", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1539509290, "permalink": "/r/happy/comments/9o1ikb/good_company_helps_extend_childhood_memory/", "nsfw": false, "first_save": 1635440717.972457, "replies_charged": false}