{"id": "t5_2qh5i_t3_axol63", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "Just like the title says, me and my SO are so incredibly touched and honored that the local shelter would use the story for their grant. We cried tears of happiness over the idea that so many more cats will be adopted to loving homes because of a simple donation. We didn't do it for any particular reason other than that we had adopted a cat from that shelter whose adoption had been paid for and we wanted to pass it along. I've loved animals all my life; I've had a special place in my heart for cats after a cat I had rescued saved my life. When she passed away 3 years ago from cancer, I was diagnosed with an anxiety disorder that I had actually had all my life. When she passed away, my anxiety got 10 times worse and I was hospitalized. Had she not been in my life, it would have gone unchecked and I may have committed suicide. She is my heart and soul, and everything I do is for her. She kept my anxiety under control, even if I didn't realize it at the time. I am so overwhelmed with happiness and gratitude for the shelter and for all of those cats; I haven't felt like this since our wedding day. Please consider fostering, adopting, volunteering your time, or even just donating a few dollars or supplies to your local shelter. You never know what good could come from that. [Required Pet Tax](https://imgur.com/a/EnwI817)", "url": "https://www.reddit.com/r/happy/comments/axol63/a_few_months_ago_we_paid_the_adoption_fee_for_an/", "title": "A few months ago we paid the adoption fee for an adult cat. We just got informed that the story was used for a grant which the adoption agency was just awarded which will pay for 40 more adult cats to be adopted!", "social_network": "reddit", "user": "Green_Day_16", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 19, "down_vote": 0, "creation": 1551811394, "permalink": "/r/happy/comments/axol63/a_few_months_ago_we_paid_the_adoption_fee_for_an/", "nsfw": false, "first_save": 1635441301.5705934, "replies_charged": false}