{"id": "t5_2qh5i_t3_mzbcv3", "request": ["5bcd7a82-c8bf-45e5-9556-cc778b964467", "258e332d-215f-495f-8bee-bccd57229f62"], "text": "Lately I've been sad and angry due to the state of the world right now. It just seems like many people have forgotten how to just be human beings. So I love seeing and reading people doing things for others for no other reason except helping a fellow human. Today I was blessed with the opportunity to do so. \n\nAs I said earlier, I'm sad and angry and that was the state of mind I was in when I walked to the store today. In fact, I was extra grumpy because I had already gone to the store earlier and they were out of what I wanted and told me to come back a few hours later, so this was my second trip. \n\nAs I was walking home I noticed a young girl walking a block ahead of me and a man and his toddler behind me. I wasn't really paying much attention, I just wanted to get home and figure out why I wasn't getting sound to one of my ear buds. When I got to my house I saw the girl, who was walking in front of me, sitting on my steps looking dejected. I asked if she was okay and if she was thirsty. She just asked if she could use my phone. I figured she was going to make a call, so I unlocked it and gave it to her. She was actually looking at Google Maps to figure out how far she was from home, and she told me her story.\n\nShe had gotten out of school a few hours earlier and the bus was late. Her dad was supposed to pick her up and he must have been late, so she decided to walk home. She ended up getting lost and had been walking around for three hours trying to get home. I've been there, so I felt so bad for her. From the map I could see it would be another hour of walking to get from my house to hers. So I decided to get her safely on the bus to get home.\n\nI invited her inside because the bus wouldn't be arriving for another 30 minutes. I let my sister know what was going on and grabbed my change bag to get bus fare for her. My sister, offered her to share her dinner with her. She mentioned that she hadn't eaten since lunch at school. I grabbed her a bottle if water and we (my sister and I) ordered her an Uber. The Uber arrived right as she finished eating and I saw her to the car and waved her off. Both my sister and I were in a good mood just from being able to help her.\n\nAn hour later the doorbell rings. She came back with her mom, dad, and brother. They came back to our house to thank us for making sure she got home safely. They had been searching for her and called the police to find her. To say they were relived would be an understatement. That they came all the way back just hits me in my feels. I wasn't looking for thanks or recognition, I just wanted to make sure she made it home. \n\nNow, instead on being sad and angry, I'm feeling happy and squishy. I'm going to go happy cry now, thank you for reading.", "url": "https://www.reddit.com/r/happy/comments/mzbcv3/my_sister_and_i_helped_a_lost_girl_get_home_safe/", "title": "My sister and I helped a lost girl get home safe and sound.", "social_network": "reddit", "user": "SylverFyre777", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 34, "down_vote": 0, "creation": 1619480590, "permalink": "/r/happy/comments/mzbcv3/my_sister_and_i_helped_a_lost_girl_get_home_safe/", "nsfw": false, "first_save": 1635439166.7145238, "replies_charged": false}