{"id": "t5_2qh5i_t3_3fp40h", "request": ["608fc108-cf44-476e-8378-c59ee7483909"], "text": "Hi everyone,\n\nI'm Violets and for a very long time I've suffered from an emotionally abusive family, Aspergers Syndrome and Anxiety/Depression. Ironically through these struggles, I've always maintained an inner core of passion and idealism. Perhaps it's been my downfall, but regardless it's inspired me to become a better person throughout my life. For example, I never want to be like my family and my dreams have always been to help other people. I used to be very interested in politics, hoping I could change the world through activism.\n\nHere comes the band; Rise Against. This band means a lot to me. My mother bought me one of their albums by accident when I was fourteen, and it was only one of few LPs I could  ever listen to on repeat; no skippies. They're activists, they talk about injustice and hope, hope that we're able to change things as the present is not too great. I used to want to be an activist too, but then came the depression which took it away. However, I want to become a Social Worker instead so I can help children in need of love.\n\nI first saw them in 2011 at the beginning of my anxiety disorder and I cried my eyes out. There was this one song called \"Ready to Fall\" and Tim McIlrath (lead singer) made us sing the refrain. It was cathartic. It was beautiful. It was cleansing. I can truly say this concert helped me heal. They as a band have stopped me from suicide multiple times and inspire me to continue.\n\nFast forward to this week, I'm bored at work and I browse concerts. I see Rise Against playing here in Sydney about six days before I turn twenty. I ask my SO of one year if he wants to join me - knowing my passion for this band and how they've helped me - and he happily buys tickets not only for himself, but for me as a gift!\n\nI cannot wait to see Rise Against and make another healing memory, but now this time in a mosh with the love of my life. It's been a while I've felt happy on the inside :)\n\n**TL;DR** Rise Against has helped me heaps from a shitty life. Seeing them again this year with my SO. Ecstatic doesn't begin to describe how I feel.", "url": "https://www.reddit.com/r/happy/comments/3fp40h/im_going_to_see_my_favourite_band_again_this/", "title": "I'm going to see my favourite band again this December!", "social_network": "reddit", "user": "Violets11", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1438654037, "permalink": "/r/happy/comments/3fp40h/im_going_to_see_my_favourite_band_again_this/", "nsfw": false, "first_save": 1635441496.4403055, "replies_charged": false}