{"id": "t5_2qh5i_t3_aoyr56", "request": ["e660e09a-842d-44ca-8826-ddfa61319574", "ea4a7795-7887-476a-9ab2-4c77d117a852"], "text": "I swear it was like it came straight out of a movie. It was about 4 years ago, my first day of English class sophomore year of high school. I was sitting 3 seats behind a new boy in my class, heavily taking notes. The following is what he later relayed to me:\n\nHe was sitting in class, looked back towards the clock, and saw me. He thought to himself, “I need to talk to her!” So for the remainder of the class period, unbeknownst to me, he preceded to pretend to drop his pencil and pick it up or pretend to be looking at the time so he could look at me again. He must have done it about 20 times he said, but I, who was buried in my notebook, didn’t notice. He sat there all period thinking of ways he could somehow approach me and ask for my number. Being the really shy guy he is, that was extremely nerve wracking for him. Then, in a glimpse of chance, our English teacher said we were going to be doing a project and had to work with the people in our row. He thought, “This is it!!” I, the devoted student, however, just thought “There’s a new boy sitting up there, I wonder if he will pull his weight or if I will have to do it”.\n\nAs I preceded to stand up and tell my group members how I, miss young and driven, will do all the work and that they would only be allowed to edit it, I glanced down and saw the most wonderful thing I have ever seen in my life. It was his face, smiling up at me. My first thought was “Wow, he’s beautiful”. I had seen boys before, but I had never, ever, seen any boy that looked as gorgeous as he did that Tuesday. I did not allow my rapid heart beat to derail my focus for long, of course, and preceded to tell them to let me do all the work. We all exchanged numbers (to his delight) and went on our way.\n\nThat night, I was texting in the group chat asking if anyone had any preferences for our PowerPoint format. Immediately, he messaged me outside the group chat with his answer. I thought, “He must not be able to text in a group chat or something” and directed my thoughts back to work. The next morning, he responded to me individually again! I thought, “He seems really nice, I’ll ask him where he’s from. He must not have many friends having just moved here and all.” And then we started texting back and forth.\n\nAround 10 text messages was all it took. I knew after that that he was the one for me, that he was different than any other boy in the entire world. He was charming, sweet, goofy, and really intelligent. He was everything I had ever wanted, but I didn’t even know I wanted until then. I honestly had never felt that way before, and all it took was a few text messages.\n\nFast forward 4 years and we both attend different colleges, but are as in love as ever. Right after we graduate, I plan to marry him and start our lives together.", "url": "https://www.reddit.com/r/happy/comments/aoyr56/we_met_in_high_school_this_is_the_day_we_met/", "title": "We Met in High School: This is the Day We Met", "social_network": "reddit", "user": "yellow_fisherman", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1549758876, "permalink": "/r/happy/comments/aoyr56/we_met_in_high_school_this_is_the_day_we_met/", "nsfw": false, "first_save": 1635439393.3506842, "replies_charged": false}