{"id": "t5_2qh5i_t3_iadaux", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "My niece is a month shy of turning three and has a variety of delays in communication, socialization, cognition, fine motor skills, as well as sensory issues and autistic tendencies. I’ve spoken about her before [here](https://www.reddit.com/r/offmychest/comments/bc7q4k/my_niece_is_autistic_and_nobody_is_listening/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Since that post she’s made a lot of progress. She is now in speech and occupational therapy. She speaks a lot more and is a lot more social, although she is still very much not a typical three year old. Yesterday she had such a great day. She let me hold her(she is very shy with people and takes forever to warm up to them, won’t go near you unless it’s someone she sees often like her parents. I don’t see her much because I’m a college student with a job not to mention covid), gave me kisses on the face for the first time, and said my name for the first time. It was all I could do not to bawl my eyes out because this is a child that two months ago couldn’t string two words together, a kid that opens the door and runs into the street and doesn’t really understand “no” or “stop,” a kid who has never said her own name. Although I’ve tried to keep an open mind and hope she’ll improve, I’d still very much accepted the distinct possibility that “Auntie” was a word I’d never hear. I’m so happy I want to scream it from the rooftops and bake a gf cake.", "url": "https://www.reddit.com/r/happy/comments/iadaux/my_developmentally_delayed_niece_said_my_name_for/", "title": "My Developmentally Delayed Niece Said My Name For The Very First Time", "social_network": "reddit", "user": "SinfullySinatra", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 38, "down_vote": 0, "creation": 1597518290, "permalink": "/r/happy/comments/iadaux/my_developmentally_delayed_niece_said_my_name_for/", "nsfw": false, "first_save": 1635442850.3885796, "replies_charged": false}