{"id": "t5_2qh5i_t3_2n1h2p", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "I have been taking measures to improving my life. They are small steps, but they are crucial. Three and a half weeks ago, I started taking an antidepressant. This is the first time in my entire life that I've voluntarily committed to actually taking them, and the first time in several years that I've even considered being medicated, again. Here I am, having good days, as opposed to the kind of bleh days I would have everyday. I'm finding it easier to make the decision to take a walk, enter my meals in my calorie counter, and, in general, choosing to be happier. For the first time in so many years, I am finding wiggle room, where I have been so stuck. For the first time in so long, I am finally starting to be able to see over that mental/emotional wall to, what could be, my success, my advancement. It doesn't seem so impossible for me to get through that wall, and I'm finally starting to be able to carve my own door through it. For the first time in way too long, I feel hopeful for myself. Just having made it this far, that is a major achievement for me. I will keep making my tomorrows better, because, now, I know I can. :)\n\nI've been on every mood stabilizing drug there is. I was (mis)diagnosed as bipolar as a teen and heavily medicated for several years. One day, my Grampa had a heart attack and needed a quadruple bypass. That day, I stopped taking all my medications, and tried to figure my own head out. I was stable for 6/7 years, without medication. I tried antidepressants, again, last year with no commitment, and, as a result, no improvement. So, I stopped. Gave up. Until last month. I had had enough. I had the misfortune of losing a best friend who I love, but realized wasn't healthy for me, family traumas, overwhelming inability to function, and crippling lack of motivation. I desperately wanted to be better, I cried over dreaming about being better. I decided I needed to have help. It was the right time. Unlike every time I'd tried before to help myself, I'd hit rock bottom and realized that I needed help to help myself. So, I'm taking antidepressants, again, the same one I've tried before, actually. And this time, because I want more than anything for it to work, it's working, I'm getting better.\n\nGuys, you don't know how long I've waited to say that I'm finally getting better.", "url": "https://www.reddit.com/r/happy/comments/2n1h2p/i_am_getting_better/", "title": "I am getting better.", "social_network": "reddit", "user": "DevilishDreamer", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1416617912, "permalink": "/r/happy/comments/2n1h2p/i_am_getting_better/", "nsfw": false, "first_save": 1635438850.6105378, "replies_charged": false}