{"id": "t5_2qh5i_t3_m9fj9u", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "So I made a post and put it in a few other subreddits a few days ago about how me and my wife separated when my daughter was a teenager and though it was amicable, it wasn't pretty in the slightest. Toxic and loud in the months leading up to the separation, and she had to listen to all of it. And life after separation wasn't much better either. I was angry, a sad sack, and I took it out on my daughter not by being abusive or anything like that, just uncaring. Uncaring and also a drinker. Scum is what I was. No good scum, and I'm not surprised she found herself closer to her mom than me. I walked that line for so long since I felt like a failure for not being there. \n\nBut as I also said in my post, I had a dream that inspired me to write a letter to her aplogizing for everything and getting it off my chest, telling her how much I loved her. And after getting off the phone with her a few days ago, she agreed to come home and see me, which she did yesterday afternoon. It was a short trip though. I hugged her tight as soon as she stepped on my porch, but she didn't make the attempt to hug me back, only asking that we talk. So we went inside and I sat down on the couch but she didn't, instead standing in front of me and saying immediately \"You don't get to be sorry\", and I knew I was in for it. \n\nYou know that thing in movies when someone's getting torn apart verbally by someone else and it perfectly expresses their guilty conscience? That's exactly what she was doing, and she made me feel so tiny emotionally. It was just \"Where were you when...\" and \"Why did/didn't you...\" over and over again, and she's inching closer and closer to tears by the minute while I just stayed silent. It was like a knife cutting deeper and deeper with each sentence as she tore my world apart deservedly so, and it was all over in less than five minutes. I tried to get up and comfort her but she pushed me away and stormed out. \n\nI didn't get much sleep that night for obvious reasons. But I did get an unexpected phone call from my ex-wife the next morning. She had spent the night at hers and she showed her the letter I sent her. \"Did you mean it?\" she asked. \"Every word\" I replied. And then I basically said \"Everything I said to you before we separated..I'm sorry\" and she replied \"Me too\". \n\nShe then told me that she convinced our daughter to see me before she went back up to school and she was already on her way to my place. My heart was racing when she walked up and this time she looked at me with an unsure expression,idk she didn't know if she wanted to be there again but also didn't want to regret not coming. \n\nWe sat down next to each other and I couldn't find my words even until I all of a sudden grabbed her and pulled her close to me and started crying my eyes out, aplogizing profusely and repeating \"Oh God I'm so sorry\". She also started crying and held on to me with all her strength saying \"It's okay dad, it's okay\" and we sat there in each other's misery. \n\nAny semblance of my old self was gone out the window by now and I was nothing. But we eventually both calmed down enough and I held both of her hands and got her to look at me. \"I'm here for you baby\" and told her how much I love her, how much she means to me and that I wasn't going anywhere. \n\nShe smiled for the first time in forever not necessarily out of pure love and affection, but more of an understanding that we reached. A smile that said she trusts me at my word. She also clarified saying \"I never hated you. I just hated that you never let me say what I wanted and made me feel like I wasn't worth listening to until yesterday\". I just nodded in agreement and replied \"Yeah, I guess I did\". We exhausted verbal apologies at this point and we were simply on level ground at this point, reaching an understanding. \n\nAnd from there we could build our relationship back up. So to do this, I started by asking her how everything was going with school, life, all that, genuinely interested in what she had to say. She spends about the next 10 minutes filling me in on all her goings-on and even that she had gotten accepted into a fraternity for her major. \n\nI was smiling the whole time because some small part of me knew I finally had my daughter back. And once she was finished, I just made one quick mention that I did talk to her mom and aplogized to her about all the things we said between each other before the separation and she simply replied \"Good\". I was still holding her hands at this point, by the way. \n\nI also asked her what she thought about the letter I sent her and she laughed a little, just saying that it was sweet but that she wished I would have said all of it sooner, and I agreed that I should have. Long ago I should have.\n\nIn the end, I asked her if she wanted to do anything together before heading back to school and she said she just wanted to see her friends and spend the day with them. But she did say she wanted to spend the night at my place since I'm closer to her school, and that made me pretty happy. Before she left I hugged her one last time, kissed her forehead and told her I love her and she gave the most genuine, heartwarming \"I love you too, dad\" I heard in a long time. \n\nThat's all I have to say about that. Sorry again for the length of all this. I probably won't be using this account again for a while unless something noteworthy happens. I'm sure my story is pretty boring and kind of sappy for this site but I'm just being honest. It's just amazing having her back. Even when we sat down and had breakfast together this morning you could just tell everything was different for the better. I don't deserve her, but she deserves the world. And I'll give her just that if that's what it takes for her to be truly happy.", "url": "https://www.reddit.com/r/happy/comments/m9fj9u/me_and_my_daughter_are_back_on_good_terms_again/", "title": "Me and my daughter are back on good terms again and I'm back in her life. Couldn't be happier", "social_network": "reddit", "user": "unwrittencarrier23", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 20, "down_vote": 0, "creation": 1616272298, "permalink": "/r/happy/comments/m9fj9u/me_and_my_daughter_are_back_on_good_terms_again/", "nsfw": false, "first_save": 1635439313.2261422, "replies_charged": false}