{"id": "t5_2qh5i_t3_f1pt4i", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "Mindfulness is about being fully present and aware of where we are, what we're doing, how we feel, and what we think on a moment by moment basis. By doing so, we wake up to the inner workings of our mental, emotional, and physical processes and understand why we are the way we are, think the way we think, and feel the way we feel. This understanding, coupled with acceptance leads to deep peace in the here and now.\n\nThe four best ways to develop mindfulness are:\n\n1. Pay more attention - Try to take the time to experience your environment with all of your senses; touch, sound, sight, smell, and taste.\n2. Live in the moment - Try to intentionally bring an open, accepting and discerning attention to everything you do. Find joy in simple pleasures.\n3. Accept yourself fully - Treat yourself the way you would treat a good friend, with patience, empathy, and kindness.\n4. Mindfulness meditation - Allow the mind to flow naturally and simply observe where it goes. Ground ourselves in our observing nature and watch life play out like a movie.\n\nMindfulness has changed my life as it has to everyone who has cultivated it in the past and present. It is about developing something we all have innate without ourselves, being our observing nature that's free from discriminations, criticism, and judgments.\n\nI talk about it in detail in [this video](https://youtu.be/lxXS6PCPTCw). Please take a look and let me know what you think! =)\n\nBest wishes to you and your mindfulness journeys.", "url": "https://www.reddit.com/r/happy/comments/f1pt4i/practicing_mindfulness_in_meditation_and_everyday/", "title": "Practicing mindfulness in meditation and everyday life has completely transformed my being. I was a big blamer and complainer who is now more mindful of the simple joys in life, and that helped me find meaning and purpose in life. Here's what I think about Mindfulness Meditation.", "social_network": "reddit", "user": "sickient", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 24, "down_vote": 0, "creation": 1581338788, "permalink": "/r/happy/comments/f1pt4i/practicing_mindfulness_in_meditation_and_everyday/", "nsfw": false, "first_save": 1635442231.1899426, "replies_charged": false}