{"id": "t5_2qh5i_t3_15jcc4", "request": ["ea4a7795-7887-476a-9ab2-4c77d117a852", "8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "My Christmas exceeded my expectations by far!\n               \nI went home to my parents’ house for Christmas vacation. I was expecting to have a fine time, but I had a really great time! I had so much fun! My boyfriend had to go visit his family, but luckily I was so busy I didn’t have *too* much time to miss him.\n               \nSunday my mum and I did some pottery together. I made a little dog for my mum, a turtle for my brother, a platter for a coworker and a mug for my boyfriend. None of my creations were ready to be fired before I left, but my mum will fire them when they’ve dried and I’ll glaze them the next time I go home. We also went and saw my Great Aunt Gwen, who I don’t get to see very often.\n              \nMonday we all went to my grandma’s house for a Christmas Eve party. My sister came with her boyfriend and their two kids. I hadn’t seen my nephews (ages 3 and 1) in over a year – they are such a delight! I got a print of a beautiful painting that my grandma did. \n            \nTuesday we had so much fun watching the kids open all their gifts. My nephews are so sweet, they spent a lot of the day hugging me and climbing up me, they’re very cuddly :) My boyfriend gave my little brother (age 8) a board game that he likes – I spent the evening playing that with my bro, we each won once!\n                \nThe reason I thought I might not have the best time ever is because my sister’s boyfriend is not a very nice guy and he doesn’t like my family a whole lot – especially not me. I won’t get into all his jackassery since this is a **happy** post, but I have to say, I was pleasantly surprised! He seemed moody at first and wouldn’t really talk to anyone, but on Christmas day he started acting a lot nicer, he talked to me a little (he has barely spoken to me in the past 3 years) and when I was leaving he gave me a hug and helped me with my bags!\n              \nI’m not super into material things, but I really love Christmas and finding the right things for everyone. I feel like I did a pretty good job of getting things each person in my family would love. My favorite thing that I received is an antique tea pot that matches the set I inherited from my great grandmother.\n", "url": "https://www.reddit.com/r/happy/comments/15jcc4/i_had_an_excellent_trip_home_for_the_holidays_it/", "title": "I had an excellent trip home for the holidays, it was so fun!", "social_network": "reddit", "user": "RegularOwl", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1356642732, "permalink": "/r/happy/comments/15jcc4/i_had_an_excellent_trip_home_for_the_holidays_it/", "nsfw": false, "first_save": 1635440229.5177493, "replies_charged": false}