{"id": "t5_2qh5i_t3_m6o62d", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "A two story single-family home in the suburbs that will still allow our daughter to go to the same school she does now and is honestly just perfect in every way. My wife passed away a year ago and we always dreamt of owning a house, even if it was just the three of us. I honestly can't even express how happy this whole situation makes me.\n\nI took a tour of it a few months ago with my daughter and I myself fell in love with it immediately. It has just about everything we could ever need from a space perspective and also has spare bedrooms that I especially want to have a home office in one. It's nothing too big, but I know my wife would be more than satisfied if she could see it.\n\nThough, obviously, my girl was a little less than thrilled about the prospect of moving at first for one obvious reason: she's never moved before. The apartment we're at now is all she's ever known. Though I got some advice from both my family and others on this site about how to possibly get her more on board with wanting to move, since her mom's passing was still on her mind. So I had an idea and am going to not only let her paint and decorate her room however she wants, I'm also going to give her some things that belonged to her mom. One is an old fashioned makeup mirror (or whatever it's technically called) that she had when she was growing up, and the other is a jewelry box with a ballerina in it that was actually my wife's grandmother's. I showed both of them to her and immediately I saw a change in her. I also told her I'd let her paint both of them on her own if she wants.\n\nHome inspection has already been done and nothing noteworthy to affect the sale was found since the owners had been taking exceptional care of it since they moved in, even adding on to it in a few places. My landlord also knows about the move and the timing was extremely important since my lease ends this month, and he's basically gonna give me a month or so to move everything out once it's up.\n\nBut honestly, the thing that made this all easier is my girl. Ever since I told her about her getting my wife's mirror and jewelry box, she's been significantly more into the prospective move. She's been a little forlorn though, just knowing how many memories she's had here. And it's shaken me up a bit too. This is the same place we brought her home from the hospital to when she was born, where almost all of her birthdays have been and so much more. But I know my wife lives on through her, so she's never far away.", "url": "https://www.reddit.com/r/happy/comments/m6o62d/i_did_what_my_wife_always_wanted_to_and_am_in_the/", "title": "I did what my wife always wanted to and am in the final steps of getting our first house", "social_network": "reddit", "user": "huntsman_459", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1615942566, "permalink": "/r/happy/comments/m6o62d/i_did_what_my_wife_always_wanted_to_and_am_in_the/", "nsfw": false, "first_save": 1635440692.9896953, "replies_charged": false}