{"id": "t5_2qh5i_t3_z9ruy", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11"], "text": "As kids, many of us have dreamed of superpowers.  We wanted to be the batman, spiderman, superman, wonderwoman, of the comics or stories we have read.  We wanted to be able to save the world.  We wanted to be able to do some genuine good for the people around us.   We dreamed and we dreamed but as we got older, these superpowers seemed unobtainable.  And some of us stopped dreaming.  But the dream is still alive and living.\n\nWhat if you already had superpowers.  What if all the superpowers are already within you?  I believe they are within all of us.  They are your ears, your eyes, your mind, your soul.\n Listen, observe, learn, love. \nYour superpowers are already within you.  You can save the world.  It may take a little sacrifice on your part.  It may take a little less worrying about the good of yourself and a little more appreciationg the people around you.  While doing good for others around you, you may find that bliss return to you.\n It just takes a little love.  A little love for the student that sits by himself in class.  A little love for the waitress doing her best to pay her way through college.  A little love for the people that cannot attain the opportunities that some of us are blessed with. \nCarpe Diem.  Seize your opportunities.\nThe more love you give, the more love will be returned.  The more love you have, the more love you can give.  If you love, spread the love.  Become the hero of your dreams.  Make the world a better place not for yourself but for the other lives around you. \nIt takes a little love, to give a little love.  Spread the love and that love will return to you.\n", "url": "https://www.reddit.com/r/happy/comments/z9ruy/we_are_all_the_heroes/", "title": "We are all the heroes", "social_network": "reddit", "user": "FlowAsWater", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1346657870, "permalink": "/r/happy/comments/z9ruy/we_are_all_the_heroes/", "nsfw": false, "first_save": 1635439221.2196245, "replies_charged": false}