{"id": "t5_2qh5i_t3_k3661i", "request": ["2293bc08-7671-4d63-b63f-dbe4a3a4858a", "e9d5c1b3-4f2e-427b-a98e-af434f9cf1da"], "text": "I’ve been dating my girlfriend officially for about 6 months now but we’ve been “dating” since late March. Today I went Christmas shopping for her and for once I actually enjoyed shopping for someone other than myself. Its a weird experience for me because ive always hated shopping for my exs in the past but for some reason with this girl I absolutely love it. My ex’s always seemed fake excited when I got them gifts which made me not want to do it anymore and i constantly felt like I had to outdo the previous things Id got them to warrant any sort of reaction other thanks “thanks babe”. With this girl its different however, I’ll randomly surprise her with gifts that I think she’ll like and she’ll break down crying and use them or wear them nearly everyday for weeks at a time and it makes me so happy to know that she actually enjoys the stuff I get her. I was probably in Victoria’s Secret today for over 2hrs, absolutely loving looking for cute clothes for her and Im really excited to show her on Christmas. This girl makes me really really happy and I feel like my heart skips a beat when Im with her and i apologize that im making you all read this but I wanted to get that out there but it makes me really happy to be with someone who appreciates my efforts", "url": "https://www.reddit.com/r/happy/comments/k3661i/this_is_the_first_time_ive_ever_actually_enjoyed/", "title": "This is the first time I’ve ever actually enjoyed gift shopping for a girlfriend and I was having so much fun with it.", "social_network": "reddit", "user": "ThatOneDudeWithAName", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1606639514, "permalink": "/r/happy/comments/k3661i/this_is_the_first_time_ive_ever_actually_enjoyed/", "nsfw": false, "first_save": 1635441071.1724498, "replies_charged": false}