{"id": "t5_2qh5i_t3_gj1xlf", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "I browse reddit casually and it had saved my brother from losing a testicle. \nYesterday, my brother (14) complained to me (23f) that his right testicle suddenly hurts a lot. Im back from Uni because of the lockdown and our mom is in hospital after an emergency back surgery, that's why he came to me first. I guess I usually wouldnt react the way I did, but for some reason I suddenly remembered a comment I read on reddit last week about some guy that had testicular torsion (testicle twisting around itself, if untreated in first hours it can die and has to be cut off). I call my relatives who have raised strictly boys - they never heard about it and tell me I am just reading the worst possible outcomes on the internet. By this point my brother is crying in pain so eventually we rush to the hospital. \n\nThe doctor confirms testicular torsion, my brother goes to surgery immediately after. We got there in the first hour since the pain started and they were able to save the situation. \n\nThank you reddit, Im happy you granted me the possibility of becoming an aunt in the future.\n\nEdit: Brother is recovering at home with a healthy dose of McDonald's, glued to the Xbox. Same old ways for him, no biggie. \n\nI am honestly feeling so glad and happy also because of the attention this post got, all of you redditors are doing yet again another great job by bringing awareness.  Who knows, maybe this post will be vaguely remembered again by someone that needs to act quickly. Thank you.\n\nLet's save more balls!", "url": "https://www.reddit.com/r/happy/comments/gj1xlf/yesterday_reddit_saved_my_brothers_balls/", "title": "Yesterday, reddit saved my brother's balls.", "social_network": "reddit", "user": "napanpa", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2391, "down_vote": 0, "creation": 1589386038, "permalink": "/r/happy/comments/gj1xlf/yesterday_reddit_saved_my_brothers_balls/", "nsfw": false, "first_save": 1635441301.9673085, "replies_charged": false}