{"id": "t5_2qh5i_t3_j6o9zi", "request": ["1d9bc0bf-4a1c-437e-94e7-5a07c99811fe"], "text": "I’m just really grateful.\n\nMy boyfriend (21M) and I (20F), have come a really long way in our relationship. He has matured a lot, and I’m happy to support him. I realized a lot of his passive behavior and immaturity came from depression he didn’t want to identify with. I made the choice to stay, and I thought the healing already started last year, but I realize it’s actually happening now. \n\nI was 300 pounds  and an undiagnosed type 1 diabetic as of last December. I’m now 230, and working out daily to now turn left over fat into muscle. I’m doing really well in college, have my cat Tinkerbell living with me, and gratefully unemployment has been keeping me a float. I plan on moving to another state with my partner, or without, to continue my dream of joining a trade school. \n\nI dance more often now. I have cut off nearly every friend I had in high school, as well as my boyfriend from his own group, because growing up meant realizing some people didn’t want to see you succeed. Gratefully, unemployment has given us thousands of dollars while our families are helping support us to stay a float in these troubling times (but trust me I’m looking for work everyday.) I can move all by myself and still be okay, and pay my own bills now. I have old friends who had been actual bullies, who still have nothing. And realizing those people didn’t belong in my life, made me the woman I am today. I’m just grateful to not be rude or degrading like they are. I’m just grateful I left the mix of things, because 2 years ago I was depressed and crying daily that I missed them so much. It was so much better to let go, because I’m much slimmer, smarter, faster, and I just... I’m flying. \n\nAnd now I have thousands saved, a stronger bond with the current love of my life, and soon a career to start. \n\nI’m just happy. Of course my relationship needs work, because we’re both always going through changes and we’re young. And working out with my health and body image isn’t always easy every day. But I am happy. I have my love, life, and family, and my kitty. I’m just happy. I’m grateful. And I hope everyone else becomes happier in these tough times too.", "url": "https://www.reddit.com/r/happy/comments/j6o9zi/i_was_300_pounds_extremely_sick_had_terrible/", "title": "I was 300 Pounds, Extremely sick, had terrible friends in 2018/19, and now : I’m a completely different person.", "social_network": "reddit", "user": "captaindrom", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 19, "down_vote": 0, "creation": 1602065529, "permalink": "/r/happy/comments/j6o9zi/i_was_300_pounds_extremely_sick_had_terrible/", "nsfw": false, "first_save": 1635440606.3988414, "replies_charged": false}