{"id": "t5_2qh5i_t3_uzhtd", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "I approached my last set of finals knowing that regardless of what happened, I had to attend school for one more semester with more than the 18-hour limit of classes than the 4 years I had expected.  That puts a lot of pressure on me to do well on finals.\n\nFirst, I was offered an internship during my first final.  My entire job in the presentation was to keep my mouth shut and I did so.  During the question and answer session afterwards, though, it seemed as if my ideas really wowed them.  I was pulled aside and discretely told that if I was interested in interning, they'd be happy to have me.  Unfortunately, when I attempted to get in contact with them afterwards, they said their position had been filled, but I was welcome to join during the fall.\n\nThe rest of my finals went great with my lowest grade being a C, which was actually much better than I was expecting and my highest being an A+ which I have never received as a final grade.\n\nNext, my first car, a hand-me-down, 11-year-old Lexus, had begun to randomly violently shake, lose traction, and become all-around unsafe for me to be in.  Although the problem was fixed, my parents had realized that this was the straw that broke the camel's back.  They had spent too much money over the years on that car and it was time to trade in.  Although my new car sounds like a step down from a 2001 IS 300, I'm very happy with my new Versa.  The MPG is great and has a ton of features I was missing, not to mention I don't feel as anxious driving it, considering the massive cost difference, but I won't turn this into a Versa commercial, I'm just happy that it worked out.\n\nShortly after finals ended, my macbook pro of 1 or 2 years stopped taking a charge(the remaining battery cycles had reached 0).  I took it into the genius bar, knowing I was safely inside my warranty timeline.  I gritted through the drive that was about an hour longer each way than it should have been as my local Apple store was closed for renovations.  After waiting for around 45 minutes, I was told that I had liquid damage(it took me a few minutes, but I remembered what caused it-not me, but a klutz from a few months prior) and although the battery was able to be replaced, they could not return my computer with a new battery without charging me for repairs(I had immediately dried my computer, started using what I call a \"keyboard condom\" and kept it safe, and there were never any problems in performance) which would total $1200.  I walked out, thinking I was sans computer, which I saw as needed for someone who wants to get into advertising, not to mention a student.  However, my good friend offered to build me a brand new computer from scratch without limiting me to OSX.  Using $200 less than the cost of the replaced MBP, he built me a mini-super computer(16GB of Ram, TB of memory, and the dual-slot video card which was able to run skyrim and assassin's creed 2 simultaneously with almost no blur).\n\nAfter a few years of cycling between loneliness and futile attempts to create a romantic relationship, I made friendly conversation with a gorgeous Subway employee who had caught my eye.  She made a damned good sandwich while giving me some sort of feeling that I needed to talk to her again.  I came back a week or so later(trying to seem nonchalant) and she suggests I come back on a weekday morning since she works every weekday and there are fewer customers, which I thought implied she wanted to talk to me personally.  I came back another week or so later as the only customer in the store.  I couldn't see her in the front, so I was wondering to myself if I should ask another employee if she had called in sick or something until she popped her head out of the back and waved.  We shot the shit a little, nothing too personal.  Once I was done eating, I tried to gather my nerves to ask for her number, but couldn't do it(That would have been my first time to ask).  As I got up from my chair, she told me not to go just yet, called me over to the register, and wrote her number on the back of the receipt, swearing she doesn't do this often.\n\nTo make a long story a little shorter, that was 2 fridays ago.  I didn't know before our first date that she had a three-year-old son and a few months ago, that might have turned me away, but my willingness to see where things led allowed me to meet this amazing kid that is impossible not to love.  This part might sound dishonest, but I love that I'm proving myself wrong when I say that I portrayed this adventurous personality who loves the outdoors and physical activity when before her, I might have spent half a day online gaming, smoking cigs(a pack a day at the worst), pot(if I could afford it) and drinking alone to excess(not that there's anything wrong with that).  But now that I've met her and given that impression, it's like my life is starting to become what I said it was, which I've found is much better.  I've almost stopped smoking cigs(1 cig every 3 or 4 days at most), pot(For some reason I'm drug tested now that I have an ADHD medication prescription) and drinking(once every week or two, and usually not alone), I've started working out and I'm getting more active to play with Owen(I forgot how much energy a 3 year old could have).\n\nFinally, just this past Monday, we shared our first kiss.  Not 30 minutes later, I walked into my first class for bartending school.\n\nI apologize for the wall of text, but I feel ecstatic to be who I am where I am in life.  If you made it this far, thank you for taking out the time in your day.  \n\ntl;dr: finals looked scary but I did pretty well.  My first car got dangerous, my parents bought a cheaper but better one.  My computer broke, my friend built a better one.  I was stuck in a rut romantically, I clicked with a girl at Subway and found out that she and her son are awesome people.  I had a sedentary lifestyle but told her that's not who I want to be, and the person I want to be is coming to me easier every day.", "url": "https://www.reddit.com/r/happy/comments/uzhtd/after_a_few_seemingly_hopeless_and_daunting_set/", "title": "After a few seemingly hopeless and daunting set of events in the past few months, I seem to be having the most fortunate month in quite some time.", "social_network": "reddit", "user": "WhoDoIThinkIAm", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1339572736, "permalink": "/r/happy/comments/uzhtd/after_a_few_seemingly_hopeless_and_daunting_set/", "nsfw": false, "first_save": 1635440859.4111347, "replies_charged": false}