{"id": "t5_2qh5i_t3_5k3p9r", "request": ["0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "Because I have the chance to have a *great* mom. \n\nI am currently studying abroad, so I don't get to see my mom as often and every once in a while I think about her and my childhood.  My mom has a few flaws, she's short-tempered, she is very attached to little details, she can be very stubborn, but she has so many qualities.\n\n**I only learned all of this a couple years ago, from my older brother.**\n\n\nBefore I was born, she was a wealthy lawyer, but she was also young and inexperienced with managing her wealth, so eventually she lost a good bit of that wealth, BUT not by buying luxury items or whatever, but by helping and giving her money to whoever asked for it with a good reason. She also spent a lot whenever she was inviting to make her guests at home.\n\nSo by the time i was born, (i'm a late kid), she was still a well-known lawyer, but she had lost that wealth and we were living in a small appartment downtown. I was the happiest kid ever, I never felt poor or missing something because she'd always get me quality clothes, a little something to eat at 4 pm, Christmas gifts even though we're a muslim family, and every once in a while she'd come back home with a toy for me or a surprise or any sort.  *What i didn't know* until my older brother told me just a few years ago, is that at that time she was *struggling* to pay for the appartment, my school and everything. She made so many sacrifices on herself just so I can be happy. During all the period of my life where i was a young, and naïve kid, she did everything that she could to make me happy. We never skipped an Halloween, a Christmas, a birthday.\n\nThat golden childhood era ended when I entered middle school, because to ensure that I have the best chances in life being a black kid, she made me enter the best school in the city, and had to pay them an absurd amount of money each year to keep me there. Of course I didn't know that, until I figured it out myself when i entered high school.  That meant no more Halloweens, no more fancy Christmas, she only kept the birthdays. Fortunately, by that time I was mature enough to know why I wasn't getting big Christmas gifts anymore.  However when I got into high school and felt ashamed of my clothes and my home, I wasn't mature enough to understand how many sacrifices my mom made to get me there, and how little of a problem my cheap clothes were.  My mom's situation got to a point where she couldn't afford paying for the appartment anymore and if it wasn't for my uncle and aunts, we would have been homeless. But she kept me in my bubble and hid that if we were now living at my aunt's house, it was because we got kicked out of the appartment, so i could continue dreaming of designer shoes and a Playstation 3.\n\nFast forward a couple years and me and my brother are now able to sustain ourselves and my mom finally gets to rest.  I will forever be thankful to her for what she did, but also for what my brother and my uncles/aunts did.\n\nI love you mom.", "url": "https://www.reddit.com/r/happy/comments/5k3p9r/im_a_very_lucky_man/", "title": "I'm a very lucky man.", "social_network": "reddit", "user": "SoDamnHealthy", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2, "down_vote": 0, "creation": 1482596254, "permalink": "/r/happy/comments/5k3p9r/im_a_very_lucky_man/", "nsfw": false, "first_save": 1635440895.3787062, "replies_charged": false}