{"id": "t5_2qh5i_t3_62502o", "request": ["c15214d3-1d77-40d5-ad12-df4ba3bdb7b2"], "text": "**TL;DR: Life sent me a lot of lessons the past 12 months, then I quit a shit job, got a dream job, and feelsgoodman.jpeg**\n\nThe last 12 months has been a struggle. Between medical costs, deaths, moving three times due to insecure housing, the stress of insecure housing, the roughest break up I've had, increased pressure and decreased satisfaction in my work, and this feeling that I was wasting my life and if I didn't do something then in five years I would be kicking myself for lost potential. I was thinking about suicide several times a day. Eventually, I got on Zoloft, took it for three days and said fuck it. Life is always going to send bad news but my job was what was keeping me from being able to handle it and I was being crazy to continue working there. I quit and a week later luck was on my side and I started a new job in a new field. \n\nIt's been two weeks and everyone keeps telling me how great I am and that they are surprised I've only been doing it for two weeks. \n\nAdditionally, the place I'm working was my second choice but my first choice employer just offered me a job--better pay, better benefits, better work environment and responsibilities--so I start in May and another bonus, I will be working the same department as my best friend/sister and I am just really happy.\n\nIt feels so damn good to finally start climbing out of that rut, to feel hopeful and not like every day is a mistake again.\n\nThis was long but this is the first time in a year I've felt like this and I just want to remember this feeling when the next rough patch hits.\n\n", "url": "https://www.reddit.com/r/happy/comments/62502o/tfw_youve_finally_made_it_through_the_storm/", "title": "TFW you've finally made it through the storm.", "social_network": "reddit", "user": "Annaruu", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 3, "down_vote": 0, "creation": 1490768670, "permalink": "/r/happy/comments/62502o/tfw_youve_finally_made_it_through_the_storm/", "nsfw": false, "first_save": 1635442810.9039557, "replies_charged": false}