{"id": "t5_2qh5i_t3_3e0ium", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "Until the age of 15 I lived in a very abusive household and was sexually abused as a kid. Until I went into foster care I feared for my life every day. I had a will written up detailing the abuse that happened and that if I was found dead it wasn't an accident but a murder. When I was in 2nd grade I remember writing \"help me\" and other such things on the inside of my books and pencil cases. I was convinced that one day my father would end up killing me and he is very intelligent and has a pretty high up and good paying job in his field so I thought he would get away with murder pretty easy.  I used to also be suicidal living in that house, the constant abuse and fearing for my life was so much stress for me at that age I thought it would be easier to be dead than living in the constant pain and fear. I feel as tho he tried to push me to that point on purpose. I was always questioning myself and if my thoughts were real because he would gaslight me, he'd beat me the night before then I would ask him why and he would say he never did that, the only way I knew I wasn't going crazy was that I had the bruises to prove it. When I tried to kill myself the first time and he was confronted about the bruises he said I had made them because I was self harming. Made me feel like I was going insane. I was also under constant surveillance at home, we had cameras all over the inside and outside of the house. One time he called me from his work and said him and his coworkers had just watched me get changed from the cameras. \n\n\n\nI lived in constant fear and confusion for the majority of my life, I sincerely thought I would be dead by now. I am so happy to be alive and grateful to experience every day. But I still suffer a lot from PTSD and depression, almost every day I feel like I want to curl into a ball and cry. I'm doing better than I was before, I used to have nightmares all the time, and flinch at a lot of movements, and get panic attacks all the time and the feeling of constantly being watched was always with me. I've worked through most of those feelings and reactions, but I'm still very depressed and have PTSD incidents. I'm doing so much better than where I was tho and know who I am and what is happening and don't fear for my life I am very happy to be here and have a drive to do better. I was homeless at 17 after my mother got me out of foster care and then kicked me out once she started getting child support and spent it all on drugs. I finished highschool myself, started college early, got a job and, was my highschools president. I was homeless during this time just moving from friends house to friends house because I didn't make enough money to pay rent anywhere. Finally after highscool, I was able to get a better job and get financial aid from being in foster care and moved into a place. I'm so happy with where I am in life right now, I wish I could go back in time and tell myself just how good it gets and how many wonderful people you'll have to help you through life. Never take aging for granted because so many people don't get to experience it.", "url": "https://www.reddit.com/r/happy/comments/3e0ium/im_happy_to_be_alive_life_gets_so_much_better/", "title": "I'm happy to be alive. Life gets SO much better.", "social_network": "reddit", "user": "soramorbid", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1437439586, "permalink": "/r/happy/comments/3e0ium/im_happy_to_be_alive_life_gets_so_much_better/", "nsfw": false, "first_save": 1635441328.3943298, "replies_charged": false}