{"id": "t5_2qh5i_t3_krj1r", "request": ["8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "My weekend was, for the first time in a long while, pleasant and lovely and amazing.\n\nI've been dealing with depression and OCD for almost four years. I've been through bad, worse, better and back to bad times. I've been in therapy and on medication for almost two months and I feel like I'm finally take more steps forward than shoves back.\n\nOn Tuesday I had a foul day. I took everything wrong, couldn't force sense to agree with reason without doubt creeping in. Started a fight with my boyfriend, cried and just had the worst moment in a long time (seems mixing OCD and PMS is the worst recipe ever). The lovely man, all the way in the UK compared to me in the US, stayed up until four in the morning (his time) on MSN with me so that I would get somewhat settled and get to bed.\n\nWednesday and Thursday were fine. They were better days after Tuesdays, felt a little draining after falling to the bottom. I apologized to him, he said we were alright, but I wasn't at happy yet.\n\nThen it turns out he'll be home for the weekend alone, and work won't need him until the afternoon.\n\nHe found a good pair of headphones and we spend the weekend together. We talked on MSN, watched movies (he's getting me into Westerns - The Magnificent Seven and The Good, The Bad, and The Ugly; I'm showing him wuxia films- House of Flying Daggers. We also watched Despicable Me today) and TV shows (lots of Mitchell and Webb Look, and other comedian stand up, My Little Pony), and stayed up until it was almost morning in England.\n\nWe said silly things and nice things just to hear the other's voice, talked of video games and living in castles, cowboys and martial arts. Got him to read reddit a bit more and comment, found him defending my Catholic views here even if he doesn't believe them entirely himself. We're not engaged yet, but we mentioned rings- he wants my ring to have an amethyst and an onyx, both our birthstones (he's December, another system has onyx as it's birthstone. Basically because onyx is pretty), so that it's us together. He wants to a ring too, which I plan to get and give after he's asked me properly first :P\n\nThis weekend he was my prince, my cowboy, my dearest friend and only love. I'm smiling, truly and honestly smiling because I want to. I feel loved and blessed.\n\nWe've been together for five years, we met online. We get to see each other about once a year for a week or two. Last time I saw him was a year and a half ago in June. At the moment I'm looking for a ticket to see him in November.\n\nTomorrow when he gets back from work (I don't have classes Monday- university), we're finishing The Good, The Bad and The Ugly and maybe seeing Curse of the Golden Flower, or Sailor Moon.", "url": "https://www.reddit.com/r/happy/comments/krj1r/my_weekend/", "title": "My weekend", "social_network": "reddit", "user": "Faustyna", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 1, "down_vote": 0, "creation": 1317012753, "permalink": "/r/happy/comments/krj1r/my_weekend/", "nsfw": false, "first_save": 1635442192.2069643, "replies_charged": false}