{"id": "t5_2qh5i_t3_125gbt", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "I was at a local food market with my two kids stocking up for the big storm that about to hit the area. As I pull up to the massive line I can overhear a store employee explaining to a \"young lady\" she can not pay for her food with her rewards card. That the card is only intended to give her discounts of items, not for payment. The \"young lady\" looked confused and was digging in her wallet to look for an alternate way to pay. The store clerk asked her if there was someone she could call to bring her some money or a credit card. The \"young lady\" said she had no family in the area. When the clerk stepped away I ran up and asked what the issue was. As she was explaining the situation to me I could see the cart had staples needed to survive, such as milk, lactose free pudding, and water, etc. I told the \"young lady\" to get behind me in line. The gentleman behind me could see what I was about to to and gladly let the lady cut the massive line. As she is coming up to the cashier she starts to say she couldn't pay for her items. At that point I said to her I would pay for them. She started to put some things on the side saying she didn't want to impose on me. I literally had to wrestle a box of macaroni onto the belt. It's not everyday you wrestle pasta away from a little old lady. Anyway, by this time the guy behind us told the women behind him what I did and now the whole line is awkwardly smiling at me. The store employee told all the other staff and they kept smiling at me as well. After I bagged all her food and started for the door she demanded my name and address so she can repay me. I said very softly that it was not needed. She then asked how can she thank me? I said to her \"stay warm and be good to someone else.\" she smiled and said this is her lucky day. I said \"everyone is entitled to one\" :) I feel good about it and I wanted to share with my r/happy. Have a good weekend everyone. ", "url": "https://www.reddit.com/r/happy/comments/125gbt/i_did_my_good_deed_for_the_year_thank_goodness/", "title": "I did my good deed for the year. Thank goodness 2013 is right around the corner so I can do another :)~", "social_network": "reddit", "user": "Hamster536", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 32, "down_vote": 0, "creation": 1351295913, "permalink": "/r/happy/comments/125gbt/i_did_my_good_deed_for_the_year_thank_goodness/", "nsfw": false, "first_save": 1635442934.4092765, "replies_charged": false}