{"id": "t5_2qh5i_t3_8xsf68", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "There is so much that has been going right for me over the course of the past few months. I am going to write them down in list form and talk about each one. This is a long read, but I would appreciate it so much if you could give my list the time of day :) ---\n\n1. I finally got out of about a year long slump around 3 months ago. This slump in my life was largely due to the toxic relationship that I was in at the time. Neither of us wanted to break up with the other one and the toxicity of it all just festered and we became increasingly unhappy. Finally, I decided to break up with her one night, and I have not been happier since we have stopped talking.\n\n2. I have an amazing and supportive family. I know that this isn't just at this point in my life, it is throughout my life, but I need to acknowledge how incredible the five other members of my family are to me. They are all extremely loving and kind and caring and will always check in on me to make sure everything is alright. My parents are emotionally and largely financially supportive as well. I don't have to pay for my college which makes things very easy on me, to the point where I only have to work part time this summer. I am so appreciative of this fact, and I never want to take it for granted, seeing how hard some of my friends are working (Props to them, though. I can always appreciate hard work when I see it.)\n\n3. I recently started dating the most amazing girl. She is, quite literally, the most beautiful girl I have ever seen. I know people will think I am saying this because I am dating her, but were I not in a relationship with her, my opinion on her would not change. Aside from just looks, she is also an incredible person. She is the most hard-working girl I know, working 40+ hours a week, alongside working to get her CNA, and also making time for me. She is very supportive of me and is caring and kind and warm and I could not appreciate her more.\n\n4. I finally found a good group of friends. Each and every one of them are so nice. I met them this past year, my freshman year of college. All of my high school friends each moved their separate ways and I don't really talk to many of them anymore. I'm not complaining, though, because in retrospect, we never really \"clicked\", meaning I never had a super authentic relationship with any of them. Not like I do with these new friends now, at least. I am even rooming with one of them in our sophomore year of college next year, and I would consider him my best friend. There are also a bunch of us even talking about getting a house our junior and senior years of college as well, which I cannot wait for.\n\n5. I have a 4.0 GPA in college so far, even while taking very hard courses. I am super proud of myself for this because it shows that I have a good work ethic and I can achieve success if I really put my mind to it. This is something that I wasn't super sure about myself prior to this past school year, and I can say, after having achieved this, I know I can get anything I want if I'm willing to put in the work for it.\n\n6. I am in very good shape, some of the best shape I've been in in my life. I recently started running again, and just working out in general, and I'm much more confident with how my body looks and how I feel in general.\n\nIf you got this far, thank you so much for reading! I am in such a good place in my life right now, and I hope that all of you are too!\n\nBest wishes to each and every one of you :)", "url": "https://www.reddit.com/r/happy/comments/8xsf68/i_am_the_happiest_i_have_ever_been_in_my_life/", "title": "I am the happiest I have ever been in my life :)", "social_network": "reddit", "user": "rocket-L", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 30, "down_vote": 0, "creation": 1531250625, "permalink": "/r/happy/comments/8xsf68/i_am_the_happiest_i_have_ever_been_in_my_life/", "nsfw": false, "first_save": 1635441319.7088726, "replies_charged": false}