{"id": "t5_2qh5i_t3_pjvr7p", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716", "2293bc08-7671-4d63-b63f-dbe4a3a4858a"], "text": "This is just an update to anyone who even gives a shit as to how I’m doing. Since my last r/happy post I have moved, and I’m enjoying my new hometown, even if it is filled with boomers :p. All kidding aside, it’s quiet, there’s absolutely no crime, streets are clean, I can comfortably walk to the beach and chill and eat a burger or schnitzel, and best of all I got this new fridge where I’m GUARANTEED cubed ice now!!! :D. It was just fucking awful when there was this really god awful heat wave back in June (got up to 105 degrees) and I literally had to take this big bag of ice and smack it to try and separate them… what a time that was!!! Also on a side note I didn’t realize room temperature Coke fizzed that much when it hit ice lmao. Also on the note of my new house, some of my extended family came over to see it and we all went in the pool in our backyard for a swim, that was a total blast as I haven’t seen them since my Grandma’s funeral a year ago.\n\nOn the other hand, all my favorite things to do have come back right around now, car shows are back, motorsports are back, football is back, and I’m just thrilled that I can just kick back and enjoy life and see people’s smiles again! And *everyone* is smiling just as I predicted! I’m sure Reddit can agree that last year was perhaps the most dark depressing time of our entire lifetime but hey we all kept up the faith and we stuck through! And trust me, there were times where I was so goddamn depressed throughout all of last year and most of this year where I felt like ending my life as it just got so stressful. I’m glad that I stuck it out, as my patience is now being rewarded! \n\nI honestly think that 2022 will be the happiest year in recent history. Anyways to whoever reads this I hope you have a great day and here’s to much more fun and excitement in 2022! :D", "url": "https://www.reddit.com/r/happy/comments/pjvr7p/my_life_is_finally_happy_and_hopeful_after_a_long/", "title": "My life is finally happy and hopeful after a long period of darkness and despair!!!", "social_network": "reddit", "user": "kentuckychicken1987", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1631048112, "permalink": "/r/happy/comments/pjvr7p/my_life_is_finally_happy_and_hopeful_after_a_long/", "nsfw": false, "first_save": 1635439585.0956988, "replies_charged": false}