{"id": "t5_2qh5i_t3_29mlzu", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb"], "text": " For once, I'm not waiting for this relationship to end or self-sabotaging myself. Instead of talking about the 'ifs,' I'm openly planing our future house and even joke about our future children. As someone who suffers from a fear of commitment, this is a huge step for me. My boyfriend is the most sweetest, funniest, most loving person I know and he totally balances me out. I've never felt so freaking happy in my life! He's just perfect - he doesn't smother me with affection, but he's also not aloof or uncaring. He makes me feel beautiful and always appreciates the smallest of gestures. Fuck, I feel like I can go on-and-on about just how flippin' *amazing* he really is! \n  \nA couple of days ago, I got into a minor car accident (I didn't leave enough of a gap between me and the car ahead of me and I ended up rear-ending them - my bad, I know). After giving them my information, I pulled into the nearest parking lot and called him to let him know what happened and explained to him that I was fine (my van wasn't even dented). Despite my assurances, he still insisted on dropping by my work (where I was headed) and making sure I was ok. What made this even more meaningful is the fact that, in the past, I was robbed at gunpoint and I had to *beg* my previous boyfriend to come comfort me and, when he *did* come, he kept asking if he could leave. I don't blame my ex - he's just not the emotionally ready sort of person, but this difference in approach and attitude made me feel really good about how far I've come in my life. I finally have my rock.     \n  \nI know that the future is always uncertain - heck, my sister recently broke up with her boyfriend of 4.5 years, but I feel full of optimism. I know it sounds totally lame and cheesy but, as far as I'm concerned, he's 'the one.' He's my best friend and, honestly, I can't wait for the infinite more anniversaries to come. I love him and I *know* he feels the same.  \n  \nI hope everyone gets to be so happy! \n  ", "url": "https://www.reddit.com/r/happy/comments/29mlzu/today_is_our_3year_anniversary_and_im_happy/", "title": "Today is our 3-year anniversary and I'm happy!", "social_network": "reddit", "user": "Crazy_Overlord", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1404278398, "permalink": "/r/happy/comments/29mlzu/today_is_our_3year_anniversary_and_im_happy/", "nsfw": false, "first_save": 1635438962.7425108, "replies_charged": false}