{"id": "t5_2qh5i_t3_fwy6d0", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I am a software software engineer. I consider myself to be very good at it, despite being extremely bad at almost every other aspect of life. I always felt like I was good at it, but I felt like I was sort of limited and not able to prove myself or get recognition for it (stuck at dead end jobs, etc). Like I said, it's really my only true skill in life, and I was beginning to think I was delusional and really had no skills after all. \n\nAnyway, \\~6 months ago I moved to a different country and started my dream job at one of the biggest software companies on the planet. This alone was a HUGE accomplishment for me. However, I work with *extremely* smart people, and I was beginning to think I didn't belong and my performance was inadequate. I was blowing through deadlines on my tasks and felt like I just wasn't grasping some concepts despite asking over and over.\n\nToday my manager gave me feedback on my performance review and said that I \"exceed expectations\" and it's almost unheard of for people to receive that rating being at the company for such a short time. I felt a huge weight lifted off my shoulders. I can finally feel less stressed about how I'm performing and it has removed my doubts about not belonging and feeling like a fraud. I'll likely be promoted sooner than I expected too which is great.\n\nJust wanted to get that off my chest since I have no friends to tell!", "url": "https://www.reddit.com/r/happy/comments/fwy6d0/my_manager_rated_me_exceeds_expectations_after/", "title": "My manager rated me \"Exceeds expectations\" after being at my (dream) job for only 6 months.", "social_network": "reddit", "user": "ohThisUsername", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 20, "down_vote": 0, "creation": 1586313493, "permalink": "/r/happy/comments/fwy6d0/my_manager_rated_me_exceeds_expectations_after/", "nsfw": false, "first_save": 1635442857.7010522, "replies_charged": false}