{"id": "t5_2qh5i_t3_lolfko", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716", "ec625709-7f64-46c7-8416-e278a4a2b110"], "text": "I haven't had the best luck when it comes to relationships but I think I finally found the one who I actually love with all my heart.\n\nI (23f) have been dating my SO (23m) for over a year now and it's been the best year of my life. I've never felt this happy or this comfortable or felt like I actually mattered in a relationship before and I'm still not used to it. Even though I'm not used to it I love the feeling of being on cloud nine and having my heart flutter everytime he message me or compliments or tells me how lucky he is to have someone who cares about him as much as he cares for me. I'm unconditionally in love with him and I want to show him how much he means to me every day and spend the rest of my life with him. \n\nI've never felt this appreciate it that I actually matter to someone before and it feels good he is the one person I want to tell everything to and is honestly my best friend! I can be my weird dorky self around him and he finds it cute, he makes me laugh and smile until it hurts (in a good way) I constantly think of him and have dreams of him when I fall asleep each night! I imagine what it would be like to move in with him and to get married to him and what our kids would look like, which is totally out of character for me because before I met him I never wanted to get married or have kids of my own! \n\nI definitely feel like it was destiny that we met as cliche as that sounds but honestly at this point I dont mind he is my soulmate and I believe we were ment to find eachother and spend an eternity with eachother.\n\nI'm just so in love that I ache to be with him and I miss him every second of every day that we can't see eachother in person due to what's going on in the world at this moment. \n\nI don't know how to handle feeling like this!  Any advice?\n\nTL;DR - I just wanted to express how I feel about my SO", "url": "https://www.reddit.com/r/happy/comments/lolfko/i_found_the_person_i_want_to_spend_the_rest_of_my/", "title": "I found the person I want to spend the rest of my life with", "social_network": "reddit", "user": "LegoPoppin", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 139, "down_vote": 0, "creation": 1613869505, "permalink": "/r/happy/comments/lolfko/i_found_the_person_i_want_to_spend_the_rest_of_my/", "nsfw": false, "first_save": 1635439604.2948263, "replies_charged": false}