{"id": "t5_2qh5i_t3_ouahu9", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716", "1d9bc0bf-4a1c-437e-94e7-5a07c99811fe"], "text": "Me and my boyfriend started out as a long distance situation. Started talking last September, he flew to meet me in December and I moved back to the country he's from back in May, that's when we started living together. He always went the extra mile for me, and I tried to do the same for him, but until couple weeks ago we never said \"I love you\" to each other. \n\nSo, couple weeks ago we had a fight. Nothing crazy, not our first one. Once we resolve things we usually cuddle and just give each other affection, helps to let go of all the negative things. Accordingly, after this argument he was holding me. Then he just squeezed me and told me he loved me. I got flustered, so I responded with a squeeze back and an \"aww\", quickly followed by \"I love you too\".\n\nMy mind was racing. He said it so casually and out of nowhere, I thought, that first \"I love you\" must not be of equal importance to him as it is to me.\nAnd in the moment I assumed that since we were already calling each other \"my love\", he probably thought he had already confessed his love for me. Nevertheless, I was happy. \n\nAround a week goes by, we go to visit his dad for a couple days. It was my first time meeting him, so quite a bit of anxiety. Day 1 goes great, lots of good food, great conversation and a lot of booze, so by the end of the night I'm in my feelings. Once we hit the hay, I hug my boyfriend and tell him that I love him. He squeezes me real tight, and for much longer than he usually would. So I ask what's up. He says, well it's the first time you said you loved me. To skip the most of the following conversation, he didn't hear me whisper the \"I love you too\" to him when he told me he loved me. He was very nervous to say it in the first place, and then thought I didn't say it back. According to him, he was happy to wait until I was ready to say it back since I gave a very positive response, but knowing him I'm 99% sure it was torturous for him to think we were not on the same level.\n\nI'm so glad I said it that night. I don't find it easy to tell people I love them, a bit of an avoidant attachment style going on there. Yet it felt so good. It felt good to just say it, and it felt good to be able to tell him that I did say it back that day. It felt good to show him that his feelings were reciprocated and appreciated, and to tell him that I was waiting for a long time to either say it or hear him say it.\nHaving had a difficult childhood and adolescence, where me displaying vulnerability and emotional pain was greeted by indifference and dismissals, nowadays I still find it challenging to be vulnerable despite having worked out most of my other issues. I have learned to depend on myself, and only myself, on pretty much all levels, and saying \"I love you\" implies that to a certain degree I am willing to depend on and be attached to that person. \nIt's not my first relationship, and not my first time saying \"I love you\". But for the first time it doesn't feel like an unhealthy addiction, or a rushed decision. I waited, we waited, and I'm more comfortable in my vulnerability than I have ever been. \n\nHe's more appreciative of my vulnerability than most people I've considered family, friends or lovers. And I'm very appreciative of his. I'm happy.", "url": "https://www.reddit.com/r/happy/comments/ouahu9/we_finally_said_i_love_you_to_each_other_and_it/", "title": "We finally said I love you to each other, and it felt so cathartic.", "social_network": "reddit", "user": "Lopapeysaa", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1627606959, "permalink": "/r/happy/comments/ouahu9/we_finally_said_i_love_you_to_each_other_and_it/", "nsfw": false, "first_save": 1635439593.8259358, "replies_charged": false}