{"id": "t5_2qh5i_t3_3sh9w7", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "**Here is an example of a typical daily meal layout for me:**\n\n1. Breakfast- probably a frozen burrito, leftovers of something I made, eggs and bacon, big bowl of cereal with too much milk, or peanut butter toast with lots of peanut butter.\n\n2. Lunch- Half a box of noodles (8 servings in a box), or a quarter of a digiorno pizza, or a personal pizza and breadsticks, or like 12 fish sticks and a medium fry worth of fries.\n\n3. Snack at least once, probably random handfuls of cereal with no measured amount, candy, chips, whatever.\n\n4. Dinner- Any of the lunch options, two pork chops with rice of some kind and applesauce. Pork chops possibly wrapped in bacon and stuffed with cream cheese. \n\n5. Maybe another snack. Around halloween I was having a bunch of chocolate and starburst and the like every day. I had a lot of milkshakes lately too.\n\n6. At least a 12oz bottle of soda's worth per day of pop, probably chocolate milk once or twice a week. \n\n7. If I got fast food, for example taco bell, I got the meal with two chalupas, a soft taco, and a large drink, ~1500 calories.\n\n**Here's examples of the last week:**\n\n1. Breakfast- Two eggs, two pieces of toast, no butter or sides or anything. Tuna sandwich on toast. Leftovers, but a serving size of leftovers, no more than 400 calories.\n\n2. Lunch- Noodles, but a measured serving, a little over one serving ~350 calories max. TV dinner, ~350 calories max. Something I made, but much less of it. Personal pizza with nothing else. Eggs. \n\n3. Dinner- One pork chop with asparagus, a little applesauce. Any of the lunch options. Two roaster garlic + asiago chicken sausages and asparagus. A box meal like hamburger helper, but portioned to be a serving of around 400 calories, and not \"whatever I wanted until I was full\".\n\n4. No snacks\n\n5. No drinks with more than 5 calories\n\n6. If I got fast food, always taco bell, I get one chalupa and one soft taco, ~550 calories.\n\n---------------------------------------\n\n\nThis is surprisingly easy. Without even trying to I haven't passed 1500 calories a day. I felt actual hunger the other day (in a healthy normal way, I'm not starving myself) and it was weird because I realized I haven't felt hungry in a year.\n\nA few years ago I did this (and still ate taco bell once or twice a week) and I lost around 90 pounds. Right now I only weigh around 180 (or I did a few weeks ago, before I started), but I still would like to lose a bit more, and eat better in general. :)", "url": "https://www.reddit.com/r/happy/comments/3sh9w7/i_havent_had_a_snack_or_soda_in_7_days_while/", "title": "I haven't had a snack or soda in 7 days, while trying not to eat so much.", "social_network": "reddit", "user": "FinalMantasyX", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 81, "down_vote": 0, "creation": 1447290253, "permalink": "/r/happy/comments/3sh9w7/i_havent_had_a_snack_or_soda_in_7_days_while/", "nsfw": false, "first_save": 1635442925.2381053, "replies_charged": false}