{"id": "t5_2qh5i_t3_98tm6w", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11"], "text": "I dont have much luck with guys, and last night I went on a date with a guy off Tinder (!!!). We’ve been texting for a few days and we’re getting along pretty well, but I had assumed he’d probably not be as good looking as he was in his pictures or that he’d try and hook up within the first 5 minutes.\n\nBoy, was I wrong. So, so happily wrong.\n\nSo first, he picks me up. And when I walked out of my house & rounded the corner, I honestly think I stopped breathing for like 10 seconds. Tall, tan, gorgeous blue/green eyes, perfectly styled hair, fit, etc. He was out of my league. He was perfect. And the best part was, the way he looked at me, I felt like he thought similar. So we get in the car and while its a bit nervous/awkward its not unbearable, and we make our way to Dave and Busters.\n\nWe play some games & get a beer, I manage to smack myself in the face with a basketball trying to make a hoop, we bond over our newly discovered nerdiness. At the end we go to the prize section & he tells me to pick out whatever I desire!! I pick out a stuffed monkey. I cuddled it all night.\n\nAnyways, we leave there to go get cupcakes & drinks at a local place, unfortunately the ones that had left werent any flavors I liked, so we leave & go to this lookout point.\n\nNow HERE is where I realized this man is someone special. I am black/puerto rican, he is white. No big deal, but he gingerly opened up an insightful conversation about wanting to learn/know what experiencing racism is like for me, and it just evolved into this beautiful discussion on various life topics, from what racism ive encountered, to our political viewpoints, to our taste in music, to our religious beliefs. Anything and everything was on the table. It felt so nice to have such an in-depth discussion with someone I was attracted to. We went to drive off to get cookies (Thank you Insomnia Cookies for being open late!) and before we left the lot I asked him to stop the car, and to kiss me.\n\nLet me say, I hate kissing. Does nothing for me. Not a fan. But when we kissed, geez. It felt like....electric? It felt....like chugging a redbull and then a cup of coffee directly after. It felt like getting all green lights on the way home. It felt like finding a really cool piece of clothing on sale at a killer price. It felt like sitting down & eating a delicious meal you’ve spent hours preparing. It felt like getting an essay back & seeing you got an A on it. It felt like seeing a dog on the street and petting it and it licks you happily. It felt like waking up after a night of drinking and not being hung over.\n\nI have never, ever felt that way about a kiss.\n\nSo, obviously, on the way to the cookie place we spent each red light discovering each others faces the way one does.\n\nWe get to cookie place. It starts to rain. I panic, bc I have ethnic hair and I had straightened it for this date, and if it got wet it’d get all poofy. So we made a game of it sorta and ran to the cookie place, narrowly avoiding a skunk I completely didnt notice in my blissful haze. \n\nWe get cookies. Run back to car. Talk more.\n\nHe takes me home. It is about 1 am ish. He gets out and walks me to my door. We kiss goodbye for a solid couple of minutes before actually finally saying bye. I say, good bye _____, he says good bye yourelovely. I get a weird happy tingle hearing him say my name. He gets in his car, I head upstairs. I wonder whether I should’ve invited him in. \n\nAnd finally, there I was, in bed, cuddling the monkey, smiling to myself excited for seeing him later this week (hopefully if our schedules work out).\n\nJust really, truly, happy.", "url": "https://www.reddit.com/r/happy/comments/98tm6w/i_went_on_the_best_first_date_of_my_life_last/", "title": "I went on the best first date of my life last night...I have butterflies and its weird but I like it", "social_network": "reddit", "user": "yourelovely", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 161, "down_vote": 0, "creation": 1534772036, "permalink": "/r/happy/comments/98tm6w/i_went_on_the_best_first_date_of_my_life_last/", "nsfw": false, "first_save": 1635439197.3476088, "replies_charged": false}