{"id": "t5_2qh5i_t3_1urx58", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "I posted this elsewhere on reddit *yesterday*, trust me, it's worth a read if you want to understand just how bad it was!\n\n\n\n\n>\"My boss makes my life a living hell.\n\n\n\n\n\n>He owns the small cafe I work in, and his customers all think he is lovely and wonderful. In reality, the moment something small happens, he will start screaming and swearing.\n\n\n\n\n>He literally verbally abuses his staff, including myself. Today, he picked up a 30cm knife whilst screaming at me. Sure, he just \"waved it around\" rather than pointing/ stabbing it in my direction... But that's still a fucking psycho thing to do. He will continue to rave and rant (swearing and throwing insults) for endless minutes.\n\n\n\n\n>He calls his staff terrible names (*dumb ass, sarcastic bitch, moron, f-cking dick head, soft-cock, dick brains, etc*), he touches our asses (females), and he says \"Got a problem with it, then get out of here!\"\n\n\n\n\n>To top it off, I am getting paid just 4c above the absolute minimum wage. I'm being taxed quite a bit, so working in absolute *hell* with the *devil* is earning me just over $12.50 p/h (after tax).\n\n\n\n\n\n>To make matters even worse, we don't get given a roster. There isn't a roster. The boss just says \"Go home now\" when he doesn't want you any more and then \"You start tomorrow at...\" if you're working the next day. This means I am never guaranteed hours and I can't make plans because I never know when Ill be working.\nI have bills to pay. \n\n\n\n\n>My social life is crumbling because I can never make plans, and even when I do, if it gets any later than 9pm, I start getting sickeningly anxious... Because I know I'll be tired in the morning when I have to wake up at 6am to go work with the devil.\n\n\n\n\n\n>It's a slow time of year, but I'm trying to get a new job.\nMy boyfriend tells me every day \"Quit\". I should. But the thought of being \"unemployed\" makes my stomach twist.\n\n\n\n\n\n>I used to be so proud of my work ethics and abilities, but now, he has personally attacked me and worn my confidence down so thin that I feel like I don't deserve anything better. So I go back, day after day, to this hell hole.\"\n\n\n.\n\n\n\n\n\n**Today**, I finally had the courage to politely tell my boss that I wouldn't be coming back after the weekend. He took it well (he was in a good mood, oddly...), but it still had me shaking with nervousness. \n\n\n\nLess than an hour later, I got a call from a place that I applied to in early *december*. They loved me in my interview (I had it yesterday arvo after work!), and want me to start next week!\n\n\n\n\nI'll be going from my $15.61 p/h (before tax) (*For the non-Australians; $15 is actually a very low pay rate for an adult here. I actually looked up the legal minimum to see if it was even legal to pay me this low!) to $22 p/h, and instead of irregular and short hours, I'll be working 9-5, 5 days a week. Hallelujah! \n\n\n\n**I am SO happy to be out of that hell hole, and to be walking straight into a job I deserve to be in!**\n\n\n\n\n\n\nEDIT: Explaining \"bad\" pay rate to non-australians", "url": "https://www.reddit.com/r/happy/comments/1urx58/you_would_not_believe_the_hell_ive_endured_at/", "title": "You would not believe the HELL I've endured at work... But today, I was brave enough to quit. I was unemployed for only an hour before receiving a call offering me a full time job earning more than $7 p/h MORE than the other awful job. I'm incredibly HAPPY.", "social_network": "reddit", "user": "shellehbelleh", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 628, "down_vote": 0, "creation": 1389243663, "permalink": "/r/happy/comments/1urx58/you_would_not_believe_the_hell_ive_endured_at/", "nsfw": false, "first_save": 1635442917.7869577, "replies_charged": false}