{"id": "t5_2qh5i_t3_6zilt3", "request": ["4161666b-4b17-4c22-bb40-42efca26f347"], "text": "I work in hospice. I know, I know, that doesn't sound like r/happy material, but hear me out.\n\nOne of my patients is an older guy in his 90s. He lives with his wife, who is his primary caregiver, and the two are probably the cutest couple on the face of this planet. I wish I could record the way they interact and post it somewhere every time I see them, just so people can see just how beautiful this relationship is. I've always had a great appreciation for these two, but I want to share today's story because it has left me feeling warm and fuzzy all day.\n\nThe two often use our sessions to reminisce and talk about all of the adventures they've had together. They've been all over the world, and you can tell they've enjoyed every minute of it. Today, the patient's wife started talking about their first dog.\n\n[Darlene] (patient's wife, not her real name): \"He was a a sweetheart, you know? Always waiting by the door when we got home, never barked, nothing but pure love from him. One day, it was raining and he ran out the door and got 'Philip's' [the patient, not his real name] newspaper for him so Philip didn't have to. We never trained him, he just knew he was helping. Such a sweet boy.\"\n\nMe: \"Wow. That sounds like an amazing story. I guess it's true, dog really is man's best friend.\"\n\nPhilip: \"That's simply not true.\"\n\nMe: \"It's not?\"\n\nPhilip: \"Absolutely not.\" He points at his wife. \"She is my best friend. Period.\"\n\nDarlene lit up so bright, like she was a school girl whose crush just asked her to the mid-winter formal. She even giggled a little bit, or at least as much as you can expect from a frail old lady with her own set of medical problems.\n\nThis is nearly every interaction with this couple. They're just so in love,  I can't even begin to describe how fulfilling it is, just to see these two in their element. Every one of us should be so lucky as these two cuties.\n\nOh, but it gets better.\n\nAs I was going to leave, Darlene asks me for a hug, and I obliged--our patients and their families get very close to us, and these sessions can be very emotional. Philip pipes in.\n\n\"I wish I could say I was not a jealous man, but I certainly think I am.\"\n\nMe: \"Oh, don't worry, Philip, I couldn't possibly steal Darlene from you.\"\n\nPhilip: \"I'm not afraid you'll steal her. I'm just jealous that you can hug her like that. I miss having the strength to hug her.\"\n\nSo anyway, I cried the whole way home.\n\nHappy Monday.", "url": "https://www.reddit.com/r/happy/comments/6zilt3/old_couples_are_the_best/", "title": "Old couples are the best", "social_network": "reddit", "user": "BrianLemur", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 18, "down_vote": 0, "creation": 1505166766, "permalink": "/r/happy/comments/6zilt3/old_couples_are_the_best/", "nsfw": false, "first_save": 1635440999.4789476, "replies_charged": false}