{"id": "t5_2qh5i_t3_bcfv2h", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "Like the title states, this past Tuesday I had a stroke and was immediately admitted to the hospital.\nI’m a 29 year old woman, fairly healthy, living in Ontario Canada and this was hardly my first brush with death. \n\nI’ve also had open heart surgery in April 2013 for mitral valve prolapse repair, I had surgery for an ovarian cyst removal later that year in December (Merry Christmas to me!), this past summer 2018 I had deep vein thrombosis in my left leg (which with the help of my family doctor was treated) and as a few days ago the surprise strokes that rocked my life. \nAfter exhibiting symptoms such as losing some of my use of my left hand, trouble speaking, and unable to smile properly,  they performed a CT scan in my hometown which is how they were able to confirm it and then transferred me a couple hours away via ambulance while giving me a clot buster (not sure of the name) and when I arrived at the larger hospital they were happy to confirm that the clot busters had worked and didn’t need to perform anymore procedures to remove the clot. \nI had to spend a few days in the hospital in which time they took more blood than I knew I even had in my body (jokes), another CT scan, multiple EKG’s, an ultrasound to make sure my heart was all good and an MRI.\nWith the help of those tests they were able to tell me that I had 3-4 small strokes on the right side of my brain, which apparently impacts my memory because i cannot remember anything properly right now. \n\nAs of now I’m just so happy to be home. My arms are tender from where the IVs were used, and I feel like I could sleep for a year, but if i never have to be asked my full name, today’s date, where I am, whether or not you peel a banana before you eat it, if I drop a rock in water will it sink, and names and functions for various things such as pens, watches, keys, and flashlights, I will be happy. \n\nJust a side note: if any of these words don’t make sense or I’m missing words, formatting, etc. I apologize in advance. This was a test in focusing and memory which, for the most part I believe I succeeded.\n\n\nEdit: they don’t know what caused the blood clots in my legs or in my brain but I’ve been given a specialist whom I’ll be seeing soon to figure it all out. It feels good to finally be getting answers.", "url": "https://www.reddit.com/r/happy/comments/bcfv2h/on_tuesday_april_9_2019_i_had_a_stroke_was/", "title": "On Tuesday, April 9, 2019 I had a stroke was admitted to the hospital, and I survived!", "social_network": "reddit", "user": "Bauifox", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 12, "down_vote": 0, "creation": 1555088057, "permalink": "/r/happy/comments/bcfv2h/on_tuesday_april_9_2019_i_had_a_stroke_was/", "nsfw": false, "first_save": 1635438837.5273407, "replies_charged": false}