{"id": "t5_2qh5i_t3_9pvcuj", "request": ["4161666b-4b17-4c22-bb40-42efca26f347", "c889a480-189a-4ed9-aa88-81c300413196"], "text": "I work at a very big retail hardware store, multi-million dollar corporation where customer service is the driving core of our company. It's hard to see that side of my company from my position as I day in and day out deal with frustrated customers burnt out on excuse after excuse as their service is slow or down-right stagnant.\n\nBut today I had one of those special moments that has kept me in this job for four years come March.\n\nI had a lady come in to cancel an order, she had been waiting for two weeks for her order which was stuck in shipment status pending. It took me two phone calls to different IT and service desks to get someone who could help me, one of the calls took about thirty minutes. In the end I was able to secure a full refund for this wonderful sweet lady.\n\nShe then asked if she could get me a promotion, it gave me a chuckle and I told her she could give me a survey to get me a pin to wear on my vest. She then gave me twenty dollars \"to pay for lunch\".\n\nDear Lady if you see this, slim chance I know, you are an angel sent from heaven. You see I really was just doing my job, I was helping you love where you live, it's what I love to do. But what you don't know is that I have no car, I walk forty minutes to work every day and as of this moment I have five dollars to my name. That twenty dollars you gave me for lunch will pay for my lunches and dinners until I get paid next week. I don't think I can thank you enough. I might have gotten you a refund, but you just gave me hope. I'm crying as I type this up at my desk.\n\nThank you. Thank you. Thank you.\n\n-Internet Fulfillment Clerk", "url": "https://www.reddit.com/r/happy/comments/9pvcuj/service_with_a_smile_and_no_money_worries_for_the/", "title": "Service with a smile, and no money worries for the next week.", "social_network": "reddit", "user": "Katiedid55", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1540051960, "permalink": "/r/happy/comments/9pvcuj/service_with_a_smile_and_no_money_worries_for_the/", "nsfw": false, "first_save": 1635440998.14256, "replies_charged": false}