{"id": "t5_2qh5i_t3_na9o8u", "request": ["e660e09a-842d-44ca-8826-ddfa61319574", "b3574414-2d10-4990-bb3e-d9be8a3b6716", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "So I started my Bronze DofE (award in the UK for 14/15 year olds) where you have to do volunteering, learn a skill and a physical activity for 3 months - and one must be for 6 months (I chose running).\n\nSo I started running back in early January and I've made so much progress and have improved my cardiovascular endurance a lot :), whilst also losing some belly fat👌. I've gone from being just able to run 1k in 6 minutes (then being completely out of breath), to running a 5k in 25 minutes and still improving. I've also managed to gather my thoughts a lot on my runs and have been a lot calmer and less angry.\n\nI've learnt my way around a kitchen (skill) and can now cook a few dishes (with a simple guide of course I'm not Ratatouille), and have been eating a lot healthier and getting my 5 a day pretty much every day 👍.\n\nI've volunteered for zooniverse.com and helping identify kelp forests from satellite images from NASA.\n\nI signed myself up to the school gym to start in September, yeah ik imma be hench boi, in front of the whole class - which may seem pathetic but I'm very concerned about whether people judge me or not.\n\nI've been doing some good quality revision (which I don't usually do 😬) for my mock GCSE's the past week and feeling really good about it.\n\nI've found my uhh... musical identity (?) and have become comfortable with it to not get embarrassed about it with other people, I like good ol' country music with good lyrics, especially the Eagles.\n\nNot something I'm particularly proud of myself for, but something nice that happened. I went up into the attic on the weekend to get down my extensive Star Wars Lego Collection to start organising it to be sold for uni in a few years. And I found my dad's old motorcycle leathers! I tried them on and they fit like a charm, and they look sick as well. I'm definitely getting a bike when I'm older.\n\nThank you for reading my rant, have a good, wholesome day! 😃🙂🙃", "url": "https://www.reddit.com/r/happy/comments/na9o8u/im_really_happy_about_what_ive_done_in_the_past/", "title": "I'm really happy about what I've done in the past few months of this year", "social_network": "reddit", "user": "Jedi_Master_Jim", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1620772324, "permalink": "/r/happy/comments/na9o8u/im_really_happy_about_what_ive_done_in_the_past/", "nsfw": false, "first_save": 1635439376.2348828, "replies_charged": false}