{"id": "t5_2qh5i_t3_o4dfo0", "request": ["2293bc08-7671-4d63-b63f-dbe4a3a4858a"], "text": "For the last two years, I've struggled so much with my weight, and I've hated the way I look to the point of not wanting to go out, because I was afraid people would stare. My bf at that time (now ex) would always point out that I've gained weight, everytime we'd meet. Also people in my surroundings, even my family kept saying \"maybe you should consider losing weight. You can see how much that affected my self esteem... \n\nI think I wasn't that much overweight, I weighted around 85 kg (187 lbs) - june last year. I'm not sure how I've started my journey. But I guess meeting the right people pushed me in the right direction. \n\nOne day, I woke up, installed couple of apps, decided to try them. They were a bit hard and kinda boring but I wasn't going to give up. I stumbled across a channel which I feel in love with it instantly. The channel's videos showed a handful of workouts that anyone can follow, and most importantly I'm having fun while losing weight. \n\nSo I kept going, day after day, month after month. And here I am today, super happy, because I actually managed to lose 20 kg (44 lbs) in just one year. That was my goal, which I'm super close to achieve it. \n\nI could not believe my eyes when I weighted myself this evening. 65,5 kg (144 lbs) is there in front of my eyes. All that hard work did pay off in the end. \n\nThere were many setbacks, I fell down multiple time. But here I am, happy, and I'm in love with my body more than ever. I would like to thank the people who loved my body from the very start to this day now. That kind of encouragement is what I needed to keep going. \n\nThank you so much for reading my story, I just had to tell someone, how I happy I feel right ❤\nAnd I'm hoping that I can inspire someone, that if I can do it, so can you. I believe in you ! \n\n(Sorry for any mistakes, english is not my first languages)", "url": "https://www.reddit.com/r/happy/comments/o4dfo0/im_only_05_kg_left_to_my_dream_weight_and_i_feel/", "title": "I'm only 0,5 kg left to my dream weight and I feel so elated 😁", "social_network": "reddit", "user": "doae1996", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 195, "down_vote": 0, "creation": 1624218406, "permalink": "/r/happy/comments/o4dfo0/im_only_05_kg_left_to_my_dream_weight_and_i_feel/", "nsfw": false, "first_save": 1635441059.0859494, "replies_charged": false}