{"id": "t5_2qh5i_t3_6wmh1y", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "I'm a 28-year-old female, with a bachelors degree in nursing. I found my love for nursing in middle school, where I got the chance to shadow the labor and delivery unit with my best friend's Mom, Pam.\n\nI was 12-years-old at the time, and I got to witness something magical; childbirth. In all of its bloody mess, this perfect little human being was born. Right in front of my eyes. It was amazing.\n\nFrom that moment, I knew I was destined to be a nurse. I graduated nursing school, and accepted my first job with a pediatric home care company. I was thrilled to be making \"adult\" money, to be a nurse for this special little boy. He was involved in a motor vehicle accident when he was just three-years-old. His Mom had picked him up from daycare, and they were on their way home. The little boy managed to undo his chest clip on his car seat. The Mom turned her head to see if he was okay, and simultaneously she crashed into the back of a bus. The impact left the child lifeless. Once EMS arrived, the child was resuscitated and transferred to a nearby children's hospital. He spent the next six months recovering from his injuries. Although he was fully able to recover mentally, he was left with physical impairments for the rest of his life. Quadriplegic, and ventilator-dependent.\n\nI got to be *his* nurse. How lucky was I? Fresh out of nursing school, I got to be his caregiver, and more importantly his friend. We spend the next year together, as I was hoping to advance my nursing skills and become an inpatient nurse.\n\nI applied to many, many jobs before I got a call back about a medical/oncology position. I was stoked. But I was terrified. I interviewed and got the job! It was a physical, and emotional time working inpatient on the medical/oncology unit. Caring for some of the sickest (yet stable) patients in the hospital. Everything I had learned in nursing school, I got to use every day at work. Although I was working as an inpatient nurse, I still felt as though I wasn't in *my place*. So I applied to transfer to the mother-baby unit.\n\nI was offered a full-time position, and really got into my groove. Helping welcome new babies into the world, helping new Mom's and Dad's learn how to diaper, feed, and burp their little ones. It was amazing. I loved it. Watching Mom's and their support system cry their eyes out as their new baby was being birthed. Those are experiences I will never forget. \n\nEventually, I met the love of my life and decided to pack up all of our things and move out of state for the military. It was a big decision, but it was the right one for us. I managed to land a job at the county hospital in our new state, and everything seemed to be going really well. Unfortunately, after just a few months, my new job wasn't working out. I wasn't given adequate resources to safely care or advocate for my patients. My questions and concerns weren't being answered. So, I decided to quit. \n\nI started applying to new jobs back home, as we were anticipating to move back in the upcoming months. I figured it would be better for me to move back before my fiancé, and get settled in a new job, and then he would return home just a few months after me. So I applied. And applied. And applied.\n\nI interviewed at nearly a dozen different organizations. Some for pediatrics. Some for home health. Some for phone triage. Some for inpatient. I waited to hear a response. Weeks went by, and the calls finally started rolling in. I was offered three positions all within the same week. I was overwhelmed that people wanted *me* to work for them. They believed in me as a nurse.\n\nI thought long and hard about all of my decisions. Talking to my fiancé, my Mom, my friends, and journaling the pros and cons. I came to a decision.\n\nThe next day, at 8:07pm, I received a phone call from an unknown number. The voicemail said her name was J, and that she was calling from (yet another) organization. (I had applied to work for her clinic months ago. I received an email saying they had filled the position. I never really thought about that position again.)\n\nShe said she had received my resume a few months ago, after they already filled the position I applied for. She said that she had another position open, and she had been holding on to my resume this whole time. She invited me to apply for the new position, and come in for an interview. (Sweet!!) But, I was still out-of-state, living with my fiancé. I told her my circumstance, and she asked if I was willing to catch a flight for an interview, that Friday. Flights from A-B were ~$600. Driving would take ~10 hours. \n\nI purchased my round-trip ticket and flew out for the interview. I met with J, an oncologist, and a few nurses from the clinic. I've never been a strong interviewer, and I knew that. I had been practicing questions and answers. Writing down everything I learned from my last 11 interviews. I even put together a portfolio of all of my interview questions and answers. \n\nI was asked to sit at the head of the table, and the four of them were to go around and ask me questions relating to the position. I answered as best as I could, only stammering a few times. I could tell my face was getting flush, and that I wasn't doing my best. I was getting overwhelmed, on top of already being stressed out.\n\nOnce the interview concluded, the manager thanked me, and said they would be making their decision in the next week, but I could call her if I had any questions. I've heard that before \"we'll contact you...\". I blew it.\n\nDays went by, and I didn't hear anything. I still had a few pending offers and was deciding which would be a second-best option for me. \n\nThen the phone rang. It was J. She said that everybody at the clinic *loved* me, and they wanted to offer me a position. They *loved* me? *ME*?! I was shocked.\n\nAll of this worrying, stressing, feeling like I was worthless, it paid off! I landed my dream job. The hours are perfect. The patient population is perfect. The staff I will work with...perfect! \n\nI'm so beyond thrilled and proud of myself. I can't wait for this next chapter of my life.", "url": "https://www.reddit.com/r/happy/comments/6wmh1y/good_things_come_to_those_who_wait/", "title": "Good things come to those who wait.", "social_network": "reddit", "user": "ISFJ-T", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1503954905, "permalink": "/r/happy/comments/6wmh1y/good_things_come_to_those_who_wait/", "nsfw": false, "first_save": 1635438843.2337673, "replies_charged": false}