{"id": "t5_2qh5i_t3_az7izr", "request": ["608fc108-cf44-476e-8378-c59ee7483909"], "text": "I'm often hearing words like - don't think about future or past too much. Live here and now. It's easy to say but how to implement it? Recently I started to understand part of it. And here are some examples of how do I implement that approach.\n\n&#x200B;\n\nToday in the morning we with my wife were in the kitchen doing something. I was preparing breakfast and thinking about this episode, while my wife cut the orange peel to make orange zest as the ingredient for some sweets. I asked her “Do you think you can be happy at this moment? And if so, how you can explain the motives?”. And her answer was: “I’m glad that you are doing breakfast for me right now, and also I’m glad that our two-years-old boy still sleeping and we can enjoy the quiet moment, and also there is very beautiful morning sunlight outside and while I’m cutting the orange peel, I’m enjoying the process of creating ideal pieces of it.” That was her answer that contained a lot of different things. It was statical, visual and audial elements of a single moment which she enjoyed.\n\n&#x200B;\n\nThe second example is about breakfast itself. We’ve found the ideal formula of breakfast for ourselves and in most cases, we are using the same receipt and it’s really tasty. I’m sure you have your own picture of a tasty breakfast. So, imagine the situation. I’m doing my best to prepare the breakfast, using ideal ingredients, that I’ve bought specifically for it, serving that breakfast for me and my wife, we give ourselves a time to enjoy our meal and then I have two options. One option is to enjoy how it tastes, what is the texture and flavors, to chew every single bite and get most of it. Because everything is set. The breakfast is ideal, I have time for it, and moreover, eating slowly is healthier. Or I can switch myself to automatic mode to chew with no sense and at the same time to think about different things from the past or near future. That means that I’m wasting my efforts to make that breakfast ideal without realizing how tasty it is.\n\n...\n\n&#x200B;\n\nWhat approaches do you use to live here and now?\n\n===================\n\nListen more in my Sensibly Happy podcast, episode E008.", "url": "https://www.reddit.com/r/happy/comments/az7izr/do_you_live_the_moment_here_and_now_some_examples/", "title": "Do you live the moment (here and now)? Some examples of how do I do it", "social_network": "reddit", "user": "SensiblyHappy", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1552162225, "permalink": "/r/happy/comments/az7izr/do_you_live_the_moment_here_and_now_some_examples/", "nsfw": false, "first_save": 1635441483.5907254, "replies_charged": false}