{"id": "t5_2qh5i_t3_50q1yt", "request": ["8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "I just want to share this story because it was so pleasant!\n\n\nThe cab I'd booked to drive me to the airport didn't show up. I was sitting on the curb (where I was supposed to meet the cab) trying to figure out what I was going to do, when one of my dad's employees drove up! She asked if I needed a ride and I gratefully accepted. I got to the airport sooner than I would have if I'd taken the cab.\n\n\nNext, I realized that, after doing online check in, I forgot to print my boarding pass. I sheepishly admitted my mistake to the check in ladies, and they were so understanding, friendly and helpful! They printed me a new boarding pass and happily sent me on my way. \n\n\nNext I went and bought a bagel, and it was delicious!\n\n\nI stored my boarding pass in my bra, and the security check point lady noticed me take it out and commented \"that's the best place to store your boarding pass! You definitely won't lose it that way\" and I cheerfully agreed.\n\n\nThen, I was selected for a random search and I did the full body scan thing. Two points of interest showed up: one on my arm and one on my head. The security guy doing the scan simply said, \"it looks like the only problem is your HUGE bicep, so you're good to go!\" There was no line in security, either. I got right through. It was super fast and super easy!\n\n\nI then arrived at my gate, about fifteen minutes before boarding. I had enough time to finish my bagel, fill up my water bottle, and fully charge my phone. \n\n\nNow I am sitting here waiting to board. I have snacks for the plane ready to go, along with books, music, and a movie!\n\n\nLooks like they're running late, but I don't even care because I'm having such a good time.", "url": "https://www.reddit.com/r/happy/comments/50q1yt/i_had_the_best_airport_experience_this_past_hour/", "title": "I had the best airport experience this past hour.", "social_network": "reddit", "user": "Burnt_Salad", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 45, "down_vote": 0, "creation": 1472770278, "permalink": "/r/happy/comments/50q1yt/i_had_the_best_airport_experience_this_past_hour/", "nsfw": false, "first_save": 1635442182.855912, "replies_charged": false}