{"id": "t5_2qh5i_t3_gkm90t", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e", "5b81e8b4-a0f8-4747-8a7a-0e37aae01c43"], "text": "Like many of us during the pandemic, I have spent months feeling utterly useless, and especially stagnant in my career & education advancements. My MCAT exam was canceled, graduate offices have been closed, and no phone calls or emails have been answered. I have been desperate to move forward or at least solidify a PLAN. \n\nToday I FINALLY received my undergrad transcript in the mail, and I was finally able to calculate my “major-GPA” (my major was biology with a focus in medicine, which included several additional courses that are required for medical school). I knew that my “overall-GPA”, which included some “fluffers” such as ceramics, drawing, etc., was over 3.0. However, the masters, research-based thesis program I am dreaming of getting into (hosted by the medical school I also dream of getting into) lists admission standards as all the credits I have, plus an overall-GPA *AND* major-GPA of above 3.0. I will not lie, I had a few struggles with my chemistry courses, even receiving exactly 1 official D in my very last semester of undergrad in organic chemistry 2. \n\nI was happy to have my transcript but petrified to calculate my major-GPA. What if it was below 3.0?? This is arguably the best program for Biomedical Science in my state. This masters program is even in the city I live in, and like I said, at the medical school I hope to attend after earning another degree (hopefully this one!!) with a higher GPA than I received in undergrad, when I partied a bit too much. \n\nAs long as I did the math right (which I’ve re calculated again and again) turns out that BOTH my major and overall GPA’s are well above 3.0!!! I am so relieved. Now I just need to get my letters of recommendation and hopefully score a bit better than my first attempt on my upcoming MCAT exam. Which I *know* I can do if I work hard enough. If I can tie these loose ends, I have a real, legitimate chance of getting into this program- which will only makes my ultimate dreams all the more possible!\n\nI just wanted to share this with some strangers, because I’m sure if I run around shouting it to the rooftops I will look both insane and entirely demanding of attention when I do not yet deserve it, because I had not actually been accepted yet, just some good news. This post came out longer than intended so even if it gets no attention here, I just wanted to say I am HAPPY, and I sincerely hope you guys are too =)) Thanks to anyone who read, peace and love!", "url": "https://www.reddit.com/r/happy/comments/gkm90t/just_a_bit_of_good_news_has_lifted_my_sunken/", "title": "Just a bit of good news has lifted my sunken spirits... I am so welcoming of this newfound self-confidence and motivation. I CAN do it.", "social_network": "reddit", "user": "datbeckyy", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1589593579, "permalink": "/r/happy/comments/gkm90t/just_a_bit_of_good_news_has_lifted_my_sunken/", "nsfw": false, "first_save": 1635438832.0941176, "replies_charged": false}