{"id": "t5_2qh5i_t3_27bju2", "request": ["44cd61d3-f01a-4909-b162-9daae7dd79b2"], "text": "When she was three years old, she saw her first dress and put it on. The kindergarten teacher told us not to worry, all boys do that every now and then.\n\nThat 'phase' never ended. \n\nWe always let her choose and we went outside of our hometown, to family, vacation and at home. Don't allowing to be a girl in our hometown and at school was to protect her from bullying if she changed her mind. In practice, when she got home from school she almost always changes into her favorite dress immediately.\n\nA few months back we've talked to other parents that have transgender children and we decided that it was time.\n\nWe have had quite a few talks with the school, a presentation for the parents of her classmates and everything was set in motion. Next Tuesday is her big day: she doesn't have to pretend to be a boy anymore!\n\nI am very happy that she lives in a country that is very liberal.\nI am very happy that most people around us are very understanding. \nI am very happy that school is accepting her the way that she is. \nI am very happy and feel very privileged to be the father of such an amazing, strong child.\n\nThank you for reading my happy thoughts!\n\nEdit: Appereantly, I was a bit premature. We got an email from the parents of a classmate. That they can and will not judge as christians, but we are doing it wrong. Also the school is doing it wrong. How are they supposed to explain this to their children? On the bright side, we got a lot more mails/comments in support so this post is still in the right subreddit. :)", "url": "https://www.reddit.com/r/happy/comments/27bju2/as_from_next_tuesday_our_transgender_child8_can/", "title": "As from Next Tuesday our transgender child(8) can be herself full-time", "social_network": "reddit", "user": "vorik", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1401912810, "permalink": "/r/happy/comments/27bju2/as_from_next_tuesday_our_transgender_child8_can/", "nsfw": false, "first_save": 1635442441.2790887, "replies_charged": false}