{"id": "t5_2qh5i_t3_j2hlks", "request": ["a9b702ea-7cbf-4932-81ef-1b1a68bda265", "64dc2923-ade0-4dd3-ae6c-66779b700555", "4161666b-4b17-4c22-bb40-42efca26f347", "af00f57d-0c85-41f5-985c-7cc20793bcbb", "8bed9c95-eda8-4aca-9f64-c1f6ec35f283", "0344ec6b-2528-4c06-8dba-4c3095c02293", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "# Love Yourself and Watch the World Love You Back\n\nLoving yourself is the one greatest act you can offer the world. When you abide in self-love, you feel happy, fulfilled, and enough. From such a positive place, you will be much kinder and more empathetic towards others, more flexible and open-minded towards life’s challenges, and generally feel much more confident and optimistic towards life. Today, I’d like to share how to love yourself, become the object of your love, and transform your life experience into a happy and loving one.\n\n# Love Your Body\n\nYour body is the one physical entity that you must carry with you from birth till death, so it makes sense to love your body unconditionally and care for it the best you can. When the body is well taken care of, it feels comfortable, strong, and is free from distress. This leads to a higher state of being where one can flourish and do anything one wants to do because the body is no longer a physical barrier. For our bodies to serve us in achieving our goals and maximizing our quality of life, we must learn to harmonize with it, listen to it, and treat it affectionately with its long term wellbeing in mind.\n\nHere is a list of things to care for our bodies and keep it optimized.\n\n1. **Get plenty of rest** – Sleep as much as your body needs every night so you always wake up feeling refreshed, energized, and ready for the day’s work. Sleep early when possible and wake up naturally without an alarm. When you wake up early, the morning won’t feel rushed and you will have time to tend to your morning activities at a leisure pace. When you master your sleep, you’ll have established a solid foundation.\n2. **Drink plenty of water** – The body needs water to flush out toxins and to keep your bodily organs hydrated and operating optimally. By replacing your fluids with water, you cut out all unnecessary sugars that are creating imbalances in the body. Water keeps the body fresh and the mind sharp so always have a bottle of water with you at all times.\n3. **Exercise regularly** – This one is well understood to have major benefits and for good reason. Exercise deepens our breath to oxygenate the body, strengthens our muscles to increase metabolism, and releases endorphins, dopamine, and serotonin to put us in a positive mental state. Exercise doesn’t need to always be intense and uncomfortable. Find a pace that suits you and work up from there. Be gentle to yourself, enjoy your practice, and be consistent.\n4. **Have healthy eating habits** – You are what you eat because your food becomes your body. Eat more fresh fruits and vegetables, less processed foods, and observe your body’s reaction to the foods you eat. Everyone has different food requirements and intolerances and it’s important that we know what works for us. Are you lactose intolerant? Gluten intolerant? How does your body react to excess sugary foods and oily foods? When the food you eat leads to bloating, inflammation, and general discomfort, it may be a sign your body is being harmed. This is one of the major factors in physical distress. Love your body by feeding it high-quality foods. Finally, allowing your body to rest in between meals will help the body enter ketosis autophagy to stimulate weight loss and self-healing.\n5. **Optimize your environment** – Keep your living and working space clean and introduce some life into it in the form of plants and animals. Having some pot plants and maybe a small fish tank around will make your environment much more soothing and pleasant. This will do wonders for your body as it helps you maintain a parasympathetic state meaning you feel safer, happier, and more relaxed.\n\n# Love Your Mind\n\nWhen the body is healthy and comfortable, you can turn your attention to your mind and nourish it with all the conditions that make it joyful, peaceful, and free from stress and anxiety. A person with a healthy mind will navigate through life skillfully, treat others with kindness and consideration, have more capacity to handle greater things, and feel overall more confident and optimistic. A healthy mind is strong in qualities such as will power, patience, joy, compassion, motivation, and wisdom.\n\nHere is a list of things to show our minds plenty of love and care.\n\n1. **Consume good content** – Social media is here to stay and we may as well embrace it. We should use it to serve us by consuming positive and wholesome content instead of wasting our time on content that adds no value to our lives. Consume enriching content to develop new skillsets, see the positives in the world, and learn how we can make a positive impact on ourselves and the people around us. Our time on social media should leave us energized and optimistic, not lethargic, and directionless.\n2. **Spend more alone time** – We don’t spend enough time with ourselves these days. It’s important to be alone every now and then, free from external expectations, to recharge and reconnect. Spending a few hours each week in meditation, walking in the park, or just relaxing at home quietly alone will help us understand more of how we feel, what we want, and what we should do. When the mind is quiet and still, we will learn more about ourselves.\n3. **Be around positive, empowering people** – We are the average of the five people we spend most of our time with. This is because we are social creatures who are easily influenced by our surrounding environment. Be around people who are uplifting, generous, and happy, and their energy will rub off on us in all the right ways. Limit our time with those who are cynical, pessimistic, and sabotaging and we remove a great source of negativity from our lives.\n4. **Practice deep breathing** – During moments of stress, anxiety, and discomfort, take a few deep breaths before deciding a reaction. Deep breathing will instantly bring ease to the mind, comfort to the body, and allow you to enter a parasympathetic state where you will be in a position to make better decisions. If you can incorporate deep mindful breathing throughout the day, you will see great benefits!\n5. **Continue growth and development** – It is important that we are constantly learning something new and improving different areas of our lives every day. Make it a habit to focus on several internal and external long-term goals that make life meaningful and exciting. Learn a new skillset or language, cultivate a few inner virtues, and spend some time improving yourself every day. There is a lot of fulfillment in personal development.\n\n# Conclusion\n\nThe biggest impact we can make on our families, our careers, our social circles, and the world itself, is to show ourselves love and attention. When we take care of ourselves and raise our physical and mental wellbeing, we will be in a better position to look after others. When we are happy, our energy will feed off on others. When we are healthy, we have more strength and confidence to deal with anything life throws at us. When we have taken care of ourselves and have all we need, everything else can be used to serve our external goals and objectives. This is why the best thing you can do is to love yourself, and when you do, the world will be eternally grateful and give you all the love in return.\n\n&#x200B;\n\nSource: [https://bekindbehappy.net/2020/09/30/love-yourself-and-watch-the-world-love-you-back/](https://bekindbehappy.net/2020/09/30/love-yourself-and-watch-the-world-love-you-back/)", "url": "https://www.reddit.com/r/happy/comments/j2hlks/i_wanted_to_share_a_short_article_i_wrote_about/", "title": "I wanted to share a short article I wrote about why loving yourself is the best thing you can do for the world. May this inspire all of us to be kinder to ourselves during these difficult times, because its the single most important thing we can do! ❤❤", "social_network": "reddit", "user": "sickient", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1601450716, "permalink": "/r/happy/comments/j2hlks/i_wanted_to_share_a_short_article_i_wrote_about/", "nsfw": false, "first_save": 1635440799.1754565, "replies_charged": false}