{"id": "t5_2qh5i_t3_nmatcz", "request": ["2293bc08-7671-4d63-b63f-dbe4a3a4858a"], "text": "Now let me preface this by saying simply: I've never built a PC for myself either. That's right, I was a newbie myself. I have a laptop that does everything I need it to and that's it. I don't like playing video games on PC either, I'm a console person. But, I do have some experience in replacing PC parts as I work the help desk at my company. I can replace any needed hardware inside a desktop as needed, even a motherboard, and get it all working as needed. Even if a PC goes down in our office, I can usually diagnose what the issue is fairly quickly and replace what I need if we have the parts.\n\nSo my co-worker, Jin, put out an e-mail to our help desk e-mail group asking if someone could help him build his first PC once all of his parts come in. I stepped up and said I'd help because...well, I don't really know why. Jin is a sweetheart and just one of those people that it kills you to make fun of even in a genuinely lighthearted way. So last Saturday I get to his place and bring my own toolbox and legit the first words to me after he said Hi were \"Oh good, I only have a screwdriver\". Now that wouldn't be a problem if he also didn't mention that he wanted to build a fuc--ng desk also. But again, because I'm so generous, I helped him.\n\nWe spent about an hour and a half putting together his desk and it was a lot of \"Jin hand me that...no not that one, the other one\", stuff like that and he was having a laugh. But, I guided him through building and he put the legs on all by himself like a big boy /s. And eventually it was all done. Now onto building the PC!\n\nSo we both at least knew how to assemble parts on the board and I let him put everything in place. But, his biggest mistake was wanting to put the board in the case immediately, and I stopped him. The reason is because what you want to do is check and see if any of your parts are DOA, Dead on Arrival, before putting it all in the case and having to take everything apart again. So we jumped it by just turning on the PSU (Power Supply Unit) and shorting some pins with a screwdriver to get it to POST and get to the BIOS screen on his monitor. Thankfully, everything was working fine and we finished the build in about an hour, even got him sweet RGB lights inside the case. And then to thank me for helping him, he bought McDonalds for me.\n\nHonestly, this is probably the most fun I've ever had doing basically anything for the longest time. I don't really spend time with other people outside of work. I come in, do my work, then leave. End of story. It was nice to I guess break the monotony for once and do something productive with someone, and learn some stuff along the way. If I had one friend in this world, the closest would probably be Jin.", "url": "https://www.reddit.com/r/happy/comments/nmatcz/i_helped_a_coworker_build_his_first_gaming_pc/", "title": "I helped a co-worker build his first gaming PC last weekend. It was honestly the most fun I've ever had doing something in a long time", "social_network": "reddit", "user": "frosty_eloquence", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1622131608, "permalink": "/r/happy/comments/nmatcz/i_helped_a_coworker_build_his_first_gaming_pc/", "nsfw": false, "first_save": 1635441025.6990469, "replies_charged": false}