{"id": "t5_2qh5i_t3_66mh36", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11", "a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "Video Version: https://youtu.be/lTz_fzZnYY8\n\nWay back in 1913, over 100 years ago, a comic strip started running called “Keeping up with the Jonses”. The comic followed the “McGinnis” family as they struggled to keep their social status in line with their neighbors the jonses, who never even appear in the comic.\n\nSeems silly right? Why would anybody care enough about their neighbors social status to let it effect how they spend their days.\n\nSo how come it seems like today, more and more of us are   acting just like the mcguines family?  \n\nSomething odd has happened within the last 50 years or so. \n\nThe standard of living in the western world has dramatically increased. \n\nYou would think that that would also increase happiness too, right?\n\nWell.. no. Happiness and what makes people happy has generally stayed level, but what has increased is mental illness, depression, anxiety disorders, and narcissism.\n\nThink that sounds a little bit backwards? Because it is. It’s totally backwards.\n\nBut it’s still the truth. The question is, why? \n\nHere’s the thing. Most of the western world is a meritocracy, and a meritocracy is defined as a system where people, based on their ability, select government or the holding of power. \n\nIn other words, your social status isn’t fixed. You have a greater opportunity to become something or someone great, to achieve success.\n\nThat also means you have a greater opportunity to fail, too.\n\nAnd with that, comes greater stress and anxiety. \n\nIt’s the price we pay for abundance and greater social mobility. Does this make it bad? No, absolutely not. But everything good and bad, has a trade off that comes with it. It is what it is. \n\nOn top of all that, we now have the Internet and social media. That isn’t to say they’re bad, in fact, I believe they’re great. They’ve given us a greater opportunity to connect, share, explore, and learn with others than any other point in human history. \n\nIf it weren’t for the internet and social media, a lot of really cool, really creative stuff we all enjoy all day everyday just wouldn’t exist. And that would be a huge bu mmer. \n\nBut on the flip side, This vast amount of information also shows us all of the people we perceive as leading better lives than us. All the people with nicer clothes, faster cars, doing cooler things in better places. \n\nAs wonderful as the internet and social media are, they’re also a constant reminder of the infinite ways we might not be good enough. \n\nAnd we can’t help but feel that way. As humans, we’re constantly comparing ourselves to our peers and the people around us. And in a world where your peers and the people around you become the millions of people online, sharing their various life experiences everyday, it’s hard not to feel lost and inadequate or like you might be missing out.\n\nBut you’re not, and here’s why.     \n\nFirst of all, Humans are surprisingly really good at finding happiness regardless of their circumstances. Happiness is something that you find through self-expression, doing things that bring meaning to your life. Happiness isn’t something you achieve, it’s something that you are. You inhibit it. A happy person doesn’t wonder if they’re happy, they just are. But, like most things, it has to start with you.\n\nSecond of all, what a lot of people mean when they say “I want to be happy” is “I want to have pleasure” and that’s fine, but pleasure isn’t happiness. Someone that’s richer than you, has nicer things than you, or is more accomplished than you still have their own set of problems to deal with. They still aren’t happy all of the time, they still get sad, frustrated, anxious, and all of the other things humans feel. That isn’t saying you shouldn’t strive for better, it’s just saying that you shouldn’t expect better to solve all of your problems and bring you perpetual bliss. \n\nThat’s just not how life works. And that’s a good thing. \n\nA lot of our joys in life are derived from overcoming challenges. There’s a reason they say to focus on the journey and not the reward. Because the journey is where all the good stuff is. The journey is where you experience all of the emotion, all of the uncertainty, all of the life. If all you got was the goal without going through anything to get there, it wouldn’t mean nearly as much. \n\nBeing special, standing out, making money, these aren’t bad things. And they’re good goals to have. If that’s what you want for yourself, you should pursue those things. Just don’t count on them solving all of your problems in life, because like it or not, you’re always going to have problems in life. \n\nSure, your life might change, and it might even get better, but there will still be times where you feel sad, there will still be times when you feel lonely and, yes, there will still be times where feel inadequate and like you could have done more. \n\nThe key is in the simple things. If you can manage to find pleasure in hanging out with your friends, or seeing your family, or reading a book, or eating good food, or being smiled at by a stranger, you’ll do just fine, no matter what you do.\nPeople who can find pleasure in those things, the everyday things we usually don’t even think about, compared to someone who cant, will find themselves much, much happier, regardless of their circumstances or what anybody else is doing. And it will just make any goals they might accomplish, any success they might achieve, or any recognition they might garnish that much better, but only because they knew how to be happy before those things.\n", "url": "https://www.reddit.com/r/happy/comments/66mh36/keeping_up_with_the_joenses_on_social_status_and/", "title": "Keeping up with the Joenses. On Social Status and Happiness.", "social_network": "reddit", "user": "Justincscott", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1492741578, "permalink": "/r/happy/comments/66mh36/keeping_up_with_the_joenses_on_social_status_and/", "nsfw": false, "first_save": 1635439211.1764474, "replies_charged": false}