{"id": "t5_2qh5i_t3_8vu0eg", "request": ["c889a480-189a-4ed9-aa88-81c300413196", "44cd61d3-f01a-4909-b162-9daae7dd79b2"], "text": "I procrastinated renewing my car registration at the DMV to the point that I kept looking in the rear view mirror for the police. I went yesterday, but the line was long and the guy in front of me explaining the process to the person behind me made me realize I didn’t have the correct paperwork to complete the registration, so I left with a plan to come back today.\n\nI got up early and left to arrive 15 minutes before it opened up to be first in line. Somehow, I showed up 5 minutes   before they opened, and there was already 30-50 people forming two lines.\n\nAs I approached the beast, I reached for a bit of stale bread and bit off a chunk as I prepared myself for battle. Paperwork in hand, I marched forward, ready and willing to commit to a fate worst than death itself.\n\nJust as I hit the sidewalk, a breakaway group was being called forth, to be herded like cattle to the other entrance as the other line stared off in the distance like well-fed cattle.\n\nI decided to integrate my being with the breakaway group as a fool-hearted gesture to the care-free inner child who accompanied me on this trip this morning. \n\nThe line was long enough that those at the back could not hear what was being said at the door as they let the privileged few sheepishly plead their case with the gate master. I listened, but could only hear the pleads of those before me.\n\nAs I got closer, my doubt growing, I was confiding in the befuddlement of those asking me if this the correct line around me, it was finally my turn to meet my maker. I stepped up, weak from fear, I raised my paperwork and muttered some words in the incorrect order my brain was trying to articulate. I was informed I was not in the right line, but to “GO AHEAD”, the mighty gate master showed pity on my soul.\n\nAs I turned the corner, time slowed down as my eyes gazed upon the most beautiful sight in all the kingdom. I could not believe what I was seeing. My breath grew short, I quickened my pace as if candy was pouring from a piñata on the floor. \n\nThe empty automated kiosk greeted me with open arms as we embraced in a sort of selfless love no other could experience, it was the best 1 minute of my life. \n\nThe line I was supposed to be in was still outside, I felt bad for them, but quickly changed my attitude as I hysterically laughed as I was leaving the parking lot. \n\nI was most of the way home with a huge permagrin, when the gates of hell were officially opened, and I knew on that day I won one for all of us.\n\nHere’s to the laws of averages!\n\nCheers! ", "url": "https://www.reddit.com/r/happy/comments/8vu0eg/normally_the_dmv_is_hell_but_today_it_was_a_bit/", "title": "Normally, the DMV is Hell, but today it was a bit of Heaven! A definite win for humanity!", "social_network": "reddit", "user": "velezaraptor", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1530638365, "permalink": "/r/happy/comments/8vu0eg/normally_the_dmv_is_hell_but_today_it_was_a_bit/", "nsfw": false, "first_save": 1635441435.96331, "replies_charged": false}