{"id": "t5_2qh5i_t3_197cg2", "request": ["608fc108-cf44-476e-8378-c59ee7483909"], "text": "\nThis is a really long story, but trust me: you're going to want to read the whole thing.  \n\nI'm a collector of [things that are awesome.](http://www.flickr.com/photos/insignificantnobody/sets)  A few months ago, I was in Fredericksburg, VA for the sesquicentennial of the Civil War battle.   I wandered a few blocks from my hotel and into a local store called The Picket Post, which specializes in Civil War memorabilia.  I'm from California, so it's all pretty new to me-- I'm like a kid in a candy store.  Off in a corner (where, in my experience, the best of things are usually waiting to be rediscovered) there was an [old wallet, containing a set of Civil War documents](http://www.flickr.com/photos/insignificantnobody/sets/72157632278087814/detail/) pertaining to a man named John L. Coleman, a Confederate agent during the war.  It wasn't cheap, but I found myself returning to the store to gawk at it for 3 straight days, and I realized I'd be furious at myself if I failed to buy the set for [my collection.](http://www.flickr.com/photos/insignificantnobody/)  And so, somewhat poorer but pleased nonetheless, I walked out with my prize.\n\nMy favorite collectibles are often the things that come with badass stories.  Assuming an 150-year-old wallet of a Civil War Confederate agent would make for a fairly interesting story on its own, I decided to share it with /r/civilwar.  A sterling individual named [roland19d](http://www.reddit.com/user/roland19d) jumped into the conversation and whipped up a family tree with all of John's children.  At some point, he realized he's actually related to one of the people in the documents: John's Coleman Sr.'s  law partner, J. D. Tisdale.  Crazy!  So  I started to ponder... wouldn't it be interesting to track down this guy's family and blow their minds?  Yer damn skippy, it would!   If [roland19d](http://www.reddit.com/user/roland19d) hadn't put that effort in, none of this would have happened.  I don't wanna get all meta here, but people like him are why Reddit is neat.  I took the head start he gave me and passed the info to a professional genealogist with the instructions to find me a living descendant-- ideally one who isn't gonna hear this and be all \"Cool story, bro.\"\n\n\nA few weeks later, I had the name and phone number of John Lewis Coleman's great granddaughter Judith and her adult daughter Susan, who both just so happen to be obsessed with John and have been for most of their lives.  Susan saw pictures of the documents and recognized his signature instantly.  She told the genealogist she wanted to cry; both she and her mother have been studying John for decades.  The Coleman name remains so important to the family that Judith gave her son the middle name of Coleman, who then passed it on to his own son.  They still have John's old furniture, copies of his brother's will, documents freeing his slaves, and gobs of other stuff they've been diligently accumulating for most of their lives.   Judith even has his bed in her guest room!  These are *exactly* the people I wanted to find, so I was utterly overjoyed.\n\n\nWhat they don't have, and have never seen, are any of these documents. Sometime in 1966-67,  [West View](http://www.flickr.com/photos/insignificantnobody/8505116391/in/photostream)-- the family estate in Lunenberg, VA-- was broken into and thoroughly looted.  West View belonged to [Audie Coleman](http://www.flickr.com/photos/insignificantnobody/8505366226/in/photostream), John Coleman's granddaughter, a recluse who may have been [just a little bit crazy.(Bonus kitten!)](http://www.flickr.com/photos/insignificantnobody/8505365876/in/photostream)  She was often seen toting a shotgun around the property and sometimes used it to greet visitors.  Later in life, she locked herself away in one building on the family's 500 acre estate where she lived without running water or electricity; everything she didn't need was stored in one of the two main houses.  Susan's family was very close to \"Aunt Audie\"; Susan remembers vacationing at West View as a child.  Judith's mother Irma cared for Audie in her later years and subsequently [inherited all of Audie's possessions](http://www.flickr.com/photos/insignificantnobody/8504273929/in/photostream) when Audie died in 1967.  \n\nSo anyway, these thieves... they stole *everything*, right down to the baseboards and the railings on the marble staircase. They took anything that might be of value, including many of John's belongings and documents.  The family ultimately recovered a few muskets, but none of John's documents were ever found.  \n\nUntil now.\n\nWow.  I love a great story, but this is also one of my favorite possessions, and it wasn't particularly cheap.   But it doesn't belong to me, not really.  It belongs to John's family.  In Judith's guest room, she still has the bed John made with his own two hands.  They have muskets that belonged to his son John Jr.. They have a ton of other info on this guy, they live and breathe John Lewis Coleman. Yet here I am, holding this wallet filled with Confederate cash and irreplaceable documents that were stolen from their dear old Aunt Audie 45 years ago.  \n\nI'm of the opinion that things that are old often have interesting stories behind them.  It's that story that makes collectibles compelling to me.  I was looking for that story when I began this little escapade, but I never expected it to turn out this well.  I'm actually holding an 150 year old wallet that was stolen 45 years ago-- and on top of that, it's still got the cash inside.   I've found living descendants of the guy who owned the wallet, and they're nuts about John.  I have [John's picture.](http://www.flickr.com/photos/insignificantnobody/8500907775/in/set-72157632278087814)  I've learned an amazing amount of information about him and his family in the process.  Clearly, I got the story I was looking for... and more.  It's not just a lost wallet story, it's *THE* lost wallet story.  As I learn about the wallet and the family, I get a bit of a sinking feeling, because I know deep down that there's only one way I can give this story a satisfactory conclusion.  I have to give it back. \n\nSo, it hurts a little, but that's exactly what I'm doing.  Tomorrow morning, this cache of documents is getting overnighted to Susan and Judith in Greenville, North Carolina.  I took the liberty of bringing in some local media, this being an amazing human interest story.  It looks like there will be a piece about this on WITN, WNCT, and in the Daily Reflector of Greenville.  Ideally, they're gonna be there to film Judith and Susan's happy awesomefaces as they open the package on Wednesday morning, but that will be up to the respective news organizations.  One of you people out there in the Greenville area needs to do me a solid and record that for me, since I live in California and won't be able to witness any of it.  \n\nI'm giving up something precious and irreplaceable, but that's ok.  The story about the time I returned a 150 year old lost wallet is priceless and forever.\n\nSince you've read this far, you get a bonus: Rosser M. Coleman's [\"My Experience in a coon fight\"](http://www.flickr.com/photos/insignificantnobody/8505034745/in/set-72157632278087814), in which Rosser and his father John attempt to remove a raccoon from a tree.  Those tldr people will miss out, but that's ok; they wouldn't read it anyway.  You, on the other hand, are just the kind of discerning individual who'd like to know all about that time Rosser and his dad hunted down a raccoon on the Sabbath.  Don't worry, you have my solemn promise that the dogs don't die at the end of this one.  The raccoon doesn't fare so well.\n\nTL;DR:  I found a 150 year old wallet belonging to a Confederate agent in the Civil War named John Lewis Coleman Sr..  It was stolen from his family 45 years ago.  I'm returning it to his living descendants, Susan and Judith.  I didn't even keep the cash. \n\n", "url": "https://www.reddit.com/r/happy/comments/197cg2/tldr_i_found_an_150_year_old_wallet_belonging_to/", "title": "TL;DR: I found an 150 year old wallet belonging to a Confederate agent during the Civil War. It was stolen from his family 45 years ago. Tomorrow, I'll be returning it to his great-great-granddaughter Susan. I didn't even keep the cash. Crazy cool story inside.", "social_network": "reddit", "user": "random_treasures", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 116, "down_vote": 0, "creation": 1361816133, "permalink": "/r/happy/comments/197cg2/tldr_i_found_an_150_year_old_wallet_belonging_to/", "nsfw": false, "first_save": 1635441488.6683269, "replies_charged": false}