{"id": "t5_2qh5i_t3_coswp8", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "NOTE: Sorry, this is an extremely long post, but it goes through when I started getting panic attacks and through my recovery. Also, sorry in advance for any typos and my bad grammar... I'm using a g-board and also my English is pretty bad.\n\nLast year, for about half a year or so, I had really bad anxiety.\n\nWhen it first started, I didn't understand what was happening to me. All I knew was that I felt weird, and it was a bad kind of weird. It frustrated me to not understand what I was feeling, just that I felt strangely off sometimes (and it felt like it was on a health-level) and I didn't like it. I don't know what I realized first: that when this happens, my heart was beating instantly fast, or that the emotion I was feeling felt close to fear...\n\nIt went on like that for weeks, maybe even a month... During that month, it got worse and worse and I realized something really wasn't right and I wasn't just overreacting. It became hard to breathe during those episodes, it would usually be promoted by or prompt overthinking, and I felt like I wasn't really in my body. I constantly feel afraid for no reason, and I noticed I started to spend more time frowning than I did smiling... a LOT more time.\n\nThen, it got even worse. I began having these episodes when I showered. At first, it was once every three or so days, then every two days, then every day... I would classify them as episodes at the time, because I just couldn't explain it. And these episodes were way worse in the shower, and I feel like that was because there was no one around to watch it happen. I would start to lose my breath, find it hard to breathe, feel my heart pounding, feel so scared, feel like I wasn't even in my body, I felt so detached, so alone, and I would cry so hard I would almost throw up. All I would feel like doing is sitting down on the shower floor and curling up into a ball. This got so bad, I dreaded showers. Absolutely DREADED.\n\nThat continued for months and months. At a certain point, probably two months in, I realized that those \"episodes\" were panic attacks, and I had death anxiety. Being an over-thinker and an atheist, I've never had a way to grasp the idea of what happens after we die, because I believed nothing would happen. I was embarrassed. That's all I felt for a long time, because I thought it was the dumbest thing to have anxiety because of a fear. I hated myself for being that way, and I was so frustrated with myself.\n\nIt was probably around 4 months in when a I finally began to talk to someone about it: my online friend I've had for many years. I knew she has had terrible stress and anxiety issues in the past, and I needed answers to my questions about anxiety problems as well as an ear to let it all out. Plus, I'm still a minor, so I live with my parents, and I love and appreciate my parents, but I've never liked being emotional (especially with my family) so I've always dreaded talking about these things with my parents and kept it a secret... I just wasn't ready to tell them. During the shower I took later on that day, I didn't have an episode. It really helped, and over the course of two months, the frequency of my panic attacks slowly faded away.\n\nI still remember the time I cried at school during my recovery. I wasn't sad, I was happy. I was walking back from lunch to my classroom building (we have to walk outside to go between the two buildings about a quarter mile apart) all alone, since I forgot my backpack at lunch, so my teacher let me go grab it. And I remember I was smiling, and I noticed I was smiling and that I felt so content halfway in, and that meant the amount of progress I was going through was astonishing. I hadn't smiled of felt happy in the past few months at that point, and all I've felt was fear or sadness. It made me so happy, I cried all my way back to the building.\n\nI started talking to a camp friend about my anxiety after that, as well. And from there, it was all uphill. That smile gave me so much motivation, it was such a nice reward... Never had I been more grateful to be able to genuinely smile. It took time, and my spring sports season also really helped with my recovery, but I eventually made it. Once, I was crying myself to sleep daily and relying on rescue pastilles to go through the school day, and now I'm crying tears of joy at the thought of my recovery and enjoying every second of my life. It's been seven whole months since my last panic attack, and I couldn't be happier about whether I'm at in life right now.\n\nLONG STORY SHORT, I had anxiety and terrible panic attacks for months and spent months trying to get better. It's been seven months since my full recovery and last panic attack and I'm extremely glad about it. I'm so grateful for where I'm at now, and I couldn't be happier.\n\nFOR PEOPLE EXPERIENCING THE SAME OR SIMILAR THINGS, please please please TALK TO SOMEONE about it. If you don't feel comfortable telling your friends yet, you are always welcome to talk to me. Talking was what got me to where I'm at, and believe me when I say that it helps a lot more than you can imagine. I went from feeling at my worst to my best in just a few months because I talked about it, and the two friends I talked about it to, I don't see regularly because one is from summer camp-schools and the other is an online friend. Please also find what works for you. For me, exercise really helped easy my stress and anxiety levels, and it seems to be the case for most people.", "url": "https://www.reddit.com/r/happy/comments/coswp8/ive_hit_seven_months_without_a_single_panic/", "title": "I've hit seven months without a single panic attack or case of long-lasting anxiety.", "social_network": "reddit", "user": "poppyfield_76", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 28, "down_vote": 0, "creation": 1565500787, "permalink": "/r/happy/comments/coswp8/ive_hit_seven_months_without_a_single_panic/", "nsfw": false, "first_save": 1635438834.185304, "replies_charged": false}