{"id": "t5_2qh5i_t3_33j2iq", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "This is as much a writing project as it is a post here, so it may get long. Just warning you.\n\n\nI was generally not a happy person as a child. I was a bit chubby, didn't have too many friends, wasn't very good socially, and had a reputation as \"the weird kid\" in elementary school as when I was really young, I *was* actually odd- ADHD or something, I had a million little nervous habits and weird-isms that actually required me to have an in-class tutor, like I was one of the *\"special\"* kids. In 4th grade, in a class of ~200 kids, I had one friend who became an \"enemy\", we hated each other, and as we got older he became popular with the other kids and I didn't. In middle school, him and groups of his friends became incredibly cruel and would stop at nothing, it seemed, to make me miserable. Rumors seemed to be generated daily in that school, (not always about me, thankfully), and just generally it really fucking sucked. Didn't help that I was kind of socially stunted and couldn't really navigate the whole minefield of bullshit.\n\nBy high school, I was actually feeling pretty depressed. I had few friends, and thanks to fairly strict parents didn't get to see them often. At least by the time high school got around, I'd managed to find places where kids wouldn't be as cruel, such as sports. I was a decently strong kid, and became OK at football and good at track & field freshman year (I was a thrower). By that point, though, I wasn't concerned with being made fun of anymore: instead, I was lonely. I wanted to meet girls. But the damage from middle school had been done (like I said, tiny graduating class, my high school total was like 750 kids. In a small high school full of the children of fairly-to-obscenely-rich assholes, reputations stick with you). No girl would talk to me. Our football team sucked, so that got me nowhere as one might possibly expect it would. I was fucking lonely. At least I had fun when I was actually playing the games and practicing shot put and stuff.\n\nFast forward to junior year (11th grade if you don't like people who appropriate university terminology for high schools). Still miserable, but by now I was a better athlete, I'd finally lost (most of) the weight I'd had for a good while, and I was doing well in school. I'd discovered that I really liked chemistry- and biology- related courses (like biotechnology and early chem) and was good at the other science and math classes too, so excelling in the area where most kids had trouble at least earned me a new rep of being smart (full disclosure, I'm not that smart- I just seemed like it in high school. I get mostly B's now, which at my university is pretty average). And I was slowly making new-ish friends.\n\nI finally met a girl that year too, ending my loneliness for a while. We'll call her Emma. Emma was new to the school, and so none of my reputations had sunk in with her yet, and apparently I actually wasn't unimpressive if you didn't yet know me (makes me wonder how this all would have turned out if I'd gone to a bigger school system). I finally got that first kiss (yeah, at age 16), and a few other firsts too. I was fucking convinced I was in love. But of course, I wasn't in love, I was just 16 years old. She and I ended up dating for a while, and for a few months it was good, though I did make an ass of myself semi-publicly several times with/for/around her. The poor girl was epileptic, too, and somehow that made me care for her more. I really did care about her, her health, happiness, etc. My parents initially liked her, but, as it turns out...\n\nEmma was crazy. Like, diagnosably so. And she showed it in front of my dad, before I knew how to recognize it. He stopped liking her after that. The relationship became more difficult, and she started starting arguments because I couldn't see her as much, accusing me of all sorts of nonsense I wasn't even capable of (I was definitely not smooth enough to cheat on her, even if I'd wanted to), threatening to break up and/or actually breaking up, apologizing an hour later and asking forgiveness... Usually through text, woo hoo. Eventually, I got tired of it, and I told her I wanted to break up with her... At which point she told me if I did, she'd kill herself. I was fucking 16, I had no idea what to do with that! Also, she was crazy in good(?) ways, too, and I thought a bit too much with the wrong head, if you know what I mean. ...I mean on the occasions that I tried to break up with her, eventually at the request of my parents, first she'd threaten self harm, then when I'd falter, she'd say \"let's go have sex\".\n\nFinally, near the end of our last year of high school, I got a legitimate excuse to break up with her, when she decided that instead of taking an issue she had with me to *me*, she'd take it to 500 of her closest friends as a Facebook status. That was it, we were through, no questions asked. I was glad to be rid of her crazy ass.\n\nGraduation, hooray, blah blah blah. Off to college.\n\nI was pretty unhappy still at this point. I felt lonely again, I almost missed Emma (well, her sweet/cuddly side, I liked that side of her). I was desperate to make a different reputation for myself, and I'd managed to get into the college with a spot on the football team as well (I was a recruited athlete but they didn't use a \"pull\" to get me in, though they did essentially pre-vet my application with admissions, basically guaranteeing me that Admissions said I was good to go), so I decided I'd be the social butterfly. This was not me, and I had no idea what I was doing. Many people would recognize me each Monday who I didn't recall meeting. This continued for a while, until I decided my drinking habits were unhealthy and so I stopped drinking so damn much.\n\nThen, one weekend, I smoked weed for the first time. I became a pothead nearly overnight, because god damn weed is just good. I became content. But I realized I was still using weed as an emotional band-aid for missing my first girlfriend. I went out and met some new girls.\n\nOne, who we'll call Katie, I really liked. Long story short, we started dating. I was convinced (again) that I was in love, and we stayed together for over a year. For most of those months, she and I really believed we loved each other. It got pretty serious. But we had problems. I couldn't really be myself around her, I couldn't do things I liked because she didn't like them (such as mildly excessive drinking, video games or smoking weed), and she had some problems with me as well. Almost a year and two months in, we had a huge fight that broke us up (the details are way too long), and I was *devastated*. Miss class for three days curled up in fetal position in the corner devastated. My roommate got sick of it, I'm sure. And as an added bonus, sophomore year Katie and I lived in the same dorm. A few weeks after we broke up, I got a call from campus security asking me to come down to their office. Fuck. Turns out she went to them with a bunch of fabricated bullshit and got them to force me to sign a \"no contact agreement\" (they can't call it a restraining order since it's not actually a legal document apparently) threatening me with expulsion if I enter the same room as her or eat in her \"preferred\" dining hall (yes apparently you can get people banned from dining halls at my school), without due process of any kind.\n\nThis all fucking sucked. To top it off, I'd been having some troubling neurological symptoms, probably due to concussions, in football that year. They sent me to get an MRI, and as it turns out when I was called early the next morning to come to the health center, I had a \"something\" in my cerebellum. Something about 1.4 by 1.3 by 0.9 cm. thankfully, it turned out to be benign, but the campus doctor is terrible at delivering bad news, and let slip \"it could be cancer\". So for several months, until my next MRI, I lived under the shadow of a possibly cancerous brain tumor, loneliness, and being forced out of my dorm. I should mention, Katie broke up with me after the tumor MRI, and by this point after the break up it was fucking Valentine's Day. I was lonely. I was on reddit. Suddenly, I saw a post of Patrick Star asking, \"Is weed a valentine?\". As I hadn't smoked in over a year thanks to Katie, was lonely and unhappy and paranoid of losing my education thanks to Katie, and fuck it, it was the worst day of the year so far, I said to myself, \"Yes, Patrick. Yes it is.\"\n\nI went out that day and bought myself an 8th of some quality buds (My university is in a very cold state, but it's also a medical state, and registered growers can use hydroponics, so good weed still can be found there). I went to the town head shop and bought a shitty glass bowl. At least I got high and forgot about loneliness.\n\nI found a new dorm, away from Katie, and moved in with my new roommate, about a week later. My new roommate, who we'll call Mike, had graciously accepted me into his room, saying he missed having a roommate after the last guy left for a semester of academic probation (and apparently to try to start his rap career). I moved all my stuff in, and after I was all done, Mike looked at me, and looked at his desk. He opened the drawer and produced a bowl and some weed, and said, \"so, do you smoke weed?\"... He's now one of my best friends at college. Through him, I made other good friends as well, and finally I felt truly socially capable. I still had some demons, though, and was dealing with nearly all of the above in this post. And Katie, unfortunately was taking some classes in the building my major's department is based in, so I was under constant stress of having to disappear if she showed up. Awesome.\n\nSummer came around, and I'd scored a research job in the chemistry department for the summer. I was so excited... Until I learned that K. Had been hired for a similar position by a computational chemistry professor. I had to see her face intermittently all summer.\n\nI smoked ridiculous amounts of weed that summer. And drank a lot. I lived in a house off campus for the summer where all of my housemates were 21 or 22, and we always had a full liquor shelf. It was a problem.\n\nNear the end of the summer, I was getting high and watching a documentary on ayahuasca. It seemed like maybe, just maybe, it was something that could help people who were trying to work their shit out. Without saying who I got it from- a friend of a friend who used the Silk Road or something, more or less- I ended up trying it. It was... Quite a time. I've described the experience in a comment somewhere, probably on /r/shrooms, but the important part was that I had an epiphany during a particularly difficult part of that trip: that my regrets were due at least in part to my own conduct. That I had to be honest with myself and admit that I had fucked up in ways and that I needed to change myself. I examined how I'd behaved with Katie. I had been sweet and thoughtful, sure, but I'd also been jealous, occasionally angry or irritable, and I'd start fights. I'd also been too needy, depending too much on her for my happiness rather than myself. And suddenly, the \"difficult\" part- a bad trip, essentially- passed, and I felt at peace.\n\nDuring the following days, I processed these thoughts more, and made a conscious effort to change myself. I worked to maintain optimism, and to depend on myself for happiness, and to value myself as a human being and be happy and comfortable in my own skin.\n\nNow, I'm still processing that epiphany. But I'm slowly making peace with the past, and working towards the future. Because that's what matters. The past is the past, and if it can't influence anything to hurt you tomorrow, then it should be a lesson learned and not a source of distress. It should motivate learning and change.\n\nI finally feel optimistic about my future.", "url": "https://www.reddit.com/r/happy/comments/33j2iq/working_towards_optimism_and_a_happy_life/", "title": "Working towards optimism and a happy life.", "social_network": "reddit", "user": "HenryKushinger", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1429742206, "permalink": "/r/happy/comments/33j2iq/working_towards_optimism_and_a_happy_life/", "nsfw": false, "first_save": 1635441996.0742145, "replies_charged": false}