{"id": "t5_2qh5i_t3_6fzudr", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "Nearly six months after my first foray into real road cycling, the saga of me getting a hold of a road bike finally (hopefully) concludes.\n\nWhen I started this current school year, I was living off campus for the first time, and convinced my parents that I was going to need a bike because the buses in this town *suuuuuuck.* So my dad went to the shed and dug out [this](http://i.imgur.com/IDZtzHE.jpg) old MTB that belonged to his dad from 1998 until his death (on it!) in 2003. It's in pretty good working order, mostly, and was top-of-the-line when it came out in 1998, but on the road, where I normally am, it's heavy, slow, and unresponsive. I would never get rid of it, too much sentimental value, but I wanted something faster.\n\nSo come January, I saved up a few hundred bucks and bought a [used road bike](http://i.imgur.com/jkqbihj.jpg) though the local cycling club, which I rode for 16 days until the rear derailleur hanger [snapped off and punched a hole in the rear fork](http://i.imgur.com/8UhnLpV.jpg). So I told my dad that this had happened, and he said \"You must have been putting out a hell of a lot of power to do that much damage going uphill\" and agreed to fund the purchase of a [proper road bike](http://imgur.com/a/frrJV). Then, literally five days later, I got T-boned at an intersection and my brand spanking new bike was destroyed. By some fuckin' miracle, I walked away with a twisted ankle and a couple of bruises, but the light was disputed and insurance sided with whatever argument cost them less money. Also, Giant didn't help me, because I am not Tom Dumoulin. I was back on the Schwinn for the foreseeable future.\n\nNow, I don't know how your parents would react to something like that happening to their 21-year-old, but mine would have *lost their shit.* If I'd told them. Which I didn't, because 1. they are currently 500 miles away and 2. they would have *lost their shit.* Instead, I just got the shifting repaired (again) on the Schwinn and replaced the increasingly broken rear wheel, and got a job at the film department on campus, which I thought would pay enough to replace the bike with an identical copy to avoid raising their eyebrows if they ever came to visit.\n\nExcept then I ended up being relegated to \"reserve,\" only getting shifts at events and whenever somebody called in sick, which usually meant I would get one shift in two weeks and find out about it the morning of. That was not going to pay for it, so I resigned myself to a few more months on the Schwinn.\n\nFinally, though, last week, my supervisor told me that he was going to extend my contract over the summer and give me actual work to do, so he could pay me actual money. I also saved up what I got from my parents and invested $200 into stocks, got lucky, and now have just shy of $400 in value, meaning that I only need about one and a half shifts per week to be able to buy that bike now and still afford rent by the end of the summer!", "url": "https://www.reddit.com/r/happy/comments/6fzudr/im_finally_getting_a_new_bike/", "title": "I'm finally getting a new bike!", "social_network": "reddit", "user": "teuast", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1496913109, "permalink": "/r/happy/comments/6fzudr/im_finally_getting_a_new_bike/", "nsfw": false, "first_save": 1635440719.694609, "replies_charged": false}