{"id": "t5_2qh5i_t3_hs6uk0", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "4161666b-4b17-4c22-bb40-42efca26f347"], "text": "In the past years, I struggled a lot regarding different aspects of my life. One of these aspects always lingering and overshadowing the other parts was the publication of an article in my role as a phD student. Writing was utterly exhausting, and I've never imagined this whole process to become so excruciating. All the redrafts, corrections, additional data collection, debating with reviewers, dealing with my own compulsion not do any mistakes, self doubt, dependency on others, feelings of inadequacy, not being \"enough\" to fulfill the expectations of supervisors, lack of validation. As this whole idea evolved from an idea of a project dating back to 2015, I cannot vividly remember a longer period when this \"thing\" was not always present in the back of my mind. Especially in the beginning, I shed so many tears from everything connected to it that doubt became like a constant companion that took full control of my life when I wasn't mindful enough.\n\n\nI eventually stopped imagining the moment it would actually be published, as it seemed so incredibly far away and, stretching over years, it just became \"this thing\", maybe from numbing down in the whole process.\n\n&nbsp;\n\nTwo days ago, I got the message that it was accepted for publication. \n\n&nbsp;\n\nI do remember that sometimes when I envisioned this moment I thought I would be incredibly floating, proud, feeling accomplished and, maybe, happy. However, what I feel right now is different. I feel ... contemplative, reflective. Grateful. Calm, somehow peaceful. Kind. Finally being able to be kinder to myself. I wouldn't describe the feeling as pride or happiness specifically. It's like my subconscious has this gentle smile directed at myself and shows me the beauty that things can come and go, but, most importantly, there is rest eventually. \n\n\nI don't think people need to survive these or similar struggles to be able to experience this wonderful feeling. But every step of the process ... getting up once more than you fall, getting help, allowing yourself to rely on others when you're in need, admitting how hard things can be ... I think all these aspects are piece by piece part of what help me actually being able to perceive this smile right now. If I could extract the most precious aspect, I would describe it as the kindness I feel towards myself right now and the gratitude that I'm able to feel it is there. In retrospect, allowing more kindness for myself along the road would have made everything seem less insurmountable. \n\n&nbsp;\n\nTo everyone reading this, I hope you allow yourself to be gentle with yourself, lenient towards what makes you worry, generous with compliments you give and take, and, most importantly, are sometimes able to give that doubt a home. At times, I felt this companion was just a voice longing to rest somewhere, too, and if I had listened more closely, it would have told me not to forget I'm just human and it's okay to be flawed.\n\n&nbsp;\n\nLife really can be wonderful :)!", "url": "https://www.reddit.com/r/happy/comments/hs6uk0/today_i_learned_there_are_better_feelings_in_life/", "title": "Today I learned there are better feelings in life than happiness!", "social_network": "reddit", "user": "JustBenjay", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1594893325, "permalink": "/r/happy/comments/hs6uk0/today_i_learned_there_are_better_feelings_in_life/", "nsfw": false, "first_save": 1635439336.1982071, "replies_charged": false}