{"id": "t5_2qh5i_t3_psgb4b", "request": ["e78e5c86-dbf1-4ab8-a98c-e9d544934b7c", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "Hello everyone! Happy World Gratitude Day!\n\nI’ve spent the last few months thinking over the last few years of my life trying to figure out what could’ve helped me deal with my problems and saved me from those tough times of having a body disorder, bouts with mild depression, and just severe self-critique. And, could it be something that would be helpful universally?\n\nI figured out one thing that was common between everyone who I’d seen struggle a lot, and it was the poor health of the relationship that they had with themselves. I heard my friends talk about themselves so cruelly and it broke my heart because what I would say to them would be the stark opposite of it. But, then I realized that was how I would talk to myself too. We were all hateful to ourselves. But, why? It definitely wasn’t helping.\n\nDisclaimer: Shameless plug ahead :P\n\nSo, I decided to create a 21-day self-love course that would help people like you and me form a better relationship with ourselves. To help us become our own friends. Even if we can’t control everything that happens to us, we can control how we behave with ourselves through those things. It’s free to take and I just want to share it hoping it can help someone out there because we really do deserve to feel loved, especially by ourselves. I wish you well :)\n\n[You can access it here](https://courses.gratefulness.me/p/21-day-self-love-course?utm_source=reddit&utm_medium=posts&utm_campaign=21%20Day%20Self%20Love%20Course)", "url": "https://www.reddit.com/r/happy/comments/psgb4b/id_been_planning_to_make_a_selflove_course_for/", "title": "I'd been planning to make a self-love course for months and it's finally out!", "social_network": "reddit", "user": "aarushi_77", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1632221471, "permalink": "/r/happy/comments/psgb4b/id_been_planning_to_make_a_selflove_course_for/", "nsfw": false, "first_save": 1635443178.950993, "replies_charged": false}