{"id": "t5_2qh5i_t3_ijtmvb", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "I want to be able to talk about my personal growth but I don’t want to seem like I’m mocking my friends who still suffer from mental health issues and I don’t want to force myself upon anyone else, so I figured I’d post here. Feel free to read all or part. \n\nI was always a shy kid growing up. I’m about to turn 18, for the record. By the time I was in junior high I kind of realized that I had fallen behind all my peers socially. Everyone else knew each other, everyone else hung out after school, everyone else was sociable and could hold a conversation and I struggled with all that. I had just one good friend growing up, and around this time she moved away so I just kind of inserted myself with her other friends who were still here. They didn’t bully me per se, but they used to call me lame/boring a lot, one would constantly be asking me why I was so quiet, I remember they even told me I looked like a mass shooter at one point which I wasn’t necessarily hurt by, I just found tasteless. \n\nIt was easier for me to make friends in online communities so by this time I had a few friends the same age as me who I had met online. I tried to keep this separate from my irl life, but my friend group constantly wanted to invade my privacy, ask who I was talking to, etc etc. Basically they all just treated me badly most of the time (I’m not saying it was all bad, there was some fun) and that kind of fucked me up for awhile. Not to mention they called me clingy when I hardly wanted to spend time with them and would constantly be talking about their weights which made me super insecure growing up (since then I’ve definitely lost some weight but I still have some body issues). \n\nI kept telling myself I would cut them off when I got to high school, so I kind of did. If they were in my classes freshman year, I didn’t talk to them, and lucky for me they didn’t reach out to me. But for some reason I expected high school to be this kind of starting over point for me? Which it really just... wasn’t. I felt super disappointed because everyone still all knew each other and I hardly had any friends, and one thing that also made me nervous was the fact that I didn’t really use social media and felt like I couldn’t catch up to the followings all my peers had, so I just tried to shut everyone out and only talk to 1-2 people per class just to get the day over. \n\nI tried to keep myself occupied but this was around the time I started to have serious self-worth issues. I wanted people who cared about me and would support me and people I could have fun with. I didn’t like how I looked when I saw myself in the mirror. I thought I was gross. My parents started going through a divorce at this time and my dad physically threatened my mom and i (i’m an only child) saying he would kill her, he would break into our house, and at one point he did (I was home, too afraid to confront him so I locked myself in my room) and he broke our TV. He also said he would commit suicide multiple times, would call me at all hours of the night begging for my mom to take him back, and was all around a POS. I could go on longer about this but I won’t. \n\nAround the middle of sophomore year my then-girlfriend introduced me to one of her friends, a girl who I’ll call Abc for story’s sake. Abc was super funny, sweet, and all around a great friend, and she and my girlfriend, along with the few friends I had in online communities were probably what kept me going. They were the ones who told me I had value and that I deserved better than how I had been treated. Probably around a year later my girlfriend and I had a nasty breakup and cut contact, but Abc was there for me the whole time and I genuinely consider her my best friend. She constantly encouraged me to do things that I was too anxious to do. I didn’t want to stand out at all, I didn’t want to feel seen because I didn’t want people to dislike me or make me feel worse about myself. \n\nFor this period of my life I had almost no personality besides going to school. I dressed plainly, didn’t talk, didn’t step out of line. Looking back I was like a zombie. Around the time I turned 16 I got a job and I really do think that this and meeting Abc are probably the two reasons I didn’t end up killing myself. \n\nI was working part-time at a fast food place, so it wasn’t super glamorous, but it felt like something fresh. My coworkers were all mostly just barely older than me and they were so funny and welcoming. I never dreaded coming to work. And as I got more used to interacting with customers from doing my job, I felt like I was more open to talking to them, and to reaching out to other people, and although I still felt depressed because of my lack of “deep” relationships these shallow friendships were so meaningful to me. \n\nAround the summer after my sophomore year was when I got extremely depressed. This was the first time in my life I felt so hopeless and suicidal, and the first time I hurt myself. I hated my looks, my art, my writing, I hated my school performance, I hated going to work, I hated the monotony of living. This hit hardest during fall/winter of that year and even up to january 2020 I was feeling suicidal. \n\nAt one point I talked to my school counselor and social worker about my suicidal thoughts and they did almost nothing to help me. I didn’t want to bother my Mom because she was already dealing with my father and job changes and I didn’t want to be another burden on her but I felt like I couldn’t do it anymore. It got to the point where I lost 80 pounds in a year because I couldn’t bring myself to eat. I would sleep almost 12 hours a night and I didn’t care about any of my hobbies. My life just felt empty. \n\nIt was around the time I started taking my meds that things started looking up. They were what kick started me on making healthy habits. My friend Abc made me promise I would try antidepressants before I killed myself, and I felt like that was the best I could do. I was afraid to take them at first in case they made me feel worse or didn’t work at all, but the first brand my doctor put me on seemed to do the trick. \n\nI had disposable income, one super good friend, a job, and decent grades. I was trying to take things one step at a time. \n\nI dyed my hair. Abc encouraged me to go shopping with her and pick out clothes and the only reason I ever bought those was because i wanted to look good WITH HER. I would never have done that for myself. I would’ve never even dared to wear SHORTS for fear of people calling me fat, thinking i’m ugly, judging me, whatever. But I finally stopped caring about that because Abc was just as nervous as I was but she was excited. We were taking steps towards developing our identities. Our styles. Becoming ourselves. \n\nI feel like quarantine and covid-19 have actually been extremely good to me. I felt like not being around my classmates at school encouraged me to be myself. I didn’t have to worry about the eyes on me in the hallway, classroom, or library. I bought cute outfits, I bleached part of my hair, I even started practicing doing makeup. I was working a lot to fill up my free time and became super close to my coworkers. They’re some of my best friends now. We used to only bond over smoking weed and now we still smoke but we can talk about anything or be deep with each other or hang out outside of work. \n\nThe first time I hung out with my coworkers outside of work was such a huge thing for me. I finally felt like we were friends rather than just people who worked together. Because they were spending their free time with me, by choice. That thought made me so proud. That I finally had friends. And I was dressing nicer. I was putting effort into my appearance for the first time in my life and I was actually getting compliments. My friends would always try to hype me up and they still do, and their support means the world to me even if they don’t know it. I always needed that push from people to actually follow my dreams. And they gave me that push. \n\nMy dad has calmed down for the most part. He lives with his mom, he’s still pretty depressed but he’s doing a lot better and he’s taking his health seriously and trying not to drink. My mom recently left a stressful job and is excited to start her new position on Wednesday. I’m super chill with all my online classes and usually work five days a week, too, but I don’t feel stressed out at all. \n\nThis is the first time in my life where things have felt this good. I’m not sure what to do about it. Abc and I are still close friends, she’s been having her own struggles so I want to be there for her like she was for me. I just felt like 2020 has treated me, personally well even if overall it hasn’t been good. I’m also super proud of myself for getting a 5 on my APUSH exam despite studying during a global pandemic. I’m also going to be graduating a semester early, so I’ll be done with high school in January. I’m looking forward to leaving that place behind. \n\nI’ve picked up some hobbies like writing and drawing again. It’s a shame I don’t have as much time for them as I want, but I don’t judge my value as a person by the quality of what I produce anymore. I can take my time and do things for fun. It’s crazy how so much changed for me in less than a year. \n\nTLDR: life DOES get better", "url": "https://www.reddit.com/r/happy/comments/ijtmvb/i_finally_feel_like_im_getting_where_i_want_to_be/", "title": "I finally feel like I’m getting where I want to be in my life.", "social_network": "reddit", "user": "paradoxities", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1598858936, "permalink": "/r/happy/comments/ijtmvb/i_finally_feel_like_im_getting_where_i_want_to_be/", "nsfw": false, "first_save": 1635439338.350073, "replies_charged": false}