{"id": "t5_2qh5i_t3_kd6qly", "request": ["e9d5c1b3-4f2e-427b-a98e-af434f9cf1da"], "text": "It’s been a rough year for everyone but especially for my mom. Not long after covid started appearing in the US she was diagnosed with brain cancer. She’s had surgery, chemo and is doing very well all things considered. She’s pretty much recovered and is now doing the consistent checks and doctors appointments and tests, which have all been coming back good. \n\nBoth of my parents are retired, social security, disability, etc. fixed income sort of situation. Not much to spend on frivolous things. I’m (30m) an entry level insurance rep for a speciality pharmacy and make decent enough money for a single guy living with his dog, not much but enough. Only been working this position for about a year, which gave me a raise of about $3-$4/hour. \n\nThis year I had managed to save a little more than $1000 and was thinking about how I wanted to spend it. My mom loves Rift, I got her to make a WoW account when I was 12 and she’s been into MMORPGs ever since. It’s been years since she’s been able to play because gaming computers can be expensive and her last one died. \n\nMy dad and I went to bestbuy today after I finally decided what I wanted to get. So I got my mom a asus gaming laptop with 16gb ram, gtx 1660ti & intel core i7. It’s not the best of the best but it will run the shit out of Rift. \n\nI’m so excited for Christmas now. I wanted to give it to her today but asked if she wanted her gift now or on xmas and she decided to wait. Now I have to hold onto this thing for two weeks and its killing me lmao. \n\nSeriously, I haven’t been this happy in a long time or excited for future plans and I just can’t freaking wait for her to open it! \n\n\nSorry for format", "url": "https://www.reddit.com/r/happy/comments/kd6qly/i_bought_a_loved_one_an_awesome_xmas_gift_and_i/", "title": "I bought a loved one an awesome xmas gift and I haven’t been this happy or excited in a long time.", "social_network": "reddit", "user": "NotObamasClone", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 47, "down_vote": 0, "creation": 1607980509, "permalink": "/r/happy/comments/kd6qly/i_bought_a_loved_one_an_awesome_xmas_gift_and_i/", "nsfw": false, "first_save": 1635441124.6108618, "replies_charged": false}