{"id": "t5_2qh5i_t3_79bx2h", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "Forgive me for this long text and for my english as it might have a lot of mistakes.\n\nI started working at this company last year (1 year and 6 months now) and it was just the usual depressing factory job. Past 6 months, after a lot of trouble trying to click with the person I was working with (he was very difficult to work with, especially with people who were beginners), I asked my team leader if it was possible to change places and have another task.\n\nThere was one. Probably the most physical job in the whole company. You literally had to walk 15Km or 9 miles for my American friends, everyday. At least that was my average. Carry hundreds of containers everyday. Containers weighing from 10Kgs to 15Kgs (22lbs to 33lbs). Working 6 days straight. 7 days straight once a month. The schedule changes every week. One week 08:00 - 16:00, the next 16:00 - 00:00 and the next 00:00 - 08:00 and repeat. \n\nMy arms have \"black marks\" (I don't know what to call it but, it's that mark you get after your muscle gets injured and becomes yellowish, sometimes purple) from carrying stuff around and can't seem to lose them as I really don't have enough time off work for them to heal completely. My hands are not pretty even though I use gloves most of the time. My back hurts, my legs too. Sometimes, exhaustion, ironically, doesn't let me sleep. \n\nEven though it was difficult, I gave it my all every single day. They needed someone for extra hours, I was there. They needed someone for the heavy lifting, I was there. Someone to work on day offs, I was there. I sacrificed a lot on a personal level to be able to work and provide for my parents. \n\n\nAfter all this time, I started thinking if all this hard work would lead me somewhere and kept imaginating scenarios. But the reality was, with my level of education, I was probably condemned to be doing this job for my whole life as in every job offer the company had, you needed to be an engineer to be able to climb through the ranks. Honestly, I didn't want that for me, so I seriously started thinking about finding another job. \n\n\nYesterday, after my lunch break finished, I went back to work. As of minutes, I see my two team leaders approaching me and telling me that they needed to talk with me. I said sure, without any idea what was coming my way. I just thought they had a task for me and wanted to explain it to me. I followed them and I see them entering the meeting room and my immediate thought was \"Shit shit shit, am I getting fired, did I fuck up somewhere?\" I don't know why did I think this as I knew I had done nothing wrong, but that was all I could think. After a brief silence, they start telling me that all year long, they have noticed how hard I've worked and how dedicated to my job I am, how passioned... At this point, all I'm thinking is \"Is this happening? What in the blue hell is happening?\" They kept telling me that I was a very good worker and that I was very dedicated, etc etc. I just wanted them to go straight to the point!!  After all this, they said it. \"We're offering you a new position.\" I started stuttering A LOT (not a good first impression, I know), but I knew I had to be calm and composed so I, successfully, tried my hardest. They gave me a brief description of the position they were offering and how serious it was, if I was ready for the new resposabilities and so on. \n\nAfter thinking about everything they said, I accepted! They did congratulate me and told me to not ever think that hard work goes unnoticed. They still didn't know when I'm going to start with my new tasks as they still had to communicate with their higher ups that I had accepted the offer. Then they said \"That's all\" and I asked if could get back to work.\n\nAfter I left the room, my legs and hands were shacking HARD. I never thought this would be possible. I went to the bathroom, called my parents to tell the news and god, were they happy.  \n\nI can't wait to start and I've never been so motivated to work again. All because now I know that all that hard work wasn't for nothing.\n\n\nI just want to add up that if you're in a similair situation, don't give up. There's almost always someone watching your hardwork, and even if that hard work doesn't get you higher, just be happy for yourself because you gave it your best shot.\n\n\nThanks for reading and have a good day!", "url": "https://www.reddit.com/r/happy/comments/79bx2h/yesterday_i_got_promoted/", "title": "Yesterday, I got promoted.", "social_network": "reddit", "user": "next_DanDy", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 574, "down_vote": 0, "creation": 1509217444, "permalink": "/r/happy/comments/79bx2h/yesterday_i_got_promoted/", "nsfw": false, "first_save": 1635439352.2749841, "replies_charged": false}