{"id": "t5_2qh5i_t3_hbwx0i", "request": ["74704fa2-216a-4299-aa5c-2674d62eb4e5"], "text": "I've been in love with this guy for years. We've been friends on and off - usually a kiss will send us separate ways for one reason or another (immaturity, guilty feelings, etc).\n\nHe popped up in my DMs about a week ago saying he was moving. I was kinda upset because obviously I was gonna *eventually* tell him how I felt, you know how it goes. We hung out. Turns out he's only moving to our old hometown 1.5 hours away, which isn't bad at all. We had a great time hanging out, and in his words, \"didn't miss a beat.\"\n\nWell I decided to go home today to see my dad for Father's Day since I can't this Sunday. After I saw him, I texted mah boi to see if he was free. He was.\n\nAgain, didn't miss a beat, laughs were had, and *man* have I missed this guy! Then he randomly tells me he's on Bumble before changing the subject. I was driving us to Sonic and couldn't fully respond, much less process what in the world he was trying to say. Before I left, I asked him what he was doing on there and he told me what he was looking for - all qualities in a person *that I have.* (I felt super great about that, ngl, but in the moment couldn't find a smooth way to be like B YOU'RE LOOKIN AT HER.)\n\nAs the evening was coming to a close and I was about to leave, he walked me out to the car. I turned around because I wanted to tell him how much *I* wanted him. Please, don't date someone else. I was begging, but couldn't get the words out. He mentioned something I barely heard and I told him he needed to be a bit more wild (in retort to whatever it was he said). He looked at me and said, \"oh don't worry. I will.\" I laughed, and hugged him goodbye - he moved my face to kiss it! \n\nHoly heck you guys, I'm still *reeling*! I can't believe it. Writing this out makes it sound like \"duh he liked you\" but for real we were super close friends so sometimes the lines get blurred, and emotions are misread.\n\nI just... he *held* my *face* in his *hands* and kissed me, so perfectly. We've been past the \"is-this-a-fling\" stage for so long that I think it might actually be happening this time! He opened the door for me to leave and before he shut it said \"I love you.\" Of course I instantly said it back because it's all I've been able to think about since I last saw him. Then he said \"will I see you again soon?\" I said \"Yes. You'd better!\" That boy smiled and shut the door. Then he waved at me from his porch as I drove off.\n\nUgh he's so cute and I'm just.... I'm just so blessed. All the bull *crap* leading up to this day has been so intense, and I just don't even have the words to express how danged lucky I feel.\n\nThanks for letting me gush, Reddit. I feel like the luckiest human on the planet today! I hope you're all well, and I feel overflowing love for everyone and everything right now. Wow.\n\nEdit: words are hard rn", "url": "https://www.reddit.com/r/happy/comments/hbwx0i/you_guys_you_guys_it_finally_happened/", "title": "You guys! You guys, it finally happened!!", "social_network": "reddit", "user": "auntruckus", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1592554892, "permalink": "/r/happy/comments/hbwx0i/you_guys_you_guys_it_finally_happened/", "nsfw": false, "first_save": 1635442128.996, "replies_charged": false}