{"id": "t5_2qh5i_t3_1csn0y", "request": ["25d24ca5-f502-424e-a8f8-3466abfbbd33"], "text": "Well I'm 22, never crushed on a girl, have never been in love.  I blame my rather shitty adolescense with my father abonding my family and me subsequently not letting anybody or anything near me since. \n\nI have hooked up witih a lot of girls in the last year or so, mostly just makeouts when dancing and usually nothing more, certainly not feelings. However last week while out getting drunk and dancing in the club I met this really amazing girl. At first it was as usual, we danced, made out, exchanged numbers and went our seperate ways at the end of the night. For some reason though I thought this chick was really cool, so I decided to call her and arranged a date. We grabbed  a cocktail to go and hung out by the river. She made a really cool impression on me, but I wasn't sure if I just was horny or actually liked her. We made out a lot on the date, both of us had a ot of fun, so we met again last night. This time in the same club again. Drunk, dancing and kissing we had an awesome time. It felt so fucking awesome after the club closed to walk to a cab with her, ride her home, make sure she got home safe, and kiss her goodbye. It did not even really cross my mind to try anything that night, I was just genuinly happy to walk hand in hand with her down the street. One of my best buddies who was with me tried to inspect her in the way only he can, acting like we are in a movie and asking her about stuff that would show if we were compatible (Stuff like \"what do you think about that BMW?\" \"Eh, I hate fancy cars\" and then he would pretend to cross that off the check list. He continued with questions like if she smoked weed, what she thought about our favorite move, how she is handling school etc It was fucking hilarious, because it was like an inside joke between him and I. She told us we are weird, but laughed it off and grabbed my hand a little tighter) Her awesome answers had me smiling and giggling inside. in his drunken state he then said something like \"Allright, dude, she can be accepted as your girlfriend\". Obviously we aren't at that point yet at all, but she gave me a very warm smile said \"A friend right now\" and gave me a kiss. It felt so awesome to just finally have a girl I can in the near future maybe call my girlfriend by my side walking happily hand in hand. \n\nThis girl has seriously managed to get to me, for the first time ever I am really looking forward to just seeing a girl without any other intentions. I'll gladly wait for sex if I can just get to hang with her some more. I know this sounds really basic for a lot of people but I am getting euphoric right now realizing that I am not broken, that I am actually capable to maybe develop feelings for a girl. This is a huuuuge step for me. I am willing to set myself up to get hurt now, I'm going to try and go for her, and I think I might pull it off. Goddamn I'm excited, gotta be careful not to be too eager, I don't want to scare her away.", "url": "https://www.reddit.com/r/happy/comments/1csn0y/for_the_first_time_ever_i_am_really_crushing_on_a/", "title": "For the first time ever I am really crushing on a girl!", "social_network": "reddit", "user": "idk112345", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 54, "down_vote": 0, "creation": 1366544041, "permalink": "/r/happy/comments/1csn0y/for_the_first_time_ever_i_am_really_crushing_on_a/", "nsfw": false, "first_save": 1635440668.5645137, "replies_charged": false}