{"id": "t5_2qh5i_t3_anxc4b", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "I am so happy right now, I have a charity place for the London Landmarks Half Marathon on March 24th, I needed to make a minimum sponsorship of £350, as per the charity place requirements, and I just reached that!  This means I definitely will be on the starting line, and I definitely will be crossing that finishing line with the most enormous sense of pride in myself going.\n\nI'm running for a charity that specialises with premature births, and I was a premature baby, so I really hope I can show new parents of premature babies that we can survive and we can succeed.  I'm severely mentally ill and the voices in my head have been taking great pleasure in trying to shoot me down, but, I'm getting out there everyday and training.  My eating disorder is so stable right now, as I don't feel guilty eating anything as I'm burning so many calories, and I'm burning them for the right reasons, I'm loving how strong my body has become.  I'm even powering through my physical ailments, and really do hope I can show people that being premature does not limit you.\n\nYes, I've had a lot of doubters, people laughing at me, thinking I'm taking the piss, so many excuses on sponsorship, I swear, raising the money has been harder and more stressful than getting myself physically able to do this, but, it doesn't matter now, any extra money I get at this point is a bonus, and I've truly learned who my real friends are and had the opportunity to cut toxic people out.\n\nSo yay for me, and yay for doing something I am genuinely proud of myself for doing, and yay for my little dog being the best training buddy going.  Yay! ", "url": "https://www.reddit.com/r/happy/comments/anxc4b/im_running_a_halfmarathon_and_proving_all_my/", "title": "I'm running a half-marathon and proving all my doubters wrong.", "social_network": "reddit", "user": "FlawsAndCeilings", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1549496937, "permalink": "/r/happy/comments/anxc4b/im_running_a_halfmarathon_and_proving_all_my/", "nsfw": false, "first_save": 1635442239.5077617, "replies_charged": false}