{"id": "t5_2qh5i_t3_nb5unt", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "So it was actually on my birthday last year. Up to that point, I had been seeing a therapist for things that my previous foster parents did to me and also just working through my anger of losing both of my actual parents, my mom passing when I was 9. When my now adoptive parents first took me in though, I just didn’t trust them. And I hated my adoptive dad simply because I was afraid it would be the same thing all over again. Lots of angry shouting between us and us both saying things to each other we shouldn’t have. It was pretty bad. But, as my therapy went on, I eventually started to open up to them little by little and apologized for a lot of stuff I said and did. Though I actually opened up to my mom more than my dad at first. But, by the time my birthday came around, I could honestly say I was comfortable with being around them and started to see them as my actual parents now.\n\nSo we had a small birthday party for me with only my closest friends and immediate family because of pandemic reasons. After everyone left, I was up in my room and my dad knocked and asked if he could come in. So he sat next to me on my bed and I immediately thought I was in trouble for something, but he reassured me I wasn’t. He asked if I had a nice birthday and even asked how my therapy and life in general was going. This was the first time we really had a talk like this. I told him everything was fine and then, never seeing this emotion on his face before, he got very sorrowful and worried for some reason. I asked what was wrong and then, out of nowhere, he said “Well I really just wanted to say I’m sorry”. I said “Sorry about what?”, “Well everything. I got angry at you all the time because I thought you were ungrateful or something like that. But, at some point I just realized you were scared and angry. I don’t blame you. I would have been too. But I just couldn’t see it for some reason. And I’m sorry”.\n\nBy this point, I was at a loss for words and he just kept talking. “You don’t have to forgive me. But just know that me and your mom care about you so much. Love you like nothing else. I know I do. And I’m sure your parents are proud of you, wherever they are”. He pointed to a framed photo on my nightstand I have of my mom and dad. Normally I would get extremely angry when someone mentioned them. But, in this moment, all I could feel was my eyes well up and my breathing was like I just ran a marathon. I wanted so desperately to just hit or throw something. But instead, he just reached out and put his arm on my shoulder and, out of I guess instinct, I just wrapped my arms around him and started crying very hard. I hadn’t been like this since my mom died.\n\nHe held me tight against him, and all he said was “It’s okay sweetie I’m here. It’s gonna be okay”. Him saying that only made me hold on to him tighter and cry even harder. But I eventually calmed down and the anger I had finally subsided. But I wasn’t happy or anything like that. Just empty, really. I told him I was fine and we just kind of left it at that, though I did cry myself to sleep that night. The next morning, I talked to him in our kitchen and also apologized for the things I said and did and he moved past it saying it was okay. I hugged him and this time it felt different. Like I genuinely felt safe for the first time in a long time. I didn’t cry again, but I did say “I love you too, by the way” as a response to him saying it to me the night before and we both smiled.\n\nFrom then on, things got better between us and now I honestly feel myself being closer to him more than my adoptive mom. Don’t get me wrong, I love them both. It’s just something about his personality and character that I find similarities of my own with and makes me that much closer to him. He’s the first person I go to for most of my issues actually. He’s a good dad and a good person. I can’t imagine where I’d be without him or my mom.", "url": "https://www.reddit.com/r/happy/comments/nb5unt/the_first_real_heart_to_heart_i_ever_had_with_my/", "title": "The first real heart to heart I ever had with my adoptive dad", "social_network": "reddit", "user": "vacant_helper", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1620871689, "permalink": "/r/happy/comments/nb5unt/the_first_real_heart_to_heart_i_ever_had_with_my/", "nsfw": false, "first_save": 1635439312.446867, "replies_charged": false}