{"id": "t5_2qh5i_t3_5brwjp", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11", "4de8d439-3f8c-406c-9767-31bcb471a057"], "text": "Some of you may remember me from a few months ago when I posted about my boyfriend asking me to me marry him in the sweetest, most loving way ever. He had woken me up at 4 in the morning because he literally couldn't wait to buy a ring or anything else, and absolutely had to ask me right there and then to be his wife. And of course I said yes, then decided to share my little story with all of you because I was so ecstatic, and well... happy... to know that I was going to spend the rest of my life with someone who means the world to me. \n\n\nAnd I have to say, since then, things have never been better. I was going through a rough patch for about a month at that point, having mostly to do with work. And with his help, I've found a new career that makes me happier than anything ever has in the past, and actually motivates me to come and work hard every day instead of feel complacent or trapped like I had before. Plus, it has motivated me to go back to school and finally finish my degree at 26 years old. Which normally the thought of would have seemed daunting and near impossible, but with his encouragement and endless support, I feel rejuvenated in my goals to finish my schooling, and even found a career path that finally makes me excited about obtaining my degree.\n\n\nMany of you gave awesome advice about romance and married life, which we have both taken to heart. Together we have worked on our relationship and strengthened it in so many ways following some of the suggestions that were offered. We still make time for one another despite our hectic schedules, whether it's a date night or simply binge watching Netflix and cuddling. We surprise one another with little notes or gifts frequently. And our communication has never been better. While yes, we do argue from time to time, we never can stay mad at one another, and are back to our lovey dovey, overly romantic and fun selves in a heartbeat. \n\n\nI love this man so incredibly much, and I am so excited for the future we are laying out together. In the next few months he will be celebrating a promotion for himself, we'll be moving into a nicer place that we're finally able to afford, and we plan on making our engagement \"official\" by exchanging rings on Christmas. Thank you all for your kind words and thoughts and advice a few months ago, it definitely impacted me deeply and meant so much. I can't wait to spend the rest of my life with my best friend. :-)", "url": "https://www.reddit.com/r/happy/comments/5brwjp/the_engaged_life_is_blissful/", "title": "The engaged life is blissful", "social_network": "reddit", "user": "flea_baguette", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1478589701, "permalink": "/r/happy/comments/5brwjp/the_engaged_life_is_blissful/", "nsfw": false, "first_save": 1635439190.5878606, "replies_charged": false}