{"id": "t5_2qh5i_t3_e9hqfh", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "The past few hours have been a blur. For the first time in years, I truly feel proud of something. I’ve struggled with self-esteem issues and mental illnesses since I was young, and they’ve been bad for the past month or so. Despite my emotions still feeling muted and everything feeling unreal, I think this is the happiest I’ve felt probably all year. \n\nI also felt so so grateful to my family for being so supportive. The first person I called was my mom, and she was so excited. Then I texted my sister, and she video called me right away (she’s abroad right now) and told me my mom had called her crying to let her know. She told me she was proud of me and let me know I was going with an almost full ride (I’d looked over the financial package already but had misinterpreted it). \n\nMy family decided to go out to dinner to celebrate and I felt really giddy. My parents kept telling me how proud they were and told me they knew I could do it. It really meant a lot because my dad was slightly emotionally abusive in the past which contributed to my mental health problems (as was my sister). In the moment I realized how far we’ve come as a family, and it just felt good to be praised considering how during most of my adolescent years I was constantly pressured to achieve (and failed at times). \n\nThen I called my grandparents in Korea. They were beyond happy and my paternal grandparents said they’d pay for my tuition and everything. I called my maternal grandma afterwards, and she was pretty calm but I could tell she was excited. She told me she hadn’t called in a while because she didn’t want to interrupt my studies, and something else that really touched me was that she said she’d been “praying for me even though our religions our different”. \n\nWhile I was writing this my dad came to congratulate me again and gave me a hug. I am so lucky and grateful to have such supportive people in my life :’)\n\nI know my problems aren’t over, but I just feel so content.", "url": "https://www.reddit.com/r/happy/comments/e9hqfh/got_into_my_top_choice_college_and_am_feeling/", "title": "Got into my top choice college and am feeling quite grateful. It feels really good to see when someone else is genuinely happy for you.", "social_network": "reddit", "user": "haenxnim", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1576119380, "permalink": "/r/happy/comments/e9hqfh/got_into_my_top_choice_college_and_am_feeling/", "nsfw": false, "first_save": 1635439342.5535147, "replies_charged": false}