{"id": "t5_2qh5i_t3_aleviw", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": " My mom suffers from mental illness and brain damage. She left my dad when I was 7 and let him have custody of us due to her being unable to take care of us. She never asked for anything from him except her freedom. For years he told us she didn’t love us, and how horrible a person she was. She never contacted us, at least that's what he told us so we believed him. Turns out, he gave her a bunch of ridiculous rules about being in contact with us, and because she felt so much guilt about leaving us and him raising us on his own, she wanted to respect his boundaries and rules. She emailed us many times, but he never told us about any of them (one of the rules my dad had was as long as we were minors, all contact had to be through him, she showed me the emails she sent to us through him). When I turned 18, she got in contact with me directly, and we started talking. I went to visit her and, after many long conversations, I moved in with her and her husband two months ago.\n\nI went from a child believing my mom didn’t love me to being an adult who now understands that my father actually let me believe that because to him, his feelings were more important than mine. I'm so angry at him because he caused actual emotional and mental harm to my brother and myself by telling us our mom didn't love us. She didn't chose him, so he told us she didn't want us. He was unable to separate his relationship with her from our relationship with her as her children. He thought that the best revenge on her was to make us not love her, because he never stopped to realize that it was his children who were the ones who actually paid the price for his lies. We still loved her, we just hated ourselves.\n\nI know he did his best. He made sure we always had a roof over our head and food in our belly; we went on vacations, never lacked for a lot, monetarily. But he still let us believe that our own mother didn't love us because she was brain damaged and mentally ill, and she wasn't capable of taking care of us financially. She believed giving him full custody was in our best interest even if it broke her heart. She didn't want us to feel like we had to choose between the two of them.\n\nI don't use reddit regularly, but I've been so happy lately about the whole situation that I needed someplace to gush. If I don't come back for a while, I do apologize. I don't care about fake internet points or karma because my mom really fucking loves me!!!! (and she lives in an amazing, loving relationship that fills me with hope for the world and the future). If that's not a FUCK YEAH!! I don't know what is.", "url": "https://www.reddit.com/r/happy/comments/aleviw/i_went_from_living_with_my_dad_and_his_stripper/", "title": "I went from living with my dad and his stripper girlfriend (who would argue and scream at each other constantly) to living with my mom and her husband (who spend every free moment together giggling, play fighting, and kissing), and I’ve never known that a home life could be so happy!!", "social_network": "reddit", "user": "WheneverYouCallMyNam", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 48, "down_vote": 0, "creation": 1548868365, "permalink": "/r/happy/comments/aleviw/i_went_from_living_with_my_dad_and_his_stripper/", "nsfw": false, "first_save": 1635440704.3660347, "replies_charged": false}