{"id": "t5_2qh5i_t3_kivc0t", "request": ["5bcd7a82-c8bf-45e5-9556-cc778b964467", "a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "This year has been so hard for so many people, that to be honest, I feel kinda guilty saying just how amazing this year has been for me.  But 2020 has been just...an incredible year in my life.\n\nFirst off, I was officially hired by a company I started working with through a temp agency.  I'm now their marketing director, and love this company, the people that own and run it, and the people I get to work with on a daily basis.  This place has been incredibly accommodating as I've made a bunch of other super positive changes in my life, and the owner is so supportive of me and and my work that it's been such an incredible pleasure to be part of this place.  For the first time ever, I can imagine working somewhere until I retire, and it will definitely be this place!\n\nSecond, I and my partner worked hard on our relationship to make it stronger than ever.  My fiancee is absolutely amazing and I love her so much!  We've had some serious rocky times, but now we're finally reaching a good stable point in our life together, and in our respective personal lives.  I can't imagine my life without her, and it feels so amazing to love someone so completely who returns that same love and devotion!\n\nThird, I bought a house!!  It's a perfect starter home, and yes, I'm TOTALLY bragging about it!  2 bed, 2 bath, with an attached 2 car garage and a detatched workshop with 1.5 acres of land, all fenced in, and they even put a brand new 30-year roof on it right before closing.  I can't get over how lucky I feel about that, and I'm still basking in the glow of new home ownership.  It's insane!\n\nFourth, definitely not least, but I started taking better care of my mental health, which is definitely what contributed to a lot of the great things that happened this year.  I'm getting my bipolar disorder taken care of, and I'm finally sleeping longer than 4 hours a night for the first time in years.  Please, if you're struggling with anxiety, mental health problems, sleeplessness, just anything that contributes to you not feeling your best, PLEASE go see someone!  Get the help you need, and I promise you'll see improvements in other areas of your life.  Maybe not immediately, but at least you'll be more clear-headed and feel better.  Life is so beautiful, and you deserve to have it!\n\nAnd finally, my finances are finally - incredibly - in a position where I was ABLE to buy a house!  Money in savings, working on rebuilding my 401k, my small business on the side has grown a lot, and I'm just...I'm feeling so incredibly blessed and feel like all of the hardships in my life helped me get to this point.  I know there's still a long, long way to go, and that things can always go wrong, but I'm choosing to focus on the good right now.  I just feel stable for the first time in my entire life, like I can finally breathe a little, and I've never felt like that, so I'm just going to soak it up!\n\nI'm sorry this was so long.  Usually at the end of each year, I look back and get upset at how much I didn't accomplish, or I look forward at all of the hurdles ahead of me.  It's such a change to feel like I have things to actually want to happen, and to actually look at the previous year as the Year I Got Shit Done.  Thank you for reading, if you did!", "url": "https://www.reddit.com/r/happy/comments/kivc0t/i_am_beyond_blessed_this_year_and_i_needed_to_say/", "title": "I am beyond blessed this year, and I needed to say it somewhere more anonymous than my social media!", "social_network": "reddit", "user": "sarahms89", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 18, "down_vote": 0, "creation": 1608738233, "permalink": "/r/happy/comments/kivc0t/i_am_beyond_blessed_this_year_and_i_needed_to_say/", "nsfw": false, "first_save": 1635439131.4012132, "replies_charged": false}