{"id": "t5_2qh5i_t3_72pgaw", "request": ["4161666b-4b17-4c22-bb40-42efca26f347"], "text": "Around this time last year, I had decided [after getting out of a shite marriage] that I didn't really want to date anyone, that maybe it was best if I just kept to myself. I was depressed and had a very intense relationship with alcohol. I didn't feel like I was really worthy of love or affection, and found that I would be disappointed when I woke up every morning.\nIt's was sometime in the first couple of weeks in October, I came into the office and someone was in the supply cabinet. I asked what they were looking for, and this handsome bearded face with the sweetest blue eyes peeked out around the cabinet door. Never seen him, but I had only worked there for about 3 months at that point. He was looking for an eraser shield, and I had no clue what it was. Apologized that I couldn't be more help, but to check with one of the drafters.\nHe came back into my office a few moments later to show me what it was. And I think that was the point I was hooked, and I didn't even know it at the time.\nFor some reason, I had to try to talk to him every time I saw him. He didn't seem bothered by it, he'd always respond, but nothing was flirtatious. (I think...) It got to be so that he'd pop into my head a few times a day, even when I wasn't at work. I didn't think I was in his league, but I really wanted to try to get to know him. So I did the best thing I could think:\n\n\nI fed him home made Irish stew. I think that was when the hint finally hit him.\nWe hung out a few times in January, started dating in February, and I have honestly never felt so loved, appreciated, and fulfilled in any relationship I've been in. I stopped drinking myself to death every night, and started running and taking care of myself before we dated, and now I am the healthiest (mentally and physically) that I have ever been in my adult life.\nHe's inspired me to be better than I was. He encourages me to take care of myself, he looks out for me, and he's not controlling about it, he genuinely cares. (Which, in my experience, has been rare.) He's so supportive of the things I want to do, he always offers to take care of me and helps me when I ask. He appreciates my independence. (I can tell he doesn't mind paying for things, but he understands that it's important to me to make things equal.) He does so much for me and doesn't even realize how wonderful I think he is. The words are hard to find.\nAs a human being - he's something of a renaissance man. He's intelligent, well-read, super talented, can make music out of almost anything, witty, good with his hands, and amazing cook, and a perfect father to his kids. (His kids are so adorable and stellar examples of his good raising, they will be excellent adults.) He's emotionally mature and knows what he wants. It's also worth mentioning (again) that he's quite handsome and has a body that won't quit. Everyone that knows him has nothing bad to say. It's almost hard to believe he exists.\nAll this to say, I am happy and grateful that I have him and that he wants me to share his life. I feel honored to be with him, and I am fully devoted to spending my life showing him how much he means to me. I am committed to being his partner, his support, and I want to give him what he's given me. And I hope I am worthy.\nI love you, Chad.", "url": "https://www.reddit.com/r/happy/comments/72pgaw/i_have_found_a_wonderful_man_and_my_life_could/", "title": "I have found a wonderful man, and my life could not be better.", "social_network": "reddit", "user": "Ailithound", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1506480154, "permalink": "/r/happy/comments/72pgaw/i_have_found_a_wonderful_man_and_my_life_could/", "nsfw": false, "first_save": 1635440985.2800076, "replies_charged": false}