{"id": "t5_2qh5i_t3_anld74", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "\nI'm a middle school Special Education teacher, and the classes that I teach are made up of 6th graders who are on an IEP and are significantly behind grade level in reading. By significantly behind, I'm talking 12 year olds who come in reading anywhere from a pre K to a 2nd grade reading level.\n\nI've been begging my admin for years to let me level my classes by reading level so I can focus more clearly on what they need where they are. This year they finally let me. I have two groups of about 12 each, and I'm very proud of what they've accomplished this year. For many of my kids, reading is not a thing of enjoyment, so I've gotten them to try based on it being a skill they need to know.\n\nAwhile back, they were really needing some tangible motivation, so I made them a deal - if we could collectively go up 100 levels this year, I would throw them a pizza party. Now, roughly 4 levels per student might not sound like much, but that's almost an entire grade levels worth of growth for a group of kids who were in 6th grade reading at a kindergarten level. It was always going to take a lot of work.\n\nWe hit 90 today. My testing sign up sheet is full and I think we'll probably hit 100 by the end of next week, and it's only February. They have worked so damn hard for this. They have fought for it. You may not think of reading as something you fight for, but some of my kids will look at a word on a reading passage and they fight with it, breaking it up and working it into their brains until it makes sense. I am so damn proud of them.\n\nNow I just have to figure out exactly where I'm getting this pizza from! Best problem ever! ", "url": "https://www.reddit.com/r/happy/comments/anld74/i_teach_middle_school_students_who_struggle_with/", "title": "I teach middle school students who struggle with reading, and a few months ago, I made a deal with my class to motivate them to raise their levels. We hit a major milestone today!", "social_network": "reddit", "user": "Broniba", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 28, "down_vote": 0, "creation": 1549416670, "permalink": "/r/happy/comments/anld74/i_teach_middle_school_students_who_struggle_with/", "nsfw": false, "first_save": 1635442864.7971747, "replies_charged": false}