{"id": "t5_2qh5i_t3_pcpavp", "request": ["b0c0a1d6-df85-40fe-9afc-934b125e4d6a"], "text": "I'm an Italian volounteer working in France for an association that helps young people without family to get indipendent.\n\nThey're mostly migrants from Africa and Arab countries that need housing, getting regular documents to legally stay in the country, finish their studies and find a work.\n\nDue to Covid we didn't do many activities and we were left with some extra budget, so we decided to spend it for a trip, and yesterday we brought them to the beach. We were a dozen: seven teenagers from several african countries, three from Pakistan, me, and an educator. As soon as we arrived we immediately went into the water.\n\nMe, being a little thin and suffering the cold from the water more than other people, got out earlier than the others and went back where we left our stuff. Not a minute after I got there, a guy came to me asking something. It went like that:\n\nHim: Are you supervising that group there? (pointing at my young ones playing in the water)\n\nMe: Yes\n\nAt that point I expected some kind of bad remark. And instead.\n\nHim: We are leaving tomorrow, and I wanted to give you this to spend for getting them ice creams\n\nAnd he lent me a 50 euros banknote. I didn't really know what to reply on the spot, and just told him a \"thank you\", very surprised. He didn't wait for more, and just left. He had his towel a little further, he packed his stuff, was joined by who I guess were his wife and daughter, and went away.\n\nHe didn't ask if I was working for some association, who the young ones I was supervising were, nothing. He didn't even wait for giving the money when everyone was present. He just made this selfless act and departed.\n\nOn the way back we bought everyone ice creams and I ended the day with a really great feeling. I think it was the nicest, most spontaneous thing I ever happened to see from someone.", "url": "https://www.reddit.com/r/happy/comments/pcpavp/a_stranger_on_the_beach_just_gave_me_money_to_buy/", "title": "A stranger on the beach just gave me money to buy ice creams for the group of young people I was with and walked away", "social_network": "reddit", "user": "NibaTCat", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 181, "down_vote": 0, "creation": 1630077229, "permalink": "/r/happy/comments/pcpavp/a_stranger_on_the_beach_just_gave_me_money_to_buy/", "nsfw": false, "first_save": 1635441794.5466743, "replies_charged": false}