{"id": "t5_2qh5i_t3_gl55j9", "request": ["4311bf71-6ec2-4c3b-aa15-1f9a3223e07b", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "So my friend and her boyfriend have 2 brazilian rainbow boas, one male, one female. They’ve been trying to breed them for over a year, and it finally worked. They now have 14 little baby danger noodles, and I’m getting one of them.\n\nMy housemate (also landlord) has said yes to it, when originally I thought we (my SO and I) wouldn’t be allowed one. Today I came downstairs and they’ve moved the living room around and made space for a vivarium, and we’re allowed a snake.\n\nOnce we’re allowed within 6ft of our friends, and the babies are definitely all okay, we get to pick out a baby, and our friend is going to help us with getting the right starter tank. Then we get the baby, it will be my first pet since leaving my parents house 2 years ago, and my first pet with a partner. It’s a big milestone.\n\nEdit: I just want to add this before anyone comments about our friends breeding the snakes. They have both owned snakes for years, and excluding the babies they currently have 5 snakes, they’re experienced and skilled snake owners. One of the snakes is actually once that they rescued, from a friend of a friend. The person got a snake from their friend, after she moved abroad, and no one knew the snake was pregnant, when she gave birth the person had no idea what to do and ended up leaving it for a week doing nothing, before calling my friend. They then had to help the mum, and the baby they rescued was the only surviving egg. They didn’t just put 2 snakes in a cage hoping for babies for fun.", "url": "https://www.reddit.com/r/happy/comments/gl55j9/im_getting_a_pet_snake_im_so_excited/", "title": "I’m getting a pet snake! I’m so excited!", "social_network": "reddit", "user": "thefabulousbomb", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2, "down_vote": 0, "creation": 1589673306, "permalink": "/r/happy/comments/gl55j9/im_getting_a_pet_snake_im_so_excited/", "nsfw": false, "first_save": 1635442073.5669985, "replies_charged": false}