{"id": "t5_2qh5i_t3_mfr381", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11"], "text": "So she is 4 years old and loves me to death, and I her. And yesterday I decided to visit my brother and her. The way her face lit up when she came around the corner and saw me is the cutest thing as she ran over yelling in joy and gave me a hug.\n\nWe spent all morning playing together and eventually she started rubbing her eyes and was about to take her afternoon nap. I sat on her bed with her in my lap.\n\n\"You tired?\", she nods her head. \"Yeah? You want to take a nap?\", she nods her head again. \"You know I luv you?\", she giggles and says \"Yes\". \"You luv me?\", she laughs again and says \"Yes\". I smile and reach forward and kiss her nose then her forehead and she giggles again. Finally she wraps her arms around me and falls onto my shoulder and I play with her hair gently to get her to fall asleep. By this point I'm pretty tired myself and once I see she's finally out, I put her on her pillow and decide I'm too tired to move and fall asleep next to her.\n\nI wake up about an hour later and she's still asleep. But seeing her so blissfully asleep is utter perfection. Yes, I'm just an uncle, but I love her like nothing else. I don't ever plan on having kids of my own, because I see how much parents struggle to raise one kid and see how draining it can be, but it's moments like these that make it seem like it'll maybe be worth it.", "url": "https://www.reddit.com/r/happy/comments/mfr381/my_niece_fell_asleep_on_me_for_the_first_time_and/", "title": "My niece fell asleep on me for the first time and I fell asleep with her. It was beautiful", "social_network": "reddit", "user": "LastConsul", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1617029085, "permalink": "/r/happy/comments/mfr381/my_niece_fell_asleep_on_me_for_the_first_time_and/", "nsfw": false, "first_save": 1635439188.2290287, "replies_charged": false}