{"id": "t5_2qh5i_t3_2wwru4", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "r/relationships kinda bums me out. I really feel for the couples that have hurt each other and I hope all those who've had their hearts broken ultimately find happiness. I remind myself that broken relationships are not the norm and there are happy couples out there that don't need advice and aren't experiencing relationship-ending events. I consider myself fortunate that I'm in a happy relationship and I just wanted to post here to maybe remind others that marriage is not dead, fidelity and love absolutely exist, and having kids is not the end of your life.\n\nI met my wife 10 years ago through mutual friends at a night club. We chatted and danced and then ended up going out to late-night dinner place to learn more about each other. The whole month after meeting her was great and we decided to make the relationship exclusive. Got myself a girlfriend!\n\nCommunication was never an issue. We talked on the phone every night before bed about anything and everything. We actually didn't have much in common but we were both very open and willing to try anything new. We both finished school and started our careers - together the whole time. I never thought about being with anyone else.\n\nAbout 5 years ago, we decided to have an adventure. My wife is a teacher and she found that the job market in Japan for foreign teachers was relatively in demand. She applied for a job at a Japanese international school and after a nerve-racking Skype interview (I was in the other room biting my nails the whole time), she got the job! Now, the biggest hurdle was getting me to come with her.\n\nWe'd already talked about getting married and how many kids we wanted so we decided that we'd tie the knot before moving halfway around the world. She somehow planned an amazing wedding in 3 months and we made it official after 5 years of dating. Just ten extremely hectic days later, we said goodbye to our families and boarded a plane to Japan.\n\nJapan was an experience I'll never forget. It was our first home as a married couple. We had to build and maintain a happy relationship with our closest friends and family on the other side of the world, on opposite time zones. There were fights, there was yelling, there was frustration. But, we always made up, we always talked things out, and we always ended up happier than before. I believe that arguments are inevitable and they have to be used as a way to learn about your partner, yourself, and your relationship.\nWe had talked about kids. We decided to wait until we moved back to our home country to have our first. Things never work out exactly as planned :) You're never really \"ready\" for kids. But, surprise, surprise, less than a year of being married and still in Japan, we stared down at our first positive pregnancy test. I was numb and freezing cold, like all the blood had been drained from my body. I was happy as joyful tears poured out both our eyes but I couldn't help thinking about what a baby meant - all the responsibility, all the selflessness, all the expenses, all the work. We both had those thoughts but we didn't let anything stop us from having a happy, healthy child. There we were, in a foreign country, not citizens, having to bring a translator to every doctor's appointment, on one salary, living in one of the most expensive cities on Earth. Frustration and worry grew but we talked about it all. We always shared our fears.\n\nNine crazy months later, our first son was born. I was a father. Life changed completely. I didn't know I had that much love in my heart to share with another human being. Yes, there were times when I wanted to ship him off to baby boarding school but all the hard times don't even come close to how amazing all the good times were. His first words, his first steps, I'll never forget all the firsts. He made me a father and instilled a confidence in me that I didn't know I could achieve. He made our adventure infinitely more personal and memorable.\n\nOur relationship was tested again in 2011. I'm sure you remember the 2011 Tohoku earthquake and the Fukushima disaster that followed. We were there to experience the fear of a nation. We experienced empty store shelves and wondering if we could drink and feed our baby tap water. Our home government told us to stay, to ignore the fear-mongering world news. We didn't know what to do. More frustration and worry. We argued about what to do. This was a huge test for our young family and we made it through unscathed. Communication and love trumped one of the worst natural and nuclear disasters in human history. We learned a lot about ourselves in Japan and I feel like we can make it through damn near everything.\n\nAfter 3 amazing years, we moved back to our home country (Canada, if you're wondering). With little money, we had to live with our parents for the first 6 months. Another test for us :D We love our families but being an independent family of our own, we had to find our own place. I was offered a job pretty much out of nowhere and were able to find our own roof to raise our family under. \"Everything always works out\" is our motto :D\nWe had a second child (daughter this time) 7 months ago. Another bundle of energy and another piece of my heart. After everything we've been through, life now is easy, happy, and stress-free. I'm self-employed and work from home so I get to be with my wife and kids 24/7.\n\nI do consider myself lucky and it warms my heart that other couples out there share similar happy stories as us. Even if the rest of Reddit and the internet are full of negative experiences, infidelity, and broken hearts, I believe that the love and happiness that is not posted is what makes the world go round :D\n\ntl;dr: Dated wife, married her, moved to Japan, had baby, Fukushima disaster, moved back, had another baby, super happy :D Always communicate about everything - your dreams, your fears, everything and anything.", "url": "https://www.reddit.com/r/happy/comments/2wwru4/me_30m_and_wife_29f_have_been_together_for_10/", "title": "Me [30M] and wife [29F] have been together for 10 years and married for 5. Happy with two kids :D", "social_network": "reddit", "user": "ThePocalypse", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1424724290, "permalink": "/r/happy/comments/2wwru4/me_30m_and_wife_29f_have_been_together_for_10/", "nsfw": false, "first_save": 1635440879.460179, "replies_charged": false}