{"id": "t5_2qh5i_t3_ks6xib", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I've always been very unsure of myself and thought I was inherently dumb and had bad work ethic. A little over a year and a half ago I started to finally learn how to handle my mental health, and started seriously building a skillset in my dream career (animation). Despite 2020 as a whole and a bunch of personal crap, it hit me recently that I'm actually doing really good. I'm almost halfway done with my online animation program, I'm starting a super fancy 3d animation mentorship this week, I'm finally going to take my permit test in March, and my new part-time job is something that I actually enjoy (or in other words don't dread doing, unlike every other job I've had haha). I still have a lot to be stressed about but it just feels really nice to see clear progress on my skills and myself as a person. I'll be super busy, but I've proven to myself that I do have good work ethic after all. It just feels super awesome.\n\nThings aren't perfect of course, and these things have their problems, but I'm realizing that they're pretty good problems to have. On top of that my family is mostly very supportive and loving, and my brother and step-family have saved be from isolating into insanity. I'm super grateful and I know that even if I've just jinxed myself right now and things fall apart, I've gotten to know my mental illnesses well enough to bounce back. I feel good about where I am, stress and all, and I feel even better knowing that I did it all myself and proved to my under-achieving depressed high-school self that I'm capable of... idk, not being a total failure. For the first time in a while, I feel super excited for the future! Thanks to anyone who read all this :D", "url": "https://www.reddit.com/r/happy/comments/ks6xib/im_motivated_and_excited_for_my_future/", "title": "I'm motivated and excited for my future!", "social_network": "reddit", "user": "IronMLady", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1609998709, "permalink": "/r/happy/comments/ks6xib/im_motivated_and_excited_for_my_future/", "nsfw": false, "first_save": 1635442841.4003577, "replies_charged": false}