{"id": "t5_2qh5i_t3_81o7gd", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "I am Chinese American. 4 years ago I went to a temple in celebration of Chinese New Years. I received a fortune telling that essentially foretold my losing my virginity to rape a few months later. Sounds crazy, I know. But I essentially received the worst fortune telling possible (literally). \n\nI really didn't put much thought into it at first. I was just curious if it would come true. A \"friend\" ended up taking my virginity through rape a few months later.\n\nIt turned my while life around. I became promiscuous. I devalued myself. I couldn't sleep very well at night. I'd stay awake until I couldn't stay awake anymore because I was afraid someone would rape me in my sleep. For months, I would wake up to the grinding of my own teeth. The list goes on. \n\nMy fearful brain put 2 and 2 together and became afraid of temples and fortune tellings. I stopped celebrating Chinese New Year even though it is one of my favorite holidays. \n\nToday was the last day of Chinese New Year celebration at a temple I'd been eyeing. I reasoned that the temple 4 years ago didn't give me bad luck or anything. In any case, the fortune may have been mere coincidence or for those who believe in Chinese fortune tellings, a warning for me. In the latter case, it was helping me. \n\nI yearned to celebrate Chinese New Year again. To get the red envelope. To place the incenses and pray to the Gods. To be around all the red and gold during this season of festivity. \n\nSo, I drove an hour to the highest rated temple on yelp near me. I prayed to the Gods. I talked to kind, smart, gentle, welcoming monks. I placed incenses and prayed some more. I made a wish at the wishing bell. I was given Chinese New Year candy. I walked around a museum of amethyst, gold, silver, ivory carvings of the Gods. I read books about Buddhist teachings in the lounge. I was surrounding by good, trusting, and giving people.\n\nIt was one of those places where you knew, even amongst strangers, you could leave your phone and belongings out in the open and it would be fine. \n\nI bought Chinese New Year/religious decoration for the house. I eyed jade pendant at the temple store. I lost the last one I owned when I was 10 years old. For some reason, I never went around to replacing it. Today, 18 years later, I bought a replacement pendant. It made me feel more wholesome and secure--a way jade pendants has always made me feel. \n\nI love Chinese New Year. I love Chinese New Year decorations. And today, I overcame a fear and realized it was just that. A fear. It had held me back from one of my greatest joys. \n\nI think I'm officially Buddhist again. \n\nThanks for reading 🙏. I hope you all have a wonderful and blessed New Year :). Happy 2018 :) ", "url": "https://www.reddit.com/r/happy/comments/81o7gd/4_years_ago_i_developed_a_phobia_to_chinese/", "title": "4 years ago I developed a phobia to Chinese temples after being raped. Today, I realized that fear was unreasonable and went to the temple to celebrate Chinese New Year :)", "social_network": "reddit", "user": "jigglemepuff", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 42, "down_vote": 0, "creation": 1520062316, "permalink": "/r/happy/comments/81o7gd/4_years_ago_i_developed_a_phobia_to_chinese/", "nsfw": false, "first_save": 1635440874.8521554, "replies_charged": false}