{"id": "t5_2qh5i_t3_fdepi3", "request": ["d9021d56-8bfa-490f-87b8-52154c0b1b05"], "text": "I (21m) just had a completely life changing experience bout a week ago including me getting rapidly uprooted from my home and moving in with someone I barely knew. \n\nI had met a mechanic who said he would help me personally work on my car in his shop for free. It simply needed a water pump and timing belt change. Well, after he saw me trying and wanting to learn to be a mechanic he decided he wanted me as his apprentice. I absolutely had to accept this!\n\nIn conversation with him I revealed a thing or to about my previous living situation (current at the time) and he straight up offered me to live in the extra room he has in his trailer and he even said I could bring my pets and my girlfriend with me too. I told him I had to have some time to think on it. \n\nI then received a call from my dad explaining that I'm not kicked out of my parent's place but it's now a place that is going to be even more hostile for me. So I called my two best friends. We grabbed everything of mine in about 20 minutes and GTFO. I didn't have a bed or anything. \n\n\nOne of my other friends heard the news and showed up with a mattress for me! For FREE! I got my other car here at the shop. (which is broken down in an extreme sense but it's a rare classic so it's my baby)\n\nPoint is, I'm alive. I have 2 dogs and a cat snuggleled up to me while I'm holding my girlfriend in my arms on a mattress that's on the floor. I work on cars all day everyday. I'm learning. I'm having fun. Life is getting better. Most of all I'm the happiest I've ever been.", "url": "https://www.reddit.com/r/happy/comments/fdepi3/my_life_has_been_changed_completely_into_a/", "title": "My life has been changed completely into a direction I had never thought it would go but by god is this the happiest I've ever been.", "social_network": "reddit", "user": "Zombie_Tackler", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 41, "down_vote": 0, "creation": 1583336215, "permalink": "/r/happy/comments/fdepi3/my_life_has_been_changed_completely_into_a/", "nsfw": false, "first_save": 1635442644.187546, "replies_charged": false}