{"id": "t5_2qh5i_t3_hbq0k", "request": ["f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "There were things I wanted to say for a long time that she didn't seem to like hearing, so last week at this time I wrote her a poem. You may notice that I don't write alot:\n\n-------------\n\nNow I know this last year was very rocky\n\nYou got stressed and I got cocky\n\nI found you controlling and you me ungrateful\n\nAnd maybe incompetent and even hateful\n\nBut in light of all the bitterness and the fighting\n\nI thought it’d be appropriate to put down in writing\n\nThe regrets I hide and the pain I keep voiceless\n\nAnd that I haven’t forgotten I’m one of your boyses\n\n-\n\nGoing back on my word isn’t something I adore\n\nWhich is why I get scared when you ask me to open the store\n\nBecause I didn’t start it so I don’t feel as connected\n\nSo I may repeat the times I got lazy or just forgetted\n\nI’m not saying it isn’t wrong of me to do\n\nBut there are things I believe and I hope you do too\n\nThat everything in life has a reason\n\nIncluding the mistakes we both make throughout each season\n\nI think this is good, because it means they can be prevented\n\nAnd I’ll remember to watch the store and you won’t feel resentment\n\nBecause saying and doing are two different things\n\nAnd sometimes I need help in fulfilling my creeds\n\n-\n\nI know you think I don’t understand\n\nWhat it’s like to be bitten on your feeding hand\n\nAnd whenever we fight like Cain and Abel\n\nIt’s in the foreground of you putting food on my table\n\nBut I realize that you and Aba worked very hard\n\nFor the meals that got me and Uri big and strong\n\nBut sometimes I feel when you make me pay back my dues\n\nThat I’m being exploited for a position I didn’t choose\n\nI wish I could pay you back in ways more meaningful\n\nBecause in running the shop I am not your equal\n\nBut above all this is why I want to move out\n\nSo I can relieve you of the burden of filling my mouth\n\n-\n\nSometimes I feel you have yet to fully adjust\n\nTo the fact that I’ve grown up and refined my touch\n\nBut I am an adult now, just like you\n\nAnd I’m no longer prone to the tricks you like to use\n\nI can tell when you skip details or don’t fully explain\n\nInformation that I want stuck in my brain\n\nAnd I think you do this because you believe\n\nThat when hearing new information kids can’t fully conceive\n\nBut you must understand that this is not true\n\nI’ve learned the most in my entire life by realizing much is not known to you\n\nAnd I hope you don’t treat Uri that way like you treated me\n\nBecause it’s hard to learn on your own that you have the right to curiosity\n\n-\n\nWriting this poem is quite a risky move for me\n\nBecause I don’t know if what I wanted to say you will see\n\nThere is a lot which I would like to tell you\n\nAnd most times I tried it wasn’t okay to do\n\nI fear this will make you will feel criticized and angry\n\nBecause I want to make an apology\n\nBecause while on the whole of our friction the blame can be split\n\nI know I’m responsible for roughly a half of it\n\nSo I’d like to say I’m sorry for the times when I was a bad son\n\nAnd when I caused you pain and ruined your fun\n\nBut this shouldn’t end on a note that is sad\n\nSo I will conclude with what makes me glad\n\nLike how you’re letting me choose my own career\n\nAnd how willing you are to give me money for beer\n\nAnd how you never beat us over the head with a chair\n\nAnd how you and Aba raised us together\n\nAnd how you went away from your family so our life could be better\n\nAnd how us being smart makes you smile and not smelter\n\nBecause when anger falls on us like rain\n\nI remember these things in order to stay sane\n\nI know in the end that my Ima is great\n\nSo know in the end that I love you. Happy mothers day! \n\n-------------\n\nYesterday she handed me a written note in reply. Her handwriting is weird at times so I chose words at a few points:\n\n-\n\n[Insert corny kidname here]\n\nYou're pretty good in verse. I can't compete. I wanted to respond to your poem. I read it as words of profound love, and I need you to know that in spite of your fears your existence is clear to me and your dad more than you could ever imagine. I could never begrudge you. The food that you eat - It's as pleasing to witness as when you were a tiny babe, and I can only regret not cooking foods you consider a treat. Having you in our life is a blessing like no other, and I wouldn't give back a single minute for all the money in the world, or any other child. You are mine and will always be and your health and well being is what we want for you and always have. You never need to apologize for your existence, only for behaviors you are not proud of. I love you just the way you are - I just don't want to see you make the same mistakes I made if you can avoid them. I believe you can - you have the powers inside you - use them to work for you, not against you. Don't be afraid of the world - it is there for you to enjoy - that is the only reason for its existence and ours. Your curiosity and sense of wonder should serve you well all your life - never let it die. It is the gift of the young, and you'd be well to remember it when you get older - it will keep you from fading. Don't be afraid to express it to us - we are not able to read minds or answer questions not asked. It's okay and great that you see us as the imperfect people that we are - and my hope is that you will not lose your appreciation for our efforts or love or results in raising you despite our imperfections.", "url": "https://www.reddit.com/r/happy/comments/hbq0k/a_written_exchange_between_me_and_my_mother_in/", "title": "A written exchange between me and my mother in light of the increased fighting we've had this last year.", "social_network": "reddit", "user": "Amitai45", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1305442441, "permalink": "/r/happy/comments/hbq0k/a_written_exchange_between_me_and_my_mother_in/", "nsfw": false, "first_save": 1635443334.1824653, "replies_charged": false}