{"id": "t5_2qh5i_t3_esf8ob", "request": ["1d9bc0bf-4a1c-437e-94e7-5a07c99811fe"], "text": "Back story. When I was a kid both of my parents were pretty severe alcoholics that ended up getting divorced and stayed alcoholics for a very long time. It was hard. I took care of my younger sister a lot, we went to soup kitchens a lot, it sucked. I’m not mad at my parents or anything, I’ve dealt with those feelings and at least understand why they were like that. But I had gotten so used to taking care of myself and others because that’s pretty much all I knew. I was dumb and married a guy who basically wanted a mom forever. I worked, he stayed home and did nothing. I cleaned the house, grocery shopped, cooked, managed the bills and whatever else. After realizing that he was not going to change and I deserve better I ended our relationship. For the next few years it was me handling everything in my life and that’s fine. \n\nAfter my spouse and I had been together for awhile he relocated to where I lived and it took a few months to find a job. He managed the house in the meantime so that was nice. He got his dream job and everything has been great. \n\nNow I’m getting laid off. Unemployment isn’t nearly as much I make at my job and there’s no time frame for when the lay off will end. I feel like I have to jump into action and get this handled by myself ASAP because that’s what I’ve always done out of necessity. Finding a job that pays well enough in the industry that is doing the lay offs is not an easy task so I’m panicking. I’m not going to make enough money. I’m so fucked. \n\nCue the good spouse. I’m venting to him about my panic and he nonchalantly tells me “don’t sweat it. We’ll get through this just fine. Together.” And he means it. He’s ok with picking up my slack because that’s what partners do. It feels so good (and so foreign) to actually have someone I can rely on. Someone who can and will actually help. For the first time in so long I feel like I’m not handling life alone and it’s comforting.", "url": "https://www.reddit.com/r/happy/comments/esf8ob/im_getting_laid_off_at_my_job_this_week_but/", "title": "I’m getting laid off at my job this week but everything is going to be ok because my spouse is a wonderful partner.", "social_network": "reddit", "user": "yellingsnowloaf", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 59, "down_vote": 0, "creation": 1579714379, "permalink": "/r/happy/comments/esf8ob/im_getting_laid_off_at_my_job_this_week_but/", "nsfw": false, "first_save": 1635440613.225244, "replies_charged": false}