{"id": "t5_2qh5i_t3_fg4jto", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "258e332d-215f-495f-8bee-bccd57229f62"], "text": "Alright r/happy this is going to be a long one so get ready. Last Friday I overdosed on LSD and DXM. I had been consuming DXM every single day in doses as high or higher than 900mg for over a month, and had been consuming 500-2000ug of LSD a day for 14 days. I finally cracked up like a nut, went into a full blown delusional state of psychosis where I fully believed that I was God. I was God, and that was the secret of the universe; except that I was the only one that wasn’t in on that, at least until now. Upon my “realization” I would be able to control the entire world with my mind, and do literally whatever I wanted however I wanted. I ended up running through the halls of my apartment screaming and nude, then went into my apartment still nude and continued screaming and smashing my wall and window with a lacrosse stick as I became increasingly frustrated that my newfound godly powers were not working the way I wanted them to. I tried to summon people who wouldn’t appear, and lost touch with reality completely. I figured that when I had my realization, I was meant to have a cosmic orgasm (I am a virgin, and so the “cosmic orgasm” was to be had through a series of breathing exercises and would cause the entire world to restart. I believed that when I came to my “realization” that I was God the entire population of the world disappeared and I was the last one left because everyone in the world was actually just versions of me and had been re-contained within me. I ended my delusion standing in my room, back facing my bed, and said “I’m God, Baby.” and fell backwards eyes closed. WHEN STILL NOTHING HAPPENED AND THE WORLD DIDNT RESTART, I came to and realized the severity of what I had just done. There’s definitely some things I’m missing from this story but I think I made my point; I lost my grip on reality. I called my mom and asked her to take me to the ER immediately as I realized that my blood pressure and temperature were probably at dangerous levels, and I was actually probably at serious risk of OD. At the hospital they gave me fluids and vitamins, let me calm down, and sent me on my way. I stayed with my parents that night instead of going to my apartment, and I’m actually back over there now. Sunday was spent reorganizing my entire space, my room, bathroom, and car, and doing a deep clean and reorganization of all my spaces. Then, last night, I finally went into withdrawals. Sweating, shaking, shivering, back and forth hot and cold hot and cold hot and cold and it’s been like this all day since I went to bed last night. I’m getting clean, and my body is finally rejecting all of the things that I have put it through.\n\nSo, the reason I say this is because I want to provide full transparency about my life going forward. I want to make some drastic changes in my life including exercising regularly, eating healthier, taking better care of my personal grooming, and many many others. I’m going to spend 60 days without any intoxicants and then maybe, if I feel like I can handle it, smoke a joint. \n\nI want to change my life. And I want to make that change public, because I know I am not alone in my struggles. There are hundreds of thousands of people out there with mental health and substance abuse issues, not just me, and I want to be in a position where I can offer my strength and light to help them. I want to be a positive force for change in this world. \n\nIf anyone reading this is going through their own struggles, and would like to talk, I want to make myself totally available to help you. I will talk to anyone, regardless of color creed gender or sexual identity, any differences that we have do not matter to me because we are both human beings and human beings make mistake and need help in order to fix their mistakes. Nobody can go it alone, and I don’t want anybody to have to. I am offering myself as a source of help to anyone who wants to talk about ANYTHING. I will listen without judgement. \n\nSo, I know this is a lot. I’m going to finish up now and end on three quotes. \n\nKEEP GOING! LETS GO CHAMP! NOW GO, MAKE IT A GREAT DAY!!!!!!!! \n\n-Space Jesus, over and out for now✌🏻🤟🏻🤘🏻", "url": "https://www.reddit.com/r/happy/comments/fg4jto/changing_my_life_the_what_the_why_the_how/", "title": "Changing my life; the what, the why, the how.", "social_network": "reddit", "user": "Spac3xJ3sus", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 3, "down_vote": 0, "creation": 1583798186, "permalink": "/r/happy/comments/fg4jto/changing_my_life_the_what_the_why_the_how/", "nsfw": false, "first_save": 1635439361.2858043, "replies_charged": false}