{"id": "t5_2qh5i_t3_prp4ny", "request": ["258e332d-215f-495f-8bee-bccd57229f62", "af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "I never thought I’d get to this day and need to get this out or I’ll burst.\n\nSome background, all of my closest family are naturalized US citizens, but I’m not. I had lived on the East Coast for almost a decade as a student. I spent my 20s with the fear of the visas run out loomed over every decisions I made, while my best friends plan for weddings and job promotions and babies and buying houses. The company where I interned offered to sponsor me, but it’s always a lengthy process with unclear real chances.\n\nThen it happened. I did have to leave the country. Everything and everyone I know is here and I’d do anything to stay, except being an illegal immigrant. My boyfriend of the same predicament left with me. We found jobs in Singapore and stayed there while my company files for my immigration. I’ll never forget how it felt taking picnic baskets with my friends, scouting venues for a fall New England wedding that eventually never came to be. We got married at the embassy in Singapore, not knowing a single soul. We stayed for 3 years at god awful jobs, met interesting people but our life had no sense of home or future. \n\nBut this year, a month after I turned 30, my green card came through. I’m going back to a great company, and my now-husband immediately got an offer for 230k/year because he piggybacked through me and does not need a sponsorship. I never allowed myself to believe so many good things could happen all at once. I was cautiously optimistic about my green card, but thought I’ll be a sole earner for a while as we’ll be recent immigrants. Now we’re going back to our dream city, working at our dream jobs, planning for our dream home.\n\nWe’ve just landed in the US today and I couldn’t sleep because I couldn’t stop crying. I’ve never cried happy before.  I’m sure we’ll run into issues and have stress at work and bad things will happen because it’s life, but just for now, everything is just absolutely perfect. I don’t know if I deserve all this and if someone was watching over me made this happened, idk God? Buddha? Allah? My brother? Thank you. \n\nAlso I’ll probably get comments about stealing American jobs or soiling your culture and whatnot. If that’s how you feel idk what to tell you. I’ll be paying more taxes here than the whole of my income in Singapore. I hope some of it goes to helping you personally.", "url": "https://www.reddit.com/r/happy/comments/prp4ny/after_over_10_years_of_struggle_my_dream_finally/", "title": "After over 10 years of struggle my dream finally came true and I’m still in disbelief", "social_network": "reddit", "user": "yeet-awayofc", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1632119305, "permalink": "/r/happy/comments/prp4ny/after_over_10_years_of_struggle_my_dream_finally/", "nsfw": false, "first_save": 1635440686.4687865, "replies_charged": false}