{"id": "t5_2qh5i_t3_ox6bzs", "request": ["2293bc08-7671-4d63-b63f-dbe4a3a4858a"], "text": "My friends are *so* tired of hearing me gush about this, but I can't stop talking about it, so I'm coming to Reddit instead!\n\n&#x200B;\n\nSo way back in middle school, I was dating this girl, and that's the happiest I've ever been.  She was my absolute best friend ever since first grade, and by the time we were twelve, we were girlfriends.  None of our parents would have been okay with that (heck, my parents didn't even like me being friends with a Mexican girl), so even though all I wanted to do was tell everyone how amazingly in love I was, we had to keep it to ourselves.  I still have vivid memories of how good it felt to lay with my head on her lap and let her stroke my hair while we watched TV in my room.  Or spending too much time together in the school library making fun of the grown-up books for being boring.  Or all the awkward, tense, beautiful moments when we were alone and I was trying to figure out if now was a good time to kiss her, which of course it never was.  She was my absolute best friend.  Still is.  And I know it's not healthy, but I've always compared every relationship I've ever had to her.  Not that I've had many.\n\nAnyway, halfway through seventh grade, she was gone.  Her family moved to Mexico because her grandpa in Yucatan was getting older and needed her mom to come back and take care of him.  We had about a month's worth of notice before she was just out of my life, and to this day I don't think I ever really got over it.  My parents wouldn't let me have a cell phone or social media or anything until I turned sixteen, so staying in contact was hard, and eventually we just stopped.  Fell out of touch.  And I wasn't okay for a really long time.  I couldn't have another relationship with a girl because my brain kept telling me she was going to disappear on me.  I tried liking guys because it was easier in a lot of ways, but I'm definitely not straight, so that wasn't happening.  I wound up falling into a pretty bad depression that I'm still not out of, but therapy and medication have made things a lot better.\n\nThen, six months ago, we ran into each-other again.  Totally by happenstance.  Turns out, we both wound up going to the same college, even though it's about a thousand miles away from where we grew up.  We've been living in the same town for almost three years and we didn't even know.  She had classes with a friend of mine, and he would *talk* about her to me, and I never even considered that the girl he was talking about could maybe be the same girl I grew up with.  I saw them leaving class together one day, and even then I didn't know.  She recognized me, though.  The look of absolute shock on her face, god.  And the way she hugged me so tight when I was just frozen there.  I was always worried that she didn't miss me as much as I missed her.  And even though I think she dealt with it a lot better than I did, I know that's not true, now.\n\nWe've spent the last six months catching up and becoming friends again, and I'm on top of the moon.  I actually haven't been this happy in years, and tomorrow night, I'm going to ask her to go out with me again.  And, of course, I'm terrified, but I know she's going to say yes.  I'm so excited I could scream.  And I can actually tell people, now.  I can hold hands with her while walking down the street.  I can rest my head on her shoulder while sitting on a park bench.  We can get married, if we want to.  God, I could talk about this for hours and hours and hours, so if anybody wants to DM me and talk some more, I definitely wouldn't complain.  Either way, I hope my happiness made you guys a little happier today!\n\nUpdate:  SHE KISSED ME, Y'ALL!  I'VE GOT A GIRLFRIEND AND I'M FREAKING OUT!!", "url": "https://www.reddit.com/r/happy/comments/ox6bzs/im_probably_getting_back_together_with_my_old/", "title": "I'm (probably) getting back together with my old girlfriend from middle school tomorrow night and I haven't been this happy in years!", "social_network": "reddit", "user": "Reset_Machine", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 38, "down_vote": 0, "creation": 1628006008, "permalink": "/r/happy/comments/ox6bzs/im_probably_getting_back_together_with_my_old/", "nsfw": false, "first_save": 1635441043.5039332, "replies_charged": false}