{"id": "t5_2qh5i_t3_mxl5dh", "request": ["fe6592a7-45e6-4fad-a9ac-29e6bff2e837", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "Since I was twelve years old, I've had a dream to animate, score, and write a film based on recurring dreams I had as a child. I am now 36. For the past 24 years I have done everything I can to prepare for this goal, starting from scratch.  It's been a long road with a lot of great experiences, but the end goal has always been the same. \n     \nHere's an overview of the road that has finally lead to my being able to pursue this dream: \n\n- began playing music at age 12 and went on to study bass in college\n- in my early 20s, I got a job at a bank to get a better sense of how funding and costs work\n- in my mid-20s, I created [this children's book and read-a-long video](https://youtu.be/SqvKkwU5uxs). The process of creating this was my way of making sure I had what it takes to see a project through to completion. It ended up getting me addicted to projects\n- in 2013, I left my finance job for good after getting a book deal drawing mazes (Extreme Mazes, Mindware series).\n- I then went on to publish a handful of other maze books as I worked on improving my drawing skills. This also helped me learn how the art/design world works. \n- Also in 2013, I got a lucky break while replying to an online posting. It lead to [this nationally televised set-design/art work](https://youtu.be/M5n0jLf2-Bc). \n- From here I was able to start networking in the Chicago film scene and got a gig as a Stand-in for Chicago PD from Season 2 through Season 5. This helped me really understand what the film production process looks like from the inside. While animation is different in a lot of ways, the overall production process on a tv show set has a lot of overlaps.  \n- After this, I wanted to increase my Project Management skills because I knew that any film project will eventually require me to lead a team. So I combined my design/set-work and creative energies and began looking for a fitting PM job. Unfortunately, I couldn't land a job in my target industry (animation), but I did get work in fast-paced, creative based industries (Trade Show & Experiential Marketing). \n- I was able to PM hundreds of projects over the past 4 years, and it taught me a lot about being able to adjust to problems, working with vendors/contractors, setting workback schedules, managing client expectations, etc...\n- So last year (2020) I finally saved enough money to build a PC that can handle the 2D and 3D softwares I've wanted to learn for years. While I know Adobe pretty well from work throughout the years, I've never gotten to truly dive into Blender, Cinema 4D, Maya, Moho, etc...\n\n\nAnd that brings me to today. Earlier this year, I let my current employer know that I planned on leaving in May to begin my animation career in earnest. I've saved up a modest amount of money to hold me over while I dive into learning for 3 months. I've signed up for bootcamps, bought courses, and started testing my skills just to make sure this is what I want to do. \n\nSo... here's why I'm so happy: \n\nI created these two animations on my new gear. These are my first attempts at animating, and I love the process of making them.      \nThere's no doubt in my mind that this is what I want to be doing, and I was encouraged to see the results of my first attempts.     \nThere's a long, long way to go, but my dream can finally begin. \n\n[My first background animation.](https://drive.google.com/file/d/11xrTJ7dqXqmYDCoeFy_1vgxPeFJi0fO1/view?usp=sharing)\n\n[My first character animation.](https://drive.google.com/file/d/12Hk3TEy3NbYS7SwsiRm4bFtdFqDXt1xN/view?usp=sharing)     \n      \nThanks for reading! Cheers!", "url": "https://www.reddit.com/r/happy/comments/mxl5dh/after_over_2_decades_of_planning_my_animation/", "title": "After over 2 decades of planning my animation dreams have begun!", "social_network": "reddit", "user": "matthewsmazes", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 33, "down_vote": 0, "creation": 1619274826, "permalink": "/r/happy/comments/mxl5dh/after_over_2_decades_of_planning_my_animation/", "nsfw": false, "first_save": 1635439493.2789621, "replies_charged": false}