{"id": "t5_2qh5i_t3_vdq28", "request": ["4de8d439-3f8c-406c-9767-31bcb471a057"], "text": "My last two summers weren't so good. The first summer I was back home, had awful depression, and hated every second of it. Last summer I stayed at college and worked in a research lab and would wake up at 4PM and sleep around 4AM (to be fair I set those hours myself) and it was still pretty lonely. This summer, I only have a part-time job, but it's pretty amazing. It's exactly what I want to do right now and is a great work experience and potential career choice in which I have a lot of freedom in deciding how a small business runs. I'm allowed to take risks which is a little scary but exciting.\n\nI still feel like it's important to keep my parents happy (they are paying for most things). Thankfully my year finished up with all A's and one A-, which is by far the best average I've had since being at college. Not complaining, since they value how much grades matter in the world more than I do. I'm also studying for the GMAT so I believe they approve of what I'm doing.\n\nI have been revising/writing a formalized business plan; over the past week, I've found some great academic information that supports the claims I proposed yesterday to my boss, who appears to be on board with my ideas! I'm also re-reading the 4-Hour Workweek, which is pretty awesome (highly recommend if you wanna do shit), and going to some great restaurants and events with friends. My girlfriend is kind, fun, and supportive, and I feel like I've found someone special to me. My roommate is gone this summer so I have a 2BR to myself!]\n\nI've also lost about 15 pounds in the past couple months, and wish to continue this trend.\n\nThings are not always bread and butter for me, and it's not like this summer is perfect, but from a holistic perspective, I'm moving in good directions for the future, on top of my shit, and I'm happy about that! Now the trick for me is to keep motivated and not get too comfortable or complacent!", "url": "https://www.reddit.com/r/happy/comments/vdq28/moving_in_good_directions/", "title": "Moving in good directions", "social_network": "reddit", "user": "punspinner", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1340286298, "permalink": "/r/happy/comments/vdq28/moving_in_good_directions/", "nsfw": false, "first_save": 1635439616.2508178, "replies_charged": false}