{"id": "t5_2qh5i_t3_fddwr2", "request": ["ea4a7795-7887-476a-9ab2-4c77d117a852"], "text": "I'm not 100% sure this is appropriate for this sub, I hope so cause I just wanted to tell someone and I don't know what other sub it would belong to :)\n\nToday I saw someone I knew briefly 12 years ago, I didn’t speak to him but it made me so happy to see how happy they looked, how at ease and confident they seemed.\n\n12 years ago we met and hung out a few times, he was my friends ex-girlfriend & friend at the time. At the time I was living in a dormitory and it was common people would hang out with someone for a while, become friends, and then just drift apart. This was one of those short lived friendships, not because anything negative happened or we didn’t enjoy hanging out together, there were just lots of other things to do and people to hang out with.\n\nI remember back then getting the feeling he was a little shy or not confident, can’t really describe it, like a little uncomfortable somehow. At the time he was a lesbian and I sort of just chalked it up to that. Back then there was a lot more prejudice and stereotypes here around sexuality than today, I figured it must be tough to be 16 years old and out.\n\nWhen I saw him today I wasn’t 100% sure it was him so I didn’t want to initiate talking to him - in case it was just some guy who reminded me of “her”. After a bit I still couldn’t stop wondering if it was him, and thinking of how happy, confident and at ease he looked compared to back in the day. So I message a friend of mine who also knew him back in the day. Asked if she remembered “her”, then asked if she knew if he is trans or if maybe it was just someone that reminded me of “her”. My friend said she didn’t know but it wouldn’t be a big surprise to her. She was able to remember his last name and with that (and a couple of other details) I was able to find him on Facebook and confirming that he is the person I remember hanging out with.\n\nI don’t know why, but I just felt like sharing this with someone. Later today I saw him again, this time with a few friends hanging out and chatting. And again, he looks so confident and happy. It feels a little weird that this is preoccupying my mind so much, that a person I briefly knew 12 years ago seems happier today than back then - but it somehow just managed to make my day better.\n\nI also found out he's studying films at university, which is awesome because I remember 12 years ago that was his dream!", "url": "https://www.reddit.com/r/happy/comments/fddwr2/today_i_saw_a_person_i_knew_12_years_ago_and_they/", "title": "Today I saw a person I knew 12 years ago and they seem so much happier today :D", "social_network": "reddit", "user": "Leyniadgangur", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1583332774, "permalink": "/r/happy/comments/fddwr2/today_i_saw_a_person_i_knew_12_years_ago_and_they/", "nsfw": false, "first_save": 1635440219.2836678, "replies_charged": false}