{"id": "t5_2qh5i_t3_kov99s", "request": ["0344ec6b-2528-4c06-8dba-4c3095c02293"], "text": "As my country went into lockdown, I was low-key depressed, not able to express my feelings and everything bothered me. I quit social media twice and spent the first couple of months with hardly anyone to talk to, cut off completely from my closest friends and any effort I put into fixing things, was shot down. I lost close family due to the pandemic and had a scare with my mom too. As time went on, I started putting some effort into my physique and started working out everyday. As the lockdown rules were relaxed, I started going out with a friend who again introduced me to her friends and so on. Even though I don't smoke or drink, I spent my evenings at clubs talking to them and having friendly banter, really getting to know these people . One of these friend's offered to host a new year's party at his terrace and spent a month's salary on the alcohol and food for a group of around 15 of us. I had a few shots of Jäger, vodka and champagne and had the best night of my life yet. One of my closest friends sat next to me and kissed me on my cheek while she thanked me for being there for her over the past year and I did the same, it only hit me later that it was the first time I had someone apart from family kiss me and vice versa. Yesterday I hit 4500 skips in about 55 minutes which is my personal best and I wasn't event tired (Idk how good that is). I might be 21, never had a girlfriend but I'm the happiest I've ever been and if I can do it, so can you!", "url": "https://www.reddit.com/r/happy/comments/kov99s/2020_started_with_me_being_lowkey_depressed_but/", "title": "2020 started with me being low-key depressed but the year ended with me being the happiest I've ever been.", "social_network": "reddit", "user": "gforgops", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1609582755, "permalink": "/r/happy/comments/kov99s/2020_started_with_me_being_lowkey_depressed_but/", "nsfw": false, "first_save": 1635442725.3935204, "replies_charged": false}