{"id": "t5_2qh5i_t3_ntysyh", "request": ["1d9bc0bf-4a1c-437e-94e7-5a07c99811fe", "2293bc08-7671-4d63-b63f-dbe4a3a4858a", "8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "I'm feeling really good as I'm writing this, I am genuinely proud of how I handled myself these past two days - in two separate situations.\n\nTrying to get over a bit of a slump, so I forced myself to go on more walks around the city and parks to hit 10,000 steps every day. It's been a really fun atmosphere around the city this weekend because we have the arts festival and pride celebrations both going on in Pittsburgh right now. \n\nYesterday, I saw a cute girl sitting by herself and after reminding myself \"regret is worse than rejection\" I went over and started a conversation with her. The chat was entertaining, easy, light, we learned a bit about each-other and got to have a simple pleasant conversation with hundreds of people walking around the park near us. This was the first time I've approached a girl to talk since my 4 year relationship ended. When she and I had to head our separate ways to get to work after about 30 minutes, I scribbled my number down on a piece of paper and gave it to her. It's been well over a day now and she hasn't contacted me and at this point I'm guessing probably won't but that's OKAY! I'm still incredibly happy that I proved to myself I can still engage in a conversation with a stranger, and have the confidence to go start a chat, and handle myself throughout. Please don't interpret this as a silver lining sort of thing, because it's completely fine if we never talk again, I'm happy about the fact I shut up all those negative worried voices and just walked up to someone and said hi. That's a win for me!\n\nThen, this afternoon I was feeling really good after my workout, and had just got my new running shoes in the mail that morning, so I wanted to go for a short run to try them out! I've always been self conscious about my weird abb genetics, mine don't line up nicely across from one another, and I have some light remnants of bacne  from when I was a teenager, 25 now. It's 90 degrees full sun in the city right now, so I rode that happiness I was still feeling from the previous day, lathered up in sunscreen and went for my first run ever without my shirt on.  I ran along the water and ended up at point park, and then walked home to recover through the arts festival and into the city.\n\nWhile I was walking home some guy in a  white truck was yelling \"hey buddy buddy buddy buddy\" out of his window until  I turned to look at him, in case I something had fallen out of my pocket or he was needing directions, at which point he shouted \"put a shirt on\" and drove off.\n\nI smiled so hard, and I've felt amazing since then. That would have destroyed me like hearing  \"chicken legs\" when I was a ball boy for the soccer team at 13, but now It was the best compliment I could have gotten.\n\nThis  jealous turd was so uncomfortable with where he is at physically that  he felt the need to get my attention and try to shame me. I felt wonderful, I know I have my flaws, but I also know I look pretty decent,  and it was really validating. Again, this isn't something bad where I'm seeing the silver lining, but a genuine sign that I've really grown and can handle that with the knowledge that I look good and I'm doing well!\n\nIt  realllllllly also showed me the truth of that notion that if you've already  had a success of some sort early in your day, hardships later sluff off  more easily. I knew I already crushed chest and calves that morning, and  had a good run, so I could take this on the cheek.\n\nAll in all it's also been a fantastic example that happiness can compound, and you can use each little nugget to fuel you on to do something else, I'm going to keep going and try to work on getting that every day. \n\nCheers", "url": "https://www.reddit.com/r/happy/comments/ntysyh/initiated_a_fun_conversation_with_a_stranger_and/", "title": "Initiated a fun conversation with a stranger, and overcame a fitness fear.", "social_network": "reddit", "user": "Floppy_Mycologist", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 3, "down_vote": 0, "creation": 1623022793, "permalink": "/r/happy/comments/ntysyh/initiated_a_fun_conversation_with_a_stranger_and/", "nsfw": false, "first_save": 1635440581.7854402, "replies_charged": false}