{"id": "t5_2qh5i_t3_pu6rz2", "request": ["0c4243d9-adb2-4db8-bf87-57a87f62e968"], "text": "\n\nI've already experience with therapy but during rona, with no job, university at home, fearing my partner might get ill, no seeing friends anymore, no going out and so on, depression and eating disorder came back. I decided to get help in summer last year and first it got worse. I really feard I might never get better. \n\nAnd now here I am. A few month ago we changed to a two week schedule, had a three week schedule a few times and it was completely fine. I had a lot to talk about but rather about new exciting good stuff, than therapy themes. We even finished the last three appointments after only 20 minutes because there was just nothing to therapy anymore. And it felt better and better. \n\nI had to use recovery records (app for eating disorders where you log in every meal, feeling and thoughts and your therapist can read it) and since quite a while I felt rather annoyed about it and forgot a few times because it just didn't take up my mind anymore. For the last month we went without it and I felt so free and happy and good again.\n\nShe asked me if there were some things that got to less time or if I am afraid about certain things in the future and when I said I would liked to dig into my childhood a bit deeper she said \"But this is something you could do on your own, too. You're so strong and smart you've learnt so much, you're completely capable of dealing with this\" and this made me to proud and a bit teary-eyed.\n\nI am truly happy and so thankful. She is an awesome therapist and the first who really fully helped me. I feel confident and strong and I am excited for the future.\n\nTL;DR : today was my last therapy appointment and I am so happy, I feel thankful and strong and ready for the future.", "url": "https://www.reddit.com/r/happy/comments/pu6rz2/today_was_my_last_therapy_appointment_and_i_am_so/", "title": "Today was my last therapy appointment and I am so proud of myself and so thankful for my therapist", "social_network": "reddit", "user": "Whysocomplicat3d", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 24, "down_vote": 0, "creation": 1632437628, "permalink": "/r/happy/comments/pu6rz2/today_was_my_last_therapy_appointment_and_i_am_so/", "nsfw": false, "first_save": 1635442491.7897778, "replies_charged": false}