{"id": "t5_2qh5i_t3_mes5wz", "request": ["1d9bc0bf-4a1c-437e-94e7-5a07c99811fe"], "text": "So I've made numerous posts in the past about how I lost my wife a year ago and have been raising our daughter on my own. And a while ago, I made a post stating that I finally got a house, me and my wife's dream. It's a little two story family home but it has everything you could need, and my daughter gets to still go to the same school she does now.\n\nI'll admit these past few weeks haven't been easy at all, mostly because the idea of us leaving the place my daughter grew up in is hard. I've slowly but surely trying to get her more into the idea of moving and she's kind of happy about it, but still. I promised her I'd give her something of her mom's too: a jewelry box with a ballerina inside and an old fashioned makeup/vanity table that my wife had as a kid. That got her in a much better mood. \n\nOur last night Friday was kind of forlorn, for obvious reasons. But she'd been taking lots of pictures of the place as something to remember it by. I made her favorite dinner for her also and let her stay up longer, but I also had a heart to heart with her about her mom. All I said was \"Mom will always be here (I pointed to her heart) and here (I pointed to her head). She never left us, she lives on through us and especially you. And plus you look just like her, like a spitting image\" and she didn't believe that last part but still smiled about it. Finally, I let her sleep in my bed if she wanted but she said no, yet she came in anyway in the middle of the night trying to be quiet as a mouse but I'm a rather light sleeper haha. \n\nSo this morning, me and my brother and his wife, who my daughter absolutely adores, all had breakfast together before starting the packing. My brother borrowed a box truck from his work and we managed to get most of the big stuff like beds and couches all in in one trip thanks to the help of some other friends of his from work. Took us most of the day but we got everything settled and hooked up for the most part. \n\nBut the last things we needed were the makeup table  and jewelery box, which were both at MIL's, her grandma. We said our hellos and my daughter gave her the biggest hug I'd ever seen from a kid her size, she's so full of love. Her eyes lit up seeing them in person, even though they were obviously in need of a good painting. I put some batteries in the jewelry box and let her play with and stare at it all the way home. It was the happiest I'd genuinely seen her in I don't know how long. \n\nAnd the rest of the evening was pretty chill. I asked her again what she thought of the place and she was still kind of adjusting to the whole thing but I could tell she was a little bit happier about it, even saying \"I think I'll like it\". There's still some small stuff to move in which we'll do tomorrow probably and I told her I'd bring her with to see the place one last time before handing over the keys back to the landlord. I'll admit I did get emotional a bit seeing us move all our stuff out, but just had to carry on. \n\nI also meant what I said about my wife and her living on through us. I'm not religious by any means nor spiritual, I just think she lives on through our memories and our character, who we are. And I know that wherever she is, she'd at least be proud of what our baby girl has become.", "url": "https://www.reddit.com/r/happy/comments/mes5wz/we_moved_today_and_im_just_glad_my_daughter_likes/", "title": "We moved today, and I'm just glad my daughter likes the new house, something me and my wife always wanted", "social_network": "reddit", "user": "huntsman_459", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1616896993, "permalink": "/r/happy/comments/mes5wz/we_moved_today_and_im_just_glad_my_daughter_likes/", "nsfw": false, "first_save": 1635440585.261363, "replies_charged": false}