{"id": "t5_2qh5i_t3_ozdvoy", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "0344ec6b-2528-4c06-8dba-4c3095c02293", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": " I. AM. OVER. THE. MOON. \n\n[Here's the situation, if you didn't see the first post.](https://www.reddit.com/r/happy/comments/ox6bzs/im_probably_getting_back_together_with_my_old/)\n\nALRIGHT, so a few nights ago, I invited my old girlfriend from middle school to come over to my place and watch movies. We’ve been hanging out for the last few months, getting to know each-other again, and I’m so, so happy. I’ve been considering seeing if she wanted to start dating again for months, and I finally decided that I was just going to do it and see what happened. I have a friend who I got to do some \\~recon\\~ for me, and he was 100% sure that she was just waiting for me to make a move, so I wasn’t nervous about her saying no or anything. I was just hesitating because getting into a relationship with someone you really like is nerve-wracking, and also probably because I’ve got some horrible problems with intimacy. Dab.\n\nANYWAY. My roommate was home, so we spent some time playing board games together, which was awesome. But after a bit I texted her like, “Hey, need to hang out with this lady alone for a bit please let me have the living room.” And so she did. And it was just her and me. I made dinner, which was awful because I’m not a great cook and I meant for us to go out to eat somewhere, but we both bike places, so that wasn’t realistic. So we had a meal of very salty stir fry which she somehow managed to eat without complaining one time.\n\nWhile we were eating, we put on a movie. We started the night on opposite sides of the couch, but I (being the subtle and suave woman of the world that I am) got just a little bit closer to her every time I got up to refill my water (which was a lot). Until eventually she called me out and said that I could just sit next to her if I wanted. Which I did. So I did. And I sort of nestled into the crook of her arm, and she put her arm around me, and I rested my head against her shoulder. Gonna be honest, folks, coulda cried. It’s the most *right* I’ve felt in years. Probably the most right I’ve felt in, oh, something like eight years and three months since she moved away the first time. It was like putting on glasses for the first time when you didn’t know how bad your eyesight had gotten. I didn’t realize how much happiness I hadn’t been feeling. Just being close to her like that again was such a rush. But a weirdly calm rush? Like after you’ve been running for a long time and you finally get to flop down in the grass somewhere. I felt so much stress that I’d been holding on for *years* just melt. Gone. \n\nAnd I didn’t even worry about what I was doing or if I was going too fast or if I looked stupid or anything like that. I didn’t worry about her thinking it was weird that my hand was on her stomach. Or if I was being too affectionate. I was able to just stop thinking and enjoy the moment. Feeling her breathing. How soft her shirt was. How *great* it felt to have someone hold me for the first time in ages. And I was so relaxed and so content that the words just slipped out. “We should go out again.” Didn’t fret about how I was going to phrase it or what she would think or how it would affect our friendship. Just said it. And she didn’t say yes. She fucking *kissed me*. She put her hand on my cheek and leaned down and put her lips on my lips and she *kissed me*. I wish I could say it was my first kiss, because the other ones were really regrettable, but it was my first kiss with her. I remember how often I would stress about wanting to kiss her when we were alone together. Drawing comics in my room, or watching TV, or doing homework or whatever, and I never did it. And I *always* regretted not doing it.  And now we’ve done it, and it was beautiful and fantastic and I’m gonna scream.\n\nI can’t stop thinking about her. I’m smiling all the time. My friends don’t recognize me when I’m not miserable! Every little thing about her just makes me grin like a loon. She called me by the silly pet name that she had for me in middle school. I didn’t know how much I missed that. And she held my hand. She kissed me at the door. AHHH. We get to hold hands in public and I can introduce her to people as my partner and we don’t have to hide that we’re dating anymore because we’re adults and who cares what anyone thinks! I don’t remember the last time I was *giddy* like this!\n\nAnd, of course, I’m also terrified! Because I’ve spent a long time in therapy trying to learn how to be vulnerable with people and silence my brain when it says that my best friends are going to get shipped off to Mexico at any moment, so getting close to people is dangerous. And I’ve been trying to learn how to develop feelings for other people, since I obviously couldn’t have a relationship with her because she was in Yucatan for all I knew. It feels regressive to date her again when I’ve made so much progress trying to get over losing her. And I worry that I’m romanticizing her. I don’t think I am (at least not too badly), but there’s always the voice in the back of my head telling me that I only love this person because she used to be my middle school girlfriend. We’re both totally different people now, and I’m worried that my brain is just settling into this relationship because I want those eight years back with the girl I knew. And I want her parents to like me! I mean, they *do* like me, but I want them to like me as her girlfriend. I want them to approve of me as a partner. Apparently she’s out to her dad, which surprises me a little, but he always seemed like he might be cool. Her mom still doesn’t know. She’s very religious, but my girlfriend (AHHHH) says that she’s trying to get better about LGBT+ stuff since Pope Francis is cool with it, so maybe there’s a chance? \n\nAnyway, I’m dying over here. Thank you to everyone who wanted an update on this story! If anybody just wants to hear me gush some more, feel free to reach out via DM’s. My profile is a kinky mess (alt account for lonely nights), so please ignore any NSFW stuff you see. I have so much stuff that I want to talk about and my friends are all tired of hearing about it (although they’re happy that there’s an update and that things are going well), so don't hesitate to reach out!", "url": "https://www.reddit.com/r/happy/comments/ozdvoy/update_im_probably_getting_back_together_with_my/", "title": "[UPDATE] I'm (probably) getting back together with my old girlfriend from middle school tomorrow night and I haven't been this happy in years! (Spoiler alert: SHE KISSED ME!)", "social_network": "reddit", "user": "Reset_Machine", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1628278655, "permalink": "/r/happy/comments/ozdvoy/update_im_probably_getting_back_together_with_my/", "nsfw": false, "first_save": 1635439283.7746904, "replies_charged": false}