{"id": "t5_2qh5i_t3_fkdlph", "request": ["258e332d-215f-495f-8bee-bccd57229f62", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I love writing -but it consumes a lot of time and energy, not to mention that I established a schedule for my one-chapter short story fanfictions so my perfectionist tendencies wouldn't get in the way and prevent me from getting stories finished. Also, I want to write my own cartoon when I grow up, so I partially write because I want to learn how to put stories together on my own time.\n\nBasically, while writing is a fun and rewarding hobby that I enjoy doing, it's not always a relaxing hobby and there's an underlying purpose of \"I do it because it's useful\".\n\nSchool also gets busy and stressful from time to time (not counting coronavirus), and I have a feeling that when I enter charter school, it'll become even more hectic. (The fact that I got in is a double happy post in and of itself.)\n\nI used to love video games, but then I made a conscious decision not to play them when they started taking up precious writing/homework time -this was before I scrapped a stressful story and established a schedule. Now that I finally have time to play video games due to no school, it just feels like I'm doing it 'cause my work timeslot is gone and I need to fill it with something.\n\nBasically, I need hobbies that are relaxing and not time-consuming.\n\nWell, a few months ago, I was digging around in the never-used drawer of my bedside table (due to cleaning) and found an old recorder I hadn't touched since third grade. Yes, *that* recorder that parents and children alike remember with a certain sense of scorn. Out of curiosity, I decided to play that old instrument.\n\nApparently I was good enough to not blow everyone's ears out on first try -and in fact, I was surprisingly skilled at it even though I hadn't done it in years. I left it on my bedside table and played it every once in a while. My desire to do music was sort of rekindled by Steven Universe, so I started replicating songs on the recorder with some difficulty.\n\nWell, I was later told to move my recorder off the bedside table because of some idiotic rule that there were no more than two items on a surface so the house would sell (definitely not happening now, lol), and chose to take it downstairs to the side table next to the couch. (Said couch was replaced by two chairs.)\n\nThis combined with my habit of being downstairs and my increased desire to sing (long story) revived the spark of my appreciation for music. I started playing the recorder more and more, to the point of doing it out of boredom when I didn't feel like writing.\n\nAnd now, here I am, loving my recorder so much that when I'm waiting for day to arrive in a specific video game, I play along to the nighttime soundtrack. My fingers just flow on the recorder so quickly and easily. It's relaxing.\n\nYesterday, I got acceptance letters for charter school under the writing department, and oddly enough, I also received a paper of other class options that were all music-related. I am mildly interested in the woodwind option and would pick it up if it were a one-semester thing, except it's a major class from the music department and I worry that if I pick it without needing to, it'll be more intense than I have time for and my already-hectic homework load from writing will become even more hectic. (If I am required to pick a music class, I'd pick the woodwinds in a heartbeat.) I could get around this by asking for private lessons outside of school. I hated my old piano lessons because it involved formalities like recitals and exams, and I was on someone else's rather strict schedule and rules instead of mine. Plus, for me, treating as a second school and not a hobby defeats the purpose of me wanting to relax by playing music myself. All I have in mind is just something I'm casually interested in, no formalities or real schooling involved. I could get around this by, once again, asking for an instructor with looser guidelines and no real formalities.\n\nBasically, I'm considering some kind of non-complicated woodwind instrument that's slightly more complicated than the recorder that I can treat as a relaxing hobby.", "url": "https://www.reddit.com/r/happy/comments/fkdlph/found_a_potential_hobby_that_under_the_right/", "title": "Found a potential hobby that, under the right circumstances, isn't too time consuming and not related to productivity!", "social_network": "reddit", "user": "PopsicleJolt", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1584480969, "permalink": "/r/happy/comments/fkdlph/found_a_potential_hobby_that_under_the_right/", "nsfw": false, "first_save": 1635440700.7685306, "replies_charged": false}