{"id": "t5_2qh5i_t3_i5ux7d", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "c15214d3-1d77-40d5-ad12-df4ba3bdb7b2"], "text": "WARNING: post is long. TLDR, doing something about the way I’ve felt for all my life has been the best decision I’ve ever made. Even if you have the slightest inkling you have ADHD, go see someone. It’s never too late in your life.\n\nI just wanted to share my experience over the last few weeks with others here concerning my ADHD - Inattentive diagnosis. I have had such a good week that on several occasions I’ve almost cried out of happiness. Something I thought was dumb and could never comprehend before this week. \n\n\n\n\nFor reference, I am a 29 year old man based in Australia and work in education. I have always been incredibly disorganised, supremely forgetful, walk away from conversations wondering wtf we just talked about and make many stupid and obvious mistakes throughout the day. Something Ive always felt super weird about was my lack of any sort of memories from primary school (years 1-7) and even early high school. Turns out it is common amongst those with ADHD. My house is a mess, driving my poor fiancé crazy. She’s a beautiful person who is overworked and has had to deal with my BS for the past seven and a half years. \n\n\n\n\nProfessionally, it was incredibly embarrassing when I would forget to follow up on something I promised, a regular occurrence. Similarly, not having convictions when speaking with or in front of people for fear of forgetting my talking points made me feel weak and dumb. But the the thing that affected me most, that really affected me to my core, was the brain fog. Come 11am, I was cognitively a zombie. My students wouldn’t get the help they deserved. Anything I was told would be acknowledged, but gone the instant the conversation stopped. I did everything I could, including cutting as many corners as possible without drawing attention to myself to leave at the earliest possible time. I thought at the time, “I work my friggin arse off here, I deserve to leave on time”. In hindsight, I wanted to get home to play video games, and usually just ended up on the couch doing nothing. Compared to my peers, I didn’t do that much. To be succinct, I knew I wasn’t reaching my potential, I wanted to reach my potential, but couldn’t bring myself to change my behaviours.\n\n\n\n\n\nTo get an ADHD diagnosis here, you must visit your General Practitioner, and they will refer you to a psychiatrist. Miraculously, on a whim I made myself make an appointment. I think it had something to do with my dad’s Myeloma diagnosis. The day I went with him to his bone marrow biopsy, he looked my in the eye and said “look after your teeth better, shave your neck more often. You’re nearly 30, get your shit together (lol)”. \n\n\n\n\nSo, I booked myself in. My GP is incredible, noted everything I said, and agreed that this points towards ADHD, presenting as inattentive. She listed 4 psychs who specialise in ADHD. I booked in with one, and was met with a 9 week wait list. It sucked, but I said I’d deal. I’ve gone the last 7 years in this profession, I can last another 9 weeks. I received a call 2 weeks later as there was a cancellation, and I was in the next day. \n\n\n\n\nI met with the psychiatrist. He was a straight down the line doctor, listened to what I had to say, accepted it all and had me take a few tests. He didn’t necessarily focus on building a relationship, but clearly wanted to build a picture of what my life has been like. I sort of appreciated the way the emotion was left out of the conversation. He showed me some videos and had me take a few tests. We discussed treatment, and he said Dexamfetamine Sulfate would be the most affective for my symptoms. He asked me to come back in a week, told me to go pee in a cup and slapped me with a $445 bill (but $210 back, cheers socialised health care!), but I felt great after. The wheels were finally in motion. \n\n\n\n\nI went down to pee in the cup. Waited 45 minutes and couldn’t pee. The old dear in the corner of the room sort of put me off a bit. I tried my best but couldn’t make it happen. I apologised and said I’d be back tomorrow to try again. I scurried out of the room, not making eye-contact with the staff out of embarrassment. The next day, I stopped peeing at 12pm. I sipped water all afternoon and headed to the lab at about 3. The whole drive I was shifting in my seat, my bladder about to explode. I made it, peed in a cup (she made me wait while she filled out the paperwork slower than a 5 year old) and that was that!\n\n\n\nI went to my appointment the following weekend and discussed a treatment plan with the psychiatrist. He put me on a plan to ramp up my dosage. I would be taking 30mg a day eventually, with freedom to take up to 40 if needed. The first day was a Sunday. I took one 5mg tablet at 7am. By 12 o’clock that day, my house was clean, I had my weekly planner done for work, and had walked my dog. I couldn’t believe it, I actually enjoyed finishing my house work and schoolwork. This has to be a placebo effect, right? My fiancé couldn’t believe her eyes. I am sure she appreciated it though!\n\n\n\n\nThe next day at work, I took 5mg again at 7am and 5mg again at 12.30pm. I got to work, and I was filled with something I hadn’t felt in a long, long time. A complete and total sense of calm. I knew what I was doing that day. And I did it. I got asked questions by my bosses. I answered them and had some friendly banter. I wrote 10 emails to parents of children who needed a meeting. And I freaking loved every second of it.\n\n\n\n\nThis continued throughout the week as I built my dosage up. I have never worked as hard as I have this week. And I have never enjoyed my job this much. I just can’t wait to tick things off my mental list. I have a complete sense of calm where there was only anxiety before. My students are achieving way more than they were before. I’ve had colleagues and friends come to me and say they are so happy that I am walking around whistling and conversing with everyone. I love talking to people and feel like I can hold my own. And I have ideas now! It’s crazy, I’m coming up with ways I can improve my practice and trying to implement them. I have said to myself multiple times now “holy shit, is this how normal people feel?”. \n\n\n\nIt’s been a week, and I expect things to normalise eventually. But it has shown me what I am capable of. I can do my job well. I can hold my own in my profession. I get started on tasks immediately now. I mean, I sat down and typed this post! Two weeks ago I would have started it and deleted it all at the half way point. This feeling is just pure elation. I feel like I have meaning in my mundane tasks now, and finishing them gives me more satisfaction than I could have ever imagined.\n\n\n\n\nIf any of what I have said resonates with you, follow up on it. You owe it to yourself to reach your potential. See whoever you need to see to make it happen. It’s worth any cost, and it’s never too late in your life.", "url": "https://www.reddit.com/r/happy/comments/i5ux7d/i_finally_started_treatment_for_adhd_i_think_this/", "title": "I finally started treatment for ADHD. I think this may have been the best week of my life.", "social_network": "reddit", "user": "ADecentReacharound", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1596870642, "permalink": "/r/happy/comments/i5ux7d/i_finally_started_treatment_for_adhd_i_think_this/", "nsfw": false, "first_save": 1635439334.561111, "replies_charged": false}