{"id": "t5_2qh5i_t3_dqkwst", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "Hello,\n\nA few years back in my 35s I decided to try reaching one of my childhood dreams, to be able to play one of the greatest organ works of all time: Bach's Passacaglia & Fugue in C Minor. There was only a small problem: I had never played an organ before. Instead I had a background of playing piano in my youth, so regardless of the insane difficulty of this masterpiece, I felt quite optimistic; just a few more keyboards and a pedalboard, it cannot be that hard, right?\n\nFirst I started to build a simple home organ for practicing purposes. I ordered a midi pedalboard from internet, carried a few midi keyboards from store, installed virtual pipe organ software to my laptop and suddenly I was ready to start practicing.\n\nThe start was a real struggle and I realised very early it wasn't going to be so easy after all. It actually felt so difficult that I almost quit in daily basis. Anyway, after a few months of pain, disbelief and fear of failing I started to take lessons from a cantor of my hometown, which retrospectively speaking was a really good idea because she made me understand how little I knew about playing organ after all, Articulation, pedalling techniques, fingering and all other sorts of stuff that I hadn't even thought about. I was really overwhelmed at first but eventually it paid off.\n\nNext 12 months or so I just kept pushing and pushing, countless of hours until, somehow, someway I finally made it through, kind of. I have to say that this has been probably one of the hardest things I've ever done in my life and therefore it feels so good to made it this far. Infact, even I know that the outcome isn't perfect, when I listen myself playing it almost brings tears to my eyes because I really feel like I did reach one of my life goals and something absolutely amazing at the same time.\n\nThanks for reading and I wish this story gives motivation to someone who wants to achieve something difficult yet great in his/her life. Trust me, It's worth it.\n\nIf you're interested, the recording can be found at:\n\n[https://soundcloud.com/justsomerandomstuff/j-s-bach-passacaglia-and-fugue-in-c-minor-bwv-582](https://soundcloud.com/justsomerandomstuff/j-s-bach-passacaglia-and-fugue-in-c-minor-bwv-582)\n\nHave a great day!", "url": "https://www.reddit.com/r/happy/comments/dqkwst/im_so_happy_today_that_i_wanted_to_share_my_story/", "title": "I'm so happy today that I wanted to share my story", "social_network": "reddit", "user": "Purrgold", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 17, "down_vote": 0, "creation": 1572704945, "permalink": "/r/happy/comments/dqkwst/im_so_happy_today_that_i_wanted_to_share_my_story/", "nsfw": false, "first_save": 1635441985.1150062, "replies_charged": false}