{"id": "t5_2qh5i_t3_9qz2yn", "request": ["5b81e8b4-a0f8-4747-8a7a-0e37aae01c43"], "text": "Backstory: I just turned 30 and my wife is 27. We met in high school and were sort of off and on until we got really serious at the end of college. We settled down and got serious about work, bought a house, got married finally in 2015. After we got back from the honeymoon I sank into a really deep depression. I suffered big time for about a year and it almost ruined my life. I decided I didn't want kids, they just scream and ruin marriages and all kinds of other (obviously incorrect) things that my depressed brain told me to believe. I almost ended my life on Christmas Eve in 2015 because I thought continuing on was pointless. I found out that I am bipolar and it explained a lot of things that I went through earlier in my life. I got help and came back to a healthy state of mind and felt so blessed that my wife was at my side even when I felt I didn't deserve it. We decided to start trying for a kid in January of this year and it happened pretty quickly. I was very nervous at first during the pregnancy. He arrived on the 22nd and my life instantly changed. I was overwhelmed with love and happiness and I cried tears of joy and didn't know how my life could ever have been as good without this perfect little man. My wife and I are so incredibly happy and we're ready to raise this little human being to be a good man and to live a good life. He is incredible! I feel, now, that my experiences with depression and bipolar disorder have equipped me to recognize signs in him if he ever goes through similar times, and that I will be ready to help him navigate the feelings and have the support he needs to be happy. I love my son and I am so happy!", "url": "https://www.reddit.com/r/happy/comments/9qz2yn/welcomed_our_first_kid_into_the_world_2_days_ago/", "title": "Welcomed our first kid into the world 2 days ago!", "social_network": "reddit", "user": "birdman133", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1540383221, "permalink": "/r/happy/comments/9qz2yn/welcomed_our_first_kid_into_the_world_2_days_ago/", "nsfw": false, "first_save": 1635442982.1296215, "replies_charged": false}