{"id": "t5_2qh5i_t3_1frwqz", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "I don't have any interesting pictures or videos to share. But I have something amazing to tell and figured this is the best place to put it. Throughout high school I was the awkward kid with a few friends. Didn't go to many parties or socialize with all of the popular kids at all. But there was this girl, Sara. One of the most stunningly beautiful women on the face of the earth. Someone I never thought I would have the pleasure of even speaking to. Recently, her and I have been casually hanging out. I built the courage, and invited her to my parents lake house for a weekend where we had a great time drinking and dancing with friends and family members. We had just finished dancing like a bunch of goof balls who know nothing about dancing, when we decided to take a break and sit down. While watching every one else dance and laugh, I couldn't help but notice that she hadn't taken her eyes off of me since we sat down beside each other. I looked at her, as she stared into my eyes, something felt right. I held nothing back, no fear of rejection or lack of confidence. I leaned in and kissed her. As my lips touched hers I felt her push towards me, pressing her lips harder onto mine. Out of shock I pulled away, looked her in her eyes once again. After exactly one second, I pushed the hair away from her face and went in, and had the most perfect, sensual, heart stopping, goose-bump raising, spine chilling, \"Romantic movie\" kiss of my life. The girl of my dreams is finally mine and we've been together for about two weeks now. NOT TO MENTION, I met her best friend emily, and she approves. What's any better than having your dream girls best friend approve of you. Besides her parents approval I suppose. Anyway, I just got home from the bars with her. We watched the Boston VS. Pittsburgh game and had a great time, annnnnnnnd I'm pretty drunk. On that note, goodnight to you all and I hope someday you get to experience the feelings that I can't seem to hide right now. \n\n**TL;DR** The girl of my dreams is now my girlfriend, and is just as happy as I am. Also got the best friend approval ;)", "url": "https://www.reddit.com/r/happy/comments/1frwqz/oh_my_yes_couldnt_be_happier/", "title": "Oh. My... YES! Couldn't be happier.", "social_network": "reddit", "user": "Poppajoe58", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 59, "down_vote": 0, "creation": 1370497962, "permalink": "/r/happy/comments/1frwqz/oh_my_yes_couldnt_be_happier/", "nsfw": false, "first_save": 1635442251.779169, "replies_charged": false}