{"id": "t5_2qh5i_t3_yd2wg", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "*Please feel free to comment/critique.  I'm looking to improve my writing skills :)\n\nSo I was on a two month vacation to China to see my relatives, the family that lives some 17 hours away.  I’ve only seen them 5 times in my lifetime.  So the trip was a big deal for me.  And I was about to enjoy every moment I had with them.  Little did I know what surprises lied in store for me.\n \nAfter living in the foreign, yet familiar land, for almost two months, my curiosity was at its highest.  It was the curiosity I had as a child.  The kind of curiosity only a child that has not yet seen any horrors of life can have.   I found myself not wanting to leave.  I only wanted more of this experience.\n \n It was the last night day with my family before I left for Beijing.  And I was chilling in the rural home of my cousin.   We were talking about everything and anything that seemed important.  We talked about friends.  We talked about love.  We talked about nature.  We talked about life, every miniscule detail about the endless natural and material beauties.  The stuff that one has to look for without really looking.  If you don’t look enough, you’ll never see it. If you look too hard, you might not be looking at the right places.  You need to look in the precise prespective of a time when you are truly enjoying the splendors of life in order to see in that detail.    And we were both right at that moment of ecstasy.\n \nI told him something about myself.  I told him I once had this belief that I could save the world.  I could be that batman, that superman, the heroes that sacrifice everything in order to achieve a cause.  And that cause was a devotion to decreasing the amount of suffering each life holds.  He asked me if I still believed this.  I told him I wasn’t a child anymore.  He then said to me the words that have resonated in my ears since, “Why not?”  And I wondered why not?  Why not?  Why don’t I believe anymore?  It had been a conviction.  My belief was a religion that I had dedicated my life to at one point.  So Why Not?\n \nAnd at that moment, his face tensed up.  The entire area went silent.  The crickets stopped singing.  The wind stopped moving.  The air was black with silence.  With the tone of a Chinese Morgan Freeman he beckoned, “Follow me.”  It was a god telling me in all his supremacy to follow him.  I felt as if I had no choice but to follow him.  So I did.  When walking, he had the familiarity of someone who had walked this road countless times.  The aura was so strong that it gave me the confidence to know where I was going in the pitch black of night. \n \nThe figure led me up a set of stairs that gave the appearance of old and creaky but walked like it was built by the hands of a master.   Still silence.  We went up to the abyss of the attic.  And there was one faint string of light that was levitating in the darkness.  This light beckoned closer as my curiosity led me towards it.  As I got closer, I felt an eerie sense of reminiscence.  It was as if I had seen this light before. Suddenly I found myself with the light softly illuminating my presence.  I reached my hand into the light and pulled the door hidden in the night.  And the light exploded with a blinding pure whiteness. \n \nI knew at that moment.   It was the first light I saw when I first opened my eyes.  It was the light from the first time I saw the sun.  It was as if all hatred, all pride, all greed had been washed away.  There were no negative emotions.  There was only the natural beauty of bliss.\nAnd that was my first time in Narnia.  From that point on, I would befriend a lion, become a king, and save the world.  All my hopes would come true in a reality that may not be real.  But the reality can be real when you undoubtedly believe in it.", "url": "https://www.reddit.com/r/happy/comments/yd2wg/truth_in_imagination_a_short_story_to_inspire/", "title": "Truth in Imagination (a short story to inspire)", "social_network": "reddit", "user": "FlowAsWater", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1345180913, "permalink": "/r/happy/comments/yd2wg/truth_in_imagination_a_short_story_to_inspire/", "nsfw": false, "first_save": 1635439221.9421127, "replies_charged": false}