{"id": "t5_2qh5i_t3_8b5lc5", "request": ["77a5a12a-14c1-468d-b6d8-4b6928ce40ae"], "text": "So my wife is away one a business trip, with no kids to watch yet I've been bored out of my gourd. I decided to say screw that noise and got up and got to work. \n\nSince we got married and bought a house three years ago, one of our biggest points of slacking has been the office in the basement. I basically hooked up my dude-bro computer, slapped some peripherals on it and called it a day. This room has been the drop zone for all of the stuff we don't know what to do with -- Spare rubbermaid containers, bedding we don't need, end tables we haven't quite placed -- Basically the crap hole of our house. \n\nI recently purchased some parts for a new computer build; obnoxiously garish water cooling setups are a hobby; and put it together yesterday, but the office just didn't do it justice. Based on that when I got home I started to work -- the biggest obstacle was a four drawer filing cabinet we came into possession within the first year of living here in favor of the two drawer cabinet I had had as a college student. We immediately filled the massive cabinet with junk that we didn't need to keep but didn't want to go through at the time. I took the time to pull it out and go through all four drawers of junk -- Most of it was unused school supplies or paperwork that we really didn't need to hold on to (graded school papers, thesis revisions, etc. I managed to cram pretty much everything from the four drawers back into my two door filing cabinet and the recycle bin. On top of that, the lower cabinet allows me to put my new computer case up there and show it off, while I can put the printer back into the desk cubby where printers should go.\n\nMy wife and I have been dreading tackling this office for literal years. I'm quite stoked that the actual work wasn't anywhere near the effort we had mentally made it out to be.\n", "url": "https://www.reddit.com/r/happy/comments/8b5lc5/my_wife_is_out_of_town_i_worked_on_a_project/", "title": "My wife is out of town, I worked on a project", "social_network": "reddit", "user": "sidneyaks", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1523342089, "permalink": "/r/happy/comments/8b5lc5/my_wife_is_out_of_town_i_worked_on_a_project/", "nsfw": false, "first_save": 1635440768.6854088, "replies_charged": false}