{"id": "t5_2qh5i_t3_n8ltmp", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716"], "text": "So I had stopped seeing a therapist by this point after what happened with my previous foster parents, and about everything else in my life to this point. I was honestly in a good place and still am, so I figured I’d write her something just talking about everything. I will mention that, because of my dyslexia, I had to type it out first and make sure there weren’t any spelling errors and then hand-write it, which I gave to her. So here it is:\n\nHi Mom,\n\nI’ll try and make this short and sweet, but it probably won’t be. I just wanted to say thank you, you and dad. For everything you’ve done for me and keep doing for me. I can’t thank you enough. Truly. But I also wanted to say I’m sorry. Mainly for how I was in the beginning when you first took me in. I said and did some things that I shouldn’t have at all. I still regret saying them to this day. But, if I’m being completely honest, it was just because I was scared. Scared and angry. Scared mainly because I didn’t want things to turn out how they did with my previous foster parents. And angry for a reason you might not think. It wasn’t because of my previous foster mom. No, it was because of how much you reminded me so much of my actual mom. \n\nI know that sounds weird but I was still so mad at the world for losing her that it felt like fate was torturing me by having someone in my life who was just like her. That was the main reason I had that hostility. But all of that would change the night it happened. My panic attack. When I called out for my actual mom to come help me and you burst in thinking I was calling for you. You wrapped me in your arms like a warm blanket and I legitimately thought for a moment my actual mom had come back but I looked again and saw you. It was the feeling of being so safe and comfortable in your arms that made me understand she was gone but that someone equally as caring and loving was right next to me this whole time. All those mean things I said to you went out the window when you heard me yelling. It didn’t even take a second thought for you. \n\nI’m sorry again for everything, but just know that I love you so much. You and dad. You guys really are the best thing to ever happen to me. I mean it. You gave me meaning and purpose in my life again. I don’t know where I’d be today without you both. But I know that wherever my birth mom is, she’s probably smiling knowing her daughter’s in safe hands.\n\nLove,\n\nCecilia\n\nI was sitting in bed next to her when I gave her this. I cried just from seeing her cry happy tears almost nonstop.", "url": "https://www.reddit.com/r/happy/comments/n8ltmp/a_short_letter_i_wrote_to_my_adoptive_mom_last/", "title": "A short letter I wrote to my adoptive mom last year for Mother’s Day", "social_network": "reddit", "user": "vacant_helper", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1620589393, "permalink": "/r/happy/comments/n8ltmp/a_short_letter_i_wrote_to_my_adoptive_mom_last/", "nsfw": false, "first_save": 1635439607.1456904, "replies_charged": false}