{"id": "t5_2qh5i_t3_p8t6j5", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "Hi! I am a 15 year old teenager who became introspective and self-aware about himself. I am from a very unstable family. When I was in 7th grade I had suicidal thoughts, feelings that my problems would go on and on and will not stop, hated myself. But then I realized, I had an ambition, I always thought of saving somebody from suicide and changing the lives of others. I always wanted to become a psychotherapist, and write philosophical stuff, theories on my personal diary of thoughts which I hide.\n\n&#x200B;\n\nWhen I was in 7th-8th grade I was kind of a people pleaser. Too naïve, tried to see the good in all, repressed my anger in order to avoid conflicts, didn't know when things are going too far. But then in 9th grade, I realized that boundaries must be created.\n\n&#x200B;\n\nMy parents are not really good parents, my mom is emotionally unstable, very bossy, sometimes gets mad randomly, while my dad constantly invalidates my feelings. I cannot get in therapy, they think its useless, both of them constantly fights, there is no more understanding/ agreement between them. My mom is very emotionally immature, she constantly takes her anger and stress out on me, very insensitive towards my feelings. Convinced them to get to family therapy, didn't work, they think its a waste of time, they never really understood that relationships could recover beautifully even if I told them that. I told my dad the repressed anger and sadness I have been keeping for years, ended up getting told to just accept it, got invalidated. I know that my parents are not perfect in raising me, nobody is perfect.\n\n&#x200B;\n\nSomeday in the future, I will heal myself from this trauma and now I just have to endure that I am from a very dysfunctional family. I usually just vent to my best friends or online. I really want to move out and go to a university, currently in grade 10, only 2 more years. Cant really make new friends or go out due to the pandemic, its very strict here. So I just have to message or video call my previous friends that I trust.\n\n&#x200B;\n\nI know that this will probably follow me through my adulthood due to the fact that I never really felt loved, so I daydream every night about finding someone who would accept me for who I am, understand me, help me grow and mature as a person. But then I realized, I have myself, I know that I am an amazing and a lovable person who deserves to be loved. People have told me I am soft hearted, open minded, a great listener, never invalidates, intelligent, and not a judgmental person. I confirmed what they said because I finally know my mindset after allowing time for myself.\n\n&#x200B;\n\n**This is how I learnt how to love and know myself:**\n\n&#x200B;\n\n**I identified the positive things about me in which I truly believe in, regardless of what some people say**\n\n&#x200B;\n\nI am soft hearted and kind because of my ambitions on becoming a psychotherapist, helping people heal themselves, save people. I know I cant save every person, help the world, but saving one would mean the world to them.\n\n&#x200B;\n\nI know I am a great listener and open minded, because I would often listen with an open mind and an open heart. I don't invalidate because I believe that the person that can know you the most is yourself, you shouldn't just brush it off, tell that there are many other problems. I empathize.\n\n&#x200B;\n\nI know I am not judgmental because I have this mindset where I view people like a spectrum between bad and good. I believe everyone has flaws and it is up to us if we are going to accept them or not depending on the severity of their traits. I know that every behavior has a reason so I should be open and know from their perspective. Sometimes people deserve to be forgiven, but I usually don't talk to them afterwards but remove grudges.\n\n&#x200B;\n\n2nd:\n\n&#x200B;\n\n**I identified the negative traits about me and determined if I should improve it or accept it.**\n\n&#x200B;\n\nI know I am a person who can take a lot of personal stuff from people, very giving, too kind and naïve. But now I know that I have attracted a lot of toxic people. I focused more on myself and decided to cut them all out and keep the ones who I feel like I can trust and are decent and genuinely wants me to be happy and okay. I learnt that its better to have a few close friends than to have a lot of friends. Started realizing when I was in 8th grade. **(Improvement)**\n\n&#x200B;\n\nAnother thing, I daydream a lot, I can sometimes be very unaware of my surroundings which annoys some people but I accept that, it gives me insights about life, makes me know more things deeply, gives me encouragement and hope. **(Acceptance)**\n\n&#x200B;\n\nThat's all, I know for a fact this will follow me from adulthood, but it would be my responsibility to heal myself, I know that I have myself, me and my friends may someday stop reconnecting but I know that I have and I love myself. Someday I hope to find the one who will love me, help me for more improvement. IDK if I would forgive my parents because I realized that parents are not perfect in raising a child. I just have to focus on endurance, acceptance, and maturity for 2 more years. I know who I am, my values, and my dreams, personality and I am not gonna change them for other people because I prefer to show people the best and authentic version of myself.", "url": "https://www.reddit.com/r/happy/comments/p8t6j5/how_i_learnt_how_to_love_myself_at_the_age_of_15/", "title": "How I learnt how to love myself at the age of 15. I am not the problem, I am strong and constantly growing as a person.", "social_network": "reddit", "user": "Dulapeep321", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 20, "down_vote": 0, "creation": 1629558810, "permalink": "/r/happy/comments/p8t6j5/how_i_learnt_how_to_love_myself_at_the_age_of_15/", "nsfw": false, "first_save": 1635442898.5777032, "replies_charged": false}