{"id": "t5_2qh5i_t3_majvsx", "request": ["e660e09a-842d-44ca-8826-ddfa61319574", "1d9bc0bf-4a1c-437e-94e7-5a07c99811fe", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "I’m awake in bed, listening to him snore on FaceTime and I genuinely cannot begin to describe the love I feel for him. I have always been such a light sleeper, I remember when he first slept over I probably got 10 mins of sleep and now I can’t sleep until I hear him snoring. 3 years later and it’s like the first week of us dating. The good, the bad, the really bad; it’s all so worth it.\nI wish I could tell my 16 year old self that I got a fairytale, that hours I spent infront of the mirror picking away at my imperfections would be the same imperfections that he taught me to love. I wish I could tell the 18 year old me in an abusive relationship that this is what love is like. That regardless of the fight, he values our relationship above anything, that he values me, treats me in a way that makes my world a little brighter. Loving myself isn’t easy but loving him is, and with loving him comes being easier on myself. I don’t need him to be happy, but being with him makes me happier. I used to be so angry at the world but then the world gave me him. \n\nThis is soft, and I should probably tell him this but Reddit will do for now. I hope everyone gets to feel this way about their person, even if people write it off as infatuation or puppy love, it’s what makes life exciting, and everyone deserves that. \n\nI didn’t think I was going to live this long, but everyday I’m happy that I chose to live", "url": "https://www.reddit.com/r/happy/comments/majvsx/to_my_younger_self_you_got_your_prince_charming/", "title": "To my younger self, you got your Prince Charming!!", "social_network": "reddit", "user": "supertomatoo", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1616407420, "permalink": "/r/happy/comments/majvsx/to_my_younger_self_you_got_your_prince_charming/", "nsfw": false, "first_save": 1635439373.6776354, "replies_charged": false}