{"id": "t5_2qh5i_t3_5jospi", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "Tonight, as we were finishing up some last minute running around to Wal Mart before going home to do crafts for Christmas, my son (7) saw a young man with a sign that said \"Homeless, Hungry, Fallen on hard times.  Anything helps.\"  He said to me \"Mom, he looks cold.  Can we help him?\"\n\nNow, I like to think I am a giving person.  I do what I can, here and there.  However, it's just my son & I, and we don't have much at all.  But, I always try to teach him that we are fortunate enough to have what we need, so when the opportunity rises, we should help.  And I think he's absorbed this lesson- his Christmas list this year to Santa was \"extra toys to donate to other kids this year\" for goodness sake.  \n\nHowever, I won't deny that my immediate thought was that this beggar was a drug addict or violent or a murderer or any number of ASSUMPTIVE things. But, in this moment, I had an opportunity to teach.  So with a hearty fuck yeah, we marched to McDonald's and picked up a 10pc nugget meal with the biggest hot chocolate we could carry.  And we marched right back outside and my son handed over the food and the $10 bill he had in his pocket (to buy craft stuff to make gifts tonight). \n\nThis guy... he couldn't have been older than 25.  He is someone's son...  and he was so lovely.  He thanked us profusely and conversed with my son for a few, wished us a merry Christmas and gave us each a hug.  And with that, we walked away.  I was in tears walking back to my car, and while I was loading my son into the car the homeless kid came up to us again with more thanks, happily eating his nuggets.\n\nIt blows me away that my little boy's first thought was just kindness.  No extremism, no need for validation, nothing.  He just saw someone who looked cold, and decided that his allowance was worth more than what he wanted. \n\nI'm still in shock, I've been humbled, and I just needed to share this tiny moment of joy I got to experience tonight.  We may not have all we want, but I have never felt so full.  Merry Christmas yall!", "url": "https://www.reddit.com/r/happy/comments/5jospi/my_son_is_7_and_taught_me_more_compassion_than/", "title": "My son is 7 and taught me more compassion than I've known in 27 years tonight. Proud mama moment right here!", "social_network": "reddit", "user": "arihkerra", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 42, "down_vote": 0, "creation": 1482383347, "permalink": "/r/happy/comments/5jospi/my_son_is_7_and_taught_me_more_compassion_than/", "nsfw": false, "first_save": 1635440877.7193904, "replies_charged": false}