{"id": "t5_2qh5i_t3_bzu5ro", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "When I was 14 years old, first month of high school, a class mate of mine shot me a text stating he had a crush on me. This was a surprise, because up until a week ago, this classmate was NOT fond of me (found out recently that the reason they didn’t like me was because they “always want to be the smartest kid in the room”, and their ego didn’t like that I was a good student too, lol). We “dated” for a month afterwards, and I broke up with him after a month because he was so shy, he wouldn’t even hold my hand. \n\nWe stayed closed friends. He dated others, I dated others. Fast forward to junior year: I’m dating a mutual friend of ours who is extremely toxic, manipulative, and abusive. My self esteem and quality of life are at an all time low. I was young and naive and didn’t realize my current partner was abusive; that’s just how men show love. (Super traumatic childhood and upbringing, I had a warped perception of love). My friend confesses he’s never lost feelings for me, that he just wanted to grow into a person that would make me happy; no pressure, if I didn’t want to be with him, that would be fine. He told me that love wasn’t what I was getting from my current boyfriend though, and that I deserved better. \n\nSome time passes, and I break up with my abusive partner and give them another chance. And he treats me SO good, unbelievably good. Never raises his voice or hits me. He is kind and gentle and patient. \n\nAnd I become so scared; when does the other shoe drop? I begin to self sabotage our relationship, making up mountains of molehills (it’s common for folks who have abusive pasts to always be on guard; if no one in your life has been kind to you before, then what does this guy gain by being kind to me now? What’s the motive?) \n\nQueue abusive ex. Threatens to kill himself if I don’t do as he wants, uses his own history of abuse to justify his abuse to me. I’m 16, and still so naive, and I fold. I immediately come clean and tell my partner. \n\nWe break up. I give him space. Few months go by. He tells me that he still loves me, and wants to try again. We stay together for the remainder of high school. \n\nWe decide to go to two different universities far from one another. Long distance doesn’t work, and we agree to split up again. Four years pass; I date different people, he goes on a few dates. We see each other every break we go home. He is just as kind as always, and I assume that he’s moved on, which kills me, because I miss him. We graduate with our degrees, and I’m looking towards my masters, completely focused on my career, getting out from under my abusers. \n\nHe asks me to meet him for coffee, which is very normal, as I said, we make a point of always seeing one another. He is nervous and it all just comes spilling out; he says he’s always loved me, from when we were 14 and so stupid. That when he yearns for someone to fall asleep next to, it’s always me he wants. That when he is asleep and dreams of his future family, he always sees me as the mother of his children, and when he day dreams of growing old, it’s next to me. He couldn’t find a partner during college because every woman wasn’t the one. \n\nI’m ecstatic, but if my life has taught me anything, it’s that you can’t rely on anyone, and the way others treat you can be fickle. I tell him that although I’m glad, I have my career to focus on. \n\nHe says all he wants is me, it always has been, and he offers to move to the city I’m studying in, put his career on hold so I can pursue my masters, that he’s sorry he’s waited so long to tell me. \n\nI used to think happy endings didn’t happen to people like me. Too bruised, too battered, maybe even to broken to deserve happiness. From birth till 18 years, my life was endless tragedy. People “like me” were too rough around the edges, too damaged beyond repair. \n\nI’ve been going to therapy to unlearn my trauma and harmful coping skills. I’ve surrounded myself with loving, kind, supportive people, who don’t use me to an end. I’ve forged strong bonds with my family. I’ve put myself through school, I worked 3 jobs for four years, I don’t have ANY DEBT for my bachelors degree, not a single PENNY to anyone. I’m about to buy my first car, all with my OWN savings and no one else’s help. I have a job and an internship already lined up to put me through my masters. \n\nAnd that little 14 year old boy, who was so shy he wouldn’t hold my hand? He’s a fine young man who I’m happy to call my partner, and we are moving into our first apartment together next month. Whenever we see children while we are out and about, he points them out and how excited he is to be a father someday, how he can’t wait to marry me in the church by his grandmother’s house, how we won’t ever make my birth mother’s mistakes.\n\nLife has been a struggle for me, to say the least. But for the first time, I can breathe. I’m free from my past, and I have a future that looks like more than pain, poverty, and homelessness. I can’t wait to wake up each day! From the time I was five, I can remember my birth mom telling me to use my looks and sex to manipulate those around me to bend to my will, that love wasn’t real, and only a good, rich, white man’s wife was all I’d amount to. \n\nI can’t wait for my future with him, I can’t wait for my career to take off. I’m so glad I’m still alive, and I can finally breathe. For the first time, I’m more than “fine”. I’m GREAT, and I can breathe. \n\nHave a good day everyone! 💛\n\nTLDR: after nearly 10 years of hardship, we are moving in together, and life’s good. High school sweethearts settling down and looking forward to a future together.", "url": "https://www.reddit.com/r/happy/comments/bzu5ro/nearly_a_decade_long_love_story_turns_out_a_happy/", "title": "Nearly a decade long love story turns out a happy ending 🥰 high school sweethearts together again! TLDR at bottom", "social_network": "reddit", "user": "Filipinut", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 17, "down_vote": 0, "creation": 1560360973, "permalink": "/r/happy/comments/bzu5ro/nearly_a_decade_long_love_story_turns_out_a_happy/", "nsfw": false, "first_save": 1635442863.9469707, "replies_charged": false}