{"id": "t5_2qh5i_t3_a6vlby", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb", "23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "Last year was a bad year for me, my depression kicked in big style to the point I had planned my suicide and even what I was gonna say in my “Note”. I’m a straight A student at uni with plenty money and a loving mother and dog however I had to take medical leave from uni and despite all the good in my life, I came very close to throwing it all away, the only reason I didn’t do it was because I felt “my punishment wasn’t done” and I didn’t want to pass my misery onto my mum and my doggy.\n\nFast forward 12 months, I have finally been diagnosed as autistic at 27 years of age, I am back kicking ass with my uni grades and realising just how little money helped me, I am using it to help others. (I was never greedy but I now truly appreciate happiness over wealth) I spent £1500 remodelling my mums house to make her happy, I have lavished my dog with presents and love (and a massssive teddy bear I bought him for Christmas shhh!). I also named a star after the amazing doctor who helped me, the message included was: “A shining star on an otherwise dark night, with more people in the world like her, there would be more people.” \n\nI have donated a PS4, tv and table so far to people who need it and now frequently use my money to be more charitable.\n\nI realised the reason I felt so bad, was all the evil in the world, so why not balance it out with light? So long as I’m here, I’m going to do my best to make myself and others happy and appreciate how incredibly fortunate I truly am. Today, I am happy and looking forward to Christmas and I wish all of you a happy holidays and an amazing new year when it comes, thanks so much for listening to me rant and rave :P", "url": "https://www.reddit.com/r/happy/comments/a6vlby/after_a_dark_12_months_my_mental_health_is/", "title": "After a dark 12 months, my mental health is improving and I am happy and looking forward to Christmas!", "social_network": "reddit", "user": "ThatScottishGuy91", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1545013842, "permalink": "/r/happy/comments/a6vlby/after_a_dark_12_months_my_mental_health_is/", "nsfw": false, "first_save": 1635438948.233702, "replies_charged": false}