{"id": "t5_2qh5i_t3_97oe58", "request": ["4161666b-4b17-4c22-bb40-42efca26f347"], "text": "Soooo..  i have been working in infrastructure consulting for 3 years now, and  frankly... i kind of hate it and I am not happy. Its time consuming, dreading, and most of  the time you are just being asked to do THIS and THAT by your clients  (anytime of the day) and it is getting tiring.. My last day is  tomorrow!! cant F-IN wait!\n\nI dont have a  job lined up after this, which is scary, BUT I am planning on doing  something different and want to get you ladies and gents input on it.\n\nI  started a Youtube Channel a month ago, since I love making videos and I  want to challenge my self during my UN-employed time off. Everyday for 7  days straight, i want to do something that makes me step outside of my  comfort zone and document it all.\n\nI was thinking the following 7 things.\n\n1. Sneak onto hotel pool rooftops\n2. Tell a joke to a crowd of people in a public space\n3. Sing in a gospel (I dont sing at all..)\n4. Convince strangers to take selfies with other strangers and have them post it on their Instagram\n5. Live  like a Victorian for 24 hours (no phone or transportation)  only my  camera, ID and 5 bucks. Get from downtown to home (which is 20 km AKA 12  miles)\n6. Give a homeless man a new outfit, bring him shopping.\n7. \\*any ideas? i want to do something in public.\\*\n\nLet me know what you guys think about this. Any suggestions? Any ideas? Anything you would change? \n\nI  have been working 9-5 for the last 3 years and feel like I haven't  accomplished/fulfilled anything on a personal level! I am hopping this  will help with that :)\n\nCheers,", "url": "https://www.reddit.com/r/happy/comments/97oe58/quitting_my_job_of_3_years_with_no_job_lined_up/", "title": "QUITTING MY JOB of 3 YEARS with no job lined up afterwards!! And doing something a little odd...", "social_network": "reddit", "user": "coolcat242424", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1534386106, "permalink": "/r/happy/comments/97oe58/quitting_my_job_of_3_years_with_no_job_lined_up/", "nsfw": false, "first_save": 1635440979.317329, "replies_charged": false}