{"id": "t5_2qh5i_t3_970gdf", "request": ["608fc108-cf44-476e-8378-c59ee7483909"], "text": "Not too awful long ago, I was riding my motorcycle home from work and sitting at a red light, per usual commute. Light turns green, I'm two cars behind the lead car, we start moving and out of no where the lead car gets absolutely smashed on the driver/front side by a pickup truck running the red light at the intersection.  Of course there's a few seconds of everyone mentally going \"Oh shit!\" in their heads, but then everyone just keeps driving like nothing happened.  This lady was just smashed by a pickup, spun around a few times (not flipped) in the road, and is now sitting against the curb facing the opposite direction of oncoming traffic.\n\nI figured it was a no brainer so I rode my motor cycle around the cars I could, through oncoming traffic waving at them to stop so they don't hit me while i'm crossing, and I park in front of this woman's car.  I look into her front window which is cracked pretty badly and give a wave like, \"hey are you okay? yadda yadda\" - to which of course she is nearly frozen in place and barely shakes her head side to side saying no, no no.  I immediately shut off the bike, toss my work backpack and helmet down, get to her driver side window, I see a lot of blood around her left arm and she still hasn't moved an inch.  Drivers window is of course shattered and the door barely can be opened. As soon as she spoke to me her first words were, \"**I'm 33 weeks pregnant...is my baby going to be okay?**\"  Holy shit was I not prepared for that.\n\nI took my shirt off as soon as I could and wrapped her arm to stop the bleeding. No it wasn't the ideal situation but nothing else around was gonna stop it and it's all I had. I got her arm wrapped and by that time another young lady had came to help me out. We got our driver out of the car and she was now sitting on the curb. We checked around for any more spots with blood or where she looked to be hurt and thankfully, nothing.\n\nI rummaged around her car for a few looking for her glasses and cell phone. The other young lady helping me was now holding our drivers arm in place in case it was broken but also keeping the pressure of my shirt on her arm to slow the bleeding.\n\nWe've racked up multiple bystanders now and the cops have been called. Lots of talking with our driver to keep her calm. Lots of reassurance (as best we could) about her baby being okay and she didn't look injured anywhere but her arm. Thank WHOEVER you want that the airbag did not deploy into her belly because that would have been horrendous for her unborn child I'm sure. Anyways... Cops and medical show up. She's got some lacerations on her arm. I brief them on what I knew about her and the accident. File my witness statement. Converse with the cops a bit. Then, make my way back home.\n\n*Now to the why I'm so happy part and why I wanted to share the story.....*About a week after the accident, the husband used my info from the police report to contact me on Facebook. He sent me a great message about how thankful they were that I could help and how I helped. He informed me the baby was fine (doc visit and ultrasound) and that his wife was now just a little sore and had some stitches but she's also doing great. They purchased a nice new car with the insurance. All seems to be going well for them now. I exchanged a few friendly messages about whatever, explained how it was no problem and how I've had training for my job in first aid, CPR, and blood stuff'z (*that's what i'll call it anyways*) - to which I was happy use in helping his wife.\n\n*...........more time passes and I had basically moved on from the short term memory of the accident because I'd had no more contact with the family..............*\n\nJust yesterday when I returned home from a vacation (which I was already on cloud 9 because it was a cruise!) I opened my mail to find a Thank You card written from the wife. She got the address from police report just like husband. She wrote me a wonderful little note about how happy she was to have me there to help her with the shirt I took off my back and calming her down and reassuring her it would all be okay. She also included a gift card to Golf Galaxy which is awesome because my FBook is littered with golf stuff so they knew I'd appreciate it. I also received a picture of THEIR NEW BABY! That was just born last Thursday I believe.\n\nIt really was no trouble for me to help her, it was reaction. I didn't realize what an impact this would have on them and I am very thankful they're so appreciative of the help. I also didn't realize that a picture of someone elses baby would make me so happy haha. I am not sharing the picture b/c well, it's their child and he was just born and I haven't asked permission.\n\nTL;DR - Was riding motorcycle home. Witnessed a car accident. Pulled over to help. Lady driving said she was pregnant. HOLY SHIT! I use my shirt to wrap her arm and stop bleeding. Help her out the vehicle. Calm as much as we can till medical arrives. File police report. Go on my way. Time passes. Family follows up on FBook saying thanks. More time passes. Family sends thank you card with gift card for golf stuff and I see a picture of their baby just born! So glad I could help and that the help is continually appreciated by the family! Happy times!\n\nEDIT: typo, prolly more somewhere", "url": "https://www.reddit.com/r/happy/comments/970gdf/i_want_to_share_my_little_story_with_people_and/", "title": "I want to share my little story with people and hoped you could share in my moment of joy!", "social_network": "reddit", "user": "AlternateFire1", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1534182408, "permalink": "/r/happy/comments/970gdf/i_want_to_share_my_little_story_with_people_and/", "nsfw": false, "first_save": 1635441484.555447, "replies_charged": false}