{"id": "t5_2qh5i_t3_yldfx", "request": ["44cd61d3-f01a-4909-b162-9daae7dd79b2", "cfcd3c1b-8d85-4f01-a313-b0943d8c4f22", "4d117a53-9372-4484-a20e-20dce96e63e4"], "text": "I've been reading [Notes from a Small Island](http://www.amazon.com/Notes-Small-Island-Bill-Bryson/dp/0380727501/ref=sr_1_1?ie=UTF8&qid=1345574427&sr=8-1&keywords=notes+from+a+small+island) by Bill Bryson and thought this excerpt would be fitting for /r/happy. \n\n\n\n\"They way I see it, there are three reasons never to be unhappy.\n\nFirst, you were born. This in itself is a remarkable achievement. Did you know that each time your father ejaculated (and frankly he did it quite a lot) he produced roughly 25 million spermatozoa--enough to repopulate Britain every two days or so? For you to have been born, not only did you have to be among the few batches of sperm that even had a theoretical chance of prospering--in itself quite a long shot--but you then had to win a race against 24,999,999 or so other wriggling contenders... Being born was easily the most remarkable achievement of your whole life. And think: you could just as easily have been a flatworm.\n\nSecond, you are alive. For the tiniest moment in the span of eternity you have the miraculous privilege to exist. For endless eons you did not. Soon you will cease to be once more. That you are able to sit here right now in this one never-to-be-repeated moment, reading this book, eating bonbons, dreaming about hot sex with that scrumptious person from accounts, speculatively sniffing your armpits, doing whatever you are doing--just existing--is really, wondrous beyond belief. \n\nThird, you have plenty to eat, you live in a time of peace, and 'Tie a Yellow Ribbon Round the Old Oak Tree' will never be number one again. \n\nIf you bear these things in mind, you will never truly be unhappy--though in fairness I must point out that if you find yourself alone in Weston-super-Mare on a rainy Tuesday evening, you may come close.\"", "url": "https://www.reddit.com/r/happy/comments/yldfx/three_reasons_never_to_be_unhappy/", "title": "Three reasons never to be unhappy", "social_network": "reddit", "user": "anomoly", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 143, "down_vote": 0, "creation": 1345574654, "permalink": "/r/happy/comments/yldfx/three_reasons_never_to_be_unhappy/", "nsfw": false, "first_save": 1635442440.0500154, "replies_charged": false}