{"id": "t5_2qh5i_t3_itfv2w", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "my boyfriend of 2.5 years and I have been through some shit. through learning about him I've come to see that his friends are his family and his family is the most important thing in the world to him beyond all measures. we are in a ldr at the moment and I just got home after spending two weeks with him and we mega chilled. ate like shit got drunk a lot and played a lot of video games and I even got to hang out with his mom and sisters for a bit too. it was wonderful with lazy mornings and calm late nights. we really just hung out. and talked and joked. without pressure without worrying about our future. it was like visiting a friend. when I got there I gave him a letter and he didnt read it until today during his lunch break and I cant remember what I put in it but I remember crying while writing it. anyways he sent me a voice message and he said I was his best friend. he has said it before, but I felt it this time. it makes my heart swell every time. his friends that he grew up with are such a huge part of his soul and I just feel so so honored to be included in that. with the ldr, some parts of our relationship have grown while others haven't and these past two weeks I feel like a fucking sim that became best friends with another sim. that bond is there now and it's the coolest shit. I wouldn't trade it for anything. I know I want this life with him. I feel so full and whole and happy knowing he's by my side. my best fucking friend.", "url": "https://www.reddit.com/r/happy/comments/itfv2w/my_boyfriend_called_me_his_best_friend_and_it/", "title": "my boyfriend called me his best friend and it means the world to me", "social_network": "reddit", "user": "HorrorificScallion", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1600198414, "permalink": "/r/happy/comments/itfv2w/my_boyfriend_called_me_his_best_friend_and_it/", "nsfw": false, "first_save": 1635439332.9255245, "replies_charged": false}