{"id": "t5_2qh5i_t3_7f9fha", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "I met my partner in April of 2016, he had been diagnosed with Multiple Sclerosis two years earlier and I knew what I was getting into. In May of 2016 he got the call that he would be receiving a new treatment called Lemtrada in June, I remember he was frustrated because it seemed so far away. He got his first infusions and other than a bit of fatigue he didn't experience many side effects, his team attributed this to him being one of the youngest male patients to be given the treatment. \n\nThe treatment essentially smashes the lymphocytes that are attacking his myelin sheath, it's not a cure, it's a disease modifying drug and at current time the best hope is that his body will regrow new lymphocytes that won't attack his myelin.\n\n\nOver the next year we made some big steps, bought our first car, moved in together, he even started working part time at his brother in laws start up, when it came time for his next infusion we had to delay them because he had some issues with his teeth, he had been in an accident a while back and his root canals were becoming infected. July of 2017 he got his second round of infusions and other than a rash that went away after 2 benadryl he had no side effects! \n\nNow here we are, November of 2017, he had an MRI earlier in the month and on Wednesday we went to his neurologist to get the results of it, he was very nervous as he felt like he may be relapsing. His neurologist comes in with a big smile on her face, he has no new lesions! Ok so we're happy, then she tells us that the lesions he has haven't grown in size and are starting to heal!!!!!! Such freaking good news! \n\nShe asked if over the past year and a half he had taken any sort of medication, other than his prescribed medical cannabis, and with the exception of 2 benadryl he hadn't.  She had looked through his records with his nurse before the appointment and wanted to confirm that. She then told him that she believes the cannabis helped him through the side effects of Lemtrada and she wants to start prescribing it to her other patients who will be getting Lemtrada!! She also is considering doing a case study on him for other neurologists because of his success!\n\n\nI know that was quite the read, but I'm so happy and excited that my wonderful partner is getting better and I've already bragged to all my friends and family so now I want to tell the whole interweb!\n\n\nTl;Dr: Life is so amazing and science is so amazing and cannabis is so amazing!!!!!", "url": "https://www.reddit.com/r/happy/comments/7f9fha/im_so_happy_i_need_to_share_it_with_everyone/", "title": "I'm so happy I need to share it with Everyone!", "social_network": "reddit", "user": "Justkneesocks", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 22, "down_vote": 0, "creation": 1511549097, "permalink": "/r/happy/comments/7f9fha/im_so_happy_i_need_to_share_it_with_everyone/", "nsfw": false, "first_save": 1635440712.4435146, "replies_charged": false}