{"id": "t5_2qh5i_t3_13wpzy", "request": ["8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "I usually spend my time inside. Whether it's gaming, redditing, or even smoking trees, I don't get out much. But today, I had a great day.\n\nMy friend came over and let himself in. He was looking for a yard sale around where I live, but couldn't find it so he came to my place. After a walk to the place, he inspired me to go on a bike ride. I'd been meaning to go on a bike ride for months.\n\nI rode on this trail, and ended up at a bench and stopped to sit for a while. An elderly man came by and we talked for a good fifteen minutes about our lives. He was a very sweet old man who lived in the same town all my life.\n\nI decided to ride around a little more, exploring the back trails around where I live. On my way back, I ran into my anthropology professor out with his kids and his dog, and we talked for a little bit about class. It was a really cool feeling, for some reason, to talk to him outside of class.\n\nBut the moral of my story is that if you take time to do something out of your ordinary routine, something unexpected WILL happen! My spirits were lifted after being under all the weight of studying. I really encourage you to plan on doing something unplanned tomorrow. Or even today!\n\n**TL;DR** Today I spontaneously went for a bike ride and had pleasant talks with an elderly man and my anthropology teacher, and I want YOU to go out there and do something expected to get the best out of your day :)", "url": "https://www.reddit.com/r/happy/comments/13wpzy/go_outside_do_something_unexpected_it_will_be/", "title": "Go outside. Do something unexpected. It will be worth it, I promise.", "social_network": "reddit", "user": "yeah_same", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1354067239, "permalink": "/r/happy/comments/13wpzy/go_outside_do_something_unexpected_it_will_be/", "nsfw": false, "first_save": 1635442188.592903, "replies_charged": false}