{"id": "t5_2qh5i_t3_bc8j1l", "request": ["3fa9d278-6200-4503-908d-5c456f8aa87c"], "text": "There’s a TLDR down below 😂\n\n\nSome preface, I’ve been working my upper body out on and off  for the past few months, also began growing out a beard and mustache combo that I’m kinda proud of, and I recently got a hair cut. Well today, My S.O and I met up with some old peeps from a group we always hang out with, but a few new faces came along! Anyway, one of the new faces today saw me and said “Hey you kind of look like....oh what’s his name...” (and to me I was thinking Seth Rogan, Jonah Hill, etc.) and she goes “OH..That Hemsworth guy, Thor!” And I was awestruck that someone would compare me to such an in shape and attractive man when I viewed myself as NOT that. And I was gleaming with newfound confidence already, but then someone else we already knew in the group said to the new girl “He got a new haircut, he changed from Gerard Butler to Chris Hemsworth!” And I grinned from ear to ear. I’ve never felt more self confidence. This happened a few hours ago but I’m still gleaming. Sorry for the length. \n\n\nTL;DR - Always viewed myself as ugly. Had someone compare me to Chris Hemsworth, and another compare me to Gerard Butler, 2 of my favorite actors. Now I’m beaming with self confidence.\n\nAlso, yes my S.O is fine with this interaction. We have a good level of comfort and trust and she’s just overall super happy to see me so confident!", "url": "https://www.reddit.com/r/happy/comments/bc8j1l/always_dealt_with_selfimage_and_confidence_issues/", "title": "Always dealt with self-image and confidence issues to a maximum, but today I was told I look like 2 of my favorite actors (Gerard Butler and Chris Hemsworth), and I’m riding a confidence high!", "social_network": "reddit", "user": "superflyguy87", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1555036525, "permalink": "/r/happy/comments/bc8j1l/always_dealt_with_selfimage_and_confidence_issues/", "nsfw": false, "first_save": 1635438992.3549132, "replies_charged": false}