{"id": "t5_2qh5i_t3_4unjpa", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "So I'm the type of person who has to be working or doing something productive to feel like I have some self-worth. I had to quit my job of 5 years as an office manager to stay at home when I had my son. The commute was a two hours a day, and my husband made far more than me, daycare is expensive, so we did what we must. I stayed home to take care of the cub, and although I enjoyed our special time together, I felt super worthless because I wasn't contributing financially. I'm kinda artsy, so I made clothes, learned how to oil paint and embroider, did some eBay and Etsy stuff, built websites for a couple small businesses, and helped my old employer maintain their website and do what I could for them remotely, but I never earned much except some extra spending money here and there. I would take on a new hobby that would make me happy for about a month (oil painting was my favorite) but I would lose inspiration, get frustrated, and sink back into the dumps.\n\nA couple weeks ago, my grandpa-in-law and husband had a talk and decided to hire me into the family business. At first I was just going to come in a few times a week, bring the kids, and do some bookkeeping stuff, but since the first couple days went so well (gpa LOVES having the kids around) they decided to train me in all the skills my husband knows.\n\nThey have kind of an usual business: they build high-end pool cues, and there's a lot of art, physics, math, and machinist work involved. So far I've learned how to run a few procedures on the lathe, the mill (creates inlays out of gold, silver, and other precious materials, as well as the pockets in which they are carefully inserted), getting familiar with CAD/CAM, and I found out I have enough manual dexterity to install the tiny inlays, too.\n\nI'm having so much fun! I'm so glad I found something new I'm good at, I can work with my husband and family around in a really cool shop... it's just awesome! It's only been a couple weeks but I'm over the moon with how perfect it is. Thanks for reading!\n\nTl;dr- Miserable as a stay a home mom until I got invited to join the family business and now I'm learning all these awesome new skills, surprising myself with skills I didn't know I already had, and making beautifully inlaid cues with my husband and his grandfather. It's going wonderfully and I couldn't be happier!", "url": "https://www.reddit.com/r/happy/comments/4unjpa/after_being_a_stay_at_home_mom_for_the_past_three/", "title": "After being a stay at home mom for the past three years (and battling depression the whole time) I started working for the family business and it's been amazing!", "social_network": "reddit", "user": "CrabappleMcNasty", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 115, "down_vote": 0, "creation": 1469520155, "permalink": "/r/happy/comments/4unjpa/after_being_a_stay_at_home_mom_for_the_past_three/", "nsfw": false, "first_save": 1635440713.8762803, "replies_charged": false}