{"id": "t5_2qh5i_t3_1ane5o", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e", "371c25be-a874-48a1-8b64-b892630c8aeb"], "text": "Hey guys, wanted to write this somewhere cause i'm stoked right now. I've had a weird life, depression, moved around a lot, kinda suicidal for a little bit, and done my fair share of fucked up things that make fantastic stories but really sucked in the moment. When I started highschool, I imagined who I wish I was, and now I am that person. I started with no friends, and at the bottom of the social food chain. I started two sports, and accomplished everything I wanted out of that (TWO SCHOOL FIRST EVER CHAMPIONSHIPS!) as a star player. My grades and schedule have always been hard as fuck, but I made it. I balanced all of my time, and slowly built up my confidence. I was a skinny little white boy, now I have a model body (and I'm damn proud of it). Each and every year, I advanced up the \"social ladder\". Not in an artificial way by trying too hard, I just became more outgoing, more social, more likable, and have many more really good friends than when I started out. I used to hate my parents, but they're alright now and we're on good terms. Weed is awesome. Beer is awesome. Cigarettes are bad for you. E-cigs are awesome. I can actually talk (and more of course) to girls now. I'm no longer a video game addict spending my summers inside wishing I was out doing something. I love my dogs and brothers and sister. I just got accepted today to [REDACTED], which has always been one of my top college choices. I have a good car, and am going to get a job very soon. I don't really know what I'm going to do with the rest of my life, but so far, I'm doing exactly how I wanted. I've imagined today for so long, and after taking a step back to examine my life, I've accomplished everything I've ever tried to do. Thanks for reading, I'm just fucking stoked on life!!!!", "url": "https://www.reddit.com/r/happy/comments/1ane5o/im_18_now_and_exactly_were_i_wanna_be/", "title": "I'm 18 now, and exactly were I wanna be (:", "social_network": "reddit", "user": "thisismyothercompute", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 71, "down_vote": 0, "creation": 1363760458, "permalink": "/r/happy/comments/1ane5o/im_18_now_and_exactly_were_i_wanna_be/", "nsfw": false, "first_save": 1635438836.9911711, "replies_charged": false}