{"id": "t5_2qh5i_t3_k8y7ez", "request": ["1d9bc0bf-4a1c-437e-94e7-5a07c99811fe", "258e332d-215f-495f-8bee-bccd57229f62"], "text": "Aaaahhhh! Where do I even start? Disclaimer : it's a long post!!\n\nI'm from a remote town in India with a dream to pursue my Masters is the US. It wasn't an easy path as my parents wanted me to stay back and take a job that I'd gotten and support the family. Instead I fought with them and took a student loan and assured them that they don't have to spend a single dime towards my education and finally they agreed. (They weren't hesitant about me getting higher education, we are from a caste that is known to do business and they expected me to take over my dad's business which I never saw myself doing for the rest of my life.)\nLife wasn't easy here at all. Though I had an undergrad degree in electronics and communication, my life long desire to become a doctor (could never become a reality because I've been diagnosed with blood injury phobia) made me pursue a degree in bioengineering (I envisioned building a medical device that could save people's lives). It wasn't easy as I had no proper background in biology except for what I learnt in high school. But I never gave up, I kept myself going and soon realized that it's very hard to get a job in bioengineering without a PhD or being a non-US citizen. I switched to doing a minor in a more computational field and ended up taking Machine learning and tried to work as a research assistant in labs at the intersection of ML and healthcare. All my batchmates were graduating and I was still struggling to find an internship. Finally I found one and I had to extend my school by a quarter to do the internship. I got very good exposure and hands on experience during my internship and then back to square one - searching for a FT job. My resume would not even get past the resume screening software that's used by companies because I was applying to a ML job with a Bioengineering major when people in CS couldn't crack it. Finally, got a job as a data scientist in a financial organization. They put me through 11 rounds of rigorous interview hoping I would fail but I nailed all of them and my manager thinks I'm an asset to the team. It took me 9 months to clear off my student loan and I couldn't be proud of myself!!!\n\nAll I want to say is NEVER SAY NEVER!! Keep hustling and your hard work is paid off in one form or the other. :)\n\nTL;DR - Fought with my parents to come pursue masters in bioengineering, realized the job market is really dry, did a minor in machine learning, beat the odds of getting a job with a Bioengineering major and clearing off the student loans within 9 months.", "url": "https://www.reddit.com/r/happy/comments/k8y7ez/im_finally_soooo_happy_to_clear_off_my_student/", "title": "I'm finally soooo happy to clear off my student loan! Such a huge relief!", "social_network": "reddit", "user": "phantasmagoria1996", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1607404808, "permalink": "/r/happy/comments/k8y7ez/im_finally_soooo_happy_to_clear_off_my_student/", "nsfw": false, "first_save": 1635440603.3881576, "replies_charged": false}