{"id": "t5_2qh5i_t3_9zxpg0", "request": ["d9021d56-8bfa-490f-87b8-52154c0b1b05"], "text": "I hope this isn't self-aggrandizing, but I got EMT and CNA certified but never had a job as either. Tonight, I saw a girl unable to hold herself up (outside a bar) and I rushed over to make sure she was ok (she's slumped over). I asked her if she was ok and checked her pulse (slow but strong enough). I yelled out to who I thought was a random passerby and he rushed over trying to pick her up. He was her husband and refused to call 9-1-1. So I yelled out to the bouncer/ticket guy and asked him to call 9-1-1.\n\nMost of the time I had to try to calmly talk to her husband and plead for him to let her sit down (so she could get more blood to her brain) and for her to be checked by paramedics. I'm worried she's going to need her stomach pumped/fluids and what if she aspirates in  her sleep?? I told them they wouldn't need to go to the emergency room, but that I'm EMT certified and that I want a better professional to check her out. \n\nShe was drifting out of consciousness with her eyes barely open/closed/opening. For a long time she wasn't responding to what we were saying. Her husband is yelling at her to wake up and stand up and her friend and her husband are trying to slap her face awake at one point to wake up her. I have to keep telling them what to do and ask them to stop this (let her sit down for God's sake instead of having her hang up limply by her arms and having her shirt pulled up). I talk to 9-1-1 and check her breathing and pulse every minute or so. We had to turn her over to her side or lean her forward so she could vomit several times. \n\nEventually paramedics come and they take her away on a stretcher. Guess what the husband said before they were gone? That he's an EMT... Im so happy that I was able to help and as much as I think the guy cared for her... He would have likely dragged her off to the car (he was trying too for a while) and let her sleep. She's in medical staffs hands now.\n\nThis made me so happy about my future (hopefully as a doctor). I'm so glad that my education has helped me deal so much better in these types of situations.\n\nTLDR: Girl was losing consciousness and I made sure 9-1-1 was called and that I was checking on her pulse and breathing/moving her to let her vomit. Husband wanted to carry her to the car immediately, but paramedics carried her away and got her checked on. ", "url": "https://www.reddit.com/r/happy/comments/9zxpg0/i_think_i_saved_a_life_happy_for_the_future/", "title": "I think I saved a life... Happy for the future", "social_network": "reddit", "user": "otterpop282828", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1543057917, "permalink": "/r/happy/comments/9zxpg0/i_think_i_saved_a_life_happy_for_the_future/", "nsfw": false, "first_save": 1635442651.884591, "replies_charged": false}