{"id": "t5_2qh5i_t3_ac3ciz", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11", "c15214d3-1d77-40d5-ad12-df4ba3bdb7b2"], "text": "My earliest memories are a toss-up between two different things: me lying in my bed watching the rain fall on a tree outside, and my parents yelling and screaming at each other. I'd always assumed that, on some level, that event had permanently damaged me with my parents' fighting matches being my first memories of the world. On top of being bathed in toxicity from my mom and her side of the family as well as my parents continuing to fight well beyond the initial divorce, I'd always assumed that any chance of a relationship for myself was simply gone out the window, a ship that had already sailed that I never even had a ticket for.\n\n&#x200B;\n\nDepression does weird things to you. Perhaps the scariest thing it does, atop a myriad of the obvious, is convince you not that a grey veil is being pulled over eyes but that the rainbow filter is actually being removed. You feel as though you are seeing the world as it truly is for the first time which, for anyone who actually has battled depression and lived in the world despite it, knows is not entirely true. And though a stopped clock is right twice a day, the clock is still stopped, the gears still refuse to turn. And so, as my friends began to start dating and have girlfriends and boyfriends of their own, I just passively accepted the notion that their happiness was not destined for me. In my head, the justification came easy: statistically, there *are* a number of people who simply never date and never enter relationships for one reason or another. In my head, *I* was simply one of those people, taking up a spot in a statistic so someone else wouldn't have to. It was really easy for me to martyr myself in my teens.\n\n&#x200B;\n\nStill, I suppose a part of me never stopped hoping, never stopped dreaming/fantasizing about what might be. As someone who writes as a hobby in his spare time, the fantasizing part came easy. And so I suppose part of me would never resign itself to what the voices in my head said was to be my fate. So when my friends started installing Tinder on their phones, I did as well. And along with the numerous other things I allowed peer pressure to let me do, I allowed one of them to convince me to try a dating site, with all the smug satisfaction he carried with him that it had worked for him. So with trepidation and my eyes rolling almost a full 180 degrees into the back of my head, I gave a few a try.\n\n&#x200B;\n\nI'll skip over a bit here for the sake of privacy and expediting the story but suffice it to say, it did not work immediately. In fact, almost a full year went by with me half-heartedly trying with my friend nagging me about it just enough to keep it in the back of my head. Then one day, it happened. Not as I expected, things never do, but some part of me saw her pictures and profile and said the classic phrase of \"What the hell?\" Then the scary part happened where she messaged back. After some days chatting I asked her out for coffee. And even more terrifyingly, she said yes...\n\n&#x200B;\n\nShe was far prettier in person than in her photos, and for some reason, I find her prettier each time I see her. With her, I got everything I ever dreamed about, just not in the way I dreamed it and just not in the package I ever expected. My depression, though I've done a good job at managing it in recent years, has moved on to telling me that she's completely out of my league and I don't deserve her. When I think about it, with her being the captain of her university's diving team, playing lacrosse, keeping up with her academics and double majors, as well as just being so damn attractive, I'm inclined to think my depression may have a point. Though still, against all odds, somehow she sees something in me. And though I have no idea whether this will even work out or not in the long, long term, on some level, I suppose it doesn't matter. If someone as amazing as her can see something in a mess of a person like me, I guess I don't have too much to worry about. For now, I'll do my level best to not screw it up and enjoy every moment I have with her, including getting destroyed in bowling.\n\n[We both suck at bowling lol](https://preview.redd.it/db95wqs4u5821.jpg?width=1280&format=pjpg&auto=webp&s=2e4da4c440ba5df292ce3aba44934f56409343b4)\n\n&#x200B;\n\nIt's so strange. I'm agnostic so I'm hesitant to say god in this scenario but for lack of a better method, I'll just say it this way:\n\n&#x200B;\n\nI asked the universe for a companion, and it sent me an angel.", "url": "https://www.reddit.com/r/happy/comments/ac3ciz/for_the_longest_time_i_made_some_terrible/", "title": "For the longest time, I made some terrible assumptions about myself and my life. I always assumed that, due to my parents' divorce and the further toxicity from my mom's side of the family leaking into my being, that any kind of relationship was just out of the cards for me. I was blissfully wrong.", "social_network": "reddit", "user": "Adriatic88", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1546500485, "permalink": "/r/happy/comments/ac3ciz/for_the_longest_time_i_made_some_terrible/", "nsfw": false, "first_save": 1635439186.6938157, "replies_charged": false}