{"id": "t5_2qh5i_t3_zxahb", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "Today is a big day for me. I had recently been going through a weird period in my life where I was out of work and sort of depressed about the way things were going in general in my life, wondering if things ever were going to be the way I envisioned when I was younger. I have been working at my super awesome but only decently paying new job, paying off some bills that I have been putting off for a long ass time. I got a bunch of errands done, just general stuff like grocery shopping and got an oil change, put some new tires on my car etc.\n\nIt sounds dumb, but I felt sort of like I was getting stuff done that I was putting off for a long time due to money issues and being a deadbeat in general. My rent is super cheap, 450 all included and I live with the guy who owns the place. But it's a super nice place, deck, backyard, and just a nice clean place in a nice clean part of town. \n\nAnyways, so I only have 450 in bills a month, not counting my student loans and that sort of deal.\nWell today, after taking care of ALL SORTS of bills and errands, I checked my bank account and I have 1400 bucks in there with literally nothing to spend it on. Even on my meager wage.\n\nAnd it was like the first time in forever that I've actually had some money that's mine. And I have another large paycheck coming before I have to pay my next bill, which is just rent at 450... so I'm BUILDING up money!! It's a freaking crazy feeling. Like, months of worrying how I'm going to pay the bills, months of not being able to go out with friends to the bars. Or even stupid shit like not being able to drive my car because I don't want to use gas because I won't be able to fill it again in the near future. It's over!\n\nIt's a really great feeling, even if 1400 bucks is nothing. It's a lot for me, it's security. I can drive my car, I can go get a sandwich, I can pay for a mechanic if my car breaks down, I can buy healthy good food and cook. All these things that I think maybe a lot of people really take for granted, I can do it now. It feels amazing. My life is getting better when I never saw how I was going to do it, and I haven't even really been trying that hard! It sort of snuck up on me.\n\nSo today's the day. Day 1.", "url": "https://www.reddit.com/r/happy/comments/zxahb/today_is_a_great_day_for_me/", "title": "Today is a great day for me.", "social_network": "reddit", "user": "NorthDakota", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 95, "down_vote": 0, "creation": 1347715258, "permalink": "/r/happy/comments/zxahb/today_is_a_great_day_for_me/", "nsfw": false, "first_save": 1635441327.266539, "replies_charged": false}