{"id": "t5_2qh5i_t3_f0km8p", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "Sorry in advance, I've never posted to this sub and this is going to be a little long but I wanted to share this uplifting experience;\n\nTo preface, I work as a building manager dealing with the day to day dealings and issues in a large apartment complex. My job can be very draining, as well as physically and emotionally exhausting. This week was very hard as I had an issue with a resident being very volatile and many of the residents were upset and unfortunately I am the first face they see when that happens so I get a lot of negative words and insults thrown my way. \n\nI came home today and I am on call and one of my tenants names popped up on the after hours phone and I picked up (as you do), ready to get another grievance regarding the disruptive tenant. What I got instead was completely the opposite, I don't usually speak much about my residents however this wonderful person is someone that I feel I need to talk about. This tenant is so so lovely, she is so sweet and in every interaction she tells me how much she loves living here and that she is so happy with how the place has changed for the better since I took over. She asked to extend her lease and told me that I was kind and wonderful. I needed to hear that after this week, she is so full of kindness and support, she works with children with disabilities and her patience and grace comes through in everything she does, she even said how grateful she was that I answered the phone even though it was after hours (I was off about 2 hours ago). She also said that she had lived in a complex when she was in her youth and was happy to see more activities that I had started doing to get to know your neighbors better. She made my whole day.\n\n Her and people like her are the reason that the world has safe places and light in a world that can at times feel unrelenting and bleak. If you are on this subreddit you are a person who contributes to that and I thank you.", "url": "https://www.reddit.com/r/happy/comments/f0km8p/after_a_very_hard_work_week_one_of_my_tenants/", "title": "After a very hard work week, one of my tenants called me and made my week!", "social_network": "reddit", "user": "aniebananie1", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 30, "down_vote": 0, "creation": 1581126093, "permalink": "/r/happy/comments/f0km8p/after_a_very_hard_work_week_one_of_my_tenants/", "nsfw": false, "first_save": 1635438833.2995453, "replies_charged": false}