{"id": "t5_2qh5i_t3_44rxid", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "I'll get right into it. This starts out crappy then gets happy!\n\n\nIt was lunchtime at school and I was really hungry. I wasn't even in any mad rush in the lunch line. I was calmly getting a milk from the cooler when my plate of food slides off my tray and into the cooler, my bowl of salad followed it. I tried to remedy it but in vain. I picked up the tray, plate, and bowl and set it and it's messiness on the cooler and told some freshmen to get out of my way and stormed out of the lunchroom. Being mad and sad at the same time I found my way to the girls bathroom, kicked a trashcan and the stall doors out of anger. I then sat down and started crying.\n\n\nHere comes the happy part. This girl from my English class walks into the bathroom and notices me immediately. She then comes over and sees me crying and asks what's wrong. I tell her about it and how I don't get lunch today now (had nothing all day except a protein bar).\n\n\nShe then starts to tell me stories about stupid things she's done and how quickly they blow over and no one cares (which I know is true). She cheered me up and made me laugh and repeatedly offered to go and buy me something. I said no a few times but she insisted. I said okay and just to get whatever was there. She brought me back fries (my favorite food, mind you).\n\n\nThat simple act of kindness made my day better and I thanked her as much as I thought wouldn't be annoying. Things like this make me believe in other people more.", "url": "https://www.reddit.com/r/happy/comments/44rxid/there_are_still_good_people_in_this_world_even_in/", "title": "There are still good people in this world! Even in high school", "social_network": "reddit", "user": "Symmetry888", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1454952304, "permalink": "/r/happy/comments/44rxid/there_are_still_good_people_in_this_world_even_in/", "nsfw": false, "first_save": 1635440720.5432239, "replies_charged": false}