{"id": "t5_2tand_t3_ojm1dm_t1_h52zkzg", "creation": 1626211165, "origin": "t5_2tand_t3_ojm1dm", "height": 1, "replied_to": "t5_2tand_t3_ojm1dm", "down_vote": 0, "up_vote": 33, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GrotiusandPufendorf", "text": "Yes, this is the best advice, OP. Gradual change is so much easier to maintain than suddenly changing everything at once. Also, don't draw too black and white of lines, because that's going to make things feel 10x harder.\n\nSo instead of saying, \"I will cook at home from now on,\" just put a budget on your eating out. Maybe start by limiting it to once a week you can order something, but you cook at home the rest of the time. That way you can still fulfill the cravings of the foods you like instead of just trying to suffer through them until you break and then feel guilty. If you make giving into cravings part of the plan, there's no guilt and no need to stray from the plan. Then once you feel confident with it, decrease it to once every two weeks. Also, make sure you have convenient at-home options, because sometimes people order out from convenience moreso than the food itself. Personally I hate cooking, so if I go buy a bunch of raw ingredients and say I'm going to cook every meal, I'll absolutely fail. But having things I can put together in 5-10 minutes or things I can meal plan for an entire week removes that obstacle.\n\nInstead of \"no more ice cream,\" it's \"I can have a scoop of ice cream every day, just not the whole pint.\"\n\nSame thing with exercise. Start slow. Saying you'll go to the gym every day if you don't already have that habit built up is a recipe for failure. Saying you'll do a yoga class once a week is way easier to maintain.\n\nI used to be a very non-active and non-athletic person who ate nothing but junk pretty much my entire life. Then in my late 20s I became a full on circus acrobat performer with a very healthy diet. I obviously didn't just jump into that. I started with a weekly yoga class. Then a few months in, I liked the strength and flexibility I was gaining and craved more, so I started taking dance classes. Then a few months after that, a dance friend told me about circus classes and I started those twice a week, then dropped the yoga and upped circus to 3 times a week. As I increased my exercise habits, my tolerance for junk food went down. I couldn't eat fast food on the days I was training because it would make me feel sick in class, so my eating naturally got healthier until I was only eating fast food once a week on my day off from training (and I enjoy it every week with no shame). Now I train 5-6 days a week and am in the best shape of my whole life and can do things I never thought I would be able to do, but it was habits that built up gradually over the course of a year. If I had started off the bat saying I was going to cut out all junk food and start training 5 days a week to be an acrobat, I would have quit 2 weeks in. And if you had told me when I started that once a week yoga class that a year from then I'd be an acrobat, I would have laughed my head off. It was about starting slow and learning what I loved, not about forcing myself to do things as though they were an obligation.", "permalink": "/r/DecidingToBeBetter/comments/ojm1dm/after_my_experience_at_an_amusement_park_i_am/h52zkzg/"}