{"id": "t5_2tand_t3_ojm1dm_t1_h532h3b", "creation": 1626212527, "origin": "t5_2tand_t3_ojm1dm", "height": 1, "replied_to": "t5_2tand_t3_ojm1dm", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "crusafo", "text": "Good for you! \n\nPhysique is 80% kitchen work (food/eating/portion discipline), 20% gym work outs. \n\nSmall changes add up over time. I found that when I cut sugary/fatty foods from my diet that I dropped weight. It does take time for that weight to come off, so your diet needs to be consistent. You may find yourself feeling a bit hungry more than often as your body adjusts to the new intake regimen. But your body will adjust.\n\nA bit of math was useful for me to make this adjustment: \n\n(disclaimer: I'm not a nutritionist or a doctor, consult a health professional for real advice, the following is my anecdotal story)\n\nStart becoming aware of the caloric levels you are consuming. \n\nFor easy example sake, lets say that your baseline caloric needs are 2500 calories per day. To maintain current weight/bodymass levels, just meet your caloric needs. To lose weight cut 500 calories per day, while still consuming healthy sources of calories. If you do this 7 days a week at the end of one week your body will have had to dip into lipid reserves to cover the missing calories. This equates to 3500 calories per week. 3500 calories is approximately equal to 1 pound of fat burned, or 4 lbs of fat-loss per month. You can adjust this caloric deficiency to your comfort/progress levels that you desire. \n\nThis gives you a rough guess on how long you will need to sustain a caloric deficiency to induce fat loss. For me, my goal was to lose 50 lbs of fat (starting weight 235, goal weight 185). My average caloric deficit is 250 - 300 calories per day, so I've averaged about 1.5-2.5 lbs. of fat loss per month for the past 23 months. I'm still not at my target goal weight, but I'm within 15 lbs (currently fluctuating between 190-195 lbs.), and I really didn't do much except cut sugary/fatty foods, and work hard on my calorie intake. I think to truly trim down to my ideal weight will require more effort from me cooking, instead of relying on sandwiches, and other carb-heavy foods for a \"quick fix\" (I'm single, so I rarely cook anything fancy). \n\nBasically, anyone can achieve their fat-loss goals by controlling their caloric intake. You can do this! \n\nRemove as many tempting junk foods from your house as possible. Find a diet that your body responds well to and stick to it. Track your progress. Give yourself a year or two, and you will be a changed person!", "permalink": "/r/DecidingToBeBetter/comments/ojm1dm/after_my_experience_at_an_amusement_park_i_am/h532h3b/"}