{"id": "t5_2tand_t3_oz6u7y_t1_h7y60u7", "creation": 1628265599, "origin": "t5_2tand_t3_oz6u7y", "height": 1, "replied_to": "t5_2tand_t3_oz6u7y", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "cerenatee", "text": "Action doesn't follow motivation. Motivation follows action. The more you do, the more you'll want to do. The less you do, the less you'll want to do. An object in motion wants to stay in motion. An object at rest wants to stay at rest.\n\nAnd expecting to want to get a job is probably expecting too much. Very few people want to work. Work usually sucks. What people want are the rewards that come from work, which is money. Money allows them to do all the other things they like, like have a place to live, buy clothes, do things with friends, pay for their car, put gas in their car, travel, etc. I'm guessing your parents are taking care of most of that and you may not have many friends or interests outside of gaming, so that's probably why you don't want to work. Your needs are satisfied.\n\nAs long as your parents enable you, or you wait around until you feel like doing something, you'll never do anything. You'll waste your 20s and 30s trying to feel like doing something and then spend your 40s and 50s blaming your parents for not pushing you to do something. Or you'll find someone desperate to have a significant other and live off them.\n\nIf you don't want that to be your life, you're going to have to do the things you don't want to do. There's no other way around it. I would start by doing something physical you don't want to do, anything, for 5 minutes, 2 or 3 times a day, for a week. Anything. Go for a walk. Try to do a pushup and stay down there 5 minutes. So jumping jacks for 5 minutes. Anything. The next week make it 3 times a day. The next week, make it 7 or 10 minutes. Gradually, slowly, you'll get out of the nothingness habit you've gotten yourself into. Don't try to do anything big or even significant. That's too much in the beginning, your brain is going to push back, your negative self talk is going to kick in, and it'll lead to failure. Make it small and easy. So easy a 2 year old can do it. That's how you start to undo lifelong habits. Or your parents kick you out and you have no choice but doing it my way is a lot easier. Good luck.", "permalink": "/r/DecidingToBeBetter/comments/oz6u7y/how_to_force_myself_to_do_things/h7y60u7/"}