{"id": "t5_2tand_t3_oz6u7y_t1_h801v22", "creation": 1628296209, "origin": "t5_2tand_t3_oz6u7y", "height": 1, "replied_to": "t5_2tand_t3_oz6u7y", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ghostvinyl143", "text": "Awesome responses.\n\n  I'd like to offer a little push back (or a different perspective on goals.)\n\nFrom my experience, being too specific and to tyrannical on myself set me back.  Of course now I know and understand why. \n\nBut consider that goals that are too specific, can cause one further stress and anxiety. Especially if you are like me, cause then I HAVE TO DO IT 100% AND IT HAS TO BE RIGHT - I've gotten better about this.  One thing that helped me out was actually being vague.  So instead of saying \"I'm going to write 1500 words a day\"  I'll actually set the weekly goal of 7500 a week. Or if I'm just having trouble focusing on that, switch it with another event or goal.\n\nThe self reflection is a tough one for me.  Those questions would reinforce my view of not/never being good or worthy enough.  I actually like your breakdown of how to accomplish goals. I do that for my planning and scheduling, but I also use the breakdown to see um... sorry I have to use positive reinforcement so I'm trying to figure out how to rephrase those self-reflection questions out of the negative of \"what went wrong\" to \"what went right and how can I make it more synergistic\"???\n\nAlways start out small. We have about 16 hours a day minus sleep and lost time. That doesn't mean you have to have a full schedule the first week out. 1-3 things is a great start. Even if you only get one done.  Eventually I found my power and until Covid and getting used and chested on by the first woman I've been in a relationship with since I was 20 set me back. But not only am I getting back where I was, I'm doing it faster and will exceed past it.\n\nEither way I wish I had responses like this 5 years ago when I was homeless and trying to be perfect and self reliant.  You are an amazing human being and I love you.", "permalink": "/r/DecidingToBeBetter/comments/oz6u7y/how_to_force_myself_to_do_things/h801v22/"}