{"id": "t5_2tand_t3_oz6u7y_t1_h7ya28y", "creation": 1628267306, "origin": "t5_2tand_t3_oz6u7y", "height": 1, "replied_to": "t5_2tand_t3_oz6u7y", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ILoveGirls_I", "text": "**Welcome to adulthood.**\n\nThis problem — doing things you don’t want to do — is going to be part of your daily life moving forward. It sounds harsh, but that’s how it is. There will be many days when you don’t feel like getting out of bed and going to school or work. You won’t be in the mood to talk to your manager, but they will want to set up a meeting with you anyway. You won’t feel prepared for an exam but you’ll have to show up and give it your best shot. You won’t want to pay your electricity bill or your rent because there are additional expenses that need to be paid this month, but if you don’t pay rent you’ll get evicted and will not have a place to stay. As a matter of fact, you’ll notice that your emotions, feelings, and moods will keep shifting — and if you let them take over your day, you’ll likely have a hard time dealing with even the smallest tasks that need to get done.\n\nThat said, it’s not the end of the world if we don’t feel like doing something. We don’t feel motivated — or we did yesterday, but today is a different story. There’s still plenty of time to course-correct and change our behavior. **We are the ones in charge of this ship!** We can change the itinerary, we can shift the schedule, we can rearrange the list of what needs to get done, and we can feel more excited about the whole thing….\n\n… but ONLY IF we can figure out why we’re doing what we’re doing.\n\nThe **WHY** here is the most important part of this conversation. It’s really hard to do anything, feel motivated to keep going, if you don’t see the point. The point in this case is a purpose, a plan, a goal. If we don’t have a clear idea of what we’d like to do with our life, it’s impossible to move in a forward direction.\n\nAnd speaking of moving forward, be honest with yourself. Have you thought about any goals that might be important to you? Goals give your life a sense of purpose — you are more in tune with the big picture of your life, not just what is happening to you today. Pursuing any kind of goal — personal or professional — is an excellent way to learn more about yourself. You find out what your top priorities are and how you can solve problems. Goals keep you focused on your personal development and they reflect your values and beliefs. No matter how you look at it, goals say more about who you are becoming as a human being. And that’s why they give us motivation to do things.\n\nIf you are serious about finding motivation, it’s worth it to take some time after school or work to think about a few things. Like this:\n\n👉🏾 Think about what you want your life to be in the long run.\n\n- Do you know where do you want to be 1, 5, or even 10 years from now? Don’t think only geography and economy of your country, but more in terms of personal development and skill level.\n- Who do you want to become in your career? Is it motivating to see yourself as a leader, CFO of a startup, politician, university professor, innovator, scientist, writer?\n- If you can come up with a dream scenario, what is it? Do you wish to live in a specific city, becoming an expert at something, having your own business, teaching others how to improve a skill?\n\n👉🏾 Try to make your goals specific.\n\n- Non-specific goals can be anything of the following. I have to graduate from college, I need a job, I must move out of my parents’ house, I want to get fit, I want a large salary.\n- Specific goals are spelled out. For example, if you’re starting a job search, write down that you want to get a job offer for a [insert job title you want] that pays an annual salary of [insert amount you believe is fairgiven your skills and experience] so that you can develop [insert current skills and new skills you’re working on].\n\n👉🏾 Have a real reason for choosing to go in a certain direction.\n\n- Instead of seeing goal setting as a chore, turn it into a choice. Tell yourself, “I really want to see myself succeed in this area!” The benefit? It gives you a greater sense of control about what you’re doing. That’s much better than feeling like you’re reacting to things or you have an obligation to work towards someone else’s goal (for example, a goal set by parents).\n- Remind yourself of the reason for action with this question: “Why am I choosing this goal?” Make the connection with the initial reasons for working on something to begin with. It can be to learn a new skill, solve a problem that you’ve had for years, pass an exam to graduate from college, start your own business, etc.\n\n👉🏾 Make your goals actionable.\n\n- Select your top 3 personal goals. They can be anything you’ve been obsessing about for years, or something you’ve been considering more seriously in the past year or two.\n- Under each goal, write down 3 things you need to do on a consistent basis. This could be to practice a skill three times a week, set aside an hour a day to focus and do research, or sign up for a class to broaden your knowledge in a field.\n- Create a schedule for the week ahead. Set aside blocks of time to making progress in the areas you've identified. Start small, with a 15–30 minute block of time. You’ll be surprised how much it adds up without you having to give up on other things you need to do during the day.\n\n👉🏾 Hold yourself accountable for your efforts.\n\n- After you’ve followed your plan of action for one week, ask yourself, Did some activities take more time than you anticipated? If so, why?\n- What was easy? Why do you think it wasn’t as difficult as you initially thought?\n- What could you have done better? Where could you have used shortcuts?\n- How can you improve the following week? Can you dedicate a bit more time to one activity to make more progress towards your important goal?\n- How will you measure your success? Can you set milestones to reach each week or deadlines to stay on track? Will you measure your progress in a journal or spreadsheet?", "permalink": "/r/DecidingToBeBetter/comments/oz6u7y/how_to_force_myself_to_do_things/h7ya28y/"}