{"id": "t5_28vigg_t3_gvd7cg", "request": ["610564bc-0916-401a-93cd-8d3e727a24ed", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I have been battling depression for about 3 years now. There have been highs and lows in between, but I haven't really recovered yet.\n\nWhen I sit down and think, I realise that I have grown as a person but that hasn't helped me in becoming happier. In fact, the outcome is quite the opposite. I have lost all hope, find existence pointless and have no one close around me. Being a very emotional and introverted person who likes to talk, it's very difficult with having nobody to talk to. In the beginning, it was very difficult to deal with, and suicidal tendencies seemed to dominate a lot. But being afraid of death, I never attempted although I may have had umpteen ideas inside my head.\n\nI started writing this because I wanted to write something. I haven't conversed for a long time with anyone. It's too lonely out here. I mean I was always okay with the physical loneliness. But having no one to talk to is kind of difficult to deal with. I have learned to cope up with time, but it isn't great. These might well be a very abrupt write up. I just needed to let out whatever I could right now, even though it might make zero sense. And I have the habit of digressing too often.\n\nAnyway, I'm okay as of now. Leaving a pretty privileged life. Still battling depression, anxiety, panic attacks, sleep deprivation, laziness and existential crisis. I am on meds and have given up on my self harming tendencies for about 6 months now. My psychiatrist, my brother and a few other acquaintances say thay I will get better although I do not believe that since I don't think I fit into this world that much. I mean one can survive if they want, but I'm not comfortable with how everything works and it increases my anxiety. I have lost hope for quite sometime. Carrying on, until I can find something better.\n\nThis isn't actually a suicidal rant, although I do have those thoughts from time to time and it seems such a sensible thing to do. I have learnt to cope with it now, but I still don't understand whether fighting it is the right thing or not.\n\nApologies for the nonsense above. And I am always available in case somebody needs to rant out or confide in someone because I feel it's easier to do that with a stranger since they don't judge you much and also their reactions/feelings do not affect that much.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/gvd7cg/totally_confused_rantings/", "title": "Totally confused rantings", "social_network": "reddit", "user": "iwillstalkyousomeday", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1591123812, "permalink": "/r/Suicidal_Thoughts/comments/gvd7cg/totally_confused_rantings/", "nsfw": false, "first_save": 1635429060.2144668, "replies_charged": false}