{"id": "t5_28vigg_t3_mczyet", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "*TW* sexual assault and suicide \n\nI (20F) have attempted suicide before multiple times when I was 15. One time when I was just fed up with life and the second when I got assaulted for the second time. It was traumatic for me and I was already dealing with PTSD from the first time (seeing and hearing things, nightmares, etc.,). \n\nYesterday, I went to the doctor to have my first ever exam of my area because I have been bleeding after sex. She noticed something so she proceeded to ask questions, starting with \"have you ever been assaulted\" because I guess she saw tearing. When I said yes, she kept asking questions. I started crying in the office like an idiot. Not only did the questions and intrusive exam open up old emotional scars for me, but it also reminded me of all the unfinished work I didn't do for my treatment. I feel like a failure. She also said that she is going to be checking for herpes and I am deathly scared that she is going to find it. I have a sick feeling I have it. My life is over at that point anyway. To top it off, my boyfriend didn't know what to say about the situation when I told him and he (unintentionally) made it worse. I get that he was trying to help, he has good intentions.\n\nI have been crying on and off ever since, thinking about how hurt my mom would be if I did this. If it weren't for my mom, I would have done this already but I just can't hurt her, but I also can't live anymore. I don't know what to do. I am sitting next to pills and a note, wanting to just end it right now. I hate that I can't get what happened when I was 15. I hate life. I hate living. I don't just want to die, I need to die.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/mczyet/im_done_with_letting_the_trauma_eat_at_me/", "title": "I'm done with letting the trauma eat at me", "social_network": "reddit", "user": "sAdgIrlwAnts", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1616683725, "permalink": "/r/Suicidal_Thoughts/comments/mczyet/im_done_with_letting_the_trauma_eat_at_me/", "nsfw": false, "first_save": 1635429346.2531323, "replies_charged": false}