{"id": "t5_28vigg_t3_nqy52m", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "So, as pretty much everyone who lurks on this sub knows, I have been experiencing an extreme case of gender dysphoria for the last 17 years where not even transitioning, artificial hormones, etc. would solve. It would not be \"real\" and biologically I would still be a male with the chromosome that absolutely sucks shit. I will not play \"dress up\" because in the end, I am still a cis male. That will not change.\n\nI have been going to therapy for the past few weeks, but skipped last Friday's session because I was so debilitated from the depression, that I had no will or energy to leave the house. The previous week at the therapy appointment, while I was in the waiting area, an attractive female arrived for a few seconds to drop something off and I felt like breaking down and I felt 100% worse. This happens no matter where I encounter them. Whether it is irl, on social media or via watching a tv show.\n\nI played a game called Among us for a few months which required me to in voice calls. There was this one person who would flaunt her sexuality in the voice call at every turn and that made me bitter and depressed. I hated every minute of playing among us with her. Also to note that none of my hobbies bring me joy anymore. I just feel empty from them and dread waking up everyday. I don't even feel anything when playing among us. Last time was last week and I just sat in a fog while the game was going on. The only emotions I feel are anger, jealousy and emptiness. I cannot cry and break down like I want to because my tears are dried up.\n\nI've also written posts on this sub talking about how I am a big advocate for euthanasia. Thus comes the part that relates to the title. I have decided that after my therapy session tomorrow, I will more than likely come out to some of my immediate family while also making my intentions known that I intend to end my life eventually. Might not be this week, might not be this month, might not be until the end of the year. I have been researching effective ways to kill myself that are physically painless and simple for me and I found two options I am content with (No, I cannot share them with you because people here frown on that). It's going to cost a bit of money, but I have about 2k from disability so I can afford it. So unless something drastic that's positive magically happens to change my mind or this entire life is a dream and I am actually a \"cis female\" dreaming this shit up, these are my intentions.\n\nI am looking forward this. For the first time in quite a while, I am actually genuinely looking forward to something. I am at peace and relieved I have made this decision.\n\nThey say you only get 1 life. That's exactly it. It's YOUR life so you should do with it as you please, regardless of other's approval. Only you know what is best for you. If you're posting here to talk me out of it save your useless platitudes and your hero complex for someone who gives a shit.\n\nAm I actually serious about this? or am I just venting because I have nothing better to do? Guess we'll find out.\n\nand now here is a fitting quote from one of my favorite TV shows:\n\n\" Parting isn't such sweet sorrow. It's just plain sweet!\" :)\n\n(obviously I will be around to respond to comments and questions about the severity of my problem, but I do not think much of platitudes. They're a dime a dozen and are usually empty.)", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nqy52m/i_have_about_made_my_decision_and_i_feel_at_peace/", "title": "I have about made my decision and I feel at peace and relieved.", "social_network": "reddit", "user": "LifeBytes123", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1622672738, "permalink": "/r/Suicidal_Thoughts/comments/nqy52m/i_have_about_made_my_decision_and_i_feel_at_peace/", "nsfw": true, "first_save": 1635429309.704468, "replies_charged": false}