{"id": "t5_28vigg_t3_l44h3v", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "Every time when I post on subreddit like these, many people come forward in order to provide advices and tips and this always angered me. I always got into argument with these helpful people often replying back to their advices with a nonchalant\"I can't do it\", \"I can't act on your advice\" and many other variations of it.\n\nBasically I wanted these people to feel that their advices are useless and they are helpless. I know it's wrong to do such a thing, but I don't know why did i indulged in such negative behaviour until yesterday.\n\nYesterday a realisation hit me regarding why I am getting furious with people who are doing their best for a person they don't even know. I realised that it has nothing to do with their advice but everything to do with my fear of not standing upto my parents especially my mother's expectations.\n\nMy mother since my childhood wanted me and my sister to excel in everything, so that she can run it in the face of her in-laws, who humiliated her and ruined her life. [For those who haven't read this](https://www.reddit.com/r/depression/comments/h9d9hd/what_to_do/), here's a short version of how my mother became the bitter person she's now. My mother was very bright student in her academic life and always wanted to be a civil servant. But fate had different and diabolical plans for her. After graduating she was immediately married off to my father, who was atleast more than twice her age. My mother was 20 at that time, same age as me right now. All her dreams were thrown under the bus of patriarchy and misogyny.\n\nShe was married off to my father by my paternal grandmother, because she wanted her daughter to become daughter in law of a rich and influential household. Those who don't know marriages in India especially arranged marriages are like community activities. Parents of bride ask their relatives and acquiantances to find a match. My mother's marriage occurred in similar way. Since my mother was eldest she was to be married as early as possible or the younger siblings can't get married (It's a stupid belief here in this shitty country.)\n\n\nNow the aquiantance who brought my father's name, didn't investigate deep enough before bringing the name as a match. She just heard rumour that my father's family was influential and rich and brought it to my paternal grandmother. My paternal grandmother not wanting to lose the opportunity to marry her daughter into a rich household, also didn't investigated my father's family and quick married my mother to my father.\n\nThe irony hit my mother and grandmother hard when they got to know that my father's family lied about their status. My father was living in a dilapidated apartment. He was suffering from variety of diseases of skin, liver and stomach due to careless lifestyle in youth. My father's family lied because they just wanted a caretaker for my father and nothing else. They also hid the fact that my father was married twice before and had a son. His earlier marriage broke because of the medival era level of patriarchy and misogyny of my father's family and their control freak nature.\n\nMy mother tried to fight all this injustice, but she couldn't do anything other than accepting the fate and the humiliation coupled with it like getting beaten by my father or getting threatened with a gun by the brother in law for speaking I'll of my father's family in front of my father.\n\nYou all must be thinking where I am going with this sob story. But I assure you this sob story contains the origins of my fears. Now comming back to the main post. My mother because of being a near valedictorian in her academic life expect the same from me and my sister. Because she failed in race of life she wants us to be successful no matter what. She doesn't understand or doesn't want to understand that [a child going through this everyday of his 20yrs of life would have developed some sort of issues](https://m.soundcloud.com/user-578003743/sounds-from-saturday-night/s-MjLRCqPjcfs?ref=clipboard&p=a&c=1). She thinks that  because she sacrificed her life by not breaking the marriage and going on with it despite of the humiliation, she is owed complete and unquestionable obedience, even if she did [this](https://np.reddit.com/r/abusiveparents/comments/hkfb39/a_pencil/), [this](https://np.reddit.com/r/abusiveparents/comments/i14h9p/my_mothers_courtesy/), [this](https://np.reddit.com/r/toxicparents/comments/i7xdsm/my_mother_just_laughingly_said_that_people_like/), or [this](https://www.reddit.com/r/abusiveparents/comments/i1riiy/today_what_i_fear_the_most_happened_in_order_to/). She wants us to be completely subversive, because as she say she has to go through all of this because of me and my sister and especially me because I am elder, so if I haven't born or born a still birth she could have left my father.\n\nMy mother wants utter perfection and doesn't tolerate carelessness. She always pick out faults and flaws in whatever me and my sister do. She wants thing to be according to her and our opinion doesn't matter. Whenever we are on call with some friend or teacher. She wants the conversation to be according to her. She shouts to behind us to speak like her or speak what she is speaking which due to which both me and my sister doesn't like to converse infront of her.\n\nDue to her controling behaviour and dysfunctional family dynamics, I tend to visited the school everyday on every working Saturday. People from india would know that 2 Saturdays in a school would be working Saturdays. I use to visit every day due to which people considered me weird and awkward making fun of me. The same behaviour continued to college till vivid struck. I used to leave home by 8 am even though my college starts at 10 am. I stayed till the official time of 5:30 pm sitting all alone in the classroom, as every other student leaves the college by 3pm and because I would be the only student left, no teacher use to come to the classroom.\n\nThis behaviour of mine of attending college everyday and staying till oficial time, has upset many students of my class that some of them even threatened me to leave early or else I will be beaten. They did so because I ruined plans of bunk and they are not wrong, me being in the class all alone doesn't lead to anything productive. It only leads to problem of attendence.\n\n\nBut I can't explain to them why I do it. I can't help myself. The only reason I went to school or college is to get some alone time away from the reality of my life. I never went to school or college for studying. That's why I never got the drive or ambition to score well or get a rank. Because this was never my agenda.\n\nBut then vivid struck and everything went downhill. The online classes and my mother's laser eyed focus on me and my sister was the most mentally draining thing. Since we live in a single bedroom flat, the desktop is situated there only. My mother sits on the bed keeping focus on every interaction in online class. She keeps on proding to ask question, to answer question to let her talk to each teacher on our behalf because we are useless in communication according to her. Due to this I stopped taking online classes or took them with muted volume making an excuse that their is problem in teachers side. In short I don't want her to intrusion in this part of my life. Because of covid the two distinct realities alone time outside house in college and the toxic home reality collided leaving only the toxic part.\n\n\nNow answering the question of getting angry at helpful redditors. The answer is if I act on the advice like getting fit, starting a diet, changing my hairstyle, joining gym, going for a walk, etc , it would be according to my mother's liking. She will decide the diet, she will decide the gym she will decide when and where should go to walk, she would decide the hairstyle she would decide each an every aspect of me and my sister's life because we are not as smart as other children, so it's her duty to decide each and every thing to the tiniest detail.\n\n\nAnd I don't want that. I don't believe in my parents. Don't believe in any parent in my extended family, because most of them are toxic, dysfunctional, patriarchal, misogynistic or a combination of these. I got my mother's hunch of doing things my own way but this leads to clashes, in which I often gets slaps or kicks. Since my father doesn't earn and house runs on the money my mother collected by selling every belonging she also has the monetary control over these decisions.\n\nMy mother wants to control each an everything, because one time she gave the power of deciding upon one of the most important decision(her marriage), and it ruined her whole life. This is her way of having an elusion of control on the seemingly uncontrollable life of ours. She considers herself perfect and consider me, my sister and my father incapable of deciding good of our own. She doesn't like to be questioned, even she spoke something wrong. She doesn't like to be corrected, because she consider herself perfect, and it's because of her we are alive. If we were to live with my father without her we would have been long dead.\n\nSo, I hate advices and tips because I can't act on them on my own accord. I have to be a puppet of my mother, in order  to act on any of the advice. Because most of the decision of parents for their children in my family are horrific. I am suffering through this skin disease due to the courtsey of my mother who forced the 12 yr old me to drink a concoction of white pepper mixed in milk in order to correct my eye sight on advice of some wannabe alternative medicine enthusiast friend. Till she refrains from taking responsibility for my skin condition and instead blames my body, saying it's my horrible body which developed side effects and it's not her mistake.\n\nSo, the only way for me to change my circumstances is to kill myself, because if I were to continue living it will be on the whims and wishes of my mother and if doesn't want that I have to leave the house. Since I have nowhere else to go and have no commercial skill I would die like beggar or street dog. I don't want to die like that. So, I will kill myself before such a day arrives\n\nI know this post won't be read by anyone due to it's long nature, but if anyone read it please don't provide any advice, because I can't act on it. Because i get paralyzed on thought of my mother dissecting my every act, my every thought and every independent impulse to shreds. I don't believe that working hard can change my life, because if that ought to be true my mother won't have go through all of that and become this mean and bitter creature. Please I beg you don't drop advice. Don't force me to remember again and again that my life is not my own, just because I committed the sin of being born. The only way to amend for this sin is death as early as possible by my own hands.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/l44h3v/emotional_mental_paralysis/", "title": "Emotional & Mental Paralysis", "social_network": "reddit", "user": "KINGYOMA", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1611511690, "permalink": "/r/Suicidal_Thoughts/comments/l44h3v/emotional_mental_paralysis/", "nsfw": false, "first_save": 1635429028.2627451, "replies_charged": false}