{"id": "t5_28vigg_t3_ks7kw1", "request": ["03598834-ede5-4aab-9b0a-fc5de7674c00"], "text": "I work for a community mental health organization as a manager. Today I was training a new staff and taking this person to meet her first client, do a simple assessment, and write a care plan. Routine stuff that usually goes off well and quickly. But it didn’t turn out that way. \n\nA statement this teen made during the assessment led me to a more detailed suicide risk assessment. That led to a trip to the local inpatient hospital. After we got our client checked in, I took some time to let my staff process. There were a lot of mixed feelings and she couldn’t believe that I had picked up on the issues so quickly, or understood what questions to ask next when the client had brushed off several of the standard questions on our assessment forms. I reassured my staff that knowing those things would come with experience and that we had done our jobs well today. We saved a life. \n\nWhat I didn’t say was that I knew to ask those questions because I identify with them. If someone turned around and asked me those same questions (and if I actually answered honestly) then I may have been admitted to the adult until in the same hospital. I know how to see the invisible pain in others because that same pain dwells in me. \n\nSometimes it helps me to know I’ve helped others. Sometimes it doesn’t. But I’m good at what I do in part because I have learned to live with the pain - at least for now.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ks7kw1/i_saved_a_life_today_but_still_want_to_end_mine/", "title": "I saved a life today - but still want to end mine.", "social_network": "reddit", "user": "International_Sea285", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1610001446, "permalink": "/r/Suicidal_Thoughts/comments/ks7kw1/i_saved_a_life_today_but_still_want_to_end_mine/", "nsfw": false, "first_save": 1635429521.7926528, "replies_charged": false}