{"id": "t5_28vigg_t3_l37muy", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "Hi, I am new to Reddit and I think this might be my best shot to being anonymous, away from friends and family. \n\nIt all started when I was young, still in my mom's womb, that my biological father's family disliked me because of my gender. (It is a very traditional thing for Chinese families) Eversince I knew this truth, I felt like why was I even born then when I am already rejected as a foetus?\n\nIn kindergarten, I got bullied by a few girls for no concrete reason. Not that I even know of any. In primary school, it got worse as I managed to go to a better class in the sense, academically. I don't know why am I teased. In secondary school when puberty came in like pimples and breast and broader hips, I start to become insecure. Worst, guys will make fun of my pimple face. Not only that, I realised the guys are looking at our breast and butt as we run for PE. It really feels a huge sense of insecurity. I wished then there was more respect. \n\nAs I am graduating from secondary school, my asshole step father had to keep molesting me around my thigh. Please, I know, \"why didn't you report this back then\"? The reason is because my mom just gave birth to my now little bro, and I know how it feels like to not have a father. It really affects you as you grow older. My only best fatherly figure is probs my grandfather but he has passed on 2 years ago. My step father had done this to me till 2019 or so.\n\nIt was only last year I reported him while I was celebrating my 21st bday in advance. Was it a cruel decision when he is already ill? I don't know. But I am pursuing a case against him and all I heard is that he has been hospitalised for a clogged artery or whatever. \n\nI moved out when I reported him. I lived alone. For quite awhile. I grew more depressed. My job let me down. I failed. I retake. I couldnt anymore. I was then admitted to IMH for a month. Came out. 2 weeks. I am in again for attempted suicide. I have moved back with my mom. But things hadn't been better. Im still suicidal and there is just so much hurt that I don't know how to live in this world. I feel like I have done all I can and it is really hopeless. I would want to abuse those drugs again, and this time a really heavy dose. \n\nI have plans to die again on my birthday because even now as I type, I am really very darn hopeless of anything in the future. I don't know what to expect from my post here, but I guess I need a lot of encouragement.. a lot of people to listen and understand why I have such hopeless thoughts to my existence. Is really.. a lot of pain.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/l37muy/it_has_gone_on_for_too_long_too_long/", "title": "It has gone on for too long. Too long.", "social_network": "reddit", "user": "a_lonely_alien_", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1611386687, "permalink": "/r/Suicidal_Thoughts/comments/l37muy/it_has_gone_on_for_too_long_too_long/", "nsfw": false, "first_save": 1635429623.8270297, "replies_charged": false}