{"id": "t5_28vigg_t3_jvm6h6", "request": ["e4caf65e-8cb5-40e4-9897-4291adbe7f3f", "20e5f323-e2c4-450a-8af3-177af94313bf"], "text": "So I'm a sophomore in high-school and I have a pretty good life. I dont have to worry about if I can eat or if the heat will be on or anything like that. My parents support me as much as they can and I'm grateful for them to be able to do that and especially my step dad. \n\nHowever ever since my freshman year I've slowly just been losing in interest in living if that makes any sense. I dont have any plans for the future and I have no goals, no aspirations or really anything to look forward to. I'm so sick and tired of this world where so much wrong shit happens on a daily basis. To be honest this work just bores me and not in the sense of \"hey I'm so smarter than everyone else and everyone else is so stupid that they bore me\" type of way.\n\nMore like in the way that nothing interesting happens to me and I wish I was someone else in a different world. And I shouldn't be feeling this way I mean I have a scholarship, I go to a really good school, I have tons of emails for colleges that some people want to go to and to me its all just nothing. I feel like anything I do doesn't matter so why shouldn't I dissappear? I don't have many friends and the ones I do i feel are just pitying me and in my mind I have only one friend who likes me for being me. And dont get me wrong I'm not depressed (or at least I dont think i am). \n\nPeople ask me what I'm going to do and I always make something up about being author and most people believe it since they say I have a talent for writing stories but in reality my plan in once I graduate from college and I settle down to kill myself. I want to live a bit and experience some things before I do it but the end is always the same and thats to kill myself. So can someone tell me am I in the wrong here?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jvm6h6/am_i_in_the_wrong_for_wanting_to_kill_myself_in/", "title": "Am I in the wrong for wanting to kill myself in the future?", "social_network": "reddit", "user": "throwaway7654903", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 22, "down_vote": 0, "creation": 1605585700, "permalink": "/r/Suicidal_Thoughts/comments/jvm6h6/am_i_in_the_wrong_for_wanting_to_kill_myself_in/", "nsfw": false, "first_save": 1635428899.5357118, "replies_charged": false}