{"id": "t5_28vigg_t3_hz1nc4", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c", "d76dec3b-b6e9-43b7-bfb3-d6c48dabd65b"], "text": "It’s been something that I’ve meaner to do since I was 12. I promised myself I wouldn’t make it to 13. Here I still am 4 years later. I feel as if I am doing myself a great disservice by putting myself through all this when the answer is right there. Every day that I stay I get attached to people who give me some momentary happiness. But I’ve noticed these people leave your life swiftly. Nothing’s permanent, but for someone like me with anxiety and apparently some moderate OCD, I’d prefer things to be permanent and sure. \nHere’s where my fear of doing is comes in. I want to do it in a way that will 100% make sure I die. But where I live we don’t have access to things like guns which I think would be the most accurate way. I don’t like the idea of bleeding out, I feel like it’d be painful. I don’t want my last moments to be painful. I’ve access to plenty of prescription drugs which I could use but from what I’ve heard it’s not 100% sure fire way to die. On top of this I’ve heard it’s slow and painful. Don’t try and say this is a sign that I don’t want to do it pls. I know I do, I’m just scared of pain and failure. \nRecently I’ve noticed that my suicidal thought  and tendencies are becoming less impulsive and more of an all the time thing, they’re starting to get more and more inescapable. \nI’ve told my mother all that I feel comfortable telling her but she ignores it. All the clear signs, everything. I’ve social anxiety but she forces me into socialising with people. I have to make a bunch of sacrifices to appease her but the minute I ask her to compromise for the sake of my mental health she calls me selfish and rude. I can’t. My sister is verbally abusive and has s been for the past 4 years and my mother does nothing despite me telling her time upon time. \nI’ve written suicide not after suicide note but she simply discards them. I used to feel she was a reason to stay, but I’m rapidly beginning to realise I have only myself in this world. \nI just really feel like I’m worth nothing tbh. All I had was my intelligence but I feel like that’s dissipating too. There really is nothing here for me.\nSometimes I do like looking at what I could do with my future but idk it all seems so distant and unobtainable for me. Idk.\nRight now the most probable way of me doing it is going to be OD on the aforementioned prescription drugs. \nI think I’m ready tbh. \nI get back some important exam results in 3 weeks and a couple days. I’m feeling that if those don’t go well I’ll be done here. \nI have some amazing friends, don’t get me wrong, but at the end of the day they’re just temporary like everyone and everything else in this world. I have already them a final letter. I hope they will understand. \nAnyways thank you for stopping by.\nRemember, don’t rage quit the game of life :)", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/hz1nc4/scared_of_doing_it_idk/", "title": "Scared of doing it idk?", "social_network": "reddit", "user": "jongyeons_debit_card", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 8, "down_vote": 0, "creation": 1595886419, "permalink": "/r/Suicidal_Thoughts/comments/hz1nc4/scared_of_doing_it_idk/", "nsfw": false, "first_save": 1635429366.454179, "replies_charged": false}