{"id": "t5_28vigg_t3_oz2yrk", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab"], "text": "I'm having the issue of suicidal thoughts but not willing to leave my family. I really wish I never existed at this point. I'm a screw up and feel like I fail at everything I do. I start off strong but then any little thing will throw me off the deep end. It's sad that money could fix most of the problems I and others seem to have. But hey money makes the world go round. My only remaining desire/hope is a partner or friend that would always have my back. I've lived under the naive assumption that being good, being nice to others will pay off. The whole treat others how you want to be treated. So how come the few friends I have, I'm willing to do anything and everything I'm not willing to do for myself. How come any time I need someone, just to talk or vent or spend time with. They all seem to disappear. I have yet to meet someone willing to help me or anyone else out for 0 gain and just the goodness of their heart. Maybe I should just join the depravity of this world and stop caring about others. Here is where I have a problem with that, I'm basically living for others at this point. I don't care about myself, if I stop caring about others. I will finally go through with it. Now how is it I want to cease to exist but at the same time I'm scared of death. Idk, but lately those negative feelings and thoughts are getting stronger and stronger and idk what to do anymore. I even get urges to do things I would never do on a clear mind. If you read this, I'm just venting and not in the right state of mind. Idk if any of this makes sense.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/oz2yrk/first_time_posting_here/", "title": "First time posting here", "social_network": "reddit", "user": "ComprehensiveWave381", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1628240572, "permalink": "/r/Suicidal_Thoughts/comments/oz2yrk/first_time_posting_here/", "nsfw": false, "first_save": 1635429263.3808086, "replies_charged": false}