{"id": "t5_28vigg_t3_g04x40", "request": ["3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "About 4 years ago, I started having depression and year after that, it got so bad that I started to have suicidal thoughts. About 1 or 2 years ago, a lot happened. During summer, I was about to commit suicide that literally no one knew about. I had a perfect plan, but at the almost last minute, I backed away because of the fear. Shortly after that, I got diagnosed after such a long time of suffering in silence. Now, I don't have that much of a problem to tell people how I feel. I actually became really open about it. This year, I told my ex-classmates how I was about to commit suicide in that time. How I was self-harming. Actually, my two classmates saw my self-harm, because one day, I cut myself really deep once again ( it needed stitches ) in the morning AT SCHOOL, and that day I had PE, and we ran, and my wound opened up, so I checked on it and they saw it. I was pretty open about it. I even once went outside where was a lot of people and I just wore a dress so my cuts ( even a few cuts from that same day ) were really shown. People were staring but nobody said anything. Now looking back at it, I loved that day, because I had fun with my friend when we were hanging out, I didn't care about it that much and I let myself show. This year, I stopped cutting because of a promise I made with my mum ( or at least I'm trying not to break the promise ) . My depression and suicidal thoughts are not as bad as they were in the past. Because I was open about it, friends were willing to help because they saw the state I was in. Even though I still have my bad times, it's not as bad as before. And I'm just trying to think that maybe one day, I'll feel better. And if anyone read this whole stupid thing, then I'm really surprised and also sorry for wasting your time ^^;;", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/g04x40/maybe_ill_feel_better/", "title": "Maybe I'll feel better", "social_network": "reddit", "user": "flowercrown_909_uwu", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1586725936, "permalink": "/r/Suicidal_Thoughts/comments/g04x40/maybe_ill_feel_better/", "nsfw": false, "first_save": 1635429583.27504, "replies_charged": false}