{"id": "t5_28vigg_t3_q2vocw", "request": ["20e5f323-e2c4-450a-8af3-177af94313bf", "90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "Yeah, stupid catchy title. But it's an online handle I used for years... as if it was for seen that I would use it just for this post \n\nMaybe one day someone I know will stumble upon this and it will answer all of their questions as to why I left the world. \n\nI was only here visiting. It's just I felt that it was the time to leave. \n\nMy life was great. Then it fell apart after I was almost murdered. Got addicted to drugs. Lost everything. I thought you could only go up from the bottom but I guess there is a trap door you can open and fall indefinitely. Can't fall any farther if you aren't here. Even sobriety lead me to more pain. \n\nDidn't have much family. Didn't really keep friends. It's not like many people will miss me and the ones who will miss me know that I loved them. I didn't do this because of anybody. I did this to end the pain I live with. \n\nMentally. Emotionally. \n\nI am an atheist so I don't believe I'll be looking down on anyone. I don't think there is an after life. \n\nBut if by some impossible chance there is..  I will be there with the ones I love most. My children. \nThis is the best thing I can offer them otherwise they would of had a lifetime of failure, too. I always have ruined the best things in my life and can't do that to them, too. \n\nWhy am I here saying all of this? Why not? Maybe somebody will read this and think I'm so pathetic... and then they will realize it's not worth it to kill themselves and it will save someone. Haha. Idk. \n\nWhy aren't we allowed to choose when we die anyways? I would rather die on my terms than anyone else's. The world is over populated. I'm just helping the planet. \n\nBut I was only here to visit.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/q2vocw/sincerely_the_end/", "title": "Sincerely, The End", "social_network": "reddit", "user": "trash-queen666", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1633561202, "permalink": "/r/Suicidal_Thoughts/comments/q2vocw/sincerely_the_end/", "nsfw": false, "first_save": 1635428963.7502286, "replies_charged": false}