{"id": "t5_28vigg_t3_pjetqe", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "I used to enjoy life and played golf and baseball... enjoyed life for what it was. I had dreams of travelling the world and finding someone like-minded to spend my life with. And all within the span of a year, I feel hopeless and my life has no value. It started with just mild depression after a breakup but it's all slowly spiraled down to the point where I only get through each day. I thought (and told myself) it would get better but it only got worse. I don't enjoy life whatsoever and I wish there was a solution. I feel tired of living but can't find the will to end it. I don't want to hurt my family in any way but I don't want to be here. I wish there was a better way, but I have less and less hope every day. I see no way out of this, and it makes me sad to think about it. I don't enjoy anything anymore. I feel like a failure but I don't want to disappoint anyone. Especially since my family is so helpful and caring. I don't want to let them down, to show them how weak I've become.\n\nMy family knows about my depression but they don't know how bad it is. They are supportive and want me to talk to them if I need to but I don't want them to see me in pain.\n\nI'm starting second year of university and I don't think I can do this. I don't really want to, either. I barely managed last year with mild depression. But backing out now costs a ton, and I don't think it's a good idea to waste this money. I am so lost right now.\n\nI don't want to do university, it's just the only way I know to get into a stable, well paying career nowadays doing something I know. I know I am a high-ish achiever, but I can't put in anything close to my full effort with this depression so I can never really reach my true potential. I just don't have any motivation anymore. The only thing that pushes me to do things is that I don't want to waste this money and let down my family.\n\nI want to get better without medication, I don't want to take meds every day just to get by. Haven't had success with anything I've tried and the side effects only made me feel worse.\n\nIf I could get some advice right now or just someone to maybe talk this through with, I'd appreciate it.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pjetqe/i_dont_understand_it_how_things_can_change_so_much/", "title": "I don't understand it, how things can change so much", "social_network": "reddit", "user": "Bruins-4-Life", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 8, "down_vote": 0, "creation": 1630984823, "permalink": "/r/Suicidal_Thoughts/comments/pjetqe/i_dont_understand_it_how_things_can_change_so_much/", "nsfw": false, "first_save": 1635428851.0829422, "replies_charged": false}