{"id": "t5_28vigg_t3_mdudgv", "request": ["82ff3069-5f28-400f-ba6f-f94d4fcede90", "1b8b7108-38ec-4c83-a7c2-510b87d5871b", "935370ff-2e76-44cd-b247-7eb7b997ce9a"], "text": "I'm tired of being everyone's punching bag. I'm tired of having to go to therapy for my mental health when people in my life keep re-traumatizing me. It's like... I can't heal in the environment that broke me/is in the process of breaking me. And the people in my life don't even THINK to consider the amount of endless pain I'm in. Some of the people in my life couldn't even begin to understand how hard I've fought to be here today. No matter how hard I try to stand up for myself, it never changes a thing. The sleepless nights, the suicidal ideations, the confusion, the self-destructive behavior, the yelling/arguments, the belittling and disrespect I put up with, the dismissal of my feelings, gaslighting, the dependency I have on others, the lack of long-lasting friendships I've had, and the way the men in my life have treated me since I was born on this shitty excuse of a planet... I'm so tired of it all. No matter where I go, what decisions I make, or how much I improve myself, abusive people always find their way into my life. Whether it's my mom, dad, other relatives, friends, complete strangers, or even my significant other... I always end up being someone's emotional punching bag and eventually even their physical one. I'm so tired of the weight I carry around with me every single day, but it's not the kind of tired sleep can fix. I've tried everything. I've slept away my life for weeks at a time in hopes maybe I can escape. I end up just having nightmares, sleep paralysis, and flashbacks. This doesn't even feel like it's the kind of emotional exhaustion any amount of therapy can 'fix'. I've tried meds and countless other therapeutic resources. I feel so stuck and alone. I know healing isn't linear but sometimes the only way I feel like I will ever be at peace is if I just end it all. I don't want to die, I just want the pain to end.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/mdudgv/years_of_abuse_are_taking_a_toll_on_me/", "title": "Years of abuse are taking a toll on me", "social_network": "reddit", "user": "ifeelcrazyagain", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1616781397, "permalink": "/r/Suicidal_Thoughts/comments/mdudgv/years_of_abuse_are_taking_a_toll_on_me/", "nsfw": false, "first_save": 1635428813.0176816, "replies_charged": false}