{"id": "t5_28vigg_t3_nhw9nf", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e"], "text": "I'm 23 (M) have no friends, single, undergrad, and  unemployed. \n\nHad a problem happened last year which makes me want to kill myself and planned it on january, so I got rid of every responsibility I had especially my college life, it gives me a taste of freedom knowing i would do it in january (thinking about this since august last year), than my main problem start to slightly disappear but now when I try to get back in track I get threatened to be expelled and I can't tell this to anyone (especially my parents) since they would know i did it on purpose thinking I would 100% do it in january. \n\nThis makes me depressed, might not be as big as my previous problem, but I don't see any solution for this.... I still try to get my chance to continue my college life but if I don't get it, I don't know what to do. I'm thinking about reschedule my intention on june or july if I get expelled since I want to spend time with my family. The thing is I also will still get abit depressed as usual if I still continue.... I don't want to be alone... I want to have friends, experience love, laugh together with friends like other group of people i see, share stories, hang out, etc.... but maybe not in this life. I'm not that close with any of my family member, some of them hates me and yeah that's it...\n\nI know this is my fault creating this problem... I always have a bad habbit on making dumb decision when I feel depressed or threatened. \n\nSo if you do have advice what I should do that would be nice.... half of me want to continue, but the other half kinda accept if I should end it..\n\nSorry if some of you find this corny or cringy & thankyou if you take your time to read and maybe giving advice :)", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nhw9nf/i_feel_lost_and_depressed_knowing_that_i/", "title": "I feel lost and depressed knowing that I haven't/won't accomplish anything in life", "social_network": "reddit", "user": "F4p69420", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1621613541, "permalink": "/r/Suicidal_Thoughts/comments/nhw9nf/i_feel_lost_and_depressed_knowing_that_i/", "nsfw": false, "first_save": 1635428832.5660787, "replies_charged": false}