{"id": "t5_28vigg_t3_pk3odf", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40", "b4d8161b-7016-486a-a4bd-5fb6a5aa639e"], "text": "I was going off on my post and then all of that was erased so TL;DR.\n\nI feel like shit, I've experienced traumatic shit growing up and my supposedly last straw would have been my parents gifting the loves of my life: my puppies. But no, \"I\" want to live. \n\nAnd since I want it so bad I need to start doing it, because my parents are tired of me. And then it goes away, all of the excitment for being alive. I need to seek therapy or perhaps... just post my problemas in a place like this, who knows?? \n\nI can't seek for therapy (my father only believes in GOD and my mother insists to say I'm pretending), so I need to make money, I'm 19 now I need to start making money... But my parents where the ones that got me in this world...\n\nBut even tho the demo of this is obligatory you can just press not interested at any time, and \"I choosed\" not to. So... I need to work, and I'm really sad about it. \n\nIf my family was different, my life would have been too. Because most of this attachment and anger issues come from abuse and gaslight my parents (mostly my mom) did over me. \n\nMy mom is a different story she loves to make others sad/angry/angsty when she's in a bad mood. \n\nSo I want my family to loves me or at least respect me, because they say they love me and then cross my boundaries or make me mad on purpose so maybe they don't love me \"enough\".\n\nThe only one that cares about me and shares their concerns about me is my little sister, she's so smart and talkative I am very sorry that I can't get along too much with her due to my lack of interest in living. She is growing up thinking that life is meaningless (which it is but still, she's just 7 and I can see the problem but can't do nothing because I'm too depressed to even talk).\n\nGoodnight, I need to find a new family, actual friends and not just me and live with the sadness of seeing children growing up in this unfair and cruel world.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pk3odf/i_figured_out_what_i_want_to_do_maybe/", "title": "I figured out what I want to do, maybe.", "social_network": "reddit", "user": "pelaqueu", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1631076086, "permalink": "/r/Suicidal_Thoughts/comments/pk3odf/i_figured_out_what_i_want_to_do_maybe/", "nsfw": false, "first_save": 1635429252.625005, "replies_charged": false}