{"id": "t5_28vigg_t3_p19df7", "request": ["b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "Today is one of those.\nI’m in my twenties and after relationships that ruined me because of how abusive and violent my partners were, I finally felt appreciated with someone else just to end up damaging my now bf. He said he forgave me but he never did and after years of what we did to each other, he has decided to gave up on me and I understand. \nI’ve never loved anyone the way I love him and I never saw myself fantasizing with a life beyond my 30’s with someone else (I’ve had suicidal thoughts since I was 10 because I’ve always felt guilty about everything, thx Catholic Church).\nAnd a few months ago I started noticing me more an more miserable, I couldn’t stop crying then isolated from all my friends and hid everything from my family too. This year I lost my job and I can’t get to finish my degree even tho I’m in the last step since the last year. \nAnyways, today I found myself (again) searching online for ways to kill me and started fantasizing with the only letter I’d leave in order to let them know that it wasn’t anyone else’s fault but my own to stop suffering, because I love living in concept, I just can’t with the pain I feel because I’ve developed chronic conditions due to how depressed I am. Everyday my body tells me that I can’t hold it anymore, no matter the professional help I get (I’ve been seeing a psychologist for over a year) nor the awesome and incredible support group I have (my beautiful family and two friends, besides my bf). \nI swear I wanna live, but I can’t be functional anymore and don’t know what else to do. The fact that I’d hurt the people that I love the most has stopped me from trying to k*ll myself but not from fantasying more and more about how it’d be better for me and everyone around me if I wasn’t here anymore because I’m not living and giving my all to my loved ones.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/p19df7/some_days_i_feel_like_i_cant_anymore/", "title": "Some days I feel like I can’t anymore", "social_network": "reddit", "user": "PastelEmoFairy", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1628539683, "permalink": "/r/Suicidal_Thoughts/comments/p19df7/some_days_i_feel_like_i_cant_anymore/", "nsfw": false, "first_save": 1635429439.6204605, "replies_charged": false}