{"id": "t5_28vigg_t3_kphrma", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "I have daily thoughts of suicide, I’m a drug addict, a mediocre human. My friends have distanced themselves from me because I told them how I want to kill myself in graphic detail. My girlfriend left me and threatened to send me to a mental hospital because she easily could with the text messages I sent her about how I’d take my life. All my friends and girlfriend say I’m just suicidal for attention and that makes me come even closer to ending my life. They know I have a cutting problem, they think I just want people to feel bad for me. The truth is, I’m fucking being destroyed by manic depression, constant suicidal thoughts, and drug use. I plan to go sober soon but It’s going to be so hard because drugs are my coping mechanism. I really want my relationship and friendships to become better. I want my mental health to be better. I’ve started seeing a therapist 2x a week. I’m on a cocktail of strong meds (lamictal 300 mg, gabapentin 300mg, vraylar) I plan to get sober on my birthday in a few days and have one last drink and one last dmt trip before I go sober. I want to go sober forever it will work wonders for my mental health and friendships because when I do drugs or drink I get manic depression, anxiety, and paranoia. It’s a process but I’m really trying to not kill myself even though I have nothing to live for and I hate myself. I’m going to start going to recovery meetings, I have 4 jobs to keep me occupied. I’m going to get back in the gym and eat healthier, and play billiards more and try to make new friends that understand me. It’s just a process that takes time and I’m in this alone w no support. I have no family, my friends are annoyed at me because I’m suicidal and my girlfriend thinks I’m fucking nuts. Life is fucking hard and for some reason I choose to wake up everyday", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/kphrma/everyone_says_im_just_seeking_attention/", "title": "Everyone says I’m just seeking attention...", "social_network": "reddit", "user": "NSHV1LL3", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 11, "down_vote": 0, "creation": 1609666452, "permalink": "/r/Suicidal_Thoughts/comments/kphrma/everyone_says_im_just_seeking_attention/", "nsfw": false, "first_save": 1635429228.3553374, "replies_charged": false}