{"id": "t5_28vigg_t3_pdo0kx", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "935370ff-2e76-44cd-b247-7eb7b997ce9a", "b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "i self harm and have suicidal thoughts. at one of my lowest moments i even wrote out 3 possible ways i could end it all, and it's still there sitting in a google doc waiting for me. the only person I've told about my suicidal ideation in some sort of detail is my sister, and I'm scared to tell anyone else.\n\nliving with my body dysmorphia and depression has taken a toll to the point where my main relief is when I'm either too overdosed on pain meds to feel anything, or self harming. when i told my therapist about my self harm she said she'd at some point have to inform the police (self harm and suicide are still crimes in my country). she said she doesn't want to do that, but ever since I've lied about stopping my s/h and I've since then stopped seeing her. part of the reason I'm hesitant to end it is because idk what will happen with my family after I'm gone, like would they pay a fine for my crime? \nthe other is for religious reasons. my mother told her friend about my cutting, and said friend sent a letter saying that I'd be sent to hell if i kill myself, which just made me more depressed. it got me thinking that God didn't favour the mentally ill. \n\nidk why I'm typing all this. i guess i need to get this off my chest to someone, even if it's just the void. i feel like such a bother. I'm the family's problem child. a washed up has-been. my family would've been better off if I'd been aborted or simply not conceived at all. i feel like an outcast wherever i go, like i simply wasn't even meant to be alive in the first place.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pdo0kx/a_vent_of_some_sort/", "title": "a vent of some sort", "social_network": "reddit", "user": "worthlsss", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1630208268, "permalink": "/r/Suicidal_Thoughts/comments/pdo0kx/a_vent_of_some_sort/", "nsfw": false, "first_save": 1635428852.6538393, "replies_charged": false}