{"id": "t5_28vigg_t3_p579vg", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "935370ff-2e76-44cd-b247-7eb7b997ce9a", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1"], "text": "Something I’ve been thinking about for a long time is the perceived validity (or lack there of) of suicide. It makes me frustrated to no end that people who are suffering from mental health problems aren’t taken seriously when they mention they are considering suicide. With the notion of hurting loved ones aside, why isn’t suicide considered a valid choice? It is always seen as a mistake that someone makes because their judgement is “clouded” by the mental and emotional battles they face. But what if I’m just not interested in living and participating in the human experience?\n\nTime and time again, I’ve heard the expression “pain is only temporary but suicide is permanent”. For some, I think that’s the whole point. Even if it is true that this pain I carry is temporary, what if my desire to not exist outweighs the benefits of staying alive and potentially feeling happier and more secure in my life? What should I do if I am increasingly anxious about having to exist for a solid half of a century? Things like climate change, mental illness, chronic pain, trauma from friends and family and a general distaste towards getting older and having to secure a job/career are all factors that I consider when thinking about my life and my lack of enthusiasm towards living. Does anyone else feel this way? There aren’t a lot of places where I feel like I can express myself in this way and I feel more and more exhausted with each passing day. Why can’t I just end my life in peace without fear of being taken to the hospital and having that choice revoked?\n\nEdit: Just wanted to add that I would really appreciate some outside input on this because I am feeling extremely alone in my thoughts rn.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/p579vg/thoughts_on_suicide_as_a_valid_option/", "title": "Thoughts on suicide as a valid option", "social_network": "reddit", "user": "m1ssredundant", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 17, "down_vote": 0, "creation": 1629081439, "permalink": "/r/Suicidal_Thoughts/comments/p579vg/thoughts_on_suicide_as_a_valid_option/", "nsfw": false, "first_save": 1635428719.939925, "replies_charged": false}