{"id": "t5_28vigg_t3_o8meil", "request": ["6b730dbc-4f91-42d3-b01a-c703ff43b401", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "Hello. I don’t want to say my real name but you can call me Taylor. I’m 23 years old. Have no friends, taking antidepressants and antipsychotics and being addicted to big doses of Xanax at the moment. I started getting very anxious at the age of 15 after battling anorexia for nearly 1 year. I developed severe anxiety. But not just that. A lot of things have happened to me. I’ve been bullied, humiliated from people. My life is falling apart. I stopped going to school at 17 years old because of severe social anxiety that’s has been caused from the fact that I’m gay. But I was forced back to school from the psychiatric hospital. The core of my anxiety is my sexuality. As I said I’m addicted to Xanax. I basically wake up at noon take 1mg sleep again then wake up take again and the list goes. I have no desire to live because the level of life I’m dreaming is not gonna happen. I fell in love with a guy at school in 2015. We started hanging out and completely hit it off immediately as friends. But he was straight. The first time we hung out he invited me to his house and everything seemed to be going well until he asked me to leave because he wanted to bring a girl home to have sex with. That crashed me. I’m still traumatized and that thought of what happened always triggers suicidal thoughts. The same day he had sex with this girl I asked him to go out again because I had to tell him something important. We sat down on a bench and I was crying and he said you don’t like me right? Do you? And I thought to myself why if he had any kind of consideration that I liked him would he choose to hang out with me and ask me to leave him house telling he was gonna have sex? Like he knew he was gonna hurt me. Anyway I said no hiding my feelings I just said I’m bisexual. Then he hugged me and told me it’s ok. We’re gonna spend the day together. I brought him to my house and we sat on the balcony for hours. And the it was time to call it tonight. I walked him home. And we said goodbye and he ran to me hugged me and told me don’t worry I love you American boy. Then months passed we were official friends. And I was always asking to hug me and he did always. Our schools were pretty close and after giving finals I was always waiting out of the school door to see him hoping he was gonna dump the girlfriend and come with me. Which is what he always did. It became a nightmare. I needed him 24/7. I was getting anxious when we weren’t together. I was so in love with him I was seeing him in my sleep. Until I told him how I felt and he ditched me completely. Ever since I have stop living. I have gained 100 pounds developed high blood pressure become ugly  negative. I dream about him every damn night. I’m suicidal because I miss him and I know he will never come back. I’ve tried multiple times to get in touch with him and he blocked me from all social media. Then another thing happened. My family went bankrupt. We start living with no purpose no life. My dad was a business owner and now works at a kiosk cleaning the toilets. I can’t deal with all of this. I’m not gonna do anything stupid obviously I just need to get it off my chest. I can’t get out of bed and everytime I do i see something and become irritable and take Xanax to ease the pain. Please help.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/o8meil/crying_for_help/", "title": "crying for help", "social_network": "reddit", "user": "StableNo5279", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1624753304, "permalink": "/r/Suicidal_Thoughts/comments/o8meil/crying_for_help/", "nsfw": false, "first_save": 1635428763.1490648, "replies_charged": false}