{"id": "t5_28vigg_t3_j979k4", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "I'm 27 and a total and complete waste of space. Stealing oxygen and all that jazz.I'm a failure and there's no one to blame but myself. I can't do much of anything right. I have nothing to talk about when I meet people out in public because day in and day out I don't do anything. I'm on drugs and I'm one front  away from being harassed by an angry drug dealer who just wants the money I owe them. I'm socially phobic so despite wanting to die I DO NOT want to die by the hand of another person. That would be torture for a socially phobic person. I don't know what to do if I decide to continue living. I don't have a girlfriend and it hurts because I don't have a sister or living mom and grandma. So I feel like I just won't meant to have the opposite sex's company. I feel left out because I can't grow a beard. Work proved to be too stressful and my co-workers hated me. For the last six months all I've did was eat and do drugs. I don't hang out with anyone when I do drugs because that's a rough crowd and I'm a snowflake. I've been robbed 3 time and raped 5 times all before the age of 18. I even had a guy break my wrist before. I feel like I'm not cut out for the world. I don't fit in anywhere. My neighbor got drunk last fall and passed out on a railroad track in our back yard ( I live in an apartment building with about 23 others) and he died. I been thinking about following suit lately. I don't know what to do guys and it be nice to start over. The only good thing is I live on my own. But lately that's been a curse as I've lost social skills. If you made it this far than thank you. I really appreciate your concern.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/j979k4/jobless_no_girlfriend_no_friends_fat_and_hopeless/", "title": "Jobless no girlfriend no friends fat and hopeless", "social_network": "reddit", "user": "Dwayneandnem8", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 13, "down_vote": 0, "creation": 1602429794, "permalink": "/r/Suicidal_Thoughts/comments/j979k4/jobless_no_girlfriend_no_friends_fat_and_hopeless/", "nsfw": false, "first_save": 1635429361.069868, "replies_charged": false}