{"id": "t5_28vigg_t3_q1fcjd", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab"], "text": "Fucked up my just recently ended relationship. Lost my job because I just got too sad to leave my house. Then got drunk and took off back to my home town to avoid my roommates breaking me down even more. Continued to get even more drunk somehow, meet up with an ex (who always was the one that got away) have a great time until he tells me it was a big fucking mistake. Now here I am, sitting in the bath tub with the last bit of hope I have only because it's my little brother's award ceremony today. I didn't want to be rude and kill myself before the ceremony. But I know I don't have much time left. I have no strength left, honestly and truly. It feels like each breath is just a lung full of shattered glass and everytime I want to speak I just can't. My brain is so scattered with what ways I want to do this but I can't settle. Bridge? Too busy there and super high fence plus cameras. Tub? Don't want to traumatize my family even more. Park trail? Children go there, I couldn't do that. I hate this. But I want to go, I'm not scared anymore. Every other time I've tried, it's never worked because I still had things I needed to do. But now I've completed my life's main quest, enough side missions, it's time to move on. I wish things could have been different. Maybe in another life time. I also apologize for the long vent. To who ever is reading this ; I hope things get better for you, friend.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/q1fcjd/i_fucked_up_every_last_thing_i_had_left/", "title": "I fucked up every last thing I had left.", "social_network": "reddit", "user": "thegloomylagoon", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 14, "down_vote": 0, "creation": 1633381912, "permalink": "/r/Suicidal_Thoughts/comments/q1fcjd/i_fucked_up_every_last_thing_i_had_left/", "nsfw": false, "first_save": 1635429250.4808254, "replies_charged": false}