{"id": "t5_28vigg_t3_nlmt11", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "cf81d7c0-cd42-4d3e-a15d-51251de387ba", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "Warning: I’m on mobile and grammar isn’t my strong suit. Also this is just another suicidal rant so lots of cussing.\n\nI’ve been fucked up as long as I can remember. I’ve had 3 past suicide attempts and have been “rehabilitated” twice. I am seriously mentally ill. In my search for reasons to live, I find nothing. All these asshats with their “you are loved”, “you matter”, “the world needs you”...they think those empty words mean shit to a person who can barely find a reason to wake up? Everyone thinks their a mental health “advocate” just for saying these shitty little sayings. I’m so desensitized to positive sensations. I can’t even find joy in food, hobbies are just me wasting money and time, work is unfulfilling and sucks away my time. I’m beyond depressed, my PTSD makes it so I can’t even interact with my partner like a normal person, and people have their little two cents to add at every turn. \n\n“Just exercise and get outside” -okay sure, it’s that easy. Let me just put that on the list of things I’m too depressed to make myself do. I can barely manage to motivate myself to wake up, but if I just exercise and go outside I’ll be chipper. Fuck off as if I could afford to take days off and still eat. \n\nMy personal favorite, “God doesn’t give us more than we can handle” -First off, don’t impose your religious beliefs on MY suffering. Fuck you and your God. If he’s so pure and holy why the fuck did he make rapists? What’s his point of existing? So I can worship him and feed his atrocious ego? \n\n“Someone loves you” -Maybe they do, maybe they don’t. Personally I feel like no one gives a single shit and my dead phone is just proof of that. I don’t give a shit about some random on the internet saying they love me. A bot can do it too. I have no family and no friends, just my partner. As a social creature it’s something that’s devastating.\n\n“You matter” -Okay so I matter? Matter for what? My minimum wage job? Heaven forbid they just immediately hire a new person. To my family? They never reach out to me and when I reach out to them it’s radio silence. Oh that’s right, you just don’t want me to kill myself because it’s upsetting to YOU. Not because you genuinely care about ME.\n\n“You have so much to live for” -Like working the same dead end job, no time to do anything (not that I could afford to) and eternal emptiness? What’s the point in living the same day over and over again? I can’t even enjoy eating and nothing gives me serotonin or a sense of fulfillment. Easy to say I have something to live for when you can actually enjoy living. \n\n“See a therapist, medications aren’t bad” -This one is hit or miss. But for me, it’s a huge fucking miss. I’ve tried what feels like dozens of different medications for the following mental illnesses: PTSD, MDD, ADHD, and Generalized Anxiety disorder. Not a single one made me feel “better”. The side affects alone made me want to die. Most of them just made me feel hollow and numb. Which I guess in big pharma is the perfect solution to feeling like a deep pit of nothing. Therapy just felt embarrassing and did nothing but deconstruct my feelings and tell me why I feel and act the way I do. Guess what Dr. Nguyen, I already fucking know that being raped and mentally/emotionally abused is causing these feelings and actions, so here is my $60 copay to see you. \n\nAll I can think about is how much easier it is to not exist at all. People die every second of every day, if anyone watches the news you can tell people don’t care about people. I don’t know, to the 5 people that read this post that are probably suicidal too, what has a shitty “advocate” said to you that just made you feel worse? It’d be nice to know that I’m not the only suicidal maniac.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nlmt11/you_are_loved_bs_effort_by_bs_people/", "title": "“You are loved”, BS effort by BS people", "social_network": "reddit", "user": "PrincessaWeed", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 22, "down_vote": 0, "creation": 1622050840, "permalink": "/r/Suicidal_Thoughts/comments/nlmt11/you_are_loved_bs_effort_by_bs_people/", "nsfw": true, "first_save": 1635428990.6965914, "replies_charged": false}