{"id": "t5_28vigg_t3_l8ftaf", "request": ["029ade1a-045d-4a03-b80e-2f560fb4018f"], "text": "I feel so dumb for feeling this way. My life is actually pretty great for the most part. I have three adorable cats, a super caring badass husband, and I even achieved my dream of being a home owner this year. \nHowever my job constantly makes me feel like I’m not worth it. My boss and my manager can be flat out mean sometimes, but my manager specifically is a psycho. I work for a very small company and the winter is our off season, and I had worked out with my boss to keep hours in the winter so that I stay on. However my manager, who does all the finances, is so against this and tells me I’m taking advantage of the owner and being selfish. So every slow day I work I’m riddled with guilt that I didn’t make enough money and I shouldn’t even be working and maybe I’m a bad person for even asking to keep working, even though this is what the owner and I had agreed on. This last week my cat had surgery, and I needed to stay home with him last minute. Me, thinking it wouldn’t be a big deal to just not open that day as it was one of the slowest days of the week in our slow season, asked my boss if I could work from home that day. Now normally, I don’t get paid time off or really any kind of benefits, but this week I had to watch some online content for a convention for the store anyways, I figured it wouldn’t be a big deal to do it at home while I watched over my cat. Well my manager has a BITCH fit, calls my boss and flips out that she thinks I’m getting paid to staying home. My boss told her she wasn’t paying me so she wouldn’t get yelled at by her own manager, and turns around and calls me to scratch out my hours and she’ll just pay me under the table to avoid my manager yelling at me too. At this point I’m stressed and confused and my manager ended up yelling at me anyways, basically saying I’m not being an adult and I’m trying to steal money from the owner. At this point I’m hyperventilating and crying and all she has to say is “if I start crying will I get what I want too?” I could barley keep it together all day and at the end of it, I just feel like I don’t want to exist. I feel helpless, I want to quit but I do like a lot about my job and I don’t have another lined up right now. I wanted to take my time and look for something better but now I’m thinking maybe I should just settle? Or even better maybe I could just stop existing. Not that I want to kill myself necisarily, I just want to not feel so bad anymore and I don’t know how. I used to self harm in high school and this is bringing back so many bad feelings, and I also feel kind of crazy for reacting like this but my husband says that she’s been emotionally abusing me this whole time by being such a psycho. I just don’t know anymore, but I don’t want to feel this way. Anyways, if you’ve made it this far thanks for coming to my Ted Talk.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/l8ftaf/i_dont_want_to_exist/", "title": "I don’t want to exist", "social_network": "reddit", "user": "Queen_Butter_III", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1611988479, "permalink": "/r/Suicidal_Thoughts/comments/l8ftaf/i_dont_want_to_exist/", "nsfw": false, "first_save": 1635429079.259967, "replies_charged": false}