{"id": "t5_28vigg_t3_o1eguy", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed", "51818c1f-9070-43a1-96e3-b1b348ef35e0"], "text": "Hey everyone! I have been very depressed lately, After my father died. I lost the meaning of life. Add to this My Two kids came to life one year before. I am Jobless immigrant in a country thats very difficult to get sustainable job. I have zero time. I have issues with my partner barely have mutual understanding. Things are going too fast. Kids needs attention, I need to time to search for job add to the mix constant arguments. It's too much.\nThe pressure is real. The hope is fading I guess. I have zero problems if God took my soul today or tomorrow or anytime. I just can't handle all the pressure all alone. I am very positive but I think things got out of my hand. At the mean time my mother is all alone in another country, she is getting old, she is getting emotional and loosing hope. It would be better if I be with here. But My mind is divided between my kids and my issues with my spause, she would refuse as well. I am in hamster wheel the more I run the more I got tired and I find myself in the same position all over again.\nDeath is beautiful if life is unworthy of living. I started gambling as well, I became a chain smoker trying to find my luck somewhere, I spend money and lose the more I lose the more I spend.\nI think money is a solution to my situation. I want it fast..\nI am 33 now. All my Peers are very stable.i have zero contact with them right now. Although I was the one who always make the first social contact and ask about them. I feel like right now. That my life is filled with untrustworthy worthy scam people. They didn't bother even to call, and ask how I feel.\nToday June 16 2021, the urge of ending all this is getting bigger. I don't know if I can make. But I have no longer have the physical energy to defeat all this obstacles.\nI cried, prayed, sinned, raged but it seems unworthy, life with all its glittering product is just waste of energy.\nIt looks like a dead end. If I did it then it must a perfect so that it wouldn't impact anyone. I should just disappear and no one find my body.\n\nI am disappointed about myself, but Myself is not caring anymore myself is wounded scared and tortured from inside,there is no where to go when everything is a must and should be.\n\nGoodbye life as for me I will never post anything anymore. Take care 🙏.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/o1eguy/godamme_the_more_i_try_the_more_it_gets/", "title": "Godamme the more I try the more it gets complicated", "social_network": "reddit", "user": "Boogieman404", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1623874918, "permalink": "/r/Suicidal_Thoughts/comments/o1eguy/godamme_the_more_i_try_the_more_it_gets/", "nsfw": false, "first_save": 1635428921.7620628, "replies_charged": false}