{"id": "t5_28vigg_t3_lji37x", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40", "f84ea205-e410-477c-ab62-1a3b3e711d50", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "My whole life has been under my fathers thumb. My boyfriend keeps saying we’ll start our new life once we graduate and find steady jobs but I’m honestly at my wits end. Everyday feels like I’m drifting more and more into insanity. I’ve come to the conclusion that I would rather die than continue to have no freedom. I’m tired of not being able to make decisions for myself while everyone else can go and do as they please behind my dads back. To my boyfriend, it’s been the best four years even if all the time we got to see each other physically accumulates to about four months. I’m sorry that I couldn’t make it to our happy ending. I love you so much and regret not giving you the family you dreamed of. To my dad, yes I remember the night you killed mom in front of us as my brother and sister pulled at your arm and pounded at your back to let her go. I say killed because you snapped her neck in front of us and she laid lifeless, to this day I don’t know how she managed to survive or if by some miracle she faked her death but I’ll never forget the loud snap of her neck and her lifeless looking eyes fixated on me. I don’t think any 5 year old (any child at all) should have to witness that. I have never forgiven you and I never would have. It has haunted me everyday and I lay in bed afraid of any arguments I hear between you two. I hate the fact that I look so much like you. When I look in the mirror, all I see is a killer. To my mother, you are the strongest person I know. Thank you for taking care of us and I’m sorry all your care for me ends in vain. I love you. I’m sorry for any and all hard times I’ve given you. I’ll never understand why you stayed with a man who attempted to kill you and kidnapped your children to see loose women after thinking he broke your neck. If he believed he murdered you and still went on his merry way, the only place he should stay is prison. That terrible experience and dads dictator-like way of running this family might be why all three of your kids are fucked up in the head. To my sister, I love you. You were always a naggy person, kind of full of yourself. Bit of a superiority complex, BUT still tried your best to be reasonable and caring. I know you didn’t mean to come off as overbearing as mom and dad. To my brother, I don’t care what you did in the past. I know we’re all fucking insane especially from the people our parents allowed in our lives. I love you too.\n\nMom, Dad. Those people you had us visit in LA claiming they were family, they helped fuck us up. Their teenage daughter did things to me and my sister as little kids. Their youngest teenage son attempted to do similar things to me. They were thieves as well, I hate that you DAD always brought them into our lives knowing full well that they were shit. You pointed the finger at your own son claiming he stole money from you when it was clearly that fucking shithole of a person you called “our cousin.” You didn’t apologize to your son. You never apologized to us. Everything that ever happened was because of you. All three of your kids now attempted suicide. I hope my brother and sister and mom can get away. When was the last time you said I love you to us? I remember mine, years ago when a girl killed herself, you realized only that morning that your kid could kill herself one day too. \nHahahahaha! How fucking hilarious! The second time you say it, I won’t even be alive to hear it! You always called us “moms kids” always telling mom “your kids..” The only times we were your kids is when we did something you could brag about. You always thought we were ungrateful and worthless. Don’t bother having a funeral, I know you’d invite all those pieces of shit i never liked. Put me in the cheapest pine box or just use some plywood you have lying around to make a box. I don’t care.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/lji37x/i_want_to_end_it_all_because_theres_too_much_pent/", "title": "I want to end it all because there’s too much pent up anger and frustration. Maybe it will help just to post.", "social_network": "reddit", "user": "DianaTheGoof", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1613279925, "permalink": "/r/Suicidal_Thoughts/comments/lji37x/i_want_to_end_it_all_because_theres_too_much_pent/", "nsfw": false, "first_save": 1635429308.139029, "replies_charged": false}