{"id": "t5_28vigg_t3_nl4n39", "request": ["b38140a1-7eee-49dc-9a69-c07b4318950c", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "How can I live in this world? I try so hard. When I feel like I want to fall apart I get back up. I stopped trying sabotage myself. I try to keep moving forward even if it means I'm crawling. So why? Why why why? Its not fair. I'm not even the one who's sabotaging myself anymore. I get good grades, I try to get better at speaking to people despite my mutism and PTSD, I try to push past my depression and suicidal thoughts when I have them and yet no matter what I do I can't move forward. I take one step forward and my mom throws me down the staircase.\n\nI'm trying so hard to leave this house. She beats me, she yells at me, she gaslights me and even though I know I can't take it anymore and I don't want to live I keep going. I'm trying so hard to secure my future even though I don't care about the me of the present because I want to believe that I can be happy one day. But how am I supposed to get out of here if she keeps sabotaging my every attempt to leave?\n\nI want to get a job: She lies to me that I can and then proceeds to rip it away from me. Now I can't save up money to move out of here.\n\nI want to do extracurriculars to try to make my college applications better: I have no transportation to school to do it and she doesn't allow me to do it either.\n\nI want to get better and stop being depressed so I contact a councilor at school and finally get therapy: She proceeds to tell me that I was wrong for bring family business outside of the house, tells me I'm just trying to get attention, and gets everyone else in the family on her side. And she makes my life at home miserable so therapy isn't helping and I feel even more depressed.\n\nI want, I hope, I dream, I work towards it and for what? For a me I don't even care about? Against a life that keeps kicking me back down? I don't think its worth it. Its too hard. I'm not worth it.\n\nSo I want, I hope, I dream, that I die. I get crashed my a car, I hang myself, I jump of a building. Why can't this just be easy? I fight against my primal urge to die and fight against my human survival instinct. Stuck in a limbo. Miserable. Over and over and over again, trying and failing, hoping and sabotaging. Hating and hating and hating myself and life and my mother.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nl4n39/its_not_fair/", "title": "It's not fair", "social_network": "reddit", "user": "ArtistWriter", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 10, "down_vote": 0, "creation": 1621990813, "permalink": "/r/Suicidal_Thoughts/comments/nl4n39/its_not_fair/", "nsfw": false, "first_save": 1635429441.2375042, "replies_charged": false}