{"id": "t5_28vigg_t3_og3rk7", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "71ee6414-54fe-46c1-b092-5b6636504a95", "cf81d7c0-cd42-4d3e-a15d-51251de387ba", "03598834-ede5-4aab-9b0a-fc5de7674c00", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1"], "text": "I’m currently 33 weeks pregnant (start of month 8) and really excited to meet my son, but a couple months ago, at 4 months, I really, REALLY, considered killing us both.\n\nThe Biological Father and I didn’t had a long relationship, we were together almost two months before we found out I was pregnant. I was almost two months pregnant when we found out. He told me to abort immediately, he said that I can’t do this to him, that he will get in drugs and alcohol as a result of a baby he doesn’t want, that I would destroy his life and I told him that I wasn’t going to abort because I’m the one who has to live with the emotional consequences and I was stable enough to provide for my baby with a work from home.\nI told him he could leave, I didn’t want to force him to do anything, I loved him and I know there is nothing worse for a child that a parent that doesn’t want to be there, he knows it too, the pain of absent parents or parents that don’t want you (one of the things we connected on) so I made it clear since moment 1 that he could leave, I won’t ask him for anything, I will be responsible for this baby and I won’t lie to the baby. \n\nHe stayed until March, when I was 4 months, and it was the most abusive 3 months of my life (January, February and March), he insulted me, told me he doesn’t love me, punched my things (he was living with me since two weeks in the relationship because he was kicked out of his house because of reasons that he told me had nothing to do with him, later that was confirmed but it’s another story)… he really was abusive, he started to drink daily, he daily had to have at least 4 gr of marijuana and usually he mixed it with something else stronger if he was with a friend. At first he helped me, he said he wanted me to have a healthy pregnancy since I’m high risk, but then he would switch and become very violent.\nOur first breakup was one day before my birthday in February, saddest and loneliest birthday of my life, I’m without a family because I’m from Venezuela living in Spain and they are all in Venezuela, I have a hard time making real friends since I’m more committed and I don’t understand calling friend to someone who won’t be there, and I was so vulnerable because of the pregnancy that I had no strength to ask him to leave or leave myself (I wanted “leaving” to be his choice, and everyday I realise now he was making it, but I was just too… afraid and vulnerable). I really thought this break up was the end because I usually when I break up once I do it for good, but never been pregnant before…. So I cried and was feeling so bad (before pregnancy I was medicated for Chronic Depression and Anxiety Disorder), I couldn’t take my pills, couldn’t take alcohol to numb the pain, couldn’t go out because of COVID, I felt so alone, so hopeless that I thought to myself “this is the world I’m bringing my baby? A world where people use and don’t respect each other? Where you could be dying and no one cares about you? This loneliness?” the though of bringing my baby to such cruelty was a lot so I really considered just ending me, thus him. Ending both our pains even tho my baby was only suffering because I was, I now realise that. I started therapy online with a Venezuelan Psychologist that week\nBaby biological daddy wrote me after he got sober and remember he left me on my bday, he asked to come, to be with him and I told him no, if we are broken up, we are, this lasted for about a week when, with him writing me daily, I couldn’t resist anymore and he came back… \nEverything when even more downhill from there, he drank even more, drugged himself even more when in March he pushed me and I just lost it, I told him if he was crazy, that I’m pregnant with his baby, I could take all the emotional abuse and sexual abuse he wanted but not if it was at risk of seriously hurting my baby. He put his hands up and said he didn’t pushed me and he was very drunk. Short after he left definitely. We broke up because I caught him in one of my home cameras trying to get it one with a close friend of mine while he was drunk and drugged and I was sleeping a door away (I trust my friend a lot because we both know she would never do anything, for her, she was one more “gay” friend). I faced him, he told me for I don’t know what time he doesn’t want the baby, doesn’t love me and stuff and I told him “then leave and stay away, no one is making you stay or do anything). That morning he left and come back 4 times to see if I saw past his stupidity, but I didn’t, one thing was to abuse me emotionally, be cruel to me or my things, another one is to break my trust specifically (I told him because I don’t want to risk anything happening to my baby to be faithful in the pregnancy, only pregnancy, he could wake me up to fuck how many times he wanted, I never said no, not even when it hurt and tears came out, not even when he had spend 4 days without showering, being faithful for 9 months was all I asked of him if he was staying with me, with us). You see, for me, my emotions weren’t putting my baby in danger in that time BUT sexual transmitted deceases or him being physically aggressive was. Yes, I wanted to end my life but then my mama bear instinct motivated me to keep living, I always wanted a family, now I was having it, I just needed to heal without antidepressants, party, alcohol, or anything, it was the hardest thing I have ever done in my life, not killing myself in that moment or month.\nHe then left, but he reappeared a couple weeks ago, I had to move from where I was, I’m in serious debt and even created a godfundme because of it, no one has really donated. I don’t know how I will do this alone but I know that while I breathe my son will know what love, support and being unconditional is.\n\nSometimes I still feel like ending it all, it’s an impulse, like it’s all too hard, like it’s not worth it, then he kicks me and I know, life may not be worth it for me, but he hasn’t even started and it’s not my choice to decide to end it when we are so close of him being born. I will be there for him, I will teach him, protect him and let him be himself, I will support him. Because I know all too well the opposite side of it.\n\nThank you for reading\n\nEdit: I forgot to mention at the beginning that I wanted to be a mom so I told him that I didn’t care if he used condoms or not, I prefer for obvious reasons with condom but I had condoms in my nightstand that he could put on if he wanted to avoid any risk. He never used them. When I got pregnant he told me 5 partners before him had aborted because they care about him and I should do it to. I told him I was always clear that if I did get pregnant I was going to have it because for me was such a slim chance… if it happened it was meant to happen because I though I was kinda infertile because of some medical reasons and trying with an ex for 8 months where nothing happened.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/og3rk7/pregnant_and_suicidal/", "title": "Pregnant and Suicidal", "social_network": "reddit", "user": "CianuroConLove", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 10, "down_vote": 0, "creation": 1625736552, "permalink": "/r/Suicidal_Thoughts/comments/og3rk7/pregnant_and_suicidal/", "nsfw": false, "first_save": 1635428728.4243271, "replies_charged": false}