{"id": "t5_28vigg_t3_mahflj", "request": ["3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "Ive done as much research as I can and calculated the most effective and quickest ways to kill myself with what I can realistically do (ideal way to go out is to shoot myself, but I can't get a gun in my country). The best and most effective was I can do is by falling off an apartment/hotel nearby.\n\nProblem is, the last thing I want to do is traumatize innocent pedestrians/passerbys (ESPECIALLY kids or teens), or worse, end up falling on one and kill them. The whole point of offing myself is so I won't cause any harm, stress, or any negative feelings or impacts on anyone else- I never wanted to! I can't just jump off my own house where the neighbourhood is quiet since it's just 2 stories high and it's more likely I'll end up being even more of a waste of my parents' money in a hospital. Committing suicide at any of those apartments/hotels nearby might also drive their value wayy down. I dont want to be a big asshole and burden when I die by doing all that.\n\nIm desperate so I can accept settling to either hanging myself or drink bleach in private even with their good chances of surviving, and how long and *painful* it may be (I deserve the torture and pain, but tbh im too much a wuss who'd rather just jump off a building). This is also a problem since I live with my parents and sister, and it's also a BIG JERK move to make them find my body in a gruesome way and that they have to go through needing to remove and clean stuff up along with if they ever want to sell the house, me dying there would greatly reduce its price.\n\nIve made up my mind to try the apartment/hotel option (because im a wuss...), and am finally happy and looking forward for something for once, but please tell me if its 1000x better to die privately than in public. If even just one of you think so i'll just do it privately.\n\nDISCLAIMER: Dont try to say BS for me not to do it or whatever. I've decided, and trust me, this is much better than if I stayed alive. Pretty much an obligation and responsibility for the sake of others.\n\nUpdate: Ive decided thursday's a good day. Friday - Sunday are weekend days where the streets might be crowded. None of yall actually answered the Q. I really hope I chose the right option out of the two. Also if any of yall reading this want to try kill yourself- NOPE dont you dare even think about it. This is a sign from me to you. F\\*ck off, pal. Keep hanging on, I believe you can get through it/cope with whatever is going on. I hope things get wayy better for you soon.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/mahflj/opinions_on_the_least_assholeway_to_off_myself/", "title": "Opinions on the least asshole-way to off myself? Please read soon", "social_network": "reddit", "user": "CluelessRedditor121", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 9, "down_vote": 0, "creation": 1616397128, "permalink": "/r/Suicidal_Thoughts/comments/mahflj/opinions_on_the_least_assholeway_to_off_myself/", "nsfw": false, "first_save": 1635429573.2378597, "replies_charged": false}