{"id": "t5_28vigg_t3_k8wc2v", "request": ["65b8351b-5dc2-4143-a37d-f2748f6d42bb"], "text": "Tired of being the forgotten one.\n\nSorry this is a rant... I’m the 2nd of 4 children in my family. I’m 31, so I’m really conflicted about this and seeming petty. But, it’s a pattern that has occurred numerous times in my life. \n\nMy older brother was born in early august. Growing up, he had birthday parties at the beach, mini golf, go carts, etc. Even this year when he turned 33 my parents coordinated two weeks before his birthday to find a time when everyone in the family was off work so we could have dinner. \n\nMy younger brother was born in April, two days after my dad. I know he feels cheated because he had to share most of his celebrations. But he has never once been forgotten. \n\nMy sister was the last one. Born in October - the only girl. Her birthday is always a big deal. \n\nBut me? I was inconveniently born in mid November. I was born nearly 2 weeks before thanksgiving, so it was always “too cold” for a party. It was “too close to thanksgiving” for us to go see grandparents, and so on and so on. But the worst is that many years I didn’t even get an excuse. This year I was forgotten entirely by my parents. \n\nMy sister found out that our parents had forgotten (again) and reminded them - and my dad tried to give me $100 as a birthday present 3 weeks late. I took the money because I am in a really bad place right now and couldn’t refuse. But I wanted to shove it back in his face and tell him to save it for one of the kids he remembers. \n\nAm I wrong to want to be remembered? Am I petty for wishing that I had been born at a different time (or really, not born at all?)? I’ve been thinking more and more about suicide and this just seems to reinforce the idea that I would not be missed. This hurts.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/k8wc2v/im_tired_of_being_the_forgotten_one/", "title": "I’m tired of being the forgotten one.", "social_network": "reddit", "user": "International_Sea285", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1607397658, "permalink": "/r/Suicidal_Thoughts/comments/k8wc2v/im_tired_of_being_the_forgotten_one/", "nsfw": false, "first_save": 1635429157.4349136, "replies_charged": false}