{"id": "t5_28vigg_t3_ha0hjq", "request": ["00a79bcd-81e1-4f43-b640-c1d1455898f4", "b38140a1-7eee-49dc-9a69-c07b4318950c", "7e28da7a-0583-461d-a0da-99621d24119a", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "I have suicidal thoughts regardless of what time it is, but yes, I especially have them at night. \n\nI have *severe* major depressive disorder and *severe* social anxiety, so I'm a thousand times more afraid [than usual] to go outside with the current social and political climate as it is. I find myself angry at the world for being so shallow and selfish. So resistant to change. I have zero motivation to try to become a functioning member of this dysfunctional society. White people scare me. Businesses scare me. Social media scares me. Driving scares me. Seeking help scares me. My own body scares me. Hell, my phone's going to be disconnected tomorrow, and that scares me. I won't have anything to distract me from my own mind.\n\nThese are just some of the things that race through my mind while I'm laying here on the verge of being homeless. I'm pretty sure sleep isn't going to prevent me from being just another statistic...so why bother trying? I might as well stay up 'til noon, sleep 'til 5, eat a can of tuna, and do it all over again. \n\n[That was the answer I wanted to give. I'm a hypocrite for wanting the world to change while blaming *fear* for not wanting to seek help, and change my own damn self. Knowing that makes me want to commit suicide even more. It makes no sense that I'm a sad gerbil running in a wheel of self-loathing that *I* created, and at this point *it's* the one taking me for a spin. I'm so tired. I need a good ass-kicking by a gang of motivational speakers, and psychedelics. I need therapy.]", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ha0hjq/someone_on_another_sub_asked_about_having/", "title": "Someone on another sub asked about having suicidal thoughts while fighting insomnia. This was the answer I wanted to give, but I think it belongs here instead.", "social_network": "reddit", "user": "OhOhPickMePickMe", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1592298932, "permalink": "/r/Suicidal_Thoughts/comments/ha0hjq/someone_on_another_sub_asked_about_having/", "nsfw": false, "first_save": 1635429206.3374448, "replies_charged": false}