{"id": "t5_28vigg_t3_po7jrp", "request": ["029ade1a-045d-4a03-b80e-2f560fb4018f", "935370ff-2e76-44cd-b247-7eb7b997ce9a"], "text": "I am highly suicidal. I regularly think about my plan. Many days I tell myself that I will kill myself before the next time the sun rises. My ideation is becoming over powering. Every time I get in my car to go to the spot I've picked to die the thing which stops me is remembering that my best friend whom I live with would be completely fucked over. He's already tight on money and I barely have any so even if I left him all of mine it wouldn't stretch very far. Were planning on moving in a couple months but he couldn't afford financially or probably even mentally to do that without me. There's a chance he would have to move back in with one of his abusive parents. And I'd just leave my cat with him? Force him to take care of it?\nI feel so ashamed to say that sometimes I don't care about any of these things. Sometimes I want to die more than I want the people I love to have stable lives. When I used to feel suicidal I would think about everyone in my life and the emotional pain I would put them through. I didn't want to hurt anyone. I still don't but that's no longer enough. Now the only thing that is enough is the fact that it would literally fuck up my best friends whole life. And it's starting to feel like that might not be enough either. That is so wrong and evil of me. I just want to win the lottery so I can give him the money so I can kill myself without too much guilt in my last moments.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/po7jrp/im_only_alive_so_my_best_friend_can_afford_rent/", "title": "I'm only alive so my best friend can afford rent", "social_network": "reddit", "user": "justanindypunk", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 8, "down_vote": 0, "creation": 1631640949, "permalink": "/r/Suicidal_Thoughts/comments/po7jrp/im_only_alive_so_my_best_friend_can_afford_rent/", "nsfw": false, "first_save": 1635429066.2512918, "replies_charged": false}