{"id": "t5_28vigg_t3_mgqb2s", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "Several months ago i started a new birth control.  I noticed a few issues.  Mostly nausea and misplaced anger. Headaches.  Normal stuff. \n\n\nToday i realized i had been having thoughts of going off someplace quiet,  and going to sleep forever and never having to wake up again. It began with rage.  I was so angry at the world.  Began to really hate everything and everyone in it. Then came like an overwhelming tiredness. I just want it to stop.  Then the thoughts of finally having peace and quiet became more and more prominent. Except it got really dark and I started saying out loud to myself i should just go die. \n\nI was cooking today when a minor inconvenience caused me to snap and say that if i was just dead everything would be so much better.  I had to stop and realize that wasn't normal.  I've never been suicidal or depressed that i know of before and it shook me to my core. \n\nI don't WANT to actually die.  I've got two beautiful daughters and a loving husband.  Why on earth would i want to leave them forever?  My brain instantly replied \"peace\". I'm done. I'm calling my Dr first thing tomorrow and asking for a different bc because this stort of stuff wasn't anywhere near my normal thought processes and I'm actually worried it will only get worse.\n\nThanks for letting me get that off my chest. I don't have anyone i can tell this to without fear of them sending me on suicide watch or calling me overdramatic.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/mgqb2s/it_really_creeps_up_on_you/", "title": "It really creeps up on you", "social_network": "reddit", "user": "LittlestEcho", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1617139177, "permalink": "/r/Suicidal_Thoughts/comments/mgqb2s/it_really_creeps_up_on_you/", "nsfw": false, "first_save": 1635429006.3476264, "replies_charged": false}