{"id": "t5_28vigg_t3_hai21y", "request": ["71ee6414-54fe-46c1-b092-5b6636504a95", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40", "03598834-ede5-4aab-9b0a-fc5de7674c00"], "text": "I'm a single mom. My own mother drank herself to death less than a year ago. She died in my arms suddenly. I called 911 before I cradled her in my lap like a little baby while blood was pouring out of her nose and mouth. Her esophagus had ruptured from all the years of consumption of hard liquor. She aspirated on her own blood. The paramedics just didn't come fast enough. I was still hoping on hope that my dad would call me from the hospital they rushed her to and they would say she's going to be okay. We played these hospital trips a lot. And, she would come back home in a week or so. I got the call. My dad on the phone, panicked and sobbing, her husband of 42 years... 'Jenna, she didn't make it.\" I had lived with her and my dad and taken care of her for the last 5 years. But... Just like that. Gone. I called and got a ride to the hospital as quickly as my brain could function enough to dial a number. My ex husband. Please.. come take me to the hospital. Hurry, I said.... As if getting there fast would make the news any less true. Twenty minutes to get there... I'm completely beside myself.. fear, anger, everything you can imagine. I ran into the double doors in the Emergency Room... Shaking. Breathing off... Fast. Dad tells me again, through sobs and disbelief, that she's gone. I ask to see her.... Just one last time. I walk with my dad and my only other sibling through a heavy door and to the left.. then I felt myself start to panic. Knowing that they are about to pull back a curtain and she will be there. Dead. I slowly walked in. My legs started to buckle under the weight of my body.... Under the weight of my fear and hopelessness. On her back. On the stretcher that she was wheeled from the ambulance on. Intubation tube still taped in her mouth. Blood everywhere. Her face. Her hair. On those purple set of pajamas I had just helped her put on shortly beforehand. Her shoes were still on. Still tied up from where I tied them. Eyes slightly ajar. She was cold. Gone. The person responsible for putting me in this world. Gone. Just a shell. My legs went. I hit the floor. Sobbing. How could this be? My mom. The mom that was just telling me the day before to get out of the abusive relationship I was in before he kills me. The mom that tied MY shoes and got ME dressed. The mom that loved me, even if she wasn't perfect. The mom who was by my side when I went through two cancer diagnosis. Gone. I was led back out to the emergency waiting room. Sitting in disbelief. I finally made it back to my parents house a couple of hours later after I knew the funeral home had come for her body. My dad wasn't and never has been a very nice man. I knew that I would be leaving that house for good after that night.. and I did. I didn't go back to my abusive relationship. I cut ties with anyone who had contact with him, which was most of my friends and family. I took my 4 year old, called the police and went to a battered women's shelter. A safe house. No one knew where I went, and they still don't. I feel utterly alone. Devastated. Worthless. I feel pain all the time. Day and night. I have no contact with anyone who knows me. Running from an abuser is dangerous and I can't risk him finding out where I am. This is too much for me. I feel dead before I've even died.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/hai21y/single_mom_no_escape_from_the_pain/", "title": "Single mom. No escape from the pain.", "social_network": "reddit", "user": "MacabreJaith", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 16, "down_vote": 0, "creation": 1592360230, "permalink": "/r/Suicidal_Thoughts/comments/hai21y/single_mom_no_escape_from_the_pain/", "nsfw": false, "first_save": 1635429052.5972698, "replies_charged": false}