{"id": "t5_28vigg_t3_nqe6ug", "request": ["e4caf65e-8cb5-40e4-9897-4291adbe7f3f"], "text": "I’d like this to not get popular, I just can’t hold it in anymore. And I’m not looking for pity. Context: My ma and father had 10 children (5 boys 5 girls) together and I am the 9th youngest. My dad left my ma to raise the kids herself, grew up very poor except brief periods where my ma would get a bf to take us in. My father showed up a few times and it was always to make life hell for my ma and he was very manipulative. (I got to watch my ma be placed in cuffs and taken to jail at 4 years old). My father manipulated my sisters who have become quite manipulative themselves and for my 18th birthday I spent it alone in a cheap motel down the road from my house because my little brother was manipulated into telling police that he wanted to kill himself because I made him feel unsafe and that I held him at gunpoint and threatened to kill him but I would never do that. It’s not in my nature to be mean or violent. I’m like Ferdinand the bull. I’m 6’ and 270lbs and pretty stout/muscular so I look intimidating but I’m really a teddy bear. So I’m 18, just finished HS and am heading to trade school for underwater welding in September-October and I’m a really smart and talented guy. I grew up around cars so I can assemble and disassemble engines and work on cars, I can work on diesels (semi trucks and pickups), I took manual machining and welding at an early college in HS and I love both. I found out I was naturally gifted at welding. I grew up quite poor and my parent (just my ma because my dad left when I was 1-2) was never home because she was a tractor trailer driver. We lived in a really shitty home that didn’t have hot water, didn’t have electricity for a couple months( we were dirt poor for a while) and was over 100 years old and falling apart. When stuff would break at home I was always the one that had to suck it up and fix it whether in the cold or rain, I would split logs in the winter and stay up to keep the fire going in the winter, when the well pump broke or pvc pipes broke because the water froze and cracked/burst them I was the one who drove illegally (I was about 14-15) to Lowe’s to get supplies and I would fix the stuff. Needless to say, I’m extremely handy and as a lot of real world experience by the time I was done with HS. I was having a conversation about being an underwater welder with my ma and I said I don’t really have a comfort zone to which she she agreed then said “you were raised in a very high stress environment” and she also told me that I was the one child out of the 10 that hadn’t betrayed or thrown her under the bus and that her will is that I get everything. What’s a kid supposed to do with that info? In any case, my ma loves the beach and ocean and has always LOVED catamarans. The one thing that really keeps me going is becoming an underwater welder so that I can buy her that catamaran and set her up for the rest of her life so she can retire (she’s 53 and won’t be able to retire still for a WHILE) and once I do that I don’t really know what to do. My dream is to be an underwater welder so once I do that then what? My other dilemma is that I used to be very family oriented but I’ve dated a few girls and was taught only that nobody wants nice guys and that I’m too nice for this world. I think I’m just gonna disappear after I set my ma up. I’v got the old world blues and I’m not built for this world. Once again, not looking for pity, just lost. Ive had a rough life, this was just a dent I the surface, but I haven’t had the worst life. I really would consider myself a happy person so I’m not complaining. Thought I should come back and say something worth reading: if you’re the smartest person in the room, you’re in the wrong room. Strive to gain more knowledge from people who will teach you and challenge you to be better. Be the dumb one in the room every once in a while, the path to success is never comfortable or an easy one. Step out of your comfort zone. Be better.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nqe6ug/just_putting_it_in_words/", "title": "Just putting it in words", "social_network": "reddit", "user": "Devilsrequiem", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1622611224, "permalink": "/r/Suicidal_Thoughts/comments/nqe6ug/just_putting_it_in_words/", "nsfw": false, "first_save": 1635428898.2115068, "replies_charged": false}