{"id": "t5_28vigg_t3_fn9fmz", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "I am so tired of being alive I want to smash my fucking head into my steering wheel I have so much anger right now I absolutely hate my life. I can’t find it in me to live anymore I have a son and I can’t pretend to be present anymore when all my thoughts are on my own demise.\nI have NO friends absolutely no one hits me up or talks to me I reach out to people and the conversations go flat and they never reach out it’s always me. No girls like me or want me I’m ignored. The only people who talk to me are my parents and I’m 31 I don’t want them to be the only people who text me or call me it’s so sad going over there and hanging out with them cause they are the only people who want to do anything with me. I can’t spend another day living my life with this isolation and being deprived of any connection what so ever I haven’t felt another persons touch in so long. This is turning me into a monster I hate seeing other people happy or seeing people in relationships especially when they’re ugly I would take a ugly or fat girl (not to sound shallow, I literally think everyone is attractive in a way) at this point just someone who gave a shit about me. I spend all my time alone in my room if I’m not with my son. And when I’m with him he’s so demanding of me and my attention I just feel like I’m his personal toy I feel like I have no identity and I just want to die. I tried believing in god and watching a lot of inspirational videos and I just get nothing it’s like my life is just one big rain cloud I want to get struck by lightning but that would take some kind of divine intervention and I already know that god has no interest in showing me mercy even if it did exist. My life is pathetic I am sad I am angry my eyes feel like they are boiling and my heart feels like it’s on fire.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/fn9fmz/feel_my_pain/", "title": "Feel my pain", "social_network": "reddit", "user": "atmwannadie", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1584919116, "permalink": "/r/Suicidal_Thoughts/comments/fn9fmz/feel_my_pain/", "nsfw": false, "first_save": 1635429324.405864, "replies_charged": false}