{"id": "t5_28vigg_t3_nx6puw", "request": ["17a9b9d7-ff9b-41b7-9002-7b804d6d8d40", "27706836-2f69-4384-a3d8-704484ace7d8"], "text": "I have struggled with depression for my entire life and 7 months ago after dropping out of college I wrote a note at 3am. Since then I have started therapy, but I dont feel comfortable sharing this with my therapist. Figured this was the next best thing\n(Trigger Warning Sexual Assault and Self Harm):\n\n\n\nI’ve spent what seems forever trying to figure out exactly the right time and place to reveal my mind to those I believe deserve it. Considering I don’t believe that even I deserve it has caused a struggle. I’m 19 years old, and yet I feel like I’ve lived a lifetime, despite only remembering 7 years of my existence. I don’t know why this is titled ‘Just In Case’. I’m not sure if it’s a way for myself to remember why I chose to stay, or if it’s a way for everyone else to understand why I chose not to. I’ve found myself so consumed by the idea of becoming the ideal person, a life filled with a successful career and love, that I’ve become a shell of a person. Without any idea of what I wish to do with my life. Without any idea of who I wish to spend it with. And a simple answer would explain that’s the point. The point of life. The point of the unknown. Take what you got and go with it. It seems like such a simple concept, and yet, the human brain is hardwired to be selfish and greedy. We are hardwired to believe that the creation of the world and universe centers around the idea that there’s a meaning behind us being here. For the past 7 years I’ve worked my ass off. I’ve taken nearly every honors and AP course at my disposal to build the grades because you need the grades to get into college and you need college to get to the career. I’ve tried multiple sports to fit into a crowd and find something to keep me fit and healthy. I’ve worked multiple mind-numbing jobs because in order to get somewhere in life you need the financial means to do so. I found and remained in a relationship that started off cute and innocent but led to toxicity and pain. Because you need to start somewhere to get to the love part. \n\nAnd yet, despite all my best efforts, I sit here at 19 years old which, without disastrous intervention, should leave me with about 62 years until I reach the average age for a woman living in the United States to die. I am a college drop out unsure of her career path and without a lead on a possible love interest. \n\nTo the outsider looking in, you’d think I have all the time in the world to figure out my life. There’s no simple answer to the complex problem I’m trying to solve. I have plenty of time to travel the world and explore my interests, figure out what I’m passionate about, and set on a path that will lead me to a happy and fulfilling life. \n\nBut we’re in the middle of a pandemic. It’s the night before the worst presidential election in history with a potential civil war looming overhead, regardless of the outcome. I have less than a week before I start yet another menial part time job to hold me over until I figure out my “next move”. If I even figure out a next move. \n\nI’ve lived 19 years. I remember 7. And I feel like I’ve wasted all of them.\n\nI’ve spent my years recollecting and obsessing over memories of childhood molestation, brief experiences with bullying, and the connection between my relationship and sexual trauma. I’ve spent my days evading my feelings by focusing on school or work or sports. I’ve spent my nights wallowing in the pain of my past, trying to figure out a reason why I feel so much pain and why nobody else seems to notice.\n\nI’ve spent my time blaming everything that’s wrong in my life on somebody else. Waiting for someone to tell me I need to get help. Growing more and more angry everyday by the lack of help I’ve received from people who are supposed to know me the best. All the while, I’ve had every single day of the past 19 years to reach out for help. To ask for what I need. And to get the treatment I deserve. \n\nI don’t fully believe that my friends and family are in the wrong because I know that I could’ve reached out. I can’t expect people to read my mind. And yet, they could’ve just as easily recognized my pain. Seen the signs. Help me. \n\nOf my 7 years of memories, a couple stick out more than others. I can vividly remember standing in my bathroom with a pair of nail clippers cutting off the skin of my thigh, not yet figuring out a way to get a razor blade to properly cut myself. I can vividly remember the day I was 15 and my boyfriend begged me to have sex with him after weeks of me saying no. Eventually coercing me, using the phrase, “If I say yes will you please shut up and leave me alone”, as a form of consent. I vividly remember going to sports practices with blood running down my thighs, going to the bathroom every 30 minutes to make sure my fresh cuts were covered, only to return to have the team single me out for something they assumed I had done. I vividly remember my mother looking at my cut marks and saying, “it looks like you’re cutting”, only to never bring it up again after a weak excuse that she seemed to believe. I can remember my sisters speaking of how I’m the boring sibling and how they don’t understand how people would want to be friends with me. \n\nIn the past 12 months, I’ve become a medical mystery, visiting doctors non-stop. Getting tests done only to be told that nothing’s wrong with me. Making me feel like I’m over reacting and the pain is in my head. \n\nI had a roommate who told me that I reminded her of her toxic father aftering ignoring me for 3 weeks while living in the same room. Normally I wouldn’t give a shit. Among my friends I’m known as the girl who doesn’t put up with bullshit. But at home growing up, I picked and chose who I told what. I would tell one friend about one struggle and another about another problem in my life. Just enough to allow me to vent, but never enough to let them put the pieces together and figure out how much of a mess I was. When I went to college and got a fresh start, my roommate was the first person I told nearly everything. I laid it all out on the table. And months later she made me seem like a monster incapable of living with, despite the countless nights I sat on the shared bathroom floor at 3am while she had sex in the room. Despite the time I woke up in my bed and had to pretend to be asleep for 2 hours while she had sex in the same room as me, fully knowing I have past history with sexual trauma. \n\nThis has turned into a feel bad for me session and I’m annoyed about it. Fuck that. No one has felt bad for me up until this point so why should it start now. Truth is fuck life. I’ve spent the past few months trying to figure out if I’m so miserable why am I here. Why am I staying if I feel no love or compassion towards my family and friends. And the only thing I can come up with is that I feel so abandoned and let down by their lack of concern for me that none of them deserve to mourn me. They shouldn’t be allowed to show their sorrow if they don’t know what I truly went through. They will truly never know the pain of what it felt like to sleep 3-4 hours a night every night if I was even that lucky. To lay on the floor silently sobbing while everyone in the house slept like a baby. There’s nothing I can say to show them why I’m hurting.\n\nI hope I can find another reason to stay. \n\nAnd if I don’t, deep down I know it was my fault. I know that I was wrong. And I’m sorry for hating you in my mind for the 7 years I can remember. I hope you can forgive me.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nx6puw/i_wrote_a_note_7_months_ago_and_i_need_to_share_it/", "title": "I wrote a note 7 months ago and I need to share it", "social_network": "reddit", "user": "friedpickles_22", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 9, "down_vote": 0, "creation": 1623383800, "permalink": "/r/Suicidal_Thoughts/comments/nx6puw/i_wrote_a_note_7_months_ago_and_i_need_to_share_it/", "nsfw": false, "first_save": 1635428883.950462, "replies_charged": false}