{"id": "t5_28vigg_t3_pcf6cl", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "Don’t do it. I moved to a new country four years ago. I had no friends, life was a boring as it could be. This probably had to do with the fact that my parents were and still are uptight. I lived my life trying not to be a bother to other people, I had insane anxiety. I didn’t want to be noticed. I felt solace by my own company. Or so I thought. Over the quarantine, I lost the knack for playing video games because it was all I did. I didn’t have people to hang out with, sometimes I would literally cry myself to sleep. Al I did was eat and sleep. My parents are nice people, they simply couldn’t notice due to them working a lot. Then last year I actually decided to go to the gym. I actually got addicted to going because I was actually occupied. I would rate myself an 8 in looks, it was just a matter of confidence. I actually started looking forward to waking up. I decided to try new things like food, different movie genre and finally fashion. I really enjoyed buying clothes and the feeling of not being average. I actually want play this out as long as I can. I saw progress on my Instagram, I went from 261 followers to 361k in like 5 months. In conclusion, most people out there don’t necessarily care what you do as long as it does not hurt them. Live your life for yourself, be confident not obnoxious, if people think you’re a burden, you’re definitely doing something wrong or they hate their life as well. Don’t try to fit in but compromise when you can. I have a lot of advice but I don’t want to drag this any further. If you actually want any more advice reach out to me.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pcf6cl/in_case_you_want_it_to_end/", "title": "In case you want it to end", "social_network": "reddit", "user": "mimexxx", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 14, "down_vote": 0, "creation": 1630034819, "permalink": "/r/Suicidal_Thoughts/comments/pcf6cl/in_case_you_want_it_to_end/", "nsfw": false, "first_save": 1635429217.0612743, "replies_charged": false}