{"id": "t5_28vigg_t3_n241ak", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab"], "text": "Not to worry, I'm not contemplating making an attempt. Figured I'd put this disclaimer out there...\n\nHere's a little backstory about myself.  \nBasically, been living with depression for the last 15 years and at first I thought it started 6 or 7 years ago with a break up that drastically affected me since then, but I've been depressed even before that. Just so happens, that relationship helped me get through it (until it ended ofc). I'm sitting here at the age of 30 realizing that I despise what and who I am and I cannot stand the thought of being alive for another 10+ years. Evidently I had perfect health, don't drink, don't smoke. I live rent free and have no fear of being kicked out, yet I am miserable af.   \n\n\nFor the past 15 years, I would have moments of enjoyment where I briefly forget what is troubling me and I can feel joy and contentment. However as of 2 weeks ago, I lost the ability to keep up this façade. I am constantly miserable, lost complete interest in the things that once brought me some sense of joy. Even waking up, eating, and doing the aforementioned things feel like a chore. Living just outright feels like a job in of itself that I simply do not enjoy. I haven't actually smiled in forever.   \n\n\nToday, I even attempted to look at pictures from a city in another Country to reminisce about the aforementioned relationship (because I traveled there to visit her) so I could see if I can feel some sense of joy again, but atlas, it only made me more depressed. I am going to be doing something related to the hobby I \"enjoy\" tomorrow, but I am not looking forward to it. I just feel blank. I haven't even done my usual exercises (4 hour walks each day) because why bother? I have no intention of making something of myself because I do not respect nor like myself. People say to \"love\" yourself but how can you love something that makes you repulsed?   \n\n\nThis brings me to the topic: Why is it inhumane for our suffering to be ended? Why is euthanasia (in most places) for the depressed against the law? We put animals away that are suffering from life threatening illnesses with no chance of recovery, so why can't the same be done for a human suffering? Mental health is just as important as physical health and if someone doesn't have the will to keep doing or fighting, why prolong their suffering?   \n\n\nTo what end does this happen? So we can just pay taxes? Is that why were are kept alive? In case we make a difference in the world? That's not going to be what becomes of me. I have no interest in helping myself or anyone else as selfish as that sounds. I didn't ask to be put on this planet the way I am. I did not ask or want to be in the bottom 5% of the human race.   \n\n\n  **Dr. Lieve Thienpont of Belguim** understood this. She understood that people should not be made to suffer a fate they feel they could not overcome. She ended the suffering of those that rationally decided that there was no other end to their suffering. It was criticized, but was it wrong? I don't think so. The important thing is those people are no longer suffering.  \n\n\nHonestly, I'm just living my life in a zombified state. Wake up, eat, go to sleep, repeat. I have no motivation to do anything else. A 24 hour day feels like 48 hours to me. It's just dragging.  \n\n\nSo again I ask, what's the use of prolonging someone's life who doesn't wish to be around and is constantly miserable? Is that really humane?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/n241ak/why_is_it_not_deemed_inhumane_to_force_people_to/", "title": "Why is it not deemed inhumane to force people to live a life they do not wish to live?", "social_network": "reddit", "user": "LifeBytes123", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 8, "down_vote": 0, "creation": 1619818550, "permalink": "/r/Suicidal_Thoughts/comments/n241ak/why_is_it_not_deemed_inhumane_to_force_people_to/", "nsfw": false, "first_save": 1635429267.574049, "replies_charged": false}