{"id": "t5_28vigg_t3_p64b9j", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40", "b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "I’ve felt helpless ever since I had my child last year. Even before, my pregnancy was brutal mentally and I have never experienced such a painful void until that point. I have been battling with suicidal thoughts and borderline actions for awhile, and the only thing that stops me is the thought of my partner having to raise our son by himself. I don’t think he’d be able to step into the dad role let alone the mom role if i left. I feel trapped. On top of that, my partner is a psychotic narcissist that does not know how to express their emotions and communicate. It’s always anger and frustration over anything. So, naturally, that has an influence on making my emotional and mental state worse. I opened up to him about a month ago that I wanted to leave this planet every day, and that I’m saying something now because I’m scared that I actually might. He expressed his concern and wanted me to get help. But no actions after that showed me that anything I said actually got through to him. So a few days ago, I had a breakdown and was just short of offing myself, and this man just hugs me and goes upstairs to call his friend about football not even a minute later, and then leaves. He left me alone in the house minutes after my breakdown, as my eyes were still swelled, with our son in the bathtub. I’m not sure what to do at this point. It seems pretty obvious to leave but I feel trapped because he’s the father of my child and now I have to deal with him forever.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/p64b9j/i_dont_know_what_to_do_anymore/", "title": "I don’t know what to do anymore.", "social_network": "reddit", "user": "No_oneforeternity", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1629208676, "permalink": "/r/Suicidal_Thoughts/comments/p64b9j/i_dont_know_what_to_do_anymore/", "nsfw": false, "first_save": 1635429308.4363258, "replies_charged": false}