{"id": "t5_28vigg_t3_otvn8i", "request": ["20e5f323-e2c4-450a-8af3-177af94313bf", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "It's been a year since the last time I thought about suicide. At that time, my mum lost her job. I wasn't working either, but I was (and still am) at college. This was a couple of weeks before covid-19 (I'm from Spain). My father had told me to seek therapy, he saw me in so much anxiety. I had problems that I needed to face. I was bullied when I was little. I used to self-harm. I didn't have self esteem. It's such an irony the fact that I study psychology and I have so much trouble seeking help. I remember one night crying at that time, thinking about how much I wanted to kill myself, I was contacted for a oportunity working at a hospital (I studis radiology image before psychology) and my phone was in silence mode. I didn't picked up. My anxiety levels went so high... I felt so gulty... I felt like garbage, like I wouldn't be able to pass my exams, my parents would reject me... I had all this distorted thoughts... Luckily, they called me again, I started working at a hospital when covid started. I had to go to a motel because my dad has  Chronic obstructive pulmonary disease (COPD) , and I didn't want him to catch it from me. I started therapy, it was a low process. I remember wanting to jump out of  my motel's room window. But I dind't. And I'm so glad I'm stll here. My psychologist has helped me SO MUCH. I just want to give hope for the people over here. You can get out of this shit. It takes work but holy fuck, it's SO worth it. I'm still working at the hospital, my mon found a new job, I'm dating the sweetest guy in the world who takes care of me and understands me. Life can suck but it can be AWESOME. and it can get better. I promise.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/otvn8i/i_used_to_think_about_killing_myself/", "title": "I used to think about killing myself", "social_network": "reddit", "user": "RefuerzoNegativo", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1627558065, "permalink": "/r/Suicidal_Thoughts/comments/otvn8i/i_used_to_think_about_killing_myself/", "nsfw": false, "first_save": 1635428961.7976232, "replies_charged": false}