{"id": "t5_28vigg_t3_jd1nk8", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "90472b3c-14c3-4a56-be61-333d4f5dd86c", "935370ff-2e76-44cd-b247-7eb7b997ce9a", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "I'm 32, unemployed and a leech on society for the past 3 years. My parents are in their 60s, both retired and living off of meager savings. Both my younger brother and sister, both could have had their own families now, had the unfortunate task of being breadwinners for trying to provide for their elderly parents and their worthless pig of a eldest brother. We all live in one residence in the city and ever since my whole shit started, the ambience changed dramatically. No longer are there fond chats and talks about day to day activities, game nights, laughter, eating out. None of those anymore. Only silence, each minding their own business, only talking when needed. Quarantine just made it so much worse. I can see it in their eyes even if they don't speak. The disappointment, the regret, the fact that it is because of me that we're no longer a happy family.\n\nI feel the same hundredfold: disappointment, regret, failure, despair. Suicidal ideation is a permanent fixture of my everyday life for 3 years. Praying to whatever higher being or power to give me a stroke, aneurysm, heart attack, whatever, and kill me while, all the while feeling sorry for myself and crying myself to sleep, only to wake up the next morning, disappointed that I'm still alive for some reason. Therapy? Right. Because I need more reason to impose on them and bring us more into debt. Bullshit.\n\nI was always a good student. Top marks, got along well with both teachers and classmates, with a few close friends. People expected me to be successful at my chosen field. Had a job but quit on my second year because I was too weak and cowardly and didn't grit my teeth hard enough. Everything was a fluke apparently. Even people I know who repeated years in college have more successful lives than me. Depression hit me hard. Distanced myself from everyone. Blocked phone calls. No one succeeded in reaching out. Not that it mattered. Why push myself, a freaking wreck, into their lives anymore? Burdening my family is enough. \n\nFor the past 3 years, I immersed myself in video games and youtube and filled my brain with trash. Tried to seek online companionships but to no avail. Sucks for me to believe that any meaningful relationships can happen online. Never. I feel like an infected foot. Something you cut off entirely so the rest of the body can live in harmony. I feel like I'm stuck. I can't go back to the workforce because I don't know anything anymore. All the things I've studied for are no more. What a waste of money I was. And I can't kill myself either because I don't wanna feel pain. I'm a coward through and through. In limbo. A very very very tiring limbo. If I try to think of what I'll be like 5 years from now, all I see is darkness. I hope I'll be dead by then. It would have been nice to kill myself now. Covid is an easy excuse that my family can tell other people for the reason of my disappearance. I don't need to be here. I have no purpose but to be a burden. Good thing I don't have children and I never planned to have any. Imagine the shit that those kids will go through. At least my pain ends with me when I'm dead. As for my family, so what? They'll grieve for a few months and get over it eventually. And they'll realize how happy they are now that I'm gone. I know because my mother actually told me in my face once that I am the reason they're not happy anymore. Told me to just go wherever I want to. Who knows. Maybe one of these days, I'll just leave and die on the streets and my body will be found in a ditch somewhere. Bonus points if I die of Covid. Can't wait to die. 2020 is already a crappy year anyway.  \n\nP. S. Don't bother commenting. Empty words from random people I don't know.are worth shit.\n\nP. P. S. If you know a way to commit suicide without pain, pls DM me. I wanna try it.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jd1nk8/limbo/", "title": "Limbo", "social_network": "reddit", "user": "Criomede", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1602963534, "permalink": "/r/Suicidal_Thoughts/comments/jd1nk8/limbo/", "nsfw": false, "first_save": 1635429038.0618248, "replies_charged": false}