{"id": "t5_28vigg_t3_p13rzf", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "Lately I’ve been feeling super depressed. I was living on a small island for 10 months and some shitty things happened that had me feeling drained/traumatized. At night especially I have a lot of suicidal thoughts. I would never actually do that because I wouldn’t want to hurt my friends and family. It sucks because I feel like I’m basically only staying alive for my friend and family but I’m so sad that I’d rather not be. I feel so tired everyday and it takes me so much energy to do basic things. Some days are better and I’ll go out and do photography which makes me feel better. I’ve also been hanging out with me best friend a lot lately because she’s moving to DC on august 12th. Also for some reason every she and my family does annoys me lately. In general I’ve been feeling very irritable about small things. I think I’m also stressed about my masters and if I’ll get in the program I want. I really want to just start my masters right now but I have to apply now and start a year later. There are things that make me happy in life and that I’m looking forward to but those things seem so far away. It sucks because I feel like I have to stay alive but I feel so miserable so what’s the point. Also my life is a lot easier than other people I know so it makes me feel bad that I have so much privilege but still feel so sad and lazy/tired all the time. It makes me feel like I’m ungrateful and unable to handle the smallest things life throws at me.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/p13rzf/dont_see_the_point_of_anything_so_exhausted/", "title": "Don’t see the point of anything, so exhausted", "social_network": "reddit", "user": "SituationZestyclose1", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1628523096, "permalink": "/r/Suicidal_Thoughts/comments/p13rzf/dont_see_the_point_of_anything_so_exhausted/", "nsfw": false, "first_save": 1635429255.386779, "replies_charged": false}