{"id": "t5_28vigg_t3_oogc6j", "request": ["029ade1a-045d-4a03-b80e-2f560fb4018f"], "text": "I have too many responsibilities to actually kill myself, I just need somewhere to speak I guess.\n\nI don't ever really remember being happy. My mum started getting sick when I was still in single digits and my dad has always been the way some dads unfortunately are. I was never close with my one sibling because they're born from a different man and was always so violent towards my mum, and the friends I had growing up would only keep me around if I was funny. I learned very early on that I was born because of my dad's abuse and he's not even my biological father, so I never understood why my mum would still subject me to him every weekend after they separated. They seperated before I was born so we never shared a house together as a family. My step parents weren't ideal growing up either, although I have to merit them for trying. I never felt a solid connection to anyone in my family apart from my mum, but having to start caring for her while I was still in school meant I didn't really have a support system with her either. I felt so guilty when my mum found out I was cutting because she didn't know what to do and she should have always come first and not have to worry about me. I grew up feeling very lonely and not learning how to communicate with anyone properly, just navigating how I behaved person-to-person to keep myself safe. I don't remember being fully looked after when I was upset and as a result, I still don't know how to manage my emotions.\n\nGrowing up I never really cared about my education because I always assumed I'd kill myself before the results even mattered. I got good secondary school grades but completely let myself down in my A levels and didn't go to university. I ended up not killing myself/disappearing like I had planned because of a few really good friends I had made and the guilt I would feel if I left them behind, so I felt lost.\n\nAs soon as I was 18 I was pushed out of the home to go and live with my boyfriend. I've always loved him more than I can describe and we were planning to live together anyway, but I wasn't ready for my family to show up at his house with all my belongings shoved in bin bags and leave them there. They got rid of my bed too so I had no choice to come back. This put strain on me and our relationship and I broke up with him once because I needed to run away, but he took me back and he's been my rock ever since. \n\nI find myself sat in my own house that we rent together, happy, cared for, a few years later, unable to sleep. Every small inconvenience I immediately hear the voice that tells me I should kill myself. Every bad call at my job that I hate that I need just to pay the bills sets me off, every time I don't know what face to make in a conversation, every time I see how much weight I've put on in the mirror, every time I think about my parents and how they feel like a distant memory, every time I cook a dinner or eat something I don't like, every time I think about an appointment I have to go to, every stubbed toe, every ripped pair of jeans, every responsibility I have makes that little voice sing a bit sweeter.\n\nI can't kill myself because I have people that I would stay alive for now, but I don't think that voice will ever go away.\n\nThank you for reading. Tell your parents you love them.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/oogc6j/it_never_goes_away/", "title": "It Never Goes Away", "social_network": "reddit", "user": "dksch-ha", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1626832571, "permalink": "/r/Suicidal_Thoughts/comments/oogc6j/it_never_goes_away/", "nsfw": false, "first_save": 1635429069.5395129, "replies_charged": false}