{"id": "t5_28vigg_t3_ihfssy", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "Just about what it says. I have lived through several serious suicide attempts, and I'm very quickly slipping back down. I don't particularly want to die anymore, but I am simply too beaten down to fight much at this point.  My family and my wife are the only reason I'm bothering with the pretense of self preservation, and even then, the cold reality, not believing in an afterlife or anything concretely religious/metaphysical, that when I die it will be a total erasure of the self, the psyche, the \"soul\", as it were, really bothers me. Makes me more depressed, more kind of just looking for an excuse to opt out early instead of live in constant existential horror. Im not really sure what Im looking for here, or anywhere else. I don't have a calling, goals, any real amount of self respect, etc. I'm just exhausted. Physically, emotionally, and psychologically I'm at a breaking point. I've cut myself to the bone several times in the past couple months, and i can't shake the feeling that I'm living on borrowed time, or the suspicion that I'm warming up for something more serious and final. I've tried to talk to my wife about it, but the topic in general is so painful for her that it just ends up scaring the shit out of her without any resolution. At this point I'm really trying to find literally anything I can successfully hang onto, but it's just getting worse, and I'm withdrawing more and feeling emptier and more isolated by the day.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ihfssy/testing_the_waters_here_a_bit_suicide_survivor_on/", "title": "Testing the waters here a bit. Suicide survivor on the decline.", "social_network": "reddit", "user": "Canariel", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1598508631, "permalink": "/r/Suicidal_Thoughts/comments/ihfssy/testing_the_waters_here_a_bit_suicide_survivor_on/", "nsfw": false, "first_save": 1635428925.8605874, "replies_charged": false}