{"id": "t5_28vigg_t3_jhgaip", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed", "90472b3c-14c3-4a56-be61-333d4f5dd86c", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "After briefly browsing this subreddit I can see that this is nothing more than an echo chamber of depression, sadness, angst, and hopelessness. So, I'll throw my 2 cents in since I'm in the same boat. \n\n&#x200B;\n\nMy story starts in early high school. Natural progression and growth native to every societies' youth are the milestones I move to and from during those years. Typical, expected, just uniquely mine in an original way because of my choices. Unfortunately, I made some choices that ended up being mistakes. I made choices that were risky and didn't pay off how I would've liked. Most people would consider these types of things failures or consequences. Depending on your worldview, emotional maturity. intellect, and wisdom you might consider failure a good thing, a bad thing, or a combination of both. To me, all my failures have been dreams that suffered brutal deaths. \n\nEvery sinking feeling I've experienced hasn't been a drop from positive emotions to negative ones or immediate sadness or loss of hope. No, those are write off explanations. That sinking weight was really just another anchor hooking into my soul and dragging me a little deeper into hell. Only recently have I realized this as I feel like I've jumped off a seaside cliff and I'm now deep in the water after impact. Yet, like being under the waves, there is a certain calmness to realizing my reality. \n\nImagine your dream partner declining your most heartfelt exclamation (and offer) of love towards them. Imagine that happening multiple times. How many times could you keep trying?\n\nImagine your dream career slipping through your fingers after fighting through shit job after shit job and the debt/demanding schedule of an accelerated college program. Can you work any job knowing the rest of your life you fell short? Do you care to do anything more than pay endless debt your whole life?\n\nImagine having the ability to learn nearly anything just enough to be interested in pursuing that subject further only to lose all momentum and face nearly insurmountable resistance from internal and external sources that prohibit any meaningful progress. How many things could you pursue before you couldn't take being denied anymore? \n\nImagine loved ones around you that support you in almost every endeavor. Now imagine a religious doctrine that guides all moral, ethical, and to some degree financial decisions and all wisdom from certain parties flows from that doctrine. Now imagine hypocritical well-wishing and encouragement to \"chase your dreams\" or \"only do what you love\". Hypocritical? How, you may ask? Imagine those same parties with that well-wishing following up to demand you about face and immediately do what is \"necessary\" so that you can \"move on\" with your life. \n\nDream big but, only when you're within socially acceptable norms and expectancy. Also, you're not dreaming if you wander outside of those bounds because dreams and success only take monetary, financial, and superficial forms. How much hypocrisy could you take before you doubt even the greatest of intentions? \n\nHow many times could you come to the same conclusion before you'd realize there's little you can do to change anything? \n\nHow much would you have to lack before you realize you won't ever be enough?\n\nHow can you claim to have your own life if you only live it for others?\n\nHow do you have hope when all windows of opportunity have been missed?\n\nI have answers to all these questions, and I'm surprisingly calm about it. I'm holding on to life for right now. Every time I've come close to ending it all I've stopped. For one, I have a close loved one that has suffered from suicide in the past. So, to put them through it again is an agonizing thought. \n\nFor two, there are many close friends and loved ones that rely much on my life. I'm an inspiration, a motivation, a light, a joy, an influence. I hate that I am those things sometimes. If I wasn't I most likely would've killed myself many times over by now. \n\nFor three, I think I hold onto life because of what I've been taught. I was taught to fight, and to fight for others. Life is valuable, almost invaluable. It's worth every suffering, so they say. The ole, \"Why have a permanent solution to a temporary problem\" saying seems to sum up the darkness for most occasions. Yet, what do you do when your world is all darkness? \n\nI've struggled with suicidal thoughts since early high school. I was 13, and I imagined that if for some reason I hit an extreme low rather than high by my 25th year I'd commit suicide. Well, I'm 25 now, and I almost feel like this is inevitable. All my dreams are dead at the moment. I have little to live for in my own pursuit. I live merely for others at this moment and even those reasons are dwindling more each day. I have honestly tried very hard at many things. None of them really took off the way I imagined them. Some things I did really well with/at but their impact seems to have little sway over how I think nowadays. \n\nI'm empty. I don't care anymore. I'm not the type to go down a flaming wreck by throwing everything to the wind either. I'll go quietly, with many apologies left behind to aid the grieving.   \n\n\nSo, there's my 2. Maybe this post was helpful and in a relatable way. We all hit rock bottom. I guess we're all asking the same question too. \n\n&#x200B;\n\nWhat makes life worth living?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jhgaip/fated_end/", "title": "Fated End?", "social_network": "reddit", "user": "JollySwagman95", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1603572050, "permalink": "/r/Suicidal_Thoughts/comments/jhgaip/fated_end/", "nsfw": false, "first_save": 1635428924.9585657, "replies_charged": false}