{"id": "t5_28vigg_t3_jfzoa2", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed"], "text": "Where to start.. I've had suicidal thoughts for the last several years and have a pretty decent plan for when the time is right. My problem is, I feel forced to live, which has caused some resentment at times, and definitely feels like a curse. If I could die right now, and not even finish this message, I would!  But, my kids which I get every other week, would be crushed if I was that selfish. I so badly want to be selfish! I dont have any friends, not even acquaintances really.. just a loner, and this message is as close to me putting myself out there as I've been in years.  Im extra careful about my body language, especially around my kids, and do everything in my power to hide these feelings from them, so I have good awareness is what Im saying..  Anyway, a few years ago my daughter who's so intuitive,  comes to me, sad face, hugs me, and says \"dad, I couldn't live without you\", and then looks into my eyes and says she loves me.  I cant even begin to describe the feeling I felt..  just how... how could this little one know! Anyway, I saw a message on here which prompted me to write this today.. we all die eventually, why not wait until it's the right time.. I cried.. when will be my right time?  I'm only 39.. I have half my life to live yet, if I'm to die naturally that is.. sure my kids will grow up and may not need me everyday, which could be an opportunity... but I'll always remember those little eyes looking into my soul that day, so when is my right time?  No way I can do this for another 40 years, I'll end up in the hospital for sure...  I'm clearly depressed, and I get anxiety attacks, which, those in themselves make me want to just end this garbage filled life of mine.  And yes, my kids are not garbage, they are the most positive thing in my life, and their a big thing at that.. but as I said, I feel forced to live. I dont want to live!  I dont want help, I dont want relationships, I dont want anything.  My mind is cloudy, its getting harder each day for me to feel like I have any substance at all.  I actually feel like I'm getting stupider as I write this message, like my brain is slowly shutting down over time.  I've done research and have come to the conclusion that the root of my anxiety attacks stem from helplessness.  And that's just dumb!  Like I go into a full blown anxiety attack if my nose is runny and I feel like I cant stop it.  How screwed up am I.. I've always been super hard on myself, not sure why.  I know it started as a kid.  While others complain about being bullied by the big guy.. there's me.. bullying myself mentally, telling myself how worthless I really am!  The one person in my life that I decided to be vulnerable with, turned out to be gay and left me. So, needless to say, no one else will ever be in my inner circle again!  Sucks when you realize your living a lie for so long. I've gone through the stages of grief so many times already, that parts of me just feel numb. Yep, that's me, no problem feeling grief, but can't just be happy for the life of me..  Ah well, one day I'll just say F it who cares if my kids are sad... it'll only be for a few weeks, and they'll get over it, they're old enough..", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jfzoa2/forced_to_live/", "title": "Forced to live", "social_network": "reddit", "user": "Cautious-Fall3679", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1603373505, "permalink": "/r/Suicidal_Thoughts/comments/jfzoa2/forced_to_live/", "nsfw": false, "first_save": 1635428924.1383686, "replies_charged": false}