{"id": "t5_28vigg_t3_lqj8j5", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "b38140a1-7eee-49dc-9a69-c07b4318950c", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1"], "text": " I (19 yrs M ) have a friend (20 yrs F) and yesterday she had an anxiety crisis because of her family and said things to me that made me feel extra concerned. Things like: \"I already thought about doing something bad to myself\", \"My life is over\", \"I just want to be happy again\", \"I am no one in life\", \"my family, who I loved the most, only make me feel worse\", \"My life sums up to sadness\".  \nI tried to make her feel better, to make her feel loved, to distract her from those negative toughs. I tried to make her remember those who love her by who she is, tried to make her remember the good moments she had with her friends and other members of her family, tried to make her feel like she matters ( She matters a lot to me).  \nWhile we were speaking, she disappeared from all social media and I haven't been able to reach her since. I am very concerned and have no idea what to do. I tried to call her cellphone several times, tried to contact her other friends, but I haven't heard from her since yesterday evening.\n\nDo you have any idea what I should do? Our conversation was entirely via chat since she was unable to answer her phone because of her family. We live in the same city and I thought about showing up at her place, but since she lives in an apartment block, I would be unable to enter without her answering my messages. I am completely lost and worried.\n\nForgive any grammatical errors. Portuguese is my primary language.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/lqj8j5/my_friend_is_having_suicidal_thoughts_what_should/", "title": "My friend is having suicidal thoughts, what should I do?", "social_network": "reddit", "user": "Bacteriomancer", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 13, "down_vote": 0, "creation": 1614089366, "permalink": "/r/Suicidal_Thoughts/comments/lqj8j5/my_friend_is_having_suicidal_thoughts_what_should/", "nsfw": false, "first_save": 1635429226.6142347, "replies_charged": false}