{"id": "t5_28vigg_t3_nlwd4x", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "I go to a partial hospitalization school. It's supposed to be therapeutic and helpful but I feel for me it's not. I was just starting to bond with and trust  my caseworker and she left. All my friends are leaving too. I have no one to trust anymore. I am begging my mom to take me out of the program it's not making anything better anymore. If anything it stresses me out more. The constant inconsistency of rules, the disrespectful peers, and how I get yelled at because I can't control them. They expect me to control others because I'm respectful to be not disrespectful. It's just too much to think of for a kid, they basically want us to control what staff should be. I'm not even in the same room with the other caseload I enjoyed before. I don't trust anyone in my room. The thought of my friends leaving in a week is giving me constant anxiety idk what I am going to d without them. I'd rather die than continue to go here. I am explaining to my mom and asking her to sign me out but she is iffy on it. She thinks I just want to bounce around from school to school. But this program is year round we don't even have summer off. I want to be able to enjoy my summer not wake up at 6:30am 5 days a week just to go there and be upset from it. I want to start at normal school again, have a fresh start and begin at the same time as everyone else. I want to blend in. I wish I had a gun or some actually good pills. I'd take the gun into school and shoot myself in the bathroom. Or maybe I can take a fresh razor blade in and cut as deep as possible for the last time. I want them to find me laying there dead blood everywhere. I want them to think about how they cared about everyone else in the school except for me. I want them to question what they did wrong, so then maybe for future kids that go there it will be different. In a good way.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nlwd4x/i_am_so_done/", "title": "I am so done", "social_network": "reddit", "user": "SublimeChinchilla", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1622078096, "permalink": "/r/Suicidal_Thoughts/comments/nlwd4x/i_am_so_done/", "nsfw": false, "first_save": 1635429002.459969, "replies_charged": false}