{"id": "t5_28vigg_t3_ix0l54", "request": ["82ff3069-5f28-400f-ba6f-f94d4fcede90", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "that its driven me into a constant state of suicidal thoughts. At current rate ill be either dead at the age of 27 or just getting my first qualification. I dont really know when i first got depression but boy do i wish i was sent to a therapist back then. Because atleast then i could have been saved from my own self destruction. While i was attending school my plan was to die after doing the final exams which i would fail every one of them as a f u to my mother but my attempts didnt succeed hence why im still here. then i got a spot in a kind of community college due to a recommendations from from previous teachers. I was isolated in the class and had no one to talk too so I dropped out in January the next year. then i got a job as a cleaner at the age of 21 because i was saving up to go on a trip with friends to japan and i planned to kill myself when i came back. Attempts still didnt work and i met a women online and have been talking to her for the last year but im still trapped in the mindset of fuck everything im going to kill myself. I have been okayish this last week but i just woke up and had the thought that when i finish my course ill be 27 and that made me want to die so damn badly i have to write this to stop myself. I cant get a job, i cant get into college so my only option is an apprenticeship which last four years. (sorry about formatting im on mobile)  well thats it thats my shit ass life thanks to my self destructive personality and probably 16 years of depression, suicidal thoughts and attempts", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ix0l54/i_have_fucked_my_life_up_so_badly/", "title": "I have fucked my life up so badly", "social_network": "reddit", "user": "Formal-Ad-797", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1600695527, "permalink": "/r/Suicidal_Thoughts/comments/ix0l54/i_have_fucked_my_life_up_so_badly/", "nsfw": false, "first_save": 1635428813.3189604, "replies_charged": false}