{"id": "t5_28vigg_t3_epq5h5", "request": ["b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "I have struggled with depression on and off since I was a teenager, but it’s gotten much worse in the last several months. I can usually drive away the sudden impulses I get to “end it all” by distracting myself with something (book, tv show, etc.) or hanging out with friends. But lately, those thoughts are occurring more and more frequently and becoming more tempting.\n\nI told my husband yesterday that I was experiencing suicidal thoughts sometimes. I said that I realize they are temporary and often fleeting, so I wouldn’t act on them. I told him that sometimes, I despise myself too much and can’t manage to grasp onto any hope that things will change.\n\nHe basically brushed me off. I think that he thinks I only said that to get his attention and his sympathy. He said, “If you are being serious, you need to get checked in somewhere.” He hasn’t mentioned it since, nor has he\nmade any effort to comfort me. He hasn’t been unpleasant or anything... just distant and aloof. He didn’t even hold me last night before we went to sleep, which he does almost every night. \n\nFor context: I have mentioned to him once or twice before that I very occasionally have suicidal thoughts, so maybe he thinks I am “crying wolf.” But those times I clarified to him that I didn’t take these dark thoughts seriously, and that I believed they were simply caused by drugs I’ve taken. This time feels different... some stuff has happened in my life recently that  had made me feel just so awful about myself, it’s difficult to move past it and see the good things in life.\n\nSo today, I talked to my mom about this on the phone and she said it was a mistake to tell him because “people don’t want to hear that.” I get what she’s saying in a way... I have a fantastic, privileged life on paper, so there isn’t a good reason for me to feel miserable. People less privileged than I would probably mock me. I now deeply regret telling both of them about it and feel stupid and worthless. I wish I had just kept it to myself and think I will from now on.  \n\nBut I figured I’d ask this community what they think. Should I never talk to anyone about my suicidal thoughts? Was I “crying wolf” when I opened up to my husband about these thoughts? I honestly didn’t intend that, at least not consciously... I was just trying to be truthful with him because we were discussing my state of mind lately.\n\nMeanwhile, I can’t stop picturing the bottle of Xanax we have stored away for emergencies like panic attacks, etc. We absolutely have enough for me to do it, plus plenty of other supplies that would potentiate an overdose. I won’t do it over this, though. I do want to keep trying.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/epq5h5/i_told_my_so_i_was_having_suicidal_thoughts_was/", "title": "I told my SO I was having suicidal thoughts. Was it a huge mistake?", "social_network": "reddit", "user": "CrystalW187", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1579211069, "permalink": "/r/Suicidal_Thoughts/comments/epq5h5/i_told_my_so_i_was_having_suicidal_thoughts_was/", "nsfw": false, "first_save": 1635429424.4440558, "replies_charged": false}