{"id": "t5_28vigg_t3_hy1rxd", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "Everything just keeps happening, things keep changing, life keeps moving, and I just feel like I'm still stuck in fucking middle school. By now I'm 16, but when people ask me how old I am, I almost say 13 everytime. I still hate everything about myself, I still am depressed about my family, I still self harm, I still want to die, and I still cant motivate myself to do basic tasks unless my parents literally force me. Meanwhile, I've lost almost all my friends, and the one friend I do have is basically becoming what I always wanted to be. She has a good job, she has a great boyfriend who shes in a committed relationship with, shes getting more confident everyday, and even though she obviously still has problems, she just is everything I wanted to be when I turned 16. Now, of course, I'm not jealous or bitter or anything, I'm so glad for her, its just I already always feel like I'm in her shadow. The most intense crush of my life only pretended to b interested in me to get to her, my most recent ex literally stopped responding to me and started being freaky with her.\n\nI just feel like the only thing that is actually productive with me right now, is my head. I'm always thinking of ideas I never fucking act on. I've planned my suicide, but I havent done it because I want to kill myself at school. I genuinely just don't want to exsist anymore. My dad said he would get me therapy after I tried to kill myself, but that was like 5 months ago. Oh, and guess who's getting help and therapy? My best friend. The worst thing is when my friends parents try to get them help and they complain about it. I would love to stop wanting to fucking die, and wanting to fucking starve myself, and fucking going in a horrible binge/purge cycle. I'd love to be able to take care of myself again like a normal god damb human being.\n\nI just feel like a failure to everyone. My dad always says people who add nothing to society shouldn't be alive. I think he hates me too. Everytime he invites me to go out somewhere without my family I'm scared hes going to shoot me or burn me on a stake. Its stupid because I want to fucking die, but I dont want my last day to be me being scared of my dad. And I'm not scared of my family for any particular reason I'm just paranoid.\n\nI just want to be able to be human again, but it seems like no one else even cares, so why should I? I'm not even religious so killing myself means nothing to me. It just means I'll be dead, nothing will happen. Yea sure my friends will be sad for like a day or two but eventually theyll forget about me, and then theyll die too. I only have like two friends anyways and they both have way more friends than me that they'd rather hang out with anyways.\n\nI just want to die.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/hy1rxd/i_cant_stop/", "title": "I can't stop.", "social_network": "reddit", "user": "JustAnAuthor5490", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1595743211, "permalink": "/r/Suicidal_Thoughts/comments/hy1rxd/i_cant_stop/", "nsfw": false, "first_save": 1635429369.6630778, "replies_charged": false}