{"id": "t5_28vigg_t3_o1cr8d", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac"], "text": "I’m 14 about now, and I’ve been struggling with really shitty depression since about 13 last year. I don’t have a good relationship with my mum, in fact it’s always been shocking. I’ve had step dads throughout growing up, some alcoholics and such but none traumatic. I was sexually abused by my Dad until about 6, then my mum found out. I think that was the icing on the cake for her hating me. I’ve accepted she can’t stand me, the feelings mutual. But I never used to care about what my dad did, I never thought of it until now. I’m so dependant on guys, like calling me pretty and using me. It makes me feel worth something. But I haven’t felt like myself at all, I feel detached from everybody. I’m really lonely and empty and it’s been like this for so long and I’m already delving into addiction. I don’t know what to do anymore, I used to just sleep all the time. But everything is so overwhelming, I have an intense hatred for myself. I can’t talk to a boy without feeling dirty and slutty. I don’t feel as if I’m good enough for anything. I hate that feeling. Everyday it hurts so much, and I just don’t feel like anybody really actually understands. I’ve been contemplating suicide for almost a year now, and now I think it’s time. I’m not at the lowest point in my life, like I was a few months ago. I’m just bored and unsatisfied and deeply unhappy. I just need a crutch of someone. Because I have nobody. I’m the fat miserable girl in everyone’s lives. I hate it so much . Nothing has gotten better. And there’s so many little things that are ruining me. And I hate my dad so much. For what he did. I want to kill myself to be at peace, and to prove to everyone that I was begging for help and they could’ve done something. It would communicate to them how bad it was. Because it is I want to do it so bad", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/o1cr8d/suicide/", "title": "Suicide", "social_network": "reddit", "user": "siiopiip", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1623870588, "permalink": "/r/Suicidal_Thoughts/comments/o1cr8d/suicide/", "nsfw": false, "first_save": 1635428739.5793273, "replies_charged": false}