{"id": "t5_28vigg_t3_ja7vkc", "request": ["1b8b7108-38ec-4c83-a7c2-510b87d5871b"], "text": "i’ve had issues with depression and anxiety from a very young age. I’ve also had issues with my body image and self esteem since forever. I thought I was over it when I started becoming more independent and confident in the last couple years. Recently i’ve been dealing with probably my worst bout of depression since I was a teenager. No one knows. my best friend, my mom, and my boyfriend are the closest people to me and have no idea what’s going on with me. I do a really good job at hiding it. \n\nI think i’m VERY good at hiding when i’m going through tough times but it hurts that no one is there for me at all. I feel I always try to be there for everyone around me and I have no one like that for me. no one I can depend on or talk to about my emotional and mental issues. and it makes me wonder how different they would act if they knew what was going through my mind everyday for the last few weeks.\n\nHow would their behavior change if they knew I was having suicidal thoughts almost daily? Would my boyfriend pick less fights with me? Would my best friend start answering my calls and texts? Would my family stop getting on my case about going back to school and having kids soon? \n\nI don’t think i’ve had serious suicidal thoughts in the last few years until now and it sucks that i’m getting so bad again. Don’t worry though I know I won’t do it. there are two things stopping me: I don’t want anyone to have to deal with the trauma of finding my body and I don’t wanna leave my dog with anyone else. I know no one else will love him or take care of him like I do. He’s the most important thing in my life. No one knows my dog is saving my life. \n\nsorry this is all over the place and thanks for reading. I just really wanna get this off my chest. i’m looking into talking to a psychologist again soon and getting on antidepressants if I can. I was too nervous to ask for them last time I went through a bad depression but I feel I need them now to get me through the rest of my life.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ja7vkc/i_wonder_how_everyone_close_to_me_would_change_if/", "title": "I wonder how everyone close to me would change if they knew what was really going through my head", "social_network": "reddit", "user": "rro32", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1602569661, "permalink": "/r/Suicidal_Thoughts/comments/ja7vkc/i_wonder_how_everyone_close_to_me_would_change_if/", "nsfw": false, "first_save": 1635428938.6299458, "replies_charged": false}