{"id": "t5_28vigg_t3_pag9py", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab"], "text": "Will it be the cowards way out? Maybe… I do wonder, does hell really exist? Will I be succumbing myself to an eternity of torture? Or is that just  something religion tells you to scare you? Will I be set free? Will I be trapped? I can’t get any more trapped than I feel right now, can I?\n\nI’ve always felt so deeply sad and alone.. Spending my life just drifting by. As a child, a teenager, and now as an adult.. The background person, the last option, the one that no one really wanted to be with, unless I had something to offer them. From school to jobs, friendships to relationships. \n\nI’ve spent half my life taking care of others… and all I have really longed for, was for someone to take care of me in return.. Was that really too much to ask for? A hug? A shoulder to cry on? Or even a “Hey are you okay?” But… instead it’s just.. silence..   \n\nMy attempts to reach out have been… unsuccessful to say the least. “It will get better.” When though? I’ve tried so hard to escape my dark thoughts. To tell people I’m not okay. To beg for help. But… once again… silence. \n\nI’ve wasted my life, and abused myself. I ruined my mind, and my body. The fat, the scarred skin, and even my teeth. I’m beyond repair.. I know it’s no ones fault but my own. I can’t even stand to look at myself in the mirror anymore… I don’t recognize the reflection staring back at me. \n\nBumpy, crater face. Yellow, cavity filled teeth. Sagging breasts. Loose stretch marked skin. Self inflicted scars. Disgusting. No wonder my significant other is no longer attracted to me. I’m not even attractive to myself.. \n\nTouch deprived. Love deprived. After all, who could possibly want this? My fucked up mind, and busted body.. I knew it was too good to be true. I’ve known my entire life no one could ever want me, and love me for me. How could that be possible, when I have never even liked myself?   \n\nHow is this not hell? I wake up everyday with this sinking feeling of dread.. This feeling like there is a gaping hole in my chest that nothing ever seems to fill..  I can’t ignore it anymore... My soul physically hurts. Just a few more days..", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pag9py/no_one_point_in_posting_this_to_my_other_social/", "title": "No one point in posting this to my other social media accounts", "social_network": "reddit", "user": "greeneyedcreeper", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1629779388, "permalink": "/r/Suicidal_Thoughts/comments/pag9py/no_one_point_in_posting_this_to_my_other_social/", "nsfw": false, "first_save": 1635428920.3239636, "replies_charged": false}