{"id": "t5_28vigg_t3_jio46k", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "I left this as a comment for someone just now, and I thought maybe posting it as its own thread would help someone today. \n\n\nI was in one of my darkest places yesterday. I wanted to peel my skin suit off and burn it. My ball was huge and would NOT lay off the button. \n\n\nHere's an image that I keep with me. Imagine you are like a box. On one wall of your box is a button. A red pain button. Emotional pain. The worst. \n\nEvery trauma, every painful word, every disappointment creates a form of grief or sadness (or even sadness thats pretending to be anger!) Pumps air into a super tough balloon ball thats just rolling around, bouncing around in that box. Randomly hitting the button. \nThe bigger the grief ball gets, the more often it hits the pain button. \n\nThe point where you want to die is usually when that ball is so damn big it just LAYS on that fuckin button. \n\n\nBut if you picture it like this, you'll know, too...that eventually that air WILL escape. You can even help a LITTLE by envisioning a little air escaping with every exhalation.  \nOver time, that ball gets a little smaller and a little smaller...sometimes some asshole or circumstance will throw some more air in there...but the ball never goes away. Eventually you could be left with a dot. Just bouncing around and it may hit that pain button...but happens far less often. The trade off is that it happens randomly so you never know when to expect it. \n\nFor people with chronic depression, we need a little help, like from meds. I feel like the meds don't make the ball smaller. They don't make the box bigger....but they make the pain button just a bit harder to push, for some people. \n\n\nAnyway. \nThat's how I try to make it through. \nIt doesn't always work. Then I post here and actually include some of the poison thats in me so that maybe it isn't deadly anymore for me. \n\n\nFeel better, friends,  Please.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jio46k/a_big_ball_and_a_sensitive_button/", "title": "A big ball and a sensitive button.", "social_network": "reddit", "user": "AlmostGladys", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1603748860, "permalink": "/r/Suicidal_Thoughts/comments/jio46k/a_big_ball_and_a_sensitive_button/", "nsfw": false, "first_save": 1635429317.0167663, "replies_charged": false}