{"id": "t5_28vigg_t3_oaoczb", "request": ["03598834-ede5-4aab-9b0a-fc5de7674c00"], "text": "This pain that holds us back. That voice in our head that tells us we need to stop feeling human emotion and end it. It will go away. I suffer every single day from the moment I wake up to the moment I go to sleep. Im only 17, I work out , Ive had girlfriends, Ive went to parties, Ive done normal people things but now for the past 4 years the only thing on my mind is how can I kill my self and painlessly. Half of me wants to end all suffering, the other half wants me to push through the suffering to see how it looks on the other side. I cant even have a conversation with someone over topics because the only thing in my mind is how am i gonna kill my self and everything thats wrong with me.  Listen up, It gets greater later. I Love You. Our problem whatever it may be, I hope you guys absolutely make it to the nice side of life and not be selfish and put other humans at risk of doing the same thing because they lost you. Each of you are worth way way way more than you think. I say fuck my mental health, let me put me in check and get to where i need to go to become happy. FUCK EVERYBODY THAT EVER DOUBTED YOU, HATED ON YOU, TOLD YOU YOU WERENT WORTH SHIT. We are at rock bottom literally the depths of fucking hell. Its time to climb out. rockbottom is a good lesson because the only way to go is UP. Even if I end up killing myself guys i hope this reaches some people and really changes them for the better. Good luck in this game we play.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/oaoczb/were_all_gonna_make_it/", "title": "We're all gonna make it.", "social_network": "reddit", "user": "PersonalitySad196", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 8, "down_vote": 0, "creation": 1625023027, "permalink": "/r/Suicidal_Thoughts/comments/oaoczb/were_all_gonna_make_it/", "nsfw": false, "first_save": 1635429521.2280476, "replies_charged": false}