{"id": "t5_28vigg_t3_h0v9p2", "request": ["e4caf65e-8cb5-40e4-9897-4291adbe7f3f", "048f49dc-273e-4b10-8bfb-66f763289af0"], "text": "Haven't thought about stabbing myself for a while, didn't miss it. But tonight has been an awful shit show where nothing is going right and my heart feels empty. Like it isn't beating and nothing will make it start. It's a different kind of pain that I can't describe and I hate it so much I thought about stabbing myself in the heart. And of course now that I thought about it, it won't go away. After 8 years I wish I didn't have to feel this way anymore. But the good doesn't seem to outweigh the bad for more than a few hours and then it's back to feeling melancholy or downright suicidal depression and I just want it to stop.\n\n\nI know I'm a \"good person\" and people care about me but it doesn't mean anything. I've lost the few things I cared about in my life and I'm spiraling back into an awful depression and I don't know if I'll make it out the other side this time. Even when I have a decent day, some part of my brain tells me that \"None of it matters and tomorrow will be just as hollow as today, so why bother? Nobody loves me and I don't belong here.\" I know it's not true but eventually the walls I've built up against myself will crumble and then I'm out of luck. I'm almost certain I won't make it to June of next year. It's the most depressing thing I can say, because I'm pretty much sealing my own fate with the idea but I can tell I'm getting worse instead of better, and it's summertime. So I think I'm out of time or close to it, but rambling into the void will get it out for tonight at least, and hopefully get me a few dollars worth of gas on my \"pity party freeway\". \n\n\nBecause why didn't I think of just, not being sad? Can't believe something so important slipped my mind. I spend too much time thinking that I should have killed myself when I was in middle school. Would've skipped a lot of pain, and nobody would have had to care if I died. Now I've got a few friends who I don't want to hurt, and my father lost his father to suicide, so I don't want to do that to him either, but it's really hard to keep things in perspective and keep my head above water when the waves come in. But I've already given my life overview without the details and those aren't important. So I'm going to try getting some sleep before the sun comes up.\n\n\nI hope everyone is having a better day than me. Y'all deserve the world.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/h0v9p2/my_heart_hurts/", "title": "My heart hurts", "social_network": "reddit", "user": "AvatarChief", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1591864411, "permalink": "/r/Suicidal_Thoughts/comments/h0v9p2/my_heart_hurts/", "nsfw": false, "first_save": 1635428901.6846302, "replies_charged": false}