{"id": "t5_28vigg_t3_ffueea", "request": ["b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "I have a wonderful girlfriend, she is literally the reason I'm still alive I love her so much she deserves everything she wants in life, she just worries so much about me because mentally I'm not at the best place right now and she Is really trying to help me but I'm still really suicidal and depressed. I've stopped eating a lot and have stared cutting a bit as well (me and her made a promise that we'd both stop cutting, so she is disappointed about that). I just don't have any motivation to keep on living, which she is really scared about as well as me bottling my emotions up around her or not being  able to trust me to not hurt myself and has on multiple occasions cried to me about how scary it would be if I tried to kill myself and that she needs me, which always make me feel guilty and just want to hide it more. She is my world and I don't want to keep stressing her out and making her upset because of me being depressed, but I can't stop feeling this way. I try not to think negative thoughts about the whole situation but when I do I think that it would be just a whole lot easier if I break up with her I know it will hurt her in the moment but in the long run it would better because I won't hurt her feelings anymore, she won't have to keep dealing with a person that can't even love themselves, but I can never get the verve to actually break up with her, I guess I'm too selfish lol. \n\nAnyway does anyone else have the same problem? \nWhat do you think is should do?\nHow can I stop feeling this way? \nAny advice would be grateful appreciated, thank you.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ffueea/how_to_not_worry_your_girlfriend_about_your/", "title": "How to not worry your girlfriend about your suicidal thoughts?", "social_network": "reddit", "user": "kodie_langton01", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1583759385, "permalink": "/r/Suicidal_Thoughts/comments/ffueea/how_to_not_worry_your_girlfriend_about_your/", "nsfw": false, "first_save": 1635429423.739848, "replies_charged": false}