{"id": "t5_28vigg_t3_i3gacn", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I feel powerless and completely unimportant in my life. I feel like I cannot be heard and the one that I need to reach is a narcissist. They use a child to silence me, because did I speak they will cause damage to that child in order to force me to stay silent. I have become sad and have lost my motivation in life because I feel so trapped and useless. I have had genuine thoughts of suicide lately, and even attempted a couple weeks ago. I swallowed a bottle of pills. Luckily, I survived. An ambulance was called and I made it. I think it caused me brain damage.\nI felt indifferent about being alive. I felt almost no emotion. I had to fake it for the ones I love to feel relief. That was awkward. I hide my emotions a lot to survive, but I don’t normally fake them. I just feel like I am powerless in life. Defeated. I have no ability to fight back because there is a trump card in their hands. It is not a threat against me, it’s a threat against a child. I cannot let them use that child to control me. To harm them inadvertently if I step out of their line of expectations. \n\nI cannot be specific, out of respect for those I love. I am not a perfect person and I have suffered severe depression in my life, and have been numb for almost two years now. I have no way out that leads to a good ending. Even suicide is not a good ending. But, it would solve a problem for a lot of people. It would make their lives less complicated. I dream of what it would be like to just end it, and that scares me. It scares me because I actually attempted it.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/i3gacn/i_cant_stop_thinking_about_it/", "title": "I can’t stop thinking about it", "social_network": "reddit", "user": "Moon-Quaker", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1596533746, "permalink": "/r/Suicidal_Thoughts/comments/i3gacn/i_cant_stop_thinking_about_it/", "nsfw": false, "first_save": 1635429636.6427722, "replies_charged": false}