{"id": "t5_28vigg_t3_ljx5sp", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0"], "text": "So as I'm a part of this subreddit, I have suicidal thoughts and all that crap.\nSometimes I start to think that I'm doing better, then I have a full on breakdown on the bathroom floor for no reason, or a paranoia attack because of a sign that I've seen.\nI was already feeling awful, but then something else happened.\nMy good friend, who's an adult, turned out to be a perverted pedophile and he talked to me about how he wanted me to tie him up and sit on the top of him.\nThis made me really disturbed, as I'm a minor and he's 21.\nThis really hurts me because he was the person who convinced me to not take the pills a month ago.\n(I had a perfect plan so If he wouldn't have been there, I would be dead)\nNow I feel like there are only two ways my life can go.\nIt's either me killing myself, or going to mental hospital.\nEven though I never went to a therapist, I know It would not be enough and to be honest, I'm scared that the therapist would not help at all, instead just making it impossible for kill myself (by telling my parents to hide the pills, etc)\nTo be honest, if they give me food 3 times a day, that's already more than I get at home.\nI'm fed up with my parents whining dramatically when I sit in my room alone 'dOnT jUsT sIt oR yOuRe gOnNa bE dEpReSsEd' but they pretend that they dont see the hundreds of cuts on my arms.\nI'm fed up with people being kind and sweet and then traumatizing me.\nI need to concentrate on myself and only MYSELF and not on others.\nThe problem is that I have no idea how to concentrate on myself in my toxic home around my toxic family without going to mental hospital.\nI feel like I'm slowly running out of time and I feel like I'm dying.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ljx5sp/mental_hospital/", "title": "Mental hospital", "social_network": "reddit", "user": "KiimberlyCollins", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1613336133, "permalink": "/r/Suicidal_Thoughts/comments/ljx5sp/mental_hospital/", "nsfw": false, "first_save": 1635429018.5316224, "replies_charged": false}