{"id": "t5_28vigg_t3_jv6hn9", "request": ["e4caf65e-8cb5-40e4-9897-4291adbe7f3f"], "text": "(sorry for my english)i'm 16 yo guy from countryside. i'm in IT middle school, i have not the worst grades, i can talk to some people, but deep down inside i fell lonely af. In my life i've had 1 true friend in elementary school. We've been hanging out for about 2 years, but then she suddenly changed and told me she don't want to be friends with me anymore. That shook me up really hard, i was crying 2 weeks straight.\n\n I wished i could go and talk to my parents or my bro about that or any other problem, but i naver had true relationships with them. My parents are talking to me only if they have job to do, they treat me like shit, and they've been  treating my brother like a fucking god, even though he's a drug and alcohol addict. I talked once to my mother to tell her how i feel about it and how it affects me but she ignored it and told me im overreacting. Now i have nobody to talk to.\n\nCurrently my only joy in life are fictional stories: games, anime etc. Sometimes i can lay in bed all day and think about what would happen if i would be god and stuff like that. My life is so boring and   \n the world is so against me that i have to run away to world of my imagination, where i can finally be happy, have someone who loves me and who i love, and just be happy\n\nMy biggest dream is that my old friend i mentioned earlier came back to normal so we could spend time like in the past\n\nU can tell me that i'm self pity and should stop complaining and enjoy life, but i dont know how to do it. I'm feeling like there's no future for me\n\nSorry for wasting your time on me, but i just had to tell somebody how i feel. Again sorry for my bad english, you might don't understand a lot of things. If you read this, i would appreciate if you rate my english from 1 to 6 xd. Sorry again and have a nice day", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jv6hn9/i_dont_know_what_to_do/", "title": "i dont know what to do", "social_network": "reddit", "user": "just_a_rand0m_retard", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1605532261, "permalink": "/r/Suicidal_Thoughts/comments/jv6hn9/i_dont_know_what_to_do/", "nsfw": false, "first_save": 1635428900.2511292, "replies_charged": false}