{"id": "t5_28vigg_t3_q9x41g", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "65b8351b-5dc2-4143-a37d-f2748f6d42bb"], "text": "My life is just a never-ending series of bullying and abuse. I've been robbed of everything I held dear and everything that made me, me. I thought I had finally found a center, I thought I could finally allow myself some rest, I thought I had found some safety. It was just more gaslighting and solitude. The best I can afford is being considered as a piece of meat, until they get tired and find someone who makes them feel better, until I'm useless. I always have to stay hidden, no one has ever shown me love or affection publicly. I just moved back with my parents and it's hell again. I can't even bear to hear them talk, even if just about some TV show. I can barely walk because of all the unhealed endless traumas I suffered and they know nothing or just don't care. I cry every day. I can't believe my life has come to this.\n\nI've always been a good person. I've always tried to help people. I've done everything I could not to hurt anyone. Yet everytime I tried to do something for myself, people would always destroy everything. All my efforts were always in vain. And on top of it all, no one ever believes me when I talk about it because these people are well-loved... while I'm the lonely, weird person.\n\nAll my nightmares have become real and my brain just can't deal with this. I've developed some serious issues (I was already severely depressed but now it's worse) only in the last year because of my therapist and the hospital and the mental health clinic, and because I've been left all alone by those who made me believe I could count on them. All the people I loved have abandoned me when I needed them the most. I had never asked for anything and this is what I got.\n\nLast night I made a noose with my scarf. I'm looking for a particular park I've seen last year so I can go and hang myself there. There's no place for me here. I'm 30 and all I've got in all these years is just rejection, derision and a mind so scarred I can barely function. I can't do anything at this point. I just spend the days sitting and waiting for the pain to pass but it never happens and it doesn't work like that. But I don't have any other choice.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/q9x41g/believe_me_ive_done_everything_i_could/", "title": "Believe me, I've done everything I could.", "social_network": "reddit", "user": "_rotten_apple_", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1634471029, "permalink": "/r/Suicidal_Thoughts/comments/q9x41g/believe_me_ive_done_everything_i_could/", "nsfw": false, "first_save": 1635428842.2008784, "replies_charged": false}