{"id": "t5_28vigg_t3_pvaxmn", "request": ["65b8351b-5dc2-4143-a37d-f2748f6d42bb"], "text": "I legit just woke up and already have no will to live, I don't necessarily even want to die but this is exhausting having so many times where nothing seems worth it. Scared that I won't be able to stop myself when this happens when I'm alone or at night. Every memory even good feels like a knife in the back, I can't go back to those places, can't relieve those times, can't do things differently, those people are forever grown up and will never be the same again and it hurts. I m trying so hard to let new people into my life but just keep climbing to the odes the old ones will come back even tho I know they won't. I hate this. I keep getting this image in my head of me being held and comforted by someone but I can't tell what age I am or who is holding me. Is it me holding younger me, me holding me, older me holding me, mental illness holding me, who tf are in these images. I want to be held irl and told I'm safe and everything is ok, I want that so bad its killing me. I want someone who can tell when I'm not ok, who I can tell anything, who I can run to when things get hard. I want someone to have my back irl, I mean ya online is great but it doesn't replace human warmth or being able to hang out w someone, being able to fall asleep next to someone. My will to live comes and goes so maybe I should just be thankful its sometimes there because I went so long without it at all. Just really pissed off that when I got out of the last hospital I wasn't suicidal for the first couple weeks and slowly I've met it slip back into my life. Its getting me when I'm weak, when I'm tired, when I don't have enough motivation to fight off the thoughts. I don't wanna die but I'm getting tired of my mind telling me I do because there's still times I end up listening and luckily I get distracted or fall asleep but what if one of these times the idea sticks again and I end up acting.....", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pvaxmn/woke_up_in_a_bad_place_again/", "title": "Woke up in a bad place again", "social_network": "reddit", "user": "KAI_IS_FINE", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1632589406, "permalink": "/r/Suicidal_Thoughts/comments/pvaxmn/woke_up_in_a_bad_place_again/", "nsfw": false, "first_save": 1635429161.5886605, "replies_charged": false}