{"id": "t5_28vigg_t3_nsjg3t", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "-Getting bullied since i was 11\n-Having a Very Toxic family \n-My Father physically abused me for no reason when i was 12\n-Getting Framed by my 4th-6th Grade teacher for the things i didn't steal \n-Got Betrayed and let down by my Childhood Best friend \n-In 9th Grade i made mistake like accidentally Sent Porn in our group chat where all of my teacher was on and that day my classmates constantly bullying me and that day made me realized I'm feeling something different about my emotions.\n-Another Year in the same school i forgot to write some of my answers in our Final exam that was already submitted, so i didn't want to fail my exam so i find my exam paper and write my answers. I didn't notice that one of my classmates saw me and think that i was cheating in my exams by copying my classmates answer and told my teachers what I've done, so my teacher got angry and mad in our Group Chat and My teacher wants one of us students will confess to my teacher. so i did but she didn't reply to my message like my teacher doesn't believe what i said. and then our \"matured\" girl in our class Said something to me\n-This Girl and i have the same age in this school year (16)\nthis girl i Trusted the most to Open up my Dark thoughts and for the things that made me feel different and the mistakes the I've done that regrets me and she was like a therapist that helping me.\nbut this girl is also my teacher's right hand and pet . And back when i write my answers that i forgot to write. My teacher and this girl talked a lot and she confronted me why did i \"cheated\" in our exams so i made my point that i didn't but she didn't listen and keeps blaming me and she used my Depression against me and she said \"You're the one that making yourself depressed\" and that moment i was shocked, confused, angry and emotional .\n-this year age of 17 I was Molested by a Gay that he lied about his personality and he said that he was a transgender women.\nIt started when i normally posting Pictures of me in my stories and he keeps interacting on it so i started to notice and message him as an disciplined male i respect that he was a gay and we talked but then she made a lot of promises the he will give me luxurious things so i believed because he introduced himself Rich and he gain my trust and we become freinds i supported him as a Transgender woman one day he invited me to a birthday party that he told me to come but i didn't want to attend but she begged me to come so i did. When i arrived to the address she provided but didn't exist so i massage him where is he and he told me a place to meet up and i started to feel something weird and i showed up in a small burger shop and i met him in there and he was exited and he take picture of us and he said that i follow him so i did and i started to pee in a public Cr and he followed and touched my dick and he started to suck my dick but i refused in that moment but she take pictures of my in my underwear and he started to cretin threatened me the he will post the picture she took including our selfie that i was Molested her Transgender sexual part so I beg him not to do that. But he started to Run very fast in the rain and that day made me feel the worst feeling i feel and made my Depression even worst.\nBut i want to talk to her that he won't post them and i asked many people were he lived and the Pointed an Old woden house and i realised the rich house he sent me was fake so i went to their house and asked the people in the house where is he and they told me that she left but i saw the slipper he wears to meet me and the umbrella that he steal From me was still there so asked again the people in the house where she is and they told me where exactly  i searched the house and i saw him hiding in an weird cabinet and I beg him not to post them and i said I'll go to the police but he has a confidence that if i do that he will ruin my image in my social media so i just went home soaked in rain and the worst day of my life just happened.\n-It's been 5 months since that happened but I'm still having a mental breakdown and crying constantly and I can't get it off my head everyday. \n-I have more reasons why i should kill myself but it will be very long.\n- So I'm ready to leave this world behind I'm preparing ti kill myself. I was hurting so much, traumatized in mistake and decisions I've done and having an anxiety attack every time.\nThank you for reading this, I'm losing my battle with depression  I'm sorry", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nsjg3t/reasons_why_i_should_kill_myself_m17/", "title": "Reasons Why I Should kill Myself (M17)", "social_network": "reddit", "user": "Reisnotreal", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 15, "down_vote": 0, "creation": 1622852678, "permalink": "/r/Suicidal_Thoughts/comments/nsjg3t/reasons_why_i_should_kill_myself_m17/", "nsfw": false, "first_save": 1635429218.1028593, "replies_charged": false}