{"id": "t5_28vigg_t3_l70fw1", "request": ["17a9b9d7-ff9b-41b7-9002-7b804d6d8d40", "65b8351b-5dc2-4143-a37d-f2748f6d42bb"], "text": " People say that with intelligence comes loneliness.\n\nWell. For years now, I've felt like I've been trapped in a place I have no business being in. Stuck in a purgatory of ignorance, I've been, since birth. While I care about scientific theories; what life will be like in the future, generations from now; or the sheer grandness of the universe. Everyone else cares about what athlete can run the fastest, who can throw a ball the farthest or the latest gossip surrounding a celebrity they've never met.\n\nEvery memorable day of my life was spent hoping; longing of living in a future that doesn't, and likely never will, exist. So long as 'humans' inhabit this place.\n\nMy nights are spent daydreaming of living off this planet. Or of living in virtually any society, other than the ones found across Earth.\n\nI hate the greedy and destructive nature of humanity.\n\nAnd, as a human, I hate myself.\n\nI hate what we've made this planet. The once lush garden that's now a trash-filled, overpopulated, technologically proficient wasteland in the making.\n\nI hate society itself. Only looking out for the big dogs. While little pups like you and I are forced to lick up crumbs from the dirt roads.\n\nFor as long as I could remember, I've wanted nothing more from life than to leave this planet. To get off of this... gravity prison forever in order to explore the universe in solitude. To find and explore strange worlds. Or, to simply look down on the Earth from a distance, thus gaining new perspective on this experience we call life.\n\nKnowing such things are impossible for the likes of myself however, classless and wealthless as I am. I've been forced to accept this mediocre existence on Planet Earth.\n\n'Living' isn't about starting families, finding happiness, accumulating wealth or pursuing your dreams. It's nothing but an endless experience of inconvenience after inconvenience, experienced day after day from the time we're born.\n\nUp until the day we die.\n\nIt's a fruitless battle against pain and frustration. Sugarcoated to be worth all the effort by the promise of an eternal, worry free life, in the presence of some benevolent god.\n\nI've been long tired of this existence. And I've wanted nothing more than to embrace eternal sleep. To return to the void of pre-birth and continue to exist; or not, in the thoughtless, emotionless realm of death.\n\nThough, as much as I hate to admit. Certain things are stopping me from pursuing such ends:\n\nMy mother would be heartbroken. My friends, devastated.\n\nMore than that, my dog wouldn't understand why I'd abandoned her so. One Piece has yet to end, a show I've been watching since I could remember.\n\nAnd, perhaps through the hubris embedded in my still primitive human mind, I want nothing more than to have my books published and shared with the world before I inevitably bite the dust.\n\nBut. This life. This... human existence. Seems to be, more often than not, something that I find myself increasingly unable to bear. The depression is nothing new, despite it getting worse. Drugs don't help, as they only increase the shitty feelings once they wear off. The worlds I've made in my head become more vibrant, more realistic, with each passing day. But I become increasingly angry that it only exists in the abstract realm of my imagination.\n\nI hate this human existence. But at the same time, I can't bring myself to end it. I thought writing this would make me feel better. Sadly, it hasn't. And stoic philosophy isn't helping me much either.\n\nI'm lost. And I don't particularly care to be found. I've thrown away my map and compass and relegated myself to wandering aimlessly through this wasteland called 'life.'\n\nThanks for listening to my rant.\n\n\"Man in his arrogance, thinks himself a great work. Worthy of the interposition of a deity.\" -Carl Sagan", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/l70fw1/sick_and_tired_of_being_sick_and_tired/", "title": "Sick and Tired of being sick and tired.", "social_network": "reddit", "user": "Liden_Snake", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1611849305, "permalink": "/r/Suicidal_Thoughts/comments/l70fw1/sick_and_tired_of_being_sick_and_tired/", "nsfw": false, "first_save": 1635428884.280033, "replies_charged": false}