{"id": "t5_28vigg_t3_oarvhw", "request": ["82ff3069-5f28-400f-ba6f-f94d4fcede90", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "Hello, not sure where else to post this, or who I can talk to about what I’ve been feeling and experiencing. Basically for context, my hometown burned down in the deadliest and most destructive wildfire in CA a few years ago. Luckily all my friends and family survived, but we lost everything and it was extremely traumatizing. The fires are gonna be starting back up in CA again and every time a new fire starts I get so triggered and get these horrible panic attacks, anxiety, depression etc. I’ve been wanting to leave CA for a long time but idk where to go. My family and all my friends still live here, and they’re pretty much my only source of happiness at this point so I don’t want to be too far away from them.\n\nRecently, my dad suddenly died a few weeks ago. We were not close. He was abusive. He said and did things that made me want to kms when I was a kid, and through I never really tried, I definitely self harmed and developed an eating disorder.\n\nHe never apologized for the things he did. Even though part of me is glad he is gone because he will no longer hurt anyone else or struggle with the pain he experienced in life, I can’t stop thinking about death. I feel like I’m obsessed with it. I don’t really have hope for the future. I believe the planet and humanity is fucked, so what’s the point of living? I have experienced some moments of beauty and happiness in life, but most of it has been pain and suffering. I can’t keep telling myself it’s going to get better when I truly fear that it’s only going to get worse.\n\nI’m on SSRIs (prozac) and I know I need to get help (counseling) and talk to someone about all this, but I’ve been doing it my whole life and it’s such a pain in the ass for something I’m not even sure really helps in the long run.\n\nAny advice on how to deal with this?? Does anyone agree with me? just wondering", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/oarvhw/cant_stop_thinking_about_death/", "title": "Can’t stop thinking about death", "social_network": "reddit", "user": "mollsballs_xo", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1625036854, "permalink": "/r/Suicidal_Thoughts/comments/oarvhw/cant_stop_thinking_about_death/", "nsfw": false, "first_save": 1635428814.443888, "replies_charged": false}