{"id": "t5_28vigg_t3_ir68or", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "So this is incredibly personal and probably useless. I think i want advice. \nI am twenty years old. Im a white woman from the states and ive been middle class my whole life. Ive never had anything traumatizing happen. I always consider myself as very privileged and lucky. My father was in the military, so we moved several times, including to overseas, a totaly of ten moves in all. I was homeschooled most of my life. \nMy parents are loving and supportive, my siblings and i have good relationships, i have good relatives and ive had good friends. Few friends have lasted, i have three from highschool, since ive moved so much. Life has been good. \nOne of my earliest memories of me when i was five. For some reason i couldnt explain five year old me found it fun to sweep. So i asked my mom if i could sweep the kitchen. She said yes, her friends were there and said \"aw i wish my kids were helpful\" and my mom said \"oh she just wants attention.\" \nI didnt sweep. I remember sitting at my kitchen table and wondering why i was born. \nAnd that was it, till i was 9 and we had a short six months in one city, where i went a couple months without any friends and cried and asked God why i didnt have friends. I even asked if he even loved me. I literally got a friend maybe that same month and I moved on. \nI started going to school for the first time while living overseas, in an American school, so there was no language barrier. Things went so bad. I was always a sad kid, i always had bad self esteem, but i was also a kid who would forget and move on and play with my friends. The first year i made plenty of friends and was only mildy sad, probably because i had to experience homework for the time in my life. \nThe next year was different. I hated everythung about myself and I was sad constantly. I still went out and had fun, but come maybe the end of the year, i started wishing i didnt exist. \nAnd this is it. I would wish i didnt exist so often i imagined jumping off of buildings. Id be playing with my friends, and id see a ledge nearby, and tell myself to just jump head first. \nOne night i was in my room sobbing. I was going to kill myself. I wrote suicide notes to everyone i knew. I was so scared. I went to my parents. \nThey saw me crying, i mean i was sobbing. They asked what was wrong and being 11 years old, and not knowing how to stsrt a conversation about suicide, i juat said , \"well, schools been really hard,\"\nThey disnt let me finish. they told me i had nothing to cry about, thst it was past my bed time and they were w ar tchung tv. I went back to my room. \nAnd honestly this is embarrasing, i tried to suffucate myself with a pillow. Obviously didnt work. I ended up falling asleep and feeling even worse in the morning.\nThe only reason im alive is because im too dumb to kill myself. But maybe i also never got help because my attempt wasnt strong enough.\nNext year, still sad and mad and self hating, i started cutting myself. Little cuts on my wrists and hands i told everyone was my cat. My parents never even asked. \nI went to them one night, again after crying to myself, and honestly convinced i was insane and that was ok because i didnt wanna live anymore.\nI went to my parents and told them i gave myself the cut on my hand. They yelled at me. They told me they couldnt trust me anymore alone. They threatened not to let me go to the party my school was having the next day. I lied and said it was o ly that one. We hugged and they told me they loved me and i said it back. \nWe moved to the states and i was homeschooled again and for the first time we werent around other kids. I went two years without friends. Things got weird. I believe i developed ocd, because my mother had it growing up and i would have compulsions and obsessions. It really was torture. I asked my mom for therapy. She yelled at me. I asked again. She told me that if someone could afford therapy, they didnt deserve to go. Things got weird. I developed anxiety so bad i got chest pains, nd my parents took me in to get an ekg. It came back good and they moved on. Id have panic attacks. I got weird and would try to soend all my time alone in my room. Then, i started hearing voices. \nIt wasnt even really voices. Id hear people call my name. Constantly. Soemtimes just say \"come here,\" and theyd go from my full name to any of my nicknames. It was constant. I didn't sleep well. I started cutting myself again.\nWe moved back overseas and i went to school. I stoll felt depressed. Id cut myself occasionally. Id have weird impulsive thoughts but for the most part id say i fought again my obsessions and won, for the most part. \nI was still suicidal. I developed an eating disorder, but it was never bad enough to get noticed, i didnt really lose any weight just bounched back and forth between ten pounds. I moved after two years and was homeschooled, though I kept a very inactive social life. It was enough. My eating disorder slowly left, mostly. I was still suicidal.\nWe moved I graduated and i joined the Army. Now i am feeling better. Ive got friends, im moving forward in my career, my bosses like me. Even the asshole boss. My coworkers are friendly to me, and i have an amazing girlfriend. \nI would say its a couple times a month. I feel suicidal. Ill get tired and want to be alone. But if im alone im scared and sad. But im doing better. I just occasionally when im alone cry. A couple months ago i cut myself abit. I dont know why. I say its because i was overwhelmed, too much an introvert for how often im around people, but i dont know. Im just tired. I want to keep living. I want to grow old with my girlfriend. I just wish i had never been born. \n\nAm I fucked up, for a reason, that I can deal with and move on from or am I just fucked up from birth?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ir68or/born_suicidal/", "title": "Born suicidal", "social_network": "reddit", "user": "simbacter", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1599885515, "permalink": "/r/Suicidal_Thoughts/comments/ir68or/born_suicidal/", "nsfw": false, "first_save": 1635429631.205277, "replies_charged": false}