{"id": "t5_28vigg_t3_ionwsf", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "b4d8161b-7016-486a-a4bd-5fb6a5aa639e", "7e28da7a-0583-461d-a0da-99621d24119a"], "text": "Now charging my phone on a new charger I bought months ago, pre-covid when times were good. When I wasn’t work bombed by my job. It’s like love bombing, only furloughing and let going. It’s been back to the job market for me, and that’s fine. It’s just scarier now knowing there’s no backup. No money coming in. Rent is passed due along with other bills. There’s no food, but the dog has food and that’s what I care about. The other night a friend was nice enough to get me some weed when we hung out. It’s a relaxer for me. Calms down my anxiety about life. About finding a new job and never getting that guy you liked. All in a happy mood because I just smoked a bowl. \n\nI’m in a happy flow. I’m feeling the vibe of the YouTube video I’m watching. I’m writing down an idea I had from a previous picture I just looked at while watching this video. I start writing it down. There’s noise down below my Studio. I can’t find my pen. There’s movement up the steps, someone walking with a dog, I hear the sniffing. There a bark from the other side of the door. My dog barks and I call him over, he doesn’t come over. I call him over again and he comes over, but doesn’t stop barking. I call my dog up and he sits. He and I have a moment. I don’t look good, but I love my dog and I take this opportunity as a photo op with him. He’s showing a lot of attention to me for once. I decide to take a video and tell him how much I love him which turns into how much I failed him. Which turned into how much I failed my mother. That got me back to thinking a lot. Which leads me back to being penniless and jobless. Which led me to looking up easy ways to kill yourself, from where I passed the prevention hotline number and when straight to Wikipedia which I proceed to scroll down. Then my phone dies.\n\nI took out pictures of my mother and had an emotional breakdown. The biggest one I’ve ever had, while people are moving in upstairs. I didn’t show shame. I cried. \n\nGuess tomorrow is another day... to live.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ionwsf/covid_depression/", "title": "Covid Depression", "social_network": "reddit", "user": "HarleyWGolightly", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1599542924, "permalink": "/r/Suicidal_Thoughts/comments/ionwsf/covid_depression/", "nsfw": false, "first_save": 1635428854.1013348, "replies_charged": false}