{"id": "t5_28vigg_t3_kxsn4t", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40", "048f49dc-273e-4b10-8bfb-66f763289af0"], "text": "It’s really interesting when thinking about death, some people don’t mind how they go out, but there are some who just want a quick painless death. In all actuality there is no such thing as a painless death because there’s only the certainty of pain. Because there’s no way to actually tell if a method is painless because the subject dies and then there’s nothing to tell from the body besides it’s mutilation. And that’s the only reason why I’m not going through with it. \nBecause the way I leave my body is gonna show how much pain I was in in my final moments and the fact that I’ll be hurting my mom in the process. She’s really the only one who’s keeping me here, like if I lost everyone besides her I believe I’d still be here. Does that make me a bad friend? I do care about my friends and their wellbeing but I don’t think I truly care for them. Damn, not sure why I’m like this. Things were going well. It’s also interesting to see who comments on peoples posts on here. Some serious posts talking about taking their lives almost never get a comment, while something like this post, maybe, would get a comment of encouragement. Like people pick and choose who they feel can be saved. And that’s some melancholy horse sh*t, everyone can be saved, it just takes time effort and patience. The world is, beautiful, there’s no denying that, it just gets to be too much most of the time, overwhelming. Like, I have anger management issues, partial OCD, depression, anxiety, and a superiority complex. I have no drive to live, or dreams to pursue. I’m not really sure why I’m here. Also, if you have an empath problem here’s a trick I used to help myself: the Egg Theory. Basically all of us share the same soul and we live out every life on earth. Everyone on earth is ourselves. And thinking about that and analyzing people really helps me be empathic and might help you too. Doesn’t excuse peoples heinous actions or anything but it’s just really interesting. Aaaaand this is how I get through my depressing thoughts. I talk until I calm down. I hope this rant helps someone else too.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/kxsn4t/tldr_i_rant_to_make_the_special_thoughts_go_away/", "title": "TLDR; I rant to make the special thoughts go away, hopefully you find it entertaining", "social_network": "reddit", "user": "Responsible-Key3137", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1610709624, "permalink": "/r/Suicidal_Thoughts/comments/kxsn4t/tldr_i_rant_to_make_the_special_thoughts_go_away/", "nsfw": false, "first_save": 1635428923.912985, "replies_charged": false}