{"id": "t5_28vigg_t3_fo9rey", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "My name is AJ I feel broken and i dont know what to do I have people around me who care but I dont trust myself to believe that they are real. I am lost im my own head in the thoughts of that I am not good enough I will never be good enough. My friend is over at my house thus week so i have no time to get a knife to my arm I dont know if that is good or bad in my mind its bad cuz I deserve it becuase all i am is an attention seeker and i dont deserve all of the love that I have. Why cant I just be thankful for once in my DAMN life I am pathetic and no one should care about me. I am nonbinary but I'm not sure if I really am I am so confused and scared of myself. I am scared of what will happen to me if I let it go to far I have attempted suicide but it never worked. My family loves me and i put on my fake smile and laugh every day. I always want to help other people who are struggling and I want to be there for them but i just dont see it in my heart to help myself. This post is a pathetic call for help becuase i am too neieve and broken to do it myself I am kicking myself for even writing this becuase I dont deserve help I deserve ro strugfle and to get eaten up by my thoughts. I HATE MYSELF I DESERVE TO DIE I DESERVE TO SUFFER AND I DESERVE RO BURN IN HELL WHICH I WHERE I AM GOING. I hate looking at my face I hate hearing my voice I hate hearing ppl say that they love me because ITS NOT TRUE. I always tell myself that I am nit depressed and that I am just looking for love that I already have but I dont deserve. I know no one will read this but that's ok and if you do that no you.\nSorry for the bad grammar", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/fo9rey/a_call_for_help/", "title": "A call for help", "social_network": "reddit", "user": "rawr_69", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1585073012, "permalink": "/r/Suicidal_Thoughts/comments/fo9rey/a_call_for_help/", "nsfw": false, "first_save": 1635429635.7636058, "replies_charged": false}