{"id": "t5_28vigg_t3_mkyopp", "request": ["65b8351b-5dc2-4143-a37d-f2748f6d42bb", "90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "I'm thinking about it, just bullet to the brain and boom, gone. I always tend to fuck things up, wether it be School, or social interaction. For school, I know I can do my best easily, but I'm always distracted, and because of that I'm always behind, failing. I've tried to fix it with some methods, but nothing sticks, and because of my failure I might be a HS Senior two years in a row. My Dad hides it but I know he hates me for it, hates me for wasting his time and energy to help me fix my fuck ups, and bail me out if I'm in serious trouble. He's helped so much that I'm grateful, but I think that only makes it worse on me in the future since I can't fix my own shit. But that's not why I'm fucked, I'm fucked because of the lack of social experience. I've had literally zero real friends growing up, no weekend get togethers or weekly communication. Nothing. But last year, at 17 years old, I finally got one,and it was awesome for a while. But it ended up in the ditch because of something so fucking dumb that's it honestly depressing. I always initiated convo on Snap everyday, and I'd always get low energy responses. I ignored it since we always had fun when we hung out. But the one day I didn't initiate, she stopped talking to me. To this day I still haven't got anything from her. At all. I later saw on her story that she found someone to replace me, so fuck me ig. So I grew a shell, kept my pain to myself. It has made me cold and offensive to most if not all people I try to talk to. Most of the time I'm just trying to impress them but I say some fucked shit, and it goes sideways. I don't have time to think since I'm just so excited to have someone actually enjoy talking to me, or even let me talk to them, that I don't think and just say whatever comes to mind. It has happened again recently when I tried to make a joke on a Snap GC with Discord buddies. Said something fucked in response to someone else's hot take and they all started going at me. As they should have. I'm so fucked that I felt like shit, not because of what I said, but that they were killing me with words. I just wanted to have people to talk to, but everytime I strive towards something I fuck it up, because of my fucked self. So yeah, bullet to the brain doesn't sound too bad. Probably would a lot of people happy.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/mkyopp/im_tired/", "title": "I'm tired", "social_network": "reddit", "user": "otheraccforreasons", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 8, "down_vote": 0, "creation": 1617667716, "permalink": "/r/Suicidal_Thoughts/comments/mkyopp/im_tired/", "nsfw": false, "first_save": 1635429125.2423553, "replies_charged": false}