{"id": "t5_28vigg_t3_pfc6bm", "request": ["20e5f323-e2c4-450a-8af3-177af94313bf", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "I’ve lived with depression/anxiety issues my whole life. I’m one of those people who never planned for the future because I thought I’d just kill myself after hs, then college, and now I’m where I am today. But because of a bad mental breakdown my senior year of college I gave up on what I wanted to do in life. My life isn’t TERRIBLE but it’s still worse than where I wanted to be.\n\nThe other night I took some shrooms, which usually make me think about things, and I started reflecting on my life choices and realizing I screwed up everything. I’ve never HAD a worse panic attack than I did in that moment, I was so upset with everything. I was crying, hyperventilating to the point where I couldn’t breathe, having so many negative racing thoughts through my head. I had such a bad headache that lasted well into the next day and it felt like my brain was getting ripped in half between all the negative thoughts and the half of me that knew I shouldn’t listen to them.\n\nObviously the shrooms were a big push into this attack, but had I not taken them idk if I would’ve ever tried to get my life back on track. I’ve still felt really depressed and stressed for the past 2 days, but then today happened.\n\nI went to the laundry mat. One person took up all of the fast machines and chose not to start them until I was about to use them. Then one of their washing machines broke down and the door wouldn’t unlock to get their clothes out. Then one of the dryers they tried to use ate up a ton of their quarters. I ended up being done and out of there before that load in their washing machine even got taken out.\n\nI walked all over town for errands. Had to use about 7 crosswalks and every single time I’d hit the button I’d immediately get the right of way to walk.\n\nThen something I needed from Walmart for weeks that’s been out of stock was finally restocked, I didn’t even PLAN on going into Walmart, I just went because I had an errand to run in the same area.\n\nNow it’s worth mentioning that I’m Wiccan. I thought the whole laundry thing was just “rule of thirds” aka, kinda like karma. But then all the other things happened and I got to thinking why everything is going so well for me today. Then I thought maybe it was the universe telling me not to kill myself:\n\nLaundry? “Your situation could’ve been worse.”\nAll the crosswalks changing as soon as I hit the button EVERY time? “Don’t *stop* your life, change is coming.”\nWalmart finally having the one thing I’ve needed for months? “Things will work out, just be patient and don’t lose hope.”\n\nOf course I know damn well these were all complete coincidences, but the witch in me just can’t chalk it up to that. And if it helps me a tiny bit about how down I’ve been feeling lately, does it really matter if they *were* just coincidences??", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pfc6bm/some_strange_coincidences_after_i_had_a_complete/", "title": "Some strange coincidences after I had a complete existential crisis…", "social_network": "reddit", "user": "Throwaway_bae420", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1630435737, "permalink": "/r/Suicidal_Thoughts/comments/pfc6bm/some_strange_coincidences_after_i_had_a_complete/", "nsfw": false, "first_save": 1635428974.7523715, "replies_charged": false}