{"id": "t5_28vigg_t3_qhf6b2", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "cf81d7c0-cd42-4d3e-a15d-51251de387ba", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "I guess I don’t know where to start, I’ve always been the “big” kid growing up, I’m 23 now. It was always hard making friends or even leaving my house. I was bullied countless times and it resulted in me fighting which triggered my anger more. I was suspended throughout three different schools during my childhood. Each time, my parents and I moved i cause trouble again. It wasent until high school where I finally saw a doctor and short enough, he told me that I had severe depression and anxiety- offered me some “happy pills” I told him to fuck off and didn’t take them. I graduated high school (barley), parents were proud of me. But, as immigrant parents usually are, they pressured me to go into college and study stuff I really didn’t want to. So I did, dropped out multiple times. Now here I am, writing this post on Reddit, don’t know why but I’m still feeling the same way. I’ve written my note over and over again but could never fully commit to ending it. I even wrote a separate note to my parents which I keep hidden. I can’t find motivation anymore, I’m stuck with no job just collecting money from whatever the government gives me. I go to to the gym, sometimes. It boost me up, but at 23 I got nothing to live for, can’t find the motivation, and honestly feel like I’ll leave nothing behind if I did die. I know my parents would be sad but as time goes on so will life and they’ll get over it as much as many other so called friends I had will to. Anyways, that’s my story. If you made this far thank you for reading if I don’t reply to your comment, we’ll, you’ll know why.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/qhf6b2/heres_my_story_its_a_long_one/", "title": "Here’s my story, it’s a long one.", "social_network": "reddit", "user": "Small_town_boy23", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1635396337, "permalink": "/r/Suicidal_Thoughts/comments/qhf6b2/heres_my_story_its_a_long_one/", "nsfw": true, "first_save": 1635428837.0726147, "replies_charged": false}