{"id": "t5_28vigg_t3_nwqesl", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "Today I lost my gf, who i cared about more than my own life. She helped me out through tough times, my parents bringing me down as usual, drugs, alcohol.... I could never thank her enough. Yesterday she told me to go and talk to her best friend who was having suicidal thoughts of her own. Her best friend was my ex, who I had a history of disagreeing with. From what I deduced, she was sad because me and my gf were together, and I wasn't with her. The type who might say \"If I can't get him, no one can!\". I didn't want to talk to her for that reason, but my gf was sad I didn't want to talk to her so I took the leap I knew I shouldn't have took. \n\n\nThe next day I woke up, thinking about her as usual, told her to not worry, she was mine and her best friend wouldn't get into my heart, she believed me. Then everything is fuzzy until my gf was mad at me, because I talked to her friends, who had been told by her best friend that I was an idiot drug addict (which I wasn't anymore). Her friends started getting mad at me and at her, I tried to tell my gf it would be okay but guess who took her phone ? Her best friend. She started saying very mean shit about me and then when I attacked her back she went to my gf and told her I said that. She was afraid I would fix it, because she knew I would. Spent all morning arguing with her, then I got to speak to my girlfriend. Wasn't the sweet reunion I had wanted. She'd only taken her best friend's ideals into account, saying one thing that was wrong with me after the other. I then told my best friends (yes i know a lot of best friends here but stick with me), who were agreeing with my gf's best friends I have no idea why. \n\n\nThen we broke up, quickly and hurtfully. Her best friend had won at a game I thought I could've won, all because I was online (my mistake i know guys i ll never do it again). Currently sitting in an overheating room cutting my arm everytime I think of her and what I did wrong. If anyone has read this far, I won't go back into drugs and I won't give up on life just yet. Tell me one thing that is going on well in your life, or as many as you want, you will help me heal. Who knows, maybe we might become friends and help each other out ? Thank you for reading this, you'll get through this storm, just like I will. Just think about why to keep living, not why to die\n\nEdit: If any of you wants to keep in touch with me thru social media so we can talk in dms, feel free to go in reddit (altho i dont check often) or thru discord: @TheLunchBox#2810", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nwqesl/lost_my_only_will_to_live_today/", "title": "Lost my only will to live today.", "social_network": "reddit", "user": "TheLunchBox31", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 12, "down_vote": 0, "creation": 1623338872, "permalink": "/r/Suicidal_Thoughts/comments/nwqesl/lost_my_only_will_to_live_today/", "nsfw": false, "first_save": 1635429262.4120057, "replies_charged": false}