{"id": "t5_28vigg_t3_n325qp", "request": ["d76dec3b-b6e9-43b7-bfb3-d6c48dabd65b"], "text": "Yes, you heard that right death cannot come soon enough. Why don't I just kill myself now you ask? Well purely because I am a mama to an 8 month old puppy and if I died now my parents would probably give him up. It is solely for that reason, I don’t want my little buddy to be abandoned by the people he trusts and loves the most. If it weren't for him I wouldn't be here posting this.\n\nFor context I am a 27 year old female with severe cerebral palsy. I only really have use of the right side of my body and I cannot walk without assistance.\nMy parents are in their 50's and 60's and I feel they now regret adopting me as a newborn, finding out I was disabled and deciding to go through with keeping me. They are old and tired, after all these years of psychological abuse and gaslighting (even though they will deny it.) I have come to the conclusion that one day soon I need to free them and everyone else around me from myself. I have a younger brother too. Although I feel he's not a very pleasant person and doesn't like me I can't say that I blame him, I don’t like me either.\n\nMy family often say that they can't do certain things that they want to do because of my disability. This upsets me because it feels like it is my fault and that I chose to live this shitty life. Which I clearly didn't, who would?\n\nWhen you adopt a child and find out that they are disabled you need to ask yourself the following things:\nAm I willing to sacrifice my entire life to care for this child on a full time basis? And in 10 years time will me and my spouse still be able to without taking it out on the child when it gets hard? \nIf the answers are no, then no matter how hard it may be do not go through with it. It's a situation where nobody wins and it's not fair on yourself and especially the child.\nOver the years I've had to have caregivers come in 3 times a day almost every single day to get me out of bed, take me to the toilet and give me showers etc. All while my parents are either around or going out and spending time with friends \nThey are genuinely good people and I get along with them. But at the same time I wish they would just go away and that I could do these things myself.\nIf I was normal I would try to pursue a career as an actor or screenwriter. Not because of the potentially good money and fame that may come hand in hand with that. But because if successful I would actually mean something to the world Although I'm not going to bullshit you more money would make life easier for almost everyone. But I would probably give the majority of it away to save animals and to people who need it more than I would.\nBefore you say that ol ignorant quote: 'Well, it could be worse.' Shut the fuck up! This is not a let's all measure our dicks of suffering. Also don't tell me that I need to trust in a God of some kind. \n\nPersonally I have seen and heard too many fucked up things to believe in some magical being in the sky who loves us all. That thousands of years old book may say that, yet contradicts itself by constantly describing events that clearly demonstrate the tyrannical opposite. Euthanasia is legal where I'm from. But under the tightest of restrictions. In that it is only an option if someone is terminally ill and has less than 6 months left. While I agree that these kinds of people should be prioritized by the system and their wishes should be treated with dignity and respect. I can only hope that one day those in power will see that living with mental pain and an overwhelming amount of demons is a valid reason to not want to go on anymore. \n\nI will not get better, I will not get married or have kids and I will die a virgin. You know what? That's okay with me I accept that and are fine with it. There is no point in whining over that, it won't help anyone.\nI would like to die when I'm either on my late 30's or early 40's. Obviously in the most painless way possible, as I'm sick of pain. I want to be free of it.\nThank you for reading this. Love me or hate me for posting something like this. Truthfully I don't care, nothing can change my mind, it would take a miracle. From my experience those don't happen.\nI will finish with a quote from my favorite character in my favorite book and TV series because I just feel like it.\nI watch and read a lot Those things are one of very few escapes I have from this world.\n'The night is dark and full of terrors...but the fire burns them all away' - Lady Melisandre of Asshai", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/n325qp/im_disabled_and_i_cant_wait_to_die/", "title": "I'm disabled and I can't wait to die", "social_network": "reddit", "user": "LionofLannister25", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1619944198, "permalink": "/r/Suicidal_Thoughts/comments/n325qp/im_disabled_and_i_cant_wait_to_die/", "nsfw": false, "first_save": 1635429545.7016215, "replies_charged": false}