{"id": "t5_28vigg_t3_owvav9", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "I'm not necessarily someone who \"wants to die\" but lately, I've been given too much to handle.\n\nA little backstory: I'm 30, and I currently live in a one bedroom apartment with my mother (I sleep on the couch, she has the bedroom), we've lived here for 3 years after a much worse living situation. Back in 2018 my fiancé got really sick and ended up passing away, and that was the worst experience of my entire life, I still haven't gotten over it entirely. But anyways, My Fiancé's sister stepped up and offered to get us into the place we're currently living, Mom has bad credit, and I have almost no credit (ghost credit), so getting into an apartment like this is rather difficult. My Fiancé's sister had it set up so she would be on the lease, and I'd be the occupant, She assured me that everything was fine, and going to get better. Well now, The apartment complex is trying to say that my Mother is an \"unauthorized occupant\" even though we have been in this living situation for over 3 years, and the previous management had no issue with her living with me.\n\nI'm a very meek and timid person, I have almost zero social skills, and i've been so overwhelmed with depression lately, I don't know what to do. It's like the universe is trying to push me to end it all. But I don't necessarily want that, But I can't take the stress, anxiety, and pain anymore.\n\nI know suicide hotlines don't work, please don't direct me towards them, that's probably the absolute worst thing you could do for me at this current point.\n\nI just don't know what to do. I feel backed into a corner, we can't really afford a rent increase. I'm afraid i'm going to lose everything.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/owvav9/i_just_kind_of_need_to_vent_or_talk_to_someone/", "title": "I just kind of need to vent or talk to someone", "social_network": "reddit", "user": "BirdofPrey702", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1627962723, "permalink": "/r/Suicidal_Thoughts/comments/owvav9/i_just_kind_of_need_to_vent_or_talk_to_someone/", "nsfw": false, "first_save": 1635429218.8284385, "replies_charged": false}