{"id": "t5_28vigg_t3_obxzrg", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab"], "text": "I try to understand emotion but i can’t quite grasp it. I understand that you can measure feelings or emotions, not that i know the difference, but how does it work? What determines love? How can people love so much? How do i know what i’m feeling? How do i fathom others emotions?\n\nI always felt stupid to admit that i don’t have the skills to, know emotion because at my teenage age i should know. Everyone else does but that’s not the point.\n\nMy point is that i do feel emotions. I met someone at a hospital i was admitted into and she was so pure and how i pictured autumn to look like if it was a person. I felt so safe. I felt worthy. She helped herself by helping others and she was so good at art. and it hurt me to see what she has gone through at such a young age with a heart like theirs.\n\nI felt a different kind of feeling that i imagine what love feels like. \n\nI like my family and they’re cool i guess but i don’t think i love them. I feel bad that i don’t. but the feeling i, had, for this girl was so different, cliche i know. It was definitely nothing i’ve felt before.\n\nBut i can’t remember it at all. Nothing. I know i felt it, i know it was something but i don’t remember it. It’s like it slowly left my brain, like every feeling i’ve experienced before slowly evaporates and leaves me with no memory. I cant explain it, i don’t remember the feeling. It makes me sad that i can’t remember her scent or how her hugs felt.\n\nmaybe if i remembered feelings like i remember peoples hands feeling up my adolescence body, pain of sexual assault, pain of my anxiety, getting beaten as a child, neglect,  maybe everything would be better.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/obxzrg/do_you_forget_feelings/", "title": "Do you forget feelings?", "social_network": "reddit", "user": "omnichordharp", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1625182274, "permalink": "/r/Suicidal_Thoughts/comments/obxzrg/do_you_forget_feelings/", "nsfw": false, "first_save": 1635429219.3974824, "replies_charged": false}