{"id": "t5_28vigg_t3_oqeiu3", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "I hate how much people give a shit over useless stuff. People argue about the stupidest things and i'm tired of it. Why do people get so angry over other people having fun if it's not hurting anyone? It's ridiculous.\n\nThen there's so much ACTUALLY angering shit that's going on and nobody cares. Everyone wants to get more upset about some person on Tinder who likes zodiac signs than anything else. Do people honestly have that much time to spend worrying about this shit?\n\nI can't even talk to people I care about anymore without getting angry. My friends feel fake, my mother pisses me off even when she's being nice to me, and everyone around me has shitty lives too. I'm a 14 year old and it already feels like i'm wasting my life away already. I have dreams of jobs but i'm also accepting that i'm going to get nowhere in life once i'm done with highschool\n\nIn online communities i'm in, there's always way too much drama. I can't even enjoying anything without it being ruined for me. And I can't blame other people for this either, they aren't responsible for how i'm feeling, but I get livid at them anyway for being such dicks that it turns other people away from an otherwise fun community.\n\nAm I a hypocrite for getting angry over other people getting angry? Maybe, but that doesn't make me any less mad. I wanna be dead, but I also don't have the courage to actually end my life. I wish someone could just kill me in an accident so I can just be done with this bullshit.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/oqeiu3/i_wanna_die_out_of_anger_not_sadness/", "title": "I wanna die out of anger, not sadness", "social_network": "reddit", "user": "YumiGumiWoomi", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1627084031, "permalink": "/r/Suicidal_Thoughts/comments/oqeiu3/i_wanna_die_out_of_anger_not_sadness/", "nsfw": false, "first_save": 1635428993.2400231, "replies_charged": false}