{"id": "t5_28vigg_t3_kqa2xn", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c", "7e28da7a-0583-461d-a0da-99621d24119a"], "text": " I live my life by only these facts-\n\nRandom things happen to random people for random reasons. Good and bad is a dichotomy human brain created in order to process  and distinguish between positive and traumatic external stimuli. So, both good and bad things can happen to both good and bad people. There is no karma, only the collective survival and self preservation instinct of an entire species working to weed out potentially harmful agents in order to protect the species. \n\nLife is not beautiful, ugly, worthy or unworthy. It’s only a process to transmit information to aquire as energy efficient configuration as possible with slight variation. Humans or any other species on this planet are only alive because they are subconsciously dictated by their biology to survive, in order to produce a healhty offspring, take care of the said offspring and ensure this chain of events don’t get disturbed. That’s why suicide has such negative connotation around the world in every culture, because it breaks this chain of events and if more individual of a species aquire such mindset it could lead to wiping out of the species, but since self preservation instinct is stonger and more primordial it triumphs most of the time.\n\nWe created society because our number one advantage over other animals is our numbers and our will to cooperate with each other to achieve our goals. Another advantage is our creative mind which helped us to strategize bette. Over time this brains of our gets honed with each bit of information humans get about the universe. With time this developing brain of ours with the capacity of logical reasoning started to analyse the basis of it's own existence and found it to be as special as that of an ant or a cockroach we buldgeon under our sleepers due to our ignorance or discomfort.\n\nThis created an empty feeling, a sense of unimportance in some humans like me and people on subreddit like these. Society as a guardian of human race created many construct like religion, marriage, etc to keep us occupied so that we don't drift into deep thoughts and find ourselves reaching the same conclusion. It created more constructs to keep us preoccupied and it was going fine until the internet arrive and flooded our minds with so much information and visions of perfection. The constructs created by society to prevent us from falling us into the canyon existential dread are now pushing most of us towards the same canyon with ferocious force. It was bound to happen because we inflated this phenomenon called life and especially human life so much with bogus constructs that failing to satisfy the parameters of those constructs became more important than living. We were always scared to see life as it is, because it destroys the illusion of superiority and bring us to the levels of every organism on earth. We wanted to be special, because since ancient times we were told stories of how awesome being a human is. But it's not. Whatever humanity has achieved as whole or as an individual, is just the sake of this one goal to maintain the survival of our species, that's it. There is nothing special, because literally every other organism on this earth is doing the same shit, but we are special because we created contraptions to wipe our butt clean with the push of one button.\n\nWhat i want to say is that, we as an organism are on this planet for survival, it's a part of our biology. When some of us face this reality it breaks the illusion of specialness and can lead them to the question \"What's our purpose\", that many of us have faced many times in our lives. To mitigate the fatal dread this existential question pose, human society created some constructs, like marriage, getting As in academic life, being beautiful, being most wealthy, etc. And it was totaly fine to confront these question with any of the answers. But no. We have to complicate this thing by overblowing the importance of these construct more than surviving. And when people fail on the metric of these construct the ignorant society bully them as worthless. But in truth all of them are equally worthless because their success is as equal as the failure of the person they are laughing at, in the grand scheme of the universe.\n\nOur approach should have been, \" We are animals that have mental advantage as compared to physical strength. We are as important or unimportant as the fly you just swatted. It just wanted to survive and now it's gone. So, don't take anything seriously. We are born to survive and procreate, but since there are so many of us you don't need to do the second part if you wish. Now, that left us with the survival part. Do what ever you want, but don't try to hurt others, because this planet is big enough for all of us to live the life we want without intentionally hurting anyone. Love who ever you want to love man or woman. Do the things you like to do, because it's your life your choices.\"\n\n&#x200B;\n\nBut instead what we got is a world with hairless primates with inflated sense of self fighting among themselves, to impose their will on each other for the sake of constructs like honour, relegion, countries, money etc.\n\nThat's why when someone asks me on internet why you want to die, when they are so many things to look for and then they start naming the above constructs like a robot and I am like, no construct you mentioned is of any importance to me. But the world we live in, forces you to indulge in these constructs like earning money, for which you would to indulge in so many constructs like taking a job, studying for that job, getting straight As so that you get the best job etc; in order to fullfill basic needs like food and shelter. Since I am not good in satisfying the parameters of any of the above mentioned constructs, it's better to end myself rather than living like a burden or destitute, which is the final destination of many, who failed to do so. It may also free up resources for those who are more accustomed to these system of constructs.\n\nSo, these are my thoughts about life and society in general. You can see for yourself that a person with a thought process like me could neve be succesfull, because my brain ristricts me from doing anything that will increase my chance of getting succes in these systems of constructs.\n\nAnyways, thanks in advance for sparing your precious time in reading this near existential rant of a nobody.\n\n***\"UTOPIA IN MIND, DYSTOPIA IN REALITY,***\n\n***TORN BETWEEN THEM,***\n\n***SUCH IS THE CRUELTY.\"***", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/kqa2xn/my_thoughts_regarding_life_in_general/", "title": "My thoughts regarding life in general.", "social_network": "reddit", "user": "KINGYOMA", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 10, "down_vote": 0, "creation": 1609771591, "permalink": "/r/Suicidal_Thoughts/comments/kqa2xn/my_thoughts_regarding_life_in_general/", "nsfw": false, "first_save": 1635429356.3592267, "replies_charged": false}