{"id": "t5_28vigg_t3_pldc78", "request": ["b38140a1-7eee-49dc-9a69-c07b4318950c", "b4d8161b-7016-486a-a4bd-5fb6a5aa639e"], "text": "At this point im really sick. Constant plaguing suicidal thought. General unhappiness. Effectively trapped for 4 more years in my contract. \n\nIm struggiling to not let it affect my work because the moment it does it will make my life signifigantly harder and if the figure out why ill be even worse of than before. My coworkers are definitely not people I would really go for help, once I slipped up and made a serious suicidal comment and well that ended up as a joke. \n\nIm locked in this position of suffering where nothing brings me joy anymore all my hobbys and things i do for fun becoming dull. Going at and socializing feels like a chore now. Wearing a mask everyday thats slowly starting to crack. Having this stress pain in the back of my head that makes me want to ram a knife in my skull just to stop it.\n\nIve really been trying. I been forcing myself to do all the right things. Eat healthy or just eating(for a bit i lost alot of weight due to appetite loss). Excercising, trying to be positive and outgoing. Managing things as well as i can. I just feels like I can no longer keep it up. Plus all ive been doing is forcing myself i hardly feel like living is my choice. After i am a cog in the military. I honestly wish i wasnt here.\n\nI honestly wouldnt have joined but i felt like i had no choice struggling to make ends meet working a minimum wage job with no college. Covid made me go out of work repeatedly. For some people i imagine its great, food, housing, healthcare, and benifits. But honestly i just keep feeling more and more miserable depspite not having to worry about starving to death.\n\nAt this point i want to quit but even if i got thrown out that would put me back at square one. Struggling to meet basic needs. I just want to give up. Just stop moving and leave. Each day im hardly living anyway. I dont really have anyone anyway. Im pretty much on my own.\n\nAnyway I kinda dont really want to suffer for a while I wanted it to be an \"accident\" but opportunitys arnt arising, i also really dont want to suffer anymore so i dont really want a painful option. So im trying to figure that out right now. Looking at sleep aid meds right now.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pldc78/eh_really_looking_to_off_myself_at_this_point_gov/", "title": "Eh, really looking to off myself at this point gov makes it a pain to do so.", "social_network": "reddit", "user": "rockyanim8", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1631245450, "permalink": "/r/Suicidal_Thoughts/comments/pldc78/eh_really_looking_to_off_myself_at_this_point_gov/", "nsfw": false, "first_save": 1635429435.2676592, "replies_charged": false}