{"id": "t5_28vigg_t3_lo4jkx", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0"], "text": "I am a F(22),  I have never hated myself this much.\n\nI hate women who are so condescending towards other women and most of them happen to be my aunts.\n\nI got an hour long lecture from my aunt about how guys will be guys and what a women's job is.\n\nSo a bit of backstory why this is relevant and so hurtful.\n\nI recently broke off my engagement, it was a really toxic relationship which drove me to the Rock bottom.\nI wanted to die rather than continue my life with the guy.\n\nI dreams of being independent and living a happy life were thrown out of the window.\nIt was more like babysitting a guy and then being yelled at by him for not putting in much effort.\n\nThere were a lot of things that within a span of 2 years made me consider death a more reasonable choice.\n\nMy family knew about this and though it took a lot of convincing I finally broke off.\n\n\nI finally felt free but it wasn't long.\nMy family started making accusations like how I broke off over a gift and the gifts weren't nice.\nI never thought I would feel so cheap and people think so less of me.\n(just for the context it was valentines day and he got me clothes to make up for threatening to kill himself if I ever leave him )\nAlso I gave every damn thing back.\n\nI told my mom I don't need a guy to to do anything. I can take care of myself and her and I want to work.\n\n\nI was criticised for this too by my aunt ofcourse.\n\nShe said, oh you don't have to worry about her she has a son he will take care of her.\n\nGuys are idiots and you can't expect to have a perfect relationship if you don't compromise and condition the guy as per your needs.\n\nGirls aren't supposed to have such dreams of working hard they need to look for a husband.\n\n----\n\nI am legit busting my ass over here just to listen to \"you need a guy to complete you\".\n\nI have never felt so worthless in my life.\n\nI know women face it on a daily basis and I hope y'all can relate.\n\nAfter 2 years of depression (clinical) this is where my worth is.\n\nI so wish I was dead. Not to make them feel bad or anything just stop existing.\nLike I never happened.\nIt would be so peaceful for everyone.\nI am so done.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/lo4jkx/i_never_wished_for_this/", "title": "I never wished for this.", "social_network": "reddit", "user": "nukeDworld", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 11, "down_vote": 0, "creation": 1613817422, "permalink": "/r/Suicidal_Thoughts/comments/lo4jkx/i_never_wished_for_this/", "nsfw": false, "first_save": 1635429016.3875723, "replies_charged": false}