{"id": "t5_28vigg_t3_m26pna", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40", "b4d8161b-7016-486a-a4bd-5fb6a5aa639e"], "text": "im 18 years old (male). I've been depressed and suicidal, for as long as I can remember now and i suffer from severe dissociation disorder which increases my other problems, and i have anger issues. I believe this to be as a result of my father and the trauma that he caused me in my life. he is also depressed and suicidal, and he used to be very abusive (due to his anger issues) towards my mother and me. HE WAS NEVER PHYSICALLY ABUSIVE TO MY MUM, just emotionally. i want to make that clear and while he definitely was physically abusive towards me, it was more emotional than anything as well, or maybe the physical just caused emotional. he's better now though, and i forgive him for everything. i have 3 other brothers, he was never abusive towards any of them in anyway. 2 of them are younger than me, so he probably just changed before they were born, but my older brother is a different story. it was obvious that he was my dads fav child, which hurt a lot and eventually i came to realise that it’s because he see’s all the worst parts of himself in me. the anger issues, the depression. everything. that’s why he hated me. because every time he looked at me he saw a reflection of everything he hated within him. i even have his resting bitch face lmao. but yeah he's somewhat better now though, still sad but not as angry. my auntie (dad's sister) told me that she had realised that i'd always gotten the short end of the stick with my dad, which was honestly nice to hear. it was nice for someone realise what i had been through, because honestly i felt quite alone. while, my dad is better, im not. i live every day depressed and have suicidal tendencies. i want to note that while i am depressed, its not severe. my suicidal thoughts are more... like i just cant be bothered anymore. i have really bad dissociation disorder, where it feels as if im constantly in a state of dissociation... like im in the backseat or living life on auto pilot. ive always struggled with putting these thoughts into words, but it kinda feels as if ive seen behind the curtain and i can never un-see what i saw, and now life is pointless... if that makes sense. it feels like ill never snap back into reality and that im seeing all from third person, which makes me want to end it and just give up. not because im sad, or because its all too painful, but because it just feels meaningless and i cant be bothered to live like this. i have a girlfriend who i love and loves me back (who ive been with for over a year now), i have a loving family, im doing fine in school and i know what im doing next, yet i still just want to die. i dont have any problems with addiction and i feel completely adequate in life, so why do still want to die? i really feel my dissociation disorder is the root of my want to kill myself, but why do i have to feel this way? i know im mentally ill because it cant be normal for someone to want to die so bad. i honestly feel that the only reason i haven't done it is because of the effect that it would have on my family and friends, but mainly because of how physically painful it would be to actually do it. if i had access to a handgun, i would have already done it, but i cant due to restrictions where i live. i dont know if nayone will respond to this tbh, ive already wrote loads and theres stuff that i just cant put into words as well, just though this would be a good place for these thoughts.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/m26pna/depressed_suicidal_dissociated_and_angry/", "title": "depressed, suicidal, dissociated and angry", "social_network": "reddit", "user": "eli_ij", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1615405900, "permalink": "/r/Suicidal_Thoughts/comments/m26pna/depressed_suicidal_dissociated_and_angry/", "nsfw": false, "first_save": 1635428837.379455, "replies_charged": false}