{"id": "t5_28vigg_t3_pd1foq", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "65b8351b-5dc2-4143-a37d-f2748f6d42bb", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "\\> I am 29\n\n\\> I have two degrees and no useful skills\n\n\\> I have ADHD and can't ever get my shit together\n\n\\> Therapy and Psychiatry don't help\n\n\\> I have no car and no license, I cannot drive, but despite promising myself every year to change this I never do\n\n\\> I hate my job and besides minimum wage retail there is no way out (my degrees are fucking useless)\n\n\\> I am 5'2\", skinny, have bad knees, poor vision and generally do not possess any genes that would be worthwhile passing on\n\n\\> I am no closer to achieving any of my life goals or dreams than I was 10 years ago\n\n\\> I'm a Black guy; no one is going to come rescue me. The world, in general, does not care about my existence\n\n\\> Both my long-term relationships have failed and the current girl I'm seeing will soon get tired of me too\n\n\\> I contribute nothing to society, but I am a drain of resources for an already overburdened planet\n\n\\> I have only ever had three reasons for not killing myself: (a) hope that things will get better, (b) fear of death and (c) not wanting to hurt people who mistakenly care about me. But I no longer have much hope that things will get better, and I am going to die anyway. Everyone dies and the planet is better off with me dead. So really I'm only alive so other people won't be sad. Which is really fucking sad.\n\n\\> Today, my only means of reliable transportation (an e-scooter) broke down on my way to a potential lead for a new job (same shitty work, new shitty location). My current job is ending in a few days and I need money. I of course never made it to the new lead, and now I don't even know how I'm gonna get to work on Monday. Either I'll find a bus route or I'll just walk for an hour and 15 minutes. I don't know how it got so bad. Every year I say things are going to get better, that I'll get my act together and my life will all start to work out but that never happens. Every year is as crap as before. I feel like I'm lying to myself. That I'm just evolutionarily unfit for existence. Maybe the best thing I can do is just die.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pd1foq/i_am_a_failure_and_the_planet_is_better_off_if_i/", "title": "I am a failure and the planet is better off if I die", "social_network": "reddit", "user": "BackLikeOsiris", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 16, "down_vote": 0, "creation": 1630117464, "permalink": "/r/Suicidal_Thoughts/comments/pd1foq/i_am_a_failure_and_the_planet_is_better_off_if_i/", "nsfw": false, "first_save": 1635428988.2359934, "replies_charged": false}