{"id": "t5_28vigg_t3_pzg268", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "65b8351b-5dc2-4143-a37d-f2748f6d42bb", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "Sorry for the long post but. A partner and I parted ways and ever since that happened I can’t seem to function right or think right. Everytime I speak to them it just hurts, everytime they needed me I was there for them and it hurts a lot. I’ve recently attempted to take the easy way out but I was hesitant, the longer I keep going on the more tempting it feels. I cannot say I moved on or anything because I know I have not but I just don’t think I can take it anymore it just hurts too much to even wake up. \n\nI’ve cried myself to sleep so many nights I couldn’t sleep nor eat, everytime I go to work it feels daunting because I feel super weak. I just feel super tired of feeling like i’m not worth it or worth the patience. They meant the world to me and now I cannot see life without them. Which is one of the reasons I feel like I cannot carry on anymore. I don’t just have thoughts about the easy way out I feel like I want it more than ever. \n\nI feel like I cannot keeping fighting my anxiety and depression anymore and I want to give in to them and let them take their toll on me. Maybe this way it’s easier? Maybe I won’t have to feel anything when it happens. I just hate everything I used to love nowadays and don’t see any point in carrying on anymore.\n\nAm I wrong for this? Because I feel like everything is my fault.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pzg268/feeling_overwhelmed/", "title": "Feeling… overwhelmed", "social_network": "reddit", "user": "F4ppingP3ngu1n", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1633118974, "permalink": "/r/Suicidal_Thoughts/comments/pzg268/feeling_overwhelmed/", "nsfw": false, "first_save": 1635428845.9845405, "replies_charged": false}