{"id": "t5_28vigg_t3_p6ncaq", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e"], "text": "So my manager suspended me today over some petty stuff. She was about to give me some good news about a promotion after my shift but instead cut my shift early and sent me home on investigating suspension. It was a rough night at work so maybe she was taking her stress out on me. But I thought she was trying to help me. I have a daughter that I signed her custody over to my stepmother because I was struggling so bad financially I was barely able to take care of her and her Mimi offered and I know she can give her a better life than what I could and can at this moment. I talk to her as much as I can but I also work alot trying to get back stable. I am debating about killing myself today.  I want to take a big bottle of sleep pills and just go to sleep. I know that is selfish because my baby needs me. But she has great Daddy who is doing his best to get her back too. I don't exactly want to die I just want the pain to end. I am a month shy of 23 years old. I do have depression and PTSD because of abuse in my past. I was a foster kid so it's not like my family really cares about me anyway. I just feel like I'm a burden on everyone. The pain is obviously not going to end. My whole life I has been hell. Even when I was 7 years old I didn't really have a smile just a mask. Maybe you think I'm exaggerating but I'm not. My hell started before I even knew what right from wrong was. Like I said I don't really want to die I just want the pain to end. And at this point killing myself might actually relieve everyone else too. They ain't gotta worry about me anymore or argue with me and I don't have to feel my own pain anymore. It's kind of a win-win. Plus my daughter will be okay. She has her Mimi already spoiling her and her Daddy is close to having his place to bring her home to. So she really won't be at much loss and she won't have to worry about me with my depression when she gets older either. \n\nP.S. don't suggest medication please that's the last thing I want to hear", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/p6ncaq/i_want_to_die/", "title": "I want to die", "social_network": "reddit", "user": "PuzzleheadedEar7337", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 11, "down_vote": 0, "creation": 1629276855, "permalink": "/r/Suicidal_Thoughts/comments/p6ncaq/i_want_to_die/", "nsfw": false, "first_save": 1635428845.3562915, "replies_charged": false}