{"id": "t5_28vigg_t3_ohmsp7", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I have a long history of mental illness and suicidal thoughts and all of that. If it interests you I was diagnosed with bipolar ii disorder when I was first hospitalised and then diagnosed with \"borderline personality disorder traits\" on top of that upon my second hospitalisation. I've also tried (and obviously failed) to attempt twice. \n\nToday is different, though. Today I learnt of a new way to make an attempt after looking for one everyday this week and on and off all year. Since then my mind has just been racing about all the things I'll need, funeral and after-death arrangements but I keep hitting this block at \"what happens if I fail again?\" Anyone who has tried and failed at an attempt knows that you just end up feeling like a loser and even a little worse than before. In my case I even had a hangover but some uni work to submit. Those times it was some what easy to hide the fact that I'd made attempts at my life but with this way it doesn't seem like that will be the case. I'm scared of being found and being forced into hospital again for the third time in a row. \n\nI'm not looking for advice in how to get away with it. I know that's against the rules but I thought I could vent about it here. I've done a good job at isolating myself from everyone so reaching out will be a nuisance for them and I'm sick of therapy \n\n(PLEASE DO NOT ASK ME WHAT IT IS. I WON'T \"SHARE\")", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ohmsp7/i_feel_sad_saying_i_felt_relieved_after_planning/", "title": "I feel sad saying I felt relieved after planning my death", "social_network": "reddit", "user": "lukewarmtaco124", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 14, "down_vote": 0, "creation": 1625937599, "permalink": "/r/Suicidal_Thoughts/comments/ohmsp7/i_feel_sad_saying_i_felt_relieved_after_planning/", "nsfw": false, "first_save": 1635429248.646699, "replies_charged": false}