{"id": "t5_28vigg_t3_ly4vhn", "request": ["029ade1a-045d-4a03-b80e-2f560fb4018f", "cf81d7c0-cd42-4d3e-a15d-51251de387ba", "b4d8161b-7016-486a-a4bd-5fb6a5aa639e"], "text": "I'm hopeless. I was diagnosed with depression and anxiety last year though I already had it for many years previously, I simply kept quiet till I was hanging on by a thread. I'm in therapy and am on meds and have amazing friends and family who do their best to support me but nothing seems to work. Sometimes meds and therapy will help for a month or so then I'll come crashing back again and each time it's torturous and I feel like I've failed everyone. I hate this constant cycle and I cut and have consistently thought about killing myself and even researched so I could make sure that if I do it, I succeed. But I hold back because I know it would absolutely destroy the people who care about me, many of whom will take the guilt upon themselves and I'm worried it might push them into a dark space. But staying is horrible. I feel like a burden constantly calling my friends crying and always ruining the mood because I just can't be happy even on my good days. It's tiring for them to have to constantly worry about me and I'm tired of being so helpless and draining them. I'm stuck and I want out but I can't. Except more recently, the urge to just end it is stronger. Every day I'm thinking about it. I have a bottle of sleeping pills which I have collected over time as I'm only prescribed them weekly. And I plan to grab a bottle of alcohol and down them together. I don't want to feel like this anymore. I can't deal with knowing they'll be scarred and blame themselves forever but I also hate being here.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ly4vhn/i_am_a_burden_no_matter_what/", "title": "I am a burden no matter what", "social_network": "reddit", "user": "iam-questionmark", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 9, "down_vote": 0, "creation": 1614921814, "permalink": "/r/Suicidal_Thoughts/comments/ly4vhn/i_am_a_burden_no_matter_what/", "nsfw": false, "first_save": 1635429073.3177032, "replies_charged": false}