{"id": "t5_28vigg_t3_ntcoqw", "request": ["e4caf65e-8cb5-40e4-9897-4291adbe7f3f", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab"], "text": "I have been sad since I was 11 (I am 15F now). Long story short my dad's twin died unexpectedly in 2017. My dad became depressed, he didn't have strength to shower, walk or go outside. He was on antidepressants for a year, and it helped him but some of his bad habits stayed (poor hygiene and being numb). At the same time we fell into bad financial problems and he started drinking alcohol. My older brother was there physically but I think that he just didn't get what was happening to our family. I became my mother's phycologist and learned all the adult problems when I was 12. Also you know when your room becomes really messy when you're really sad, well that was our entire home since then (which is also stressing me out). Ar around 13 I started self harming, it wasn't really bad, I didn't do it often, and the cuts weren't deep. I wasn't that insecure in my looks . But as the years passed it just kept getting worse (my family life and my cutting). I had friends, but this just wasn't something that I could ever tell them because I don't want to be pitted or looked down on. When my brother moved out last year I just lost it, he was the only positive thing in our household. I started cutting more and more seeing my limits (when I was doing homework, having a bath,...) I got terrible scars and also began having acne so i just didn't want to go outside because of how ugly I felt. I love seeing my friends at school but I just felt like shit every time I got out.Oh yeah i was also one of the poorest kids in my class (that also fucked me up). Bikini season is coming and I don't know what to do (well I didn't go on a family vacation since 2016 so the problem is going to the pool with my friends). Well I plan to just kill myself in the bath (with clothes on because I don't want my parents to see my ugly scars). But also if I do that my parents would probably die of sadness , BUT ALSO fuck them for taking my childhood away from me because  they were depressed. So yeah, you know what they say about hope dying last, well I think it's game over. The only thing that is left to die is my pitiful and atrocious body. And I have and idea to maybe just butcher myself with a knife a couple of times because that will probably be a beautiful way to die. The first of August feels like a good time to do it. Welp it felt pretty good to rant out to strangers like this.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ntcoqw/a_rant/", "title": "A rant", "social_network": "reddit", "user": "dreamy_love18", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1622950723, "permalink": "/r/Suicidal_Thoughts/comments/ntcoqw/a_rant/", "nsfw": false, "first_save": 1635428897.9138114, "replies_charged": false}