{"id": "t5_28vigg_t3_mj55z4", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I've technically attempted to die 4 times by now. Failed every time. Im not gonna attempt anything yet, i'm only going to do so when it's official that i don't pass highschool by not being able to finish 4 whole research papers/experiment reports by april 4, or max april 5 latest due to my own fault and weird brain stuff. At least with 4 attempts, i know what doesn't work (I also found a new nice, efficient way to commit suicide, so, neat). I got a whole school mad and on my tail, my family (specifically one parent) threatening just the absolute worst things to me (on top of already treating me like shit ahaha), a brain that just feels like static and cotton wool combined, anxiety fear and stress so bad lifting any limb feels like concrete and my vision goes dim from time to time, on top of many other things. All in all, just, man... Im already a shitty person and student, but, man. Nothing and no-one is helping. Everything sucks. Im not even doing anything anymore at this point, just fighting to cope and handling everything and not go off myself yet. Which does absolute jack shit, cause I need to finish those damn papers. Idk. I cant get anything done. Never did, and never do. Everything sucks. That's all. Just venting here that includes suicidal thoughts, cause this is a place to put suicidal thoughts. Whatever.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/mj55z4/everything_sucks_everything_sucks_010/", "title": "Everything sucks. Everything sucks. 0/10.", "social_network": "reddit", "user": "CluelessRedditor121", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 10, "down_vote": 0, "creation": 1617441808, "permalink": "/r/Suicidal_Thoughts/comments/mj55z4/everything_sucks_everything_sucks_010/", "nsfw": false, "first_save": 1635429223.5449326, "replies_charged": false}