{"id": "t5_28vigg_t3_pl41jf", "request": ["e4caf65e-8cb5-40e4-9897-4291adbe7f3f"], "text": "I'm one of those annoying people that seems to have a lot of medical issues. It's definetly not something I enjoy, it's gotten me to a point where I will deny/ignore problems just to avoid having to deal with doctors and insurance, the whole mess. \n\nWhen I was 18 I was in a car crash, hit head on by a drunk driver. It was pretty serious, at the time there were concerns about my neck and future ability to walk. The bigger issues actually became the severe facial trauma I suffered as result of impact wi th the airbag. My whole face had to be reconstructed, nose, cheeks, jaw, etc. I spent weeks in a medicated comma, months in the hospital, had multiple procedures. At a point early on an aneurysm was discovered. More surgeries, years before I'm done. I live with facial scarring, pain, nerve damage, and a disorder with my eye that can't be fixed - I can't really see out of it or move it. \n\nDespite this set back at a critical moment on my life, I picked myself up and kept going. I wasn't bitter really, not at first. I had to keep going, there was no point in complaining or self pity. I finished my degree, went to grad school even. I met someone who didn't seem to mind my funky face, someone who made me feel okay, someone who loved me - for a time.\n\nNow more time has passed, more random medical trauma has occurred, more surgeries and pain. And I can feel him slipping away from me. I've already lost most of my friends because they \"couldn't deal\" with having a friend whose body seems to want to die all the time. Cant say I blame them.\n\nIf you have read all this, thank you. Maybe Im hoping to find someone like me. I feel very alone most of the time. My husband will barely look at me or talk to me. I feel like I am nothing but a burden on others. I don't want to be here anymore :|", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pl41jf/why_should_i_keep_going/", "title": "Why should I keep going?", "social_network": "reddit", "user": "trash_cat13", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1631213560, "permalink": "/r/Suicidal_Thoughts/comments/pl41jf/why_should_i_keep_going/", "nsfw": false, "first_save": 1635428897.1994102, "replies_charged": false}