{"id": "t5_28vigg_t3_kag3ck", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "Feelings\nI usually don’t feel normal things. Like normal emotions. I do feel happy sometimes, sad , lonely, and all that. I feel normal stuff, but at the same time I also know I’m different. I don’t know if it’s because of my past, my mental health, I don’t know if it’s from things I’ve seen and witnessed because I know that I do have at least a little ptsd  from some of the things I’ve been through and seen, but I don’t care because it’s made me more in touch with reality. I don’t know exactly why, but it started about when I was 12, I changed. I started seeing life and reality how it really is, I started thinking abt things and feeling stuff I never did before. The only feeling I can give to describe myself is physchedelic. It doesn’t make sense to everyone but to me it does. It’s just every minute of my life I feel like I’m on a rollercoaster, a never ending rollercoaster of happiness and sadness that just loops around me forever and never ends, I feel like I’m always high I don’t know why. It doesn’t make sense but that is really how I feel all the time. I just always feel like there is something different running through my veins. I don’t know why. But I know I’m different than most people, and I’m not crazy, I just am very much more self aware than most people are. It’s good and bad. I am intelligent with most things too, I can be good at school but I feel like it’s a waste of time and mind. I realistically won’t use any of it, because I’m not like everyone else.  I always just feel like I’m the only real person and everyone else is just all the same. I’ve never met anyone different like me. I can’t hold a relationship because of how hectic my life and mind are. I never want to put people through that because I always think I don’t wanna take someone on this mind ride with me it’s my own situation. That’s why I try not to make friends or get in relationships because I don’t wanna put people through me.I always feel sad, and I lash out at people sometimes, I don’t mean too, it’s just I try so hard sometimes to get people to understand me and my mind, but of course, nobody ever will. And that is okay with me. I used to be toxic, because I was just as confused about what I was doing and why I was the way I was as everyone else used to be. But I’m okay now, I don’t lash out, I’m calmer now. It’s like whenever you cut yourself, it hurts at first, and it’s intense and you feel adrenaline, but after a certain limit of pain you just stop feeling, almost like the brain doesn’t know how to cope with that severity of feeling or pain. That’s how I am, I thought I was going crazy, I was sad all the time, I was scared, I didn’t know what I was going to do next, but now I am calmer, I can control it , and now I don’t freak out or get scared, I just feel numb. Also I’m always nice to people, I always try to make sure everyone is okay and happy, because honestly nobody ever does for me and I’m always lonely, so I try to make sure other people don’t have to go through that so I’m always happy to people. This is also why I like slowed down music, because my mind is constantly spinning and listening to slow music gives me a chance to slow down and sync with everyone else. This stuff sounds stupid to whoever may ever read this but all this stuff just explains me and how I am. I just feel like every time I close my eyes I’m so high in the sky, alone on a burning rollercoaster going all day long, constantly. It’s fun but can also be stressful at times. Sometimes I feel like I’m going crazy, but I know I’m not, my mind is just very hectic and sometimes it’s a lot to handle so I feel like I lose a grip on myself sometimes and go off the rails, but I always get back somehow. I used to actually think I was possessed or something 😂but now I know it’s just my mind. I’m just a very outlandish person, no other way to describe it. I’ve done bad things, things I won’t say on this note, but I’ve been through some stuff that nobody knows about, and nobody except for me will ever know about some things that I’ve done. That’s okay with me, because I try my best to make people see that I’m positive, and I try to act happy to everyone, so my real feelings and the things I’ve done will all die with me and that’s fine with me. It’s hard for me to connect with people, because I’m not like them, and then I just give up. That’s why I stopped talking to almost everyone I used too. To many people to handle and I like being alone. It’s a lot to handle sometimes, that’s why I tried to kill myself so many times and was depressed because I just couldn’t handle my mind anymore, but I’ve learned too. I was going through a lot, lost one of my girlfriends that actually understood me, but she committed suicide because she wasn’t well at home. I lost friends, I’ve lost so many things. But I always remember as long as I’m still sitting in my mental rollercoaster alone, I don’t need people sitting around me in my life. It’s more peaceful alone for me. More enjoyable honestly. I love my family, but a mind like me needs a lot of alone time. Nobody really understand me or gets what I feel. I don’t blame them, it doesn’t make sense if you aren’t living through it. Me and Olivia my little sister are the most similar because i am the way I am and she is more of an introvert, like me. But we didn’t talk for years because I think we thought we hated each other but we really just didn’t talk. I love Sophia my twin sister but she is just a toxic person. I love my mom but she will never understand my Mind, and that’s okay. My dad won’t understand either but they both try, and it means a lot, but I wish they wouldn’t because it’s a waste of time. I don’t need help, I just live a different lifestyle than everyone else, and I always will. I will always do crazy pshychedelic things that won’t make sense to most people. Parking a car at the top of a hill and doing acid at night while it’s windy and cold and listening to music then staying at a carnival or party all night long and blasting music and doing drugs to numb myself doesn’t sound normal,but I do that regularly ,but I feel like things like that are the only things that calm me down and bring me back to reality. That’s why I’ve always had a love for rollercoasters and amusement parks, and the whole amusement park/ carnival aesthetic in general. I just feel like because my head is always spinning and on a trip, when I’m on a rollercoaster it’s almost like I catch up to my own mind for a second. I’m in sync with myself while I am on a rollercoaster because of all the spinning and flipping and turning, rollercoasters are hectic and instense similar to the way it feels for me with my mind all the time, so it balances out. That’s why I’ve always said if anyone ever had to live in my mind for just a day, they would probably drive themselves crazy or kill themselves, because it’s scary sometimes feeling this intense. Not for me, but at first I was scared which is why I tried to kill myself so many times. The only real reason that I haven’t killed myself is because of Michael my little brother. Can’t do that to him, I should have done it when he was younger so he wouldn’t even remember me, but now he’s older and smarter and he remembers me and he loves me, so he wouldn’t understand if I just disappeared from his life one day, and I just can’t bring myself to leave his life like that. Not everyone can handle feeling like this, it’s hard for me sometimes too and if I had to choose to be like this or normal, I would choose this though. It’s a trip. if anyone ever sees this, I know it sounds crazy, but trust me Im ok. I’ve learned to deal with it and I’ve accepted that I will probably always feel this way mentally. That’s fine with me. I can be normal, I’m mature, I’m smart, I’m funny, it’s just this that I keep to myself. It’s Thursday October 22nd , my name is Ethan starr. This was just a full on explanation of myself.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/kag3ck/i_dont_know_how_much_longer_ill_be_here_so_here/", "title": "I don’t know how much longer I’ll be here so here is just something I wrote about my mind and feelings so it’ll always be out there somewhere ⚠️", "social_network": "reddit", "user": "Heavy-Yak381", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 10, "down_vote": 0, "creation": 1607610158, "permalink": "/r/Suicidal_Thoughts/comments/kag3ck/i_dont_know_how_much_longer_ill_be_here_so_here/", "nsfw": false, "first_save": 1635429296.3554904, "replies_charged": false}