{"id": "t5_28vigg_t3_ihgzls", "request": ["029ade1a-045d-4a03-b80e-2f560fb4018f", "65b8351b-5dc2-4143-a37d-f2748f6d42bb"], "text": "I'm over it, not sure where to start so I'll go from tots. My dad was a cop, my mom was a fucking cultist.  I'm an invasion era combat vet. Until Monday I had been a civil servant at one level of gov or another for 22 years then I got laid off. Where to begin? So my dad was one of the first SWAT cops ever, in Chicago in particular and the Midwest as a whole. He was alright I had a decent relationship with him till he passed, while I was invading Iraq.  Which was fucked up as cult bitch mom had been dieing in a bed for years and yet somehow out lived him, evil bitch.\n\nMy early life sucked ass for years till my ma left to go do cultist things. My dad moved in with my grams, whom we both loved. He obviously worked fucked up ass hours but when he was off we did all kinds of cool shit. I think i was in 2nd grade when ma came back. I was fucking pissed even as a what, 8yo? I hated her so much for just thinking it was cool for her to just roll back in like it was normal. No one cared what I thought and that made me mistrust dad on a hardcore level, even at that age. I have guilt about that but, he did me wrong, hard wrong. \n\nOnce ma moved back in she went after my relationship with Grams like a fucking demon. Hid me away,  made dad get his own place again, talked shit to my young ass about my rather fucking awesome and loving grams, to my face like I knew what she was talking about. FUCK! Then at like 9 or 10 years she left dad again  but took my ass with her this time. I WAS NOT COOL WITH THIS! \n\nI was beaten regularly with switches and other such southern fucking bullshit. I was sexually abused and punished for bull shit reasons by the rest of the community as it was known. I rarely saw my mother because I needed to be brought in line with the community again, as it was known. I don't remember or want to talk about much but I will share this, I was once fed napkins for a fucking day because I had a booger hanging from my nose and no one told me. STRAP THAT SHIT ON. \n\nI remember dudes I didn't know taking me and my bullshit ma to Charlotte NC Airport one day. They had suits and my dad and grams were there. I was so happy to see them, grams went the fuck off on ma in public, asking the suites dudes to arrest her but they didn't do shit to ma. I even yelled for them to lock that bitch up but, dad just picked me and carried me away. That was my second plane ride ever. Ma was in the back of that plane. FUCK.\n\nWe got back to Indianus and I lived only with grams for years. Then I turned 12 and was sent back to my \"parents\" man, I was fucking devastated beyond explanation. Suddenly I couldn't play with toys anymore, I had chores all day, everyday and if I got a C in anything  in school I was beaten, terribly by my ma with my dads belts. This was my new life? I ran away repeatedly but could only run to grams, where she found me everytime, duh.\n\nNow I'm in my early teens, junior high, getting in fights and getting suspended constantly! Like three times a week I'd beat a mother because someone knew who I was and told thier kids I was mouth raped as a child. I didn't want to be a giant cuntbag but you can't just talk shit about that to my face, of course I beat your child's ass, I was no longer able to feel physical pain. I just reacted. The punishments for these transgressions were not only fucking weird but mentally destructive. \n\nThe first semester was standard, dad would express his disappointment, fucking pussy ass. No longer a cop by the way.. Then shit just got out of this world. I once had my entire room taken away. I had to sleep in the guest room, after I helped dad take the fucking door off of the hinges. So there I was, just on fucking display for that terrible bitch. I was made to dust my actual room everyday while I was suspended so I would miss all that I had had before I got into more fights. Then, after that was all over guess what.... id5just have to go beat a mother fuckers ass again so, it was worse. \n\nAnyway, I can't keep on that topic for too long. It reminds me of how my dad failed me as a protector and a mentor. So I ran away at 16 and became a crust punk. Now hold up as I've never written a post this long and I want to see if it'll actually post...", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ihgzls/im_just_tired_42m_ive_been_tired_longer_than_most/", "title": "I'm just tired (42M), I've been tired longer than most of you have been alive.", "social_network": "reddit", "user": "smittyhotep", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 11, "down_vote": 0, "creation": 1598515019, "permalink": "/r/Suicidal_Thoughts/comments/ihgzls/im_just_tired_42m_ive_been_tired_longer_than_most/", "nsfw": false, "first_save": 1635429081.409729, "replies_charged": false}