{"id": "t5_28vigg_t3_q05uyl", "request": ["029ade1a-045d-4a03-b80e-2f560fb4018f"], "text": "Isn’t it crazy how you can know life is good, you can even sit there and go into detail with yourself why you love life… all of the things that make you happy on replay in your mind. Yet somehow, that ONE dark little thought still overpowers every single good thing. Like a vine. It grows around and embeds itself in every thought. No matter how happy it is. \n\nSometimes, rarely, I find myself in a moment where it’s not RIGHT there. But then I take a step back and there it is, tapping. Tapping at my window, begging to come back in. Guilt tripping me. Reminding me of all the shitty things I’ve done. Telling me I don’t deserve any of the good things. \n\nThere are even times it isn’t present for days, or weeks, and  I think it’s gone for good. Jokes on me though, that pesky little FUCK is always lying dormant, like a cancer.  Everything is great. No signs of it. I have no idea anything is wrong. \nThen one day, boom. I collapse and suddenly it’s embedded in every fiber of my thoughts. \n\nI know nobody cares and it probably sounds pretty stupid but FUCK. It’s like im swimming and barely touching the ground because the waves are big, not too much to handle. I can deal with it for the first moment. Im fully capable. But then the waves get too big. I lose control and I’m drowning if I don’t jump at just the right time. \n\nI guess what I’m saying here is,\n\nI’m losing the strength to keep jumping the big waves, and there’s not a lifeguard anywhere in sight.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/q05uyl/i_think_i_finally_found_the_words_for_what_goes/", "title": "I think I finally found the words for what goes through my fucked up head", "social_network": "reddit", "user": "happydaze_", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1633217093, "permalink": "/r/Suicidal_Thoughts/comments/q05uyl/i_think_i_finally_found_the_words_for_what_goes/", "nsfw": false, "first_save": 1635429066.8771784, "replies_charged": false}