{"id": "t5_2tand_t3_eybl0m_t1_fghfokl", "creation": 1580783775, "origin": "t5_2tand_t3_eybl0m", "height": 1, "replied_to": "t5_2tand_t3_eybl0m", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "furrysurender", "text": "Your perception on what life is, is limited, as is everyone’s. We only know so much. We’re told that our lives should look a certain way. But honestly, everyone feels similar to you, more or less. No one has it figured out, no one is having a fantastic time every single day. No one is sure of their future. No one is ready for change. Everything you’re feeling is so widely relatable, it might help to remind yourself that it’s not you vs the world. You’re in the same boat as a lot of different types of people, people you wouldn’t expect to relate with you, people you assumed were happy or having a good time - it’s just that we’re not telepathic. We can’t read each other’s minds. We don’t live the lives of others. We don’t see what people go through behind closed doors. You’re not wrong or different. We’re more alike than different, it may surprise you. \n\nThe future rarely looks like what we expected it to, in good ways and bad, so there’s really no reason to obsess over the idea of what your future is going to look like, although I completely understand and have been there myself. Something that helps is changing up your usual routine. Do something that you wouldn’t normally do, even if it’s as simple as going out somewhere to get food or coffee. Just change it up. Even if it scares you. When you change up your normal routine when stuck in a pattern of negative thinking, you remind yourself how change is always possible, it’s happening right in front of you. What was once going to be another typical day, has changed. Through action. You can’t think your way out of this, that’s what I’ve learned. If you’re more in your head than you are in your body, it’s time to balance things out. Creativity, exercise/sports, hobbies, volunteering/social interaction - these are all things that help us get out of our head for the moment and into the body as we are physically doing something that requires more mental focus than the our obsessive negative thinking, and it serves as a reminder that life is more than just thinking. Our thoughts can take us somewhere else, transcend us. It can also take us to our own personal hell. Life is more than just the mind. Stopping and looking around and focusing on all the objects in the room you’re in, the movement of your breathing, the feel of your skin, the noises you hear - these are all things that are with you in the moment. You can focus on these things when you find yourself drifting into a different place in your mind. Your thoughts about your future aren’t real, they are valid, but they do not exist, they are an idea, and if it isn’t serving you well, it’s time to let that idea move on so you can move on past it. If you want to change, you can. If you believe nothing will change, nothing will. If you believe one day things will look brighter for you, they will. You have a choice in the say of your future. And that’s through the actions of your present moment. You can’t think your way out of this one I believe. Best of luck x", "permalink": "/r/DecidingToBeBetter/comments/eybl0m/i_want_to_be_more_optimistic_about_the_future_so/fghfokl/"}