{"id": "t5_2tand_t3_olziey_t1_h5ixuof", "creation": 1626536748, "origin": "t5_2tand_t3_olziey", "height": 1, "replied_to": "t5_2tand_t3_olziey", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "_sparrow", "text": "You’re definitely right that two people can build something up from nothing, but after nearly a decade it’s clear that your partner has no interest whatsoever in putting in his own true efforts to change. I’m sure you get heartfelt apologies, and maybe even see “progress” for a couple weeks, or a month or two, before he “slips up” again and the cycle starts fresh with his emotional apologies and promises to try harder. But if he were really trying you wouldn’t still be having these problems. \n\nTo be frank, it’s not hard to not cheat in a relationship. It’s actually incredibly easy not to cheat. All you have to do is not flirt with other people. You say “Oh, I’m sorry, I’m already in a relationship,” if someone offers you their number or asks you to come home with them. If the temptation is a struggle then just go home and go back out another time when you’re in a better headspace. Your boyfriend isn’t doing any of these *very* simple things. And just because you’re not a peach 100% of the time doesn’t mean his cheating is excusable or forgivable. If you don’t like how someone is treating you you either leave them or draw a hard boundary within the relationship. He’s taking advantage of all of your compassion and loyalty, and with this long and ongoing of a precedent being set I think the only way to get him to stop taking advantage of you is to leave. \n\nYou say that he’s genuinely sorry, but if he were *genuinely* sorry he would have stopped this disgusting and degrading behavior. He’s only sorry that he got caught. He has so little respect for you that he tries to cheat with people that he *knows* will probably tell you, but he does it anyways because he knows you’ll forgive him anyways. \n\nI know it’s hard to believe that you will be able to love anyone else as much as you love this person you’ve spent 9 years with, but once you’re with someone who is fiercely loyal to you I promise your heart is going to swell with so much love and gratefulness that you’ll wonder why you put up with this guy for so long. I spent years stuck in cycles of dating serial cheaters, and also dating serial abusers, and I know that leaving is the hardest part but life is so, so much more fulfilling and rewarding once you finally do.", "permalink": "/r/DecidingToBeBetter/comments/olziey/tips_on_how_to_live_life_while_waiting_for_your/h5ixuof/"}