{"id": "t5_2tand_t3_qai2ux_t1_hh41ubw", "creation": 1634567547, "origin": "t5_2tand_t3_qai2ux", "height": 1, "replied_to": "t5_2tand_t3_qai2ux", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gigimera", "text": "I really, strongly empathize with your perspective. Some of your struggles are eerily similar to mine - I too am an art student and focused too much on my partner the last year. This added to me gaining some new problems due to my stubbornness. I'm working through it, but as long as the willingness is there, it's going to be ok! But enough of me. \n\nYou're very courageous for applying for these jobs and I applaud that! You actually started overcoming yourself to become closer to do the thing you love.  The response is certainly crushing, so don't deny that it's hurting you. In fact it could be causing that brain fog. \n\nI think you feel awful with the feeling of the world turning against you, and your hobbies seemingly being denied to you. It's an awful weight to bear, especially with the added negativity of Covid and all that jazz.\n\nOverall, it sounds like you have a lot of trouble handling your situation alone. Your energy is muddled and shooting haphazardly into places, and you feel very small and unsure. But I think you already did some great steps. You just need to focus that energy better.\n\nIt's never easy, but if you have someone like the right therapist to talk to, it can help you find a bit of structure, it can help you regain that focus and importance of your own work. (And find out why you're so drawn to doing it!)\n\nWe also have social media to thank us feeling as though our work is insignificant. But never, ever let it do that to you!! Your art is a whole world. Treat the very moment now as the most important thing in the world. What you are doing right now is the most important thing in the world. Don't think about others. Don't let your energy be diverted into another being. You come first!! You do!\n\n 2D Animation is also very demanding field, and it takes a lot of energy. So you need to feel as good as possible. Also, I think it would help you to make a really small project. Make a 10 second movie. What story can you tell in 10 seconds? Or a one page, two page comic. Finishing it will make you feel really good. You just need to overcome the mind tricks and insecurity that comes with starting each new project. (It doesn't really go away, but you become stronger each time you overcome it.)\n\nAlso, as harsh as the response from that internship person was, it might also be the thing that can put you in the right direction. It teaches you to not rush into things. Seriously, don't rush your work! It's literally so important that you just do it and don't think about the results. Each new drawing is great and wonderful as it is, because you did it purely for yourself.", "permalink": "/r/DecidingToBeBetter/comments/qai2ux/lost_in_my_head/hh41ubw/"}