{"id": "t5_2tand_t3_madmt0_t1_grurnt0", "creation": 1616446316, "origin": "t5_2tand_t3_madmt0", "height": 1, "replied_to": "t5_2tand_t3_madmt0", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NauticalFork", "text": "I think my issue around meditation is kind of the opposite of what you describe. Know yourself -> love yourself has merit, but I feel like I've gotten to know myself *too well,* to the point that I hate myself. I've spent lots of time alone with my thoughts, and those were the times in life that I barely remember because of how distant and uncaring I was then. When I lost my first job after college, it was like I just mentally shut down for about six months. With no job, a girlfriend that left months prior, friends that all moved away to get married and start families, and all that... it was like I got to see what the real me was like. Like that \"when the chips are down\" moment you described, and I hated the empty, vapid person I became who just started at walls and absentmindedly scrolled the internet. I still spent some time writing then, but it was all terrible and I continued to collect rejection after rejection like I do to this day because I'm \"not the right fit.\" \n\nAnd I feel like my self-awareness is alright. Like, family and co-workers often are surprised by and compliment my emotional awareness, especially self-awareness.\n\nIt's basically like I've seen who I am when you take away my job, my social life, and my chance at love, and I hate that person so much. Success is the only thing that keeps me from that person. If I lost my job now, I would probably become that person again. And knowing that that person is a part of me, I feel like I can't really love myself, and that if anyone were to get to know me well enough, they would eventually see that part of me and realise that that inner ugliness is why women and publishers don't want me.", "permalink": "/r/DecidingToBeBetter/comments/madmt0/my_entire_life_ive_hated_that_so_much_is/grurnt0/"}