{"id": "t5_2tand_t3_idxrnv_t1_g2d6cqg", "creation": 1598043142, "origin": "t5_2tand_t3_idxrnv", "height": 1, "replied_to": "t5_2tand_t3_idxrnv", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "linkertrain", "text": "Ooh bud, I feel you on that. I’m a year and a half in on my sobriety. I took the suggestion not to date for a year seriously too, but now here I am, and... I have no idea what I’m doing, no idea what to do. Someone asked me when I was first in rehab what my idea of a perfect first date is, and I had to think a moment and realize I genuinely didn’t know anymore. I could tell them what it used to be, hanging out in a parking lot somewhere, talking, listening to music, getting high and maybe hooking up. I realized that my addiction was so pervasive that it’d become my personality, and without it I wasn’t sure who I was or what I wanted. Now I’m a year and a half in and my general feeling of un-readiness has turned into an anxious tummy. I, too, realized how the self-centered-ness of who I used to be manifested in relationships and I how my priorities had been so self serving in the last few years. I even went to a few codependent anonymous meetings (CODA) and they opened my eyes to a whole new landscape of character issues I didn’t realize I was carrying. Which was terrifying. Like finding a new door in your house you’ve never noticed before, and you crack the door open and take a peek inside and... it’s a mess, like a bomb went off. And you think, ohhhh fuck me. This is new stuff I have to deal with. A year into sobriety and I feel really good about my progress and oop, ohhh uh oh, here we go, starting from the bottom again. That said, I really, REALLY enjoyed the CODA meetings and I’d highly recommend them, I only stopped going because of covid. \n\nBut it doesn’t change the fact that I feel like I have no idea how to date now. Where do you go? What do you do? I don’t mind bars either but exactly like you said, it can be a little weird for the other people when you’re not drinking, especially if it’s one on one. Genuinely, I do not know. The other day my dad and I, talking about girls, kind of made a lighthearted comment about how I’m 25 now and getting older and I thought YA THANKS DAD I’M VERY AWARE. What’s the answer? I haven’t got a clue, unfortunately. But I don’t think I’ll be in this in-between-place forever, I have hope it’ll turn out. Just uh.. not sure how the middle steps will look on the way from here to the goal. But I’ll figure them out, I’m confident. \n\nDo let us know if you make some progress or figure it out, myself and other people like you are definitely out here, feeling the same things and wondering the same questions. Best of luck to you, my brother.", "permalink": "/r/DecidingToBeBetter/comments/idxrnv/ive_recently_tried_to_open_myself_up_to_dating/g2d6cqg/"}