{"id": "t5_2tand_t3_khi92q_t1_ggmvpcl", "creation": 1608592441, "origin": "t5_2tand_t3_khi92q", "height": 1, "replied_to": "t5_2tand_t3_khi92q", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "playboycartier44", "text": "Recently I had to admit this about myself. It’s difficult. It doesn’t always mean your an asshole or anything. We all have shit we could stand to change about ourselves. Some people’s shit just presents itself in more quantifiable ways. We only stop growing when we’re dead. So while I get that it can be hard to admit certain imperfections, don’t feel bad!\n\nYou’ll realize very quickly in your healing process that the past doesn’t matter at all. All you can do is learn what you need to and keep it pushing, trying to be the best version of yourself you can be. \n\nMy biggest advice is to not waste your time fixating on the past. Reflect on it and process it. Grow as a person and apply the overarching lessons you get from it to your future interactions, but don’t beat yourself up about it. \n\nNobody should be the same person their whole lives. You’re entitled to fuck up, and evolve. Whether that’s with people you might have inadvertently hurt or not. If you didn’t do anything super fucked up and your intentions were mostly good, there’s not a whole lot anyone can say about that. \n\nSo many people never realize they need to make these changes. As a result they live their lives out as unhappy people with no friends and shitty relationships. \n\nYou’re not subjecting yourself to that, which already puts you so far ahead of the game. All you can do is try your hardest to be the best version of yourself. \n\nPart of this growth will cause you to reevaluate your priorities, and that’s good. You should sleep well at night knowing you will soon not have to face the burdens of this social stress. Just trust the process and focus on living in the moment and trying to facilitate a better future. I wish u luck in self-improvement!", "permalink": "/r/DecidingToBeBetter/comments/khi92q/i_want_to_be_better_i_am_a_toxic_person/ggmvpcl/"}