{"id": "t5_2tand_t3_khi92q_t1_gglwi48", "creation": 1608574639, "origin": "t5_2tand_t3_khi92q", "height": 1, "replied_to": "t5_2tand_t3_khi92q", "down_vote": 0, "up_vote": 156, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Vampire_sloth", "text": "I might be wrong here, and if anyone wants to correct me they’re welcome to, but as recovering toxic person I managed to get a lot better initially by learning social rules of how to be a good person and then trying to act on them. \n\nThere’s a book by Dale Carnegie called “how to win friends and influence people” that I picked up partially because I heard good things about it and partially because I thought it would help me influence people, lol. It laid out a lot of groundwork about the ‘theory’ of being a well liked decent person.\n\nBut really, as I changed my toxic behaviors one by one to more positive ones I noticed the benefits in how people treated me, and the enjoyment of that led me to get better.\n\nI unfortunately still occasionally have bouts of toxic behavior with my parents, but that’s because they’re kind of toxic too at times and I get punished if I’m not being toxic, but my friends think I’m a pretty good person nowadays, and I’m happy about that.\n\nSo my two key points are: learn and read books on how to be a good person/how to recognize toxic and harmful social behaviors.\n\nAnd if you hang around other toxic people it might make sense to stop hanging out with them. Part of how toxicity happens to some people is they were brought up in an environment where toxic behavior was considered normal.\n\nAnd honestly, if you have some friends or a decent person that you interact with regularly: you could try telling them that you are trying to improve as a person and ask them if there was anything recently that you did that bothered them, and what could you do in the future to be better. At least that’s what I did.\n\nIf you have any specific questions, feel free to send me a DM.", "permalink": "/r/DecidingToBeBetter/comments/khi92q/i_want_to_be_better_i_am_a_toxic_person/gglwi48/"}