{"id": "t5_2tand_t3_mpxuog_t1_guf02th", "creation": 1618348750, "origin": "t5_2tand_t3_mpxuog", "height": 1, "replied_to": "t5_2tand_t3_mpxuog", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "startingfresh1120", "text": "Habits and procrastination. What you’re describing isn’t entirely a self control issue. You’ve established a number of habits. Now, these habits in and of themselves aren’t bad necessarily. You aren’t doing schedule 1 drugs, after all. However, it sounds like these habits are getting in the way of you getting what you want out of life. It also sounds like you are using these habits to avoid doing other things. Procrastination doesn’t necessarily mean laziness. It’s a coping mechanism to avoid pain and stress, but in the end itself causes more pain and stress.\n\nI recommend checking out the book Atomic Habits by James Clear. It provides a system for changing your habits and has been helpful for a lot of people. His website has lots of good info as well that is free and can get you started. Also worth mentioning that sometimes we think we need motivation first before we can do something. But it is sometimes best to just start doing things which then builds momentum. \n\nTo be clear, there is nothing wrong with the activities you’re doing, and you should be able to enjoy them. However, they are affecting your quality of life so it’s best to figure out how to partake in them in moderation while achieving what you want in life. \n\nCheck out the links below for more info on what I’ve discussed. And good luck. \n\nhttps://jamesclear.com/habits\n\nhttps://markmanson.net/how-to-get-motivated\n\nhttps://www.gooduniversitiesguide.com.au/education-blogs/student-life/find-out-how-to-conquer-procrastination\n\nhttps://www.gooduniversitiesguide.com.au/education-blogs/student-life/beat-procrastination-with-the-pomodoro-technique", "permalink": "/r/DecidingToBeBetter/comments/mpxuog/how_do_you_teach_yourself_self_control/guf02th/"}