{"id": "t5_2tand_t3_os25f7_t1_h6p1apb", "creation": 1627385102, "origin": "t5_2tand_t3_os25f7", "height": 1, "replied_to": "t5_2tand_t3_os25f7", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GandalfTheTartan", "text": "I'm a communication skills coach who practically reinvented his life between the ages of 27 (enrolled at uni) - 31 (graduated). Here's what I recommend:\n\n- Read \"How to Have Confidence and Power in Dealing with People\" by Les Giblin. It makes \"How to Win Friends and Influence People\" look like toilet paper, because it backed on science rather than wishful thinking.\n\n- You can't hope for a better past, but you can work towards a better future. The fact that you are going back to school shows that you're acting on making life better for yourself. Mindfulness and the act of simply noticing when you are replaying a moment in your mind - then stopping it, will help improve your mental health.\n\n- Often if someone isn't interested in us, it's either because we are too shy, too standoffish or we need to improve our social skills.  This might be answered by your next comment - if you're sitting at home a lot and damaging your mental health you're limiting your social intelligence. Ask yourself, would you want to be around someone like yourself? If not, identify what it is you need to develop to become a more approachable person. For me, this was learning how to 'drop my guard' rather than constantly looking sour. I needed to learn how to smile.\n\n- Social media has been proven numerous times to be bad for your mental health. If you can cut it out, do so. Replace it with a VR Headset and a copy of VRChat if you can, because that will help you develop your social skills rather than social viewing skills.\n\n- Emotions are natural and there is nothing wrong with crying. Low points are natural too. However, _emotional intelligence_ is important. If your moods are becoming problematic, you're probably asking 'why' questions rather than 'what' questions. E.g; Asking, 'why do I hate myself?' will always find a problem whereas asking 'what can I do to stop hating myself?' will find a solution. Look into ways to grow your emotional intelligence.\n\n- Don't set yourself on fire to keep someone else warm. You live once, so you need to sit down and _write down_ exactly what it is you want to do for a living. If you don't take the time to figure it out, you'll just end up going with the flow, and that's where all the rubbish piles up at the end of the ocean.\n\n- Social anxiety is mostly a weakness in your internalised self-communication skills, aka, how you talk to yourself. Reading the above book and practicing talking to people is the only way to improve this, because you can't just 'develop confidence' internally without external practice. Ask yourself: how often have you judged someone for what they said, which has changed how they have behaved? You'll find the answer usually is 'rarely', so the same will apply to yourself. People don't judge others as much in person as the online world will have you believe. We often suffer more from imagination than we do from reality.\n\n- The only way to lose weight is to eat less and move more. Given you know you are overweight, you simply need to make the choice to change it and then follow your own choice. Only you can do this.\n\n- Well done on making that choice! Getting back into education is the single best thing anyone can do in my opinion. It changed my life and it can change yours if you stick at it :)", "permalink": "/r/DecidingToBeBetter/comments/os25f7/how_do_i_go_about_reinventing_and_changing_my/h6p1apb/"}