{"id": "t5_2tand_t3_os25f7_t1_h6mb9gr", "creation": 1627326582, "origin": "t5_2tand_t3_os25f7", "height": 1, "replied_to": "t5_2tand_t3_os25f7", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Nanevak", "text": "Are we the same person? Ofc I'm a guy and a year older than you.\n\n\\- I struggle with my weight and eating habits,..\n\nI can give some advice for the weight loss because I lost 20kgs during the pandemic (still have to lose 20 kg more).\n\nI use the combination of intermittent fasting and calorie counting.\n\nI calculated my TDEE and I eat 1000 kcals less than that. This way in most cases I lose 1 kg per week. \n\nBut to tell the truth I plateau so hard after every 10 kgs. Now I'm struggling again to lose more but I can maintain the lost weight fine so that's nice.\n\nYou have to really want to lose weight. There is no ideal time to start the diet. There will be at least one relative one week into your diet who's making a barbeque party or family dinner or something. Work or school will always be there to cause stress.\n\nThe other cope I do is I go out for a 30 minute walk daily. I even go out for a stroll when I'm stressed out so I can sort out my feelings.\n\n\\- Trouble making friends,...\n\nJust have some hobbies. I don't know, dancing for example and you could befriend with the women there. Just keep a optimistic attitude and you can do it.\n\n\\- I am sometimes stuck in the past,...\n\nMe too but I realized it wouldn't make me happy if I could magically go back in time.\n\nI'm not that important and my time is limited on this Earth so I need to try concentrate on the present instead and fix what is fixable and live my life to the fullest.\n\n\\- I tend to sit at home a lot, which seems to be terrible for my mental health...\n\nYes! Limit social media. I didn't delete my fb profile but I only use the fb chat from my phone to stay in contact with friends and classmates. Your life journey is a little different from the others but there isn't a right way to live one's life imo. It was a hard pill to swallow but we are just a little bit different from them. Not better or worse just different. \n\n\\- Never had a boyfriend or any dating experience,...\n\nSame :( , just with girls. My plan A is losing weight\n\n\\- I do have a problem with my moods,..\n\nI started going to therapy again a week ago. I'm not medicated so I only have my own devices to solve this issue. Now I'm trying to be more courageous and integrating my \"shadow\" (Carl Jung's theory) so I can be a more authentic person.\n\n\\- I plan on going back to school,...\n\nGood luck, it's never to late to study what you want to study and work in that field.\n\nThe pandemic fucked me up too sadly, I need another to finish my engineering degree.\n\nDon't lose hope. You can't know for sure if things not get any better. Life is not constant, there are ups and downs.", "permalink": "/r/DecidingToBeBetter/comments/os25f7/how_do_i_go_about_reinventing_and_changing_my/h6mb9gr/"}