{"id": "t5_2tand_t3_pwvzrj_t1_hejnhm6", "creation": 1632794634, "origin": "t5_2tand_t3_pwvzrj", "height": 1, "replied_to": "t5_2tand_t3_pwvzrj", "down_vote": 0, "up_vote": 139, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kdramapeach", "text": "you are still young. age is a social construct anyways (not really I know but I just want you to feel better 😭 SORRY) \n\ncreate a list of things you used to love as a child, if it is hard to remember then that is okay. don’t feel bad. that just means that you get to make new memories! I am 22 and I’m probably in no place to give advice but I will tell you what I do with my life just to give you some ideas. I love watching my little pony. I also love peppa pig and my friends and family know me as a huge shrek fan. I also love to knit and paint. I have been learning a few languages too! I am also into health and wellness. yoga, pilates, etc. all right up my alley. I love to cook as well! love me some anime too. \n\npinterest is a great way to get into hobbies or find things you might like!!! there is a board for literally everything! get the app and create a board for everything you want or save some boards! :D you can still “feel young” because you still are young!!! you can still make up for lost time. I say just create a list of things you have seen other people do that you have always wanted to try out. or things you want to learn or try out. \n\nbeing in my 20s for me has just been dating myself. I do everything alone and I have many hobbies that keep me busy when I’m not in uni. date yourself. go to a museum. explore cute cafes in your city. try out cuisine from every country! you could make a list of countries and put a check mark when you try its cuisine! take a pottery class. watch Anne with an E. watch gilmore girls. experiment with makeup if you are into it! glossy eyes, bright eyeshadow, etc. change your hair. dye it if you’d like! cut it, etc! :D\n\ndon’t judge yourself either! whether that is going to the movies alone or watching a kids cartoon!!! I hope I have helped in some way :) < 333", "permalink": "/r/DecidingToBeBetter/comments/pwvzrj/what_can_i_do_to_feel_young_again/hejnhm6/"}