{"id": "t5_2tand_t3_q9tj07_t1_hgz77qd", "creation": 1634473940, "origin": "t5_2tand_t3_q9tj07", "height": 1, "replied_to": "t5_2tand_t3_q9tj07", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DragonBastion", "text": "On mobile so thank you for your patience with any formatting or errors.\n\n\nYour perspective is the first and most important thing that you need to work on. You think yourself a loser, which is not a mindset that will get you out of your (or any) predicament. Even if you don't feel it (yet), change the word loser to something more powerful and motivating, something you want to be. Might I recommend warrior, winner, hero, scholar, or whatever other title or descriptor you like. Just change the word. It will start as feeling dumb and silly but eventually that will be the word you use and that feeling will change with it. It takes time and persistence to rewire the neurons in the brain. \n\n\nThe next thing is that you need to stop comparing yourself to others. They are on their own journey. Praise the ones that used quarantine to improve themselves but don't compare their highlight reel with your editing room floor. Focus on your own struggles and where you are now compared to where you were 5 years ago.\n\n\nYou seem to take pride in being younger and more advanced. Those are great qualities for students in primary school. Outside the classroom, who cares? You're comparing your age and accomplishments to others, which is unhealthy, unkind, and unhelpful. You spent quarantine in safety and used that time to enjoy your personal hobby. Time spent enjoying life is not time wasted. Your peers might be jealous they didn't have a chance to avoid a literal lung-destroying plague. Your parents care to keep you safe and place your lifelong health over short-term benefits of finishing university sooner. It's adding a few years to your education plans and not ending them. You're not lagging behind. Your goal and timetable have adjusted to meet the obstacles before you.\n\n\nYou didn't fail. You're not failing. You're not losing. You're not useless. You're not a loser. You're a warrior. You're a winner. You're a hero. You're being presented an opportunity. Every challenge, struggle, trial, and obstacle in life is an opportunity. The opportunity is in changing yourself and your strategies to grow beyond this. You will need to give up time playing video games, but you already know that.\n\n\nChange your view from loser to something positive. Stop comparing yourself with other people. Don't worry about your age in relation to your achievements. Nobody cares if you're the youngest or the oldest in your class.\n\n\nAlso- seek medical help from a doctor if you think this might be any form of mental health issue. Medication and therapy can help. I'm not a doctor, nor a psychologist. I just don't believe the power of positive thinking can overcome chemical imbalances.\n\nI wish you well and am cheering for you in overcoming your struggles. You've got this.", "permalink": "/r/DecidingToBeBetter/comments/q9tj07/i_am_falling_behind_and_i_dont_know_what_to_do/hgz77qd/"}