{"id": "t5_2tand_t3_poqbds_t1_hcz33is", "creation": 1631727002, "origin": "t5_2tand_t3_poqbds", "height": 1, "replied_to": "t5_2tand_t3_poqbds", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "OldDog03", "text": "Will give my 2 cents of advice and this what life has taught me after 60 yrs. So you may or may not want to read what I have to say as I'm currently unemployed and about to start collecting a pension and living of my investments.\n\nUsually what holds most people up is the ambition and there imagination.   \n\nDo you remember the movie Apollo 13 with Tom Hanks and they are there in the capsule, when the high CO2 alarm goes off. They solved this problem by taking stock of everything they had and then found a solution of how to fit a square filter into a round hole.\n\n\nEven though you do not have a team of engineers to help you figure your job situation you have friends, family and Reddit.\n.\nGet a note pad and write down all your skills and talents no matter what they are.\n\nNext write down the jobs you would be willing to work.\n\nNext write down the Jobs that are available.\n\nSomewhere in all this there should be a job for you, it may not be your dream job but its a job.\n\nIts easier to get a job once you already got one, so get out and get a job and move around to suit your career goals.\n\nThis is pretty much what I have done, my dream in life was to get married, have some kids and place of our own. All this has been achieved, I worked jobs that met my skill set. But this whole time have been learning new skills.\n\nYes it can be tough, but there is only one thing to do and that is to keep moving forward. 30 yrs ago the only way to get a job was to go out every day and make contact with people, today most people sit behind a computer and not really talk to anybody. You may have to do what used to be done before and actually go knocking on doors and talk to people.", "permalink": "/r/DecidingToBeBetter/comments/poqbds/i_hate_looking_for_a_job_no_one_will_hire_me/hcz33is/"}