{"id": "t5_2tand_t3_poplh7_t1_hcyxetq", "creation": 1631724662, "origin": "t5_2tand_t3_poplh7", "height": 1, "replied_to": "t5_2tand_t3_poplh7", "down_vote": 0, "up_vote": 15, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Amberthms", "text": "Writing. Doesn’t even have to be on paper, could be in the comfort of your bed on an app. I know, sounds boring and monotonous. But when I started, I did it just for the sake of doing something. Wasn’t even passionate or motivated. Now, it is my favorite thing to do.\n\nI (16F) used to have pretty bad depressive episodes. Couldn’t find the motivation to get up unless I needed to. So I sat in bed and I wrote and wrote and wrote. Who knows what started it, or why, but it’s a release, a conversation, introspection, and a distraction all in one.\n\nDoesn’t have to be anything specific. Could be a page humoring yourself. Could be about your feelings, or could be a distraction from them. You could even spend hours on end writing about your whole life, all the different outlooks and perspectives you’ve had, your ways of thinking, your ideals, your contemplations, your philosophies, and so much more. I used to think writing and/or reading was some boring monotonous task, but the possibilities are endless. \n\nI’ve made hundreds of plans, countless pages of finding a philosophy and outlook on life I truly resonate with, I identified my problems, negative systems and habits, the loopholes and really understood myself through writing. What’s even better is that you could use these notes to further your progress when you finally do get therapy, and when you get better, you can start implementing some of the plans you wrote down and actively pursuing all your written goals and ideals. All those plans to improve my life, I’m now implementing them. I’ve figured out how my mind works, and I use that to my advantage. My reward systems, my habits, my tendencies, writing can possibly turn your mind from an enemy to your best power.\n\nWriting is probably the only hobby I have. It’s extremely powerful if you go into it with an open mind. Sometimes you’ll find yourself remembering things you haven’t thought of in years. It makes things more clear. It reduces overly emotional thinking. It allows you to view life more rationally, and to view your emotions from a second/outside perspective. When you feel like you’ve been wandering through life with foggy lenses, seeing it all in writing just wipes it off.\n\nWhen you have a great realization, write it down. When you have a big worry, write it down. When you have some crazy dream that probably isn’t important, write it down. The more you write, the more patterns you see. The more YOU you see. It’s like knowing a friend. It gets easier and easier to understand yourself if you view yourself objectively.\n\nDoesn’t even have to be anything profound. Writing feels like a conversation. It’s a space where you can do anything. You don’t even have to form articulate sentences. You could fuck around and make something funny. Or put some random shower thought. I found that it eased my loneliness, and therefore made my despair seem a little less overwhelming.\n\nIt’s not a cure. But it is an amazing way to learn how to cope and manage. Every negative habit and system I have has its own appropriate response, all written down incase I forget. I have a certain way of meditating. A certain phrase. A certain action for when I need to get out of a rut. I have my philosophy in life all written down in a single page, which never fails to ground me. It’s extremely rewarding, and comforting to know you have some sort of “backup” whenever things start getting more south than planned. Sometimes, the best advice you can get is from your past self, or your past self in a good mood (lol). \n\nDepression pretty much festers and builds and builds up inside of people, immobilizing them (sometimes literally) and preventing them from functioning. Release it all. All the things you wish you could scream or whisper out can be put on a page or on some journal app. Write and write until the room of your mind feels just a little more tidy, and you’ll find just a bit more energy and clarity to do other things. \n\nPerhaps it might not work for you. But hey, give it a try and see what happens. Everything I’m saying is purely from my experience, but I really hope it captures your interest a tiny bit. \n\nOther simple and easy things to do:\n- Bake. Holy crap. If you have a sweet tooth, baking the GOOD stuff is definitely rewarding. Blueberry muffins are my favorite.\n- Learn a language. Oookay, maybe not simple and easy.. at all. But definitely rewarding if the culture the language is connected to resonates with you. I’m not talking about duolingo or books, I just mean comprehensive input (shows/dramas/Netflix series in that language). The feeling of understanding even a sentence without subtitles is addicting.\n- You said you wanted to spice up your life, so maybe something just a tad bit materialistic would help. A useful home appliance like a diffuser (aromatherapy helps if you struggle with relaxation or sleep), try that one thing you’ve found interesting with your hair, buy that funny shirt.. yeah. \n- Have you tried VR? Pretty cool since you can talk to other (most of the time) pleasant people and it’s pretty interesting and fun. You learn so much and hear a bunch of cool stories as well.\n- Buy a bunch of imported snacks from other countries that you’ve never tried and see how you like it. I definitely love takis now (they don’t sell takis in most places where I live).\n- Sorry if this is cliche, but meditation. Guided if you’re a beginner. Not physically taxing, so I suppose it can be categorized as “easy”. It’s so relaxing that one time I fell asleep after a one hour session. And I have trouble sleeping at night!\n- Deep clean of your environment does wonders for the mental state. I think I’ve heard somewhere before that changing your environment is monumental if you want to improve your mental state, as it is pretty much linked. Although cleaning can be tiring and quite boring, some find it therapeutic. I’m definitely not the latter, but find it helps afterwards anyway. \n- Dog park. Not sure if you’re a dog person, or an animal person, but, wow. Just. Dog parks. And dogs.\n- Find some cafes or anything similar near you that you haven’t checked out yet. Might be the change of pace you need if everything feels monotonous. New atmosphere, different food, different surroundings.\n- Call a close friend or family member. Doesn’t have to be anything deep. Helps a lot during tough times.\n- Not sure if you’re a musically inclined person, but singing and/or instruments. Karaoke. My heart will go on is a true challenge. Basic chords on the uke/guitar are relatively simple to learn and apply to many songs.\n\nLastly, remember that things don’t have to be big and spontaneous to be exciting. Truth is, many days for a lot of people are monotonous and pretty boring. A nice cup of coffee, a good meal, good weather, a good drink, etc. The things we usually overlook and don’t spare a second glance are worth savoring. Well, easier said than done, I’ve been there, but just a note for anyone else that sees this I suppose.\n\nNot sure if this will help, but I hope it does. Hoping you can get access to those sessions as soon as possible, and that things will start looking up in a few months. Stay safe :)", "permalink": "/r/DecidingToBeBetter/comments/poplh7/what_are_some_simple_or_easy_things_i_can_do_to/hcyxetq/"}