{"id": "t5_2tand_t3_k78fw8_t1_geq4h7e", "creation": 1607195824, "origin": "t5_2tand_t3_k78fw8", "height": 1, "replied_to": "t5_2tand_t3_k78fw8", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "goddessgamora", "text": "Firstly OP, I am really happy for you. These are extremely hard decisions to make, but you did so for YOURSELF, and I hope that you can someday feel empowered by that and pull confidence from that feeling to confirm to yourself that you did the right thing. \n\n\n\n\n\n\nI want to give you a headsup as a person who went through this a few years ago with a best friend of 20 years. You are grieving the loss of a relationship right now, and you will continue grieving for quite sometime considering this person was in your life for 11 years. Reference the stages of grief because you will experience them all in time, and that is totally normal. Those thought processes however have a way of putting fissures in your acceptance and perception of the reality; which is that you made the right decision for yourself, your greatest ally.\n\n\n\n\n\nSomedays you will catch yourself wondering \"If I had just stuck around and been a good influence, maybe they couldve made a turn around\" This is called bargaining, and it is a normal thought process in grief. You have weighed the pros and cons, I would assume a million times over and came to the conclusion that your well being is the MOST important (and it always will and should be) and this person was in someway a detriment to that. Do not forget the reasons you made this very hard decision, those feelings are and always will be valid.\n\n\n\n\nI wish you the best of luck on this journey and life as a whole. Use this experience to fortify the realization of what your boundaries are in terms of what you allow/not allow, and you how you expect to be treated in all of the relationships in your life.", "permalink": "/r/DecidingToBeBetter/comments/k78fw8/i_finally_cut_ties_with_a_toxic_person_in_my_life/geq4h7e/"}