{"id": "t5_2tand_t3_k3ua6h_t1_geco2uy", "creation": 1606898508, "origin": "t5_2tand_t3_k3ua6h", "height": 1, "replied_to": "t5_2tand_t3_k3ua6h", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ohgodidonthaveajob", "text": "Thank you, Reddit for the warm response! Addressing common questions about what exactly did I do to deal with my troubles, I'll try to chalk out a rough outline of the things one could do to feel a little better about themselves. \n\nTL;DR: life has no meaning, you have to make your own meaning out of it. Take it one day at a time, no failure is permanent, and you are certainly not alone in feeling this. Relish your strengths and take pride in them. You are a whole human being despite whatever is wrong with you. \n\n&#x200B;\n\nI realised that something was terribly wrong with me after the initial suicide attempts started but I was not so sure about what to do with what I felt, where to place it in my head or how to go on chasing what's supposed to be a normal life. As my condition worsened I could not attend all my classes, started flunking important subjects and grew distant from my friends and my family. I didn't feel that my therapist was really listening to me and I could not afford to see a better therapist given the financial and time-related constraints. I started lying pathologically about how I was doing well, how my life was in control, how I didn't spend entire weeks planning out the least painful way to kill myself and especially about how I didn't need help. I didn't think that I deserved help or was worthy of help because of the stigma pertaining to my childhood trauma, and because I had always been an overachiever and it simply did not fit the narrative of \"gifted child aces college and lives through life fiercely.\" \n\nI had a major breakdown after an early morning drinking session with a friend and realised that I had hit rock bottom. I had attendance shortage, my room was a mess, my apartment was full of empty bottles of whiskey and I had developed a nicotine addiction too. To cope with the breakdown I shaved my head with a trimmer and told myself that I will decide to be better, and deciding to be better started with not lying to myself about how I felt. I couldn't put my very limited energy into \"pretending to be good,\" and instead decided to use it to do some actual groundwork pertaining to my condition.  \n\nAfter I stopped lying to myself I was able to see what was actually wrong, and I realised that this condition was the reason behind my self-esteem issues and since nothing could be done to undo what had happened, I could divert my energy into understanding my strengths and drawing upon them to reach a more well-rounded sense of self. I realised that despite it all, I had a lot of empathy for this world, I was kind to people, I was the kind of person people could depend on, I told myself that my poetry was worth reading, that my body was worthy of affection and that if all these other people can do this, so can I, or at least try my best to. I started cutting off people who sucked the life out of me, I tried being more honest with how people make me feel (even if it was a negative feeling) I put enough effort into academics to pass my course and I put my feet down firmly on trying to decrease my dependence on alcohol. \n\nThings were not linear, there were multiple setbacks, recovery was not linear, and I kept falling back into old patterns. I kept reminding myself that if I could be so kind to other people, I could similarily be kind to myself too. A year later I had my final and almost fatal suicide attempt which I survived. I did what I could with what I had, and came back home after the semester ended. I made a schedule and started running, I made sure that I was having three full meals every day. I decided to establish personal boundaries with the people in my life and I tried enforcing them over time.  I told myself that I will take this one day at a time and even if I failed at what I was doing, I could always try again. I didn't have to kill myself today if I could do that later at any point in my life, and that thought made it more bearable.", "permalink": "/r/DecidingToBeBetter/comments/k3ua6h/celebrating_a_whole_year_of_no_intrusive_thoughts/geco2uy/"}