{"id": "t5_2tand_t3_qcrrvc_t1_hhl1l47", "creation": 1634878442, "origin": "t5_2tand_t3_qcrrvc", "height": 1, "replied_to": "t5_2tand_t3_qcrrvc", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "WelbonWorkOnline", "text": "Our ability to remember things is greatly diminished by lack of sleep and much of the difficulties we face when tired is the result of these difficulties. We find it difficult to maintain emotions under these conditions, and when combined with the lack of perception, we can find problems seem much worse when we are tired and interpersonal problems with family and friends become issues we prefer not to deal with under these circumstances.\r  \n\r  \nAddressing the sleep disruption pattern is something we all know we should do, but few of us take the initiative to improve our emotional and physical wellbeing. I am proud of you sharing your story Yellow Brick Road. You have awakened us all to feel comfortable to give this talking thing a go and open up about what we think on sleep. I feel the same way about my youth. We tend to stay in the cycle and try to deal with our lack of energy or with the associated problems of relating to others appropriately. \r  \n\r  \nThe problem with continuing the sleepless cycle is that *it self perpetuates*. The very things that were initially a symptom of sleeplessness eventually becomes the cause of it as we lie in bed concerned about life problems.  Breaking the cycle is essential to improve not only our sleep patterns but also our emotional, physical and social well-being. \r  \n\r  \nThis is how I address my sleep problems. And I had many...\r  \n\r  \nOur sleep cycles are dictated by hormonal responses in our body to light and darkness. **If over time we prevent our bodies to submit to these responses naturally, they become resistant to them.**   Believing it’s possible to retrain them and setting some guidelines to achieve this is essential to overcoming the problem.\r  \n\r  \nTry to learn techniques that help you to relax before you sleep. Turn off the computer, have a warm bath and consider a warm milk based drink. I know you planned to go to bed earlier but if necessary listen to music or meditate.  Try to listen to your body as it tells you it is tired earlier in the evening and **don’t resist the impulses by continuing to watch television or use the computer, game, or phone.**\r  \n\r  \nOver time I started convincing myself of the importance sleep is to my health and well-being. Learning more about it was the key to finding a solution to a problem that has had a profound effect on the way I feel about myself and my world. Thanks again Yellow Brick Road for the catalyst of conversation. I hope this helps many others just as it sparked my sharing...", "permalink": "/r/DecidingToBeBetter/comments/qcrrvc/i_always_feel_tired_no_matter_what/hhl1l47/"}