{"id": "t5_2tand_t3_qcrrvc_t1_hhk7vz0", "creation": 1634863237, "origin": "t5_2tand_t3_qcrrvc", "height": 1, "replied_to": "t5_2tand_t3_qcrrvc", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Snow_Wonder", "text": "A lot of things could be causing this. Here a few things that could be tried that could help:\n\nGet blood work! It could be caused by a vitamin deficiency. Deficiencies in vitamins D and B12, or in iron or magnesium can all make you tired. As we get older we sometimes are less good at getting nutrition from food compared to as little kids.\n\nTry improving your sleep hygiene. Good sleep hygiene is consistent (same wake up time and bed time). Good sleep hygiene involves avoiding things that will wake you or negatively effect sleep quality before bed time (avoid blue light, caffeine, and large meals before bed - the latter can cause acid reflux for example and the former wake your body).\n\nTry adjusting your sleep schedule. First, try figuring out how long your sleep cycle is by napping. What nap lengths make you feel great and what make you feel groggy? The average person has 4-6 cycles a night and the average person has cycle of 90 minutes but there’s a lot of variance. If you have a 90 minute cycle but aren’t sleeping for a time that’s a multiple of 90 minutes, you won’t feel great when you wake. Waking in the middle of your cycle is disorienting and will leave you feeling unrested even with plenty of sleep.\n\nAnother thing you can try when it comes to sleep schedule adjustments. Historically, people didn’t do all their “sleep” for the day all at once. Some people would incorporate evening/afternoon naps into the day, while many others would have a time in the middle of the night that they’d briefly wake for (an hour or 2).\n\nA third things about sleep schedule. There is some variation among human circadian rhythms (our body’s “clock”) and some people are wired to be sleepy earlier and sleepy later. If possible, try to have a sleep schedule that aligns with your circadian rhythm. This can be hard if you’re night owl but when you can adapt to your circadian rhythm, definitely do.\n\nAnother thing you can try is increasing your physical activity. Better cardiovascular health can lead to better, more restful sleep.\n\nCheck for breathing issues when you sleep. Sleep apnea and other issues can reduce the quality of sleep leaving you tired.\n\nI’m a 22F and used to be tired all the time as well. I’ve found vitamins and exercise to generally be the most effective at improving my sleep quality of these options. For a brief time my sleep got really bad. It turns out it was because I was eating large dinners late at night, I was giving myself “silent reflux” and triggering my asthma, making my breathing bad both when I was asleep and when I was awake.", "permalink": "/r/DecidingToBeBetter/comments/qcrrvc/i_always_feel_tired_no_matter_what/hhk7vz0/"}