{"id": "t5_2tand_t3_po8pe3_t1_hcv4wve", "creation": 1631650948, "origin": "t5_2tand_t3_po8pe3", "height": 1, "replied_to": "t5_2tand_t3_po8pe3", "down_vote": 0, "up_vote": 267, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "aam726", "text": "Half the cliches are true and half are bullshit.\n\n**True:**\n\n*Invest early*\nStart saving for retirement now. If your job offers 401k matching, try and save as much as they will match if you can. If they don't offer that, an IRA and put as much as you can in. I know it sounds crazy, but that extra few hundred bucks now will grow exponentially, and you will never be able to \"catch up\" by investing more later. This is, without a doubt one of the best things I've done.\n\n*Take Care of Your Health*\nThe shit they say is true. You only get the one body and it catches up with you. Whether it's just your metabolism slowing down as you age and losing muscle mass, or living it up in your 20's by partying - it will catch up with you! If you don't already have an excercise routine, start one. It doesn't have to be training for the Olympics, in fact - it shouldn't be. Start small and build if you feel like it, just walking is fine, but do it, make it a sustainable habit. Don't drink too much.  Not to be a party pooper, but I've seen too many of my friends from my 20's become functioning wine mommy alcoholics. Alcoholism sneaks up on you, and boozing does you no favors. Have fun, but have limits. Don't smoke. If you do, quit. If you only smoke sometimes, stop. It took me 22 years to stop my \"I don't really smoke\" smoking habit. Drugs. Responsibly and rarely.\n\n*Negotiation*\nSo much of your future career and salary rests on your current career and salary - push for the raise and/or promotion at EVERY opportunity - even if you aren't sure you deserve it. When interviewing for a job always make a counteroffer. Never accept a first offer in any sort of purchasing negotiation. Remember in any negotiation, you are not in a rush to answer, the other party may try and make you feel rushed so you make a quick (and bad) decision, but you aren't rushed - take all the time you need to think about the terms and negotiate as necessary. Negotiating is NOT being difficult (this bears remembering the most).\n\n*Saying No*\nSay No to things you don't want to do. Reject the idea of obligation. Your friend from HS that you barely ever see and don't like is having a party that you feel obligated to go to? Say no. Don't make up an excuse, excuses can be countered. Just say no. This applies to social things, but also work opportunities, relationships, anything - don't just accept things because they are offered to you.\n\n**False:**\n\n*You Have to Get Married & Settled Down*\nNo, you don't. And if you have found someone you want to spend your life with, don't fall into the huge expensive wedding trap where you have to please everyone but you and your spouse. \n\n*You Have To Have Kids By Age X* \nThis is nonsense and puts so much pressure on women especially. Reject this false notion. You'll have kids if and when you're ready, it's not ever a \"now or never\" scenario. Don't settle for a relationship or a life you don't want because you MIGHT want it someday and think it might be too late then.\n\n*Enjoy It While You're Young* \nI think you should enjoy life while you are young, but also while you aren't. Life, I think only gets better as you get older, unless you have decided to live your life on other people's terms. Then you'll find yourself very unhappy and longing wistfully for when you were young and free.\n\n**Mix True & False**\n\n*Travel* \nTraveling is such an interesting one, because when you are young you have less vacation time and less money - but less responsibility. When you are older, you have more money and vacation time, but more responsibility so it's harder to actually travel. Either way, if you can do it, you should. When you are old, and young. Though this year, may not be the year for that!", "permalink": "/r/DecidingToBeBetter/comments/po8pe3/what_advice_do_you_have_for_someone_whos_turning/hcv4wve/"}