{"id": "t5_2tand_t3_po8pe3_t1_hcxuuku", "creation": 1631707167, "origin": "t5_2tand_t3_po8pe3", "height": 1, "replied_to": "t5_2tand_t3_po8pe3", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheWinterPrince52", "text": "This took me far too long to realize: People have a sixth sense for the attitudes and emotions of others, even if they don't realize it.  This is what they are referring to when they say \"There was an energy in the room\" or \"I'm getting bad vibes from that guy.\"  It's not just a figure of speech; it's REAL.  If you can learn to tune yourself to it, you have officially learned how to \"read the room\" and navigating social situations becomes a LOT easier after that.  Similarly, the emotions you are feeling are likely putting off an energy of their own, and it is up to you to keep track of what that energy is so you can stop yourself from becoming the villain in situations that affect you emotionally, or in situations where your current attitude is very much not the attitude of those around you.  Don't like the situation you find yourself in?  There is nothing wrong with leaving, and there is usually nothing wrong with saying why if someone asks.\n\nDo not let your emotions control you, and do not let the emotions of others pull you into Mob Mentallity.  Learn instead how to control yourself when you feel certain ones, and how to put yourself in situations that affect your emotions in a positive manner.\n\nFor example: Video game making you angry?  Nobody can blame you for switching to another game that you are certain will help you relax, even if your friends call you out on it.  There is nothing wrong with that.  I had to do that this morning (though admittedly I was playing alone); I stayed up a bit extra to play a more relaxing game so I didn't go to bed angry and end up with no sleep and a grudge.  I lost sleep, yes, but at least I didn't lose all of it, and instead was able to sleep peacefully when I finally DID go to bed.", "permalink": "/r/DecidingToBeBetter/comments/po8pe3/what_advice_do_you_have_for_someone_whos_turning/hcxuuku/"}