{"id": "t5_2tand_t3_5rku9y_t1_dd9nd51", "creation": 1486095704, "origin": "t5_2tand_t3_5rku9y", "height": 1, "replied_to": "t5_2tand_t3_5rku9y", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Hi there,\n\nI'm glad that you replied, since dialogue is the means through which ideas can travel and be challenged. I definitely understand your point in which you argue that under-representation in a field could point to a difference in how we treat our children, as well as more things in general too. However, I do believe that this is a lot more grey than many people give it credit for (forgive me if I'm lumping you into a group of people you don't exactly agree with). \n\nIf we think about a few different fields, such as self help and improvement, STEM, politics, which you've mentioned, as well as some others such as computer science and technology. Women are underrepresented in computer science and technology, and sexism definitely has a large role to play in that. However, in the STEM field, I do believe that women are underrepresented, but I don't believe that this is due to sexism. STEM fields, in general, tend to be quite open to anyone, regardless of race, gender, sex, sexuality, or any form of identification (unless you're a religious fundamentalist, for obvious reasons). This is due to the fact that the basis of science is critical thinking; can you do the science, nothing else matters, science transcends petty things like ideologies and identifications. There is a trend for there to be a greater percentage of men in STEM fields than women, however this is due to factors other than sexism. Now, as for politics, I think it's somewhere in the middle. I happen to not be an expert in politics, so I won't say too much, but I know that there are many politicians who are women, and that the amount of women in politics has been growing. There is definitely some sexism involved in politics, but that is improving, at least from what I've seen. And as for self help and self improvement, I don't believe that there is even an under-representation of women in the field. If you look, you're bound to find countless women in the field, even if you look for topics or are just doing research as opposed to specifically singling out women (I'm not a fan of the whole 'just go look on the internet' so I'll provide examples if you do truly want them). \n\nThat was a large wall of text, so just to tie it all back together, the under-representation of women in specific fields is a lot more grey than it is often given credit for. Sexism is often a factor, yes, however it is not the only factor and sometimes not the most major factor. And there are also many fields in which women are not under-represented at all.\n\nNow, forgive me if this comes off as a little hostile, but whether or not you are a woman is absolutely irrelevant to your knowledge of sexism. I know multiple women who definitely do not understand the meaning of sexism, as well as multiple women who do, and multiple men who don't, as well as multiple men who do, and multiple non-binary gendered people who do, and others who don't. Furthermore, when you stated that you should know what sexism is, given that you are a woman, you are attempting to argue from authority, which means nothing anyway when it comes to discussing ideas and opinions.\n\nOn a similar topic, knowing whether the people who you assumed to be \"shocked\" by your comment were men or women is completely irrelevant. Their minds are independent of their sex (albeit not of their gender, however that's a bit more complex), and thus so are their ideas and opinions. Furthermore, it seems as though you were insinuating that privilege is commonly invisible to men because they are so often privileged. I'd like you to keep in mind that privilege is a very fluid thing, and everyone is subject to privilege of some kind, thus it isn't invisible to those within it, but to those who give it no thought. And since any human with a mind is capable of giving it thought, the invisibility of the privilege that one has is completely independent of sex, race, etc. \n\nMoving on to your next point, I completely agree with you that change only comes when people are uncomfortable. However, the assumption that those who disliked your first comment did so because they were uncomfortable because it would have required them to change how they looked at the list is quite a stretch. You're assuming that they are uncomfortable as well as assuming that they are uncomfortable because they did not want to change their views. I respect your initiative to bring your ideas out and challenge those with other ideas, if everyone would do that, society would be a much better place. However, people tend to often get offended when assumptions about them are made, and it really doesn't help your point whatsoever, it just makes you seem defensive and/or hostile, which also greatly changes how people will view and remember what you said. I believe that your ideas could have more impact if you really focused more on your points and less on assumptions or defensiveness, there's no need for them. Similarly, when you said that you just wanted to point something out to a primary male environment which they would likely not have noticed right away, I respect that and agree that it's something that could be brought up and have a good effect, however the way in which you said it only seemed to garner negativity, thus I would advise that next time you bring similar topics up in a more clear and logical way, so that your ideas can be heard more easily and have more of a good impact.\n\nI appreciate the effort you put into replying to my comment, and I hope that I've given you the same respect. As a scientist, I greatly enjoy the exchange and development of ideas. If you would like to continue conversing, I would be happy with that, if not, then I thank you for this conversation and for the opportunity to present and develop our ideas, and I hope that something has come out of it. \n\n\nHave a wonderful day,\n\n-TGEU", "permalink": "/r/DecidingToBeBetter/comments/5rku9y/if_you_were_me_a_few_years_ago_this_would_be_the/dd9nd51/"}