{"id": "t5_2tand_t3_afk1wv_t1_ee1228g", "creation": 1547440975, "origin": "t5_2tand_t3_afk1wv", "height": 1, "replied_to": "t5_2tand_t3_afk1wv", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "jtsuper", "text": "You can also try Omvana 6 phase guided meditation. Look it up on youtube. It's really grounding and it's all about forgiving yourself and others for past issues that weigh on your mind and visualizing where your life should be in a few years, and taking the necessary steps to get there. It really helped me focus on forgiving myself for any negative situations that weigh on my mind frequently. If you truly listen to the meditation and follow the guides directions without overthinking it too much; grudges or regret that you've held onto from the past might dissolve once you forgive yourself, like it did for me. Making you a little kinder to yourself. I think I've stopped weighing my mind/subconscious down with these useless thoughts for the most part. Idk about you guys but I think these thoughts will occur whether you like it or not but for the past few weeks I let my negative thoughts pass with little to no attention. My mind feels a lot lighter if that makes sense. Like no trace of that heavy minded feeling from depression, maybe a slight diddle from anxiety here and there but I've learned to open my minds door for it willingly. Basically I stopped pretending I wasn't home when Anxiety-Flanders and his flaming mustache came a knocking and let him in. I stopped fighting him. By doing this consistently my anxiety has calmed down diddly. Anyways after you've completed the meditation, make sure to reinforce that you've made peace with your past, whenever your mind starts bringing these things up. I'm not saying this was the only thing that cleared up my head but definitely suppliment it with physical activity, forming good habits, accomplishing goals, etc. Keep your mind swimming within the present, don't go drowning in the past. If you feel heavy/groggy, go for walks and stay out of your room/bed so you're not to stuck in your head all fucking day, roasting yourself like I did. Idk about you guys but staying in my room/bed all day, doing absolutely nothing, gives me more time to entertain self defeating thoughts over past fuck ups, one by one. So instead of doing that pussy shit you could start adding small habits and goals to your day to day so you'll have less time to shit talk and more time to think about, plan and execute your goals. While you're getting the ball rolling make sure you don't be too nice to yourself. For example don't jiggle for joy over washing the dishes for the first time in a year, because that's what any normal person should be doing regularly. Instead acknowledge that you have to do that thing every day, maybe give yourself a little bro nod of approval and continue going about your day. Start doing things because you want/need too, not because your weak candy ass needs a treat to motivate yourself. Reward yourself with accomplishments from your hard work. Start small work your way up. Don't do things like calling yourself a piece of shit everyday. It'll wear down on you. Constructive criticism works better. Think yourself out of your funk with a stoic thought process. If you want to think level headed, you have to think about what you needs to happen for a preferred result and execute. This thinking will eventually become ingrained and you'll shed your old mold of being and thinking. Write down your troubles and how you can go about solving then.\nJust so you know this has been working for me. Who knows It might work for you but stop trying to copy efforts of others mindlessly. Think critically and execute. Think to yourself, \"If I put my mind to it, I WILL DO IT. OBVIOUSLY YOU HAVE LIMITS.  But thats where thinking critically and with a level head comes into play. Play the game within your means. You have to buckle down and figure out your own ways to cope with your reality. Maybe you need meds and a doc; maybe you don't but think about the first step you need to take and do it or you'll be stuck..... FOREVERRR DUN DUN DUNNNN. WAKE UP. Stop confusing yourself with heavy thoughts while sitting in your room doing nothing,instead start thinking about doing something, how you're going to do it and fucking EXECUTE. ", "permalink": "/r/DecidingToBeBetter/comments/afk1wv/how_to_be_kinder_to_yourself/ee1228g/"}