{"id": "t5_2tand_t3_q2d978_t1_hfo0nhh", "creation": 1633563726, "origin": "t5_2tand_t3_q2d978", "height": 1, "replied_to": "t5_2tand_t3_q2d978", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rock_kid", "text": "Exactly! I keep imagining that he won't do *that* to me, moving the goalpost and lowering the bar, and he keeps proving me wrong and doing exactly that. Despicable.\n\nI didn't exactly ghost my ex, but close. He had thankfully been crashing elsewhere already but were were married and hadn't even started divorce proceedings, because he refused to make up his mind on whether we could work it out or not, and I was leaving it up to him (but only for so long, because no answer is an answer). Eventually I heard through the grapevine that he was hanging out with an ex that he had supposedly sworn off having anything to do with, all while he was supposed to be trying to make it work with me. You know, his whole-ass wife. Was even moving some things back in with a planned move-in date.\n\nI didn't even tell him that I knew. I just called him and told him we're done and asked if he had anything to say for himself. Of course, he tried to say he was sorry, but not for anything in specific, which told me it was just a blanket apology because he got caught at *something*, didn't know what, and there was probably more I didn't know about that he wasn't ready to confess to. It didn't matter, he'd already put me through the ringer and I was relieved by my decision by that point, there was no way he could change my mind.\n\nBut the whole call took less than two minutes, and I still didn't tell him why because I knew he knew. He didn't try to ask or argue. And I wouldn't have even bothered with that much except that I needed to make it concrete that he would stop showing up at the house trying to move back in. But if there was any thought in my mind that it would have been harder than that to officially end it, I would have just blocked him on everything, maybe asked a mutual Facebook friend to put him on blast if anyone felt safe doing do, and kept the door locked if he came by. I don't live alone so I wouldn't have had to deal with him without protection, but in my case, it was always his affair partners that were dangerous, not him.\n\nI'm so freaking glad to be done with all this, but wtf when people try to judge *how* somebody leaves a shitty situation. It's like, you weren't there. You don't have to get it. Please just move on. I'm one part wishing more people just understood, and one part glad for them that they don't have experience that makes them understand.", "permalink": "/r/DecidingToBeBetter/comments/q2d978/i_left_a_toxic_relationship/hfo0nhh/"}