{"id": "t5_2tand_t3_q7s52d_t1_hgmjlj6", "creation": 1634227707, "origin": "t5_2tand_t3_q7s52d", "height": 1, "replied_to": "t5_2tand_t3_q7s52d", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hedgy-poooo1", "text": "I've been here, too haha. Honestly, I'm still trying to figure out how to move forward. Anyway, I'm assuming that your repulsion for studying stems from that paper you failed (or, at least, that was its culmination)? If so, maybe you can try changing your mindset about that failure. What caused it? Was it something beyond your control (ex: the paper was just difficult, you're dumb)? Or was it something you had control over (ex: you didn't put in enough effort)?\n\nThis also calls for a reassessment of your perception of academic success in general. Intelligence does play a role in it, but so does effort. Young children whose academic success is attributed to intelligence find it harder to bounce back when they experience failure. This is because they feel that the fault lies within themselves and that there is nothing they can do about it. On the other hand, those whose success is attributed to the amount of effort exerted are more resilient. This is because the amount of effort they can exert is something within their control.\n\nSo much for explanations (I'm sorry haha), I think you should work on those negative mental associations you have unconsciously made with studying (and with yourself). Maybe it'll also help to recall those times you were the overachiever. But, uh, don't compare your current self with your younger self. The circumstances you had back then and today are different. Just use it as an inspiration. Your younger overachiever self is not separate from the current you. It's still a part of your history. It's still you. \n\nI hope you submitted that paper on-time and I wish you luck on your journey to rebuilding your life uwu.", "permalink": "/r/DecidingToBeBetter/comments/q7s52d/i_hate_that_i_am_not_who_or_where_i_thought_i/hgmjlj6/"}