{"id": "t5_2tand_t3_nirfzs_t1_gz4ub45", "creation": 1621748727, "origin": "t5_2tand_t3_nirfzs", "height": 1, "replied_to": "t5_2tand_t3_nirfzs", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MyDogFkingLovesRocks", "text": "Hi friend. \n\nI’m not going to make you feel like shit. Why? You’re already doing that to yourself, for yourself. How well is that approach working out for you? \n\nI’ve spoken about it on other posts on this sub before. This is a crazy paradox but we cannot change until we accept ourselves exactly as we are in this moment. \n\n\nThink of alcoholism. You know how everyone says in movies etc “The first step is admitting you have a problem”? You see a character say  \n“Hello, my name is John Doe and I’m an alcoholic”. \n\nWhy is that important? obviously you can’t fix a problem if you’re not acknowledging the problem. \n\nBut this is more than that. I also mean fully accepting you for who you are right now. Being able to say “I accept me, as I am, in this moment. \n\nTopics to explore acceptance of for you might be:\n\nNeurodivergency, being a virgin, \nyour relationship with your parents, Your friend dying, Your mental health and mental illness, financial situation, job and educational status, Your body and physical appearance \n\n> A side note here: we aren’t accepting ‘bad things’. There is no good or bad, it’s neutral in the acceptance space. \n\n> You want to accept all the major aspects of your life. \n\nTo do this, you create an Acceptance Space, which must become a part of your life and daily routine. \n.\n**Create your Acceptance Space**\nIs your bedroom clean and tidy? It’s critical that it is- Nobody feels good living in chaos. \n\nIf it’s a total disaster, that’s something you can chip away at in 30 minute blocks. \n\nwhat makes you feel safe, loved, peaceful? \n\nMaybe it’s when you were young, memories of your grandmother baking cinnamon apple pies. A soft blanket, childhood pet. If you love outer space. \n\n**Create a corner in your bedroom**\n\nSet up a little table, even books stacked on top of one another to create a small diy altar, you could stack your favourite books, just choose your height. [here](https://www.worthpoint.com/worthopedia/farmhouse-vintage-books-decorative-1852049485) is a very rough example (you can make it as wide & high as you like) \n\nOn top of your diy altar, place a few things which create this space. E.g cinnamon scent candle, a photo of a beloved childhood pet or a photo of a place you used to holiday. Maybe even a fantasy place like The shire. \n\nThink of all the senses. Touch. I have sand from a beach I love, some rocks from a river I go to, tiny (hand sized) piece of drift wood. contrasting textures is good. \n\nYou can get battery operated star projectors very cheaply, which are calming. \n\nWhat sounds do you like that calm and soothe you?  Maybe something subtle like wooden beads in a wooden bowl, or even in a fabric bag.  You can shake, tap, roll them. \n\nFinally get a meditation cushion cheaply or even fold a blanket or towel to sit on. \n\n**The Acceptance-Space Practice Process**\n\n1. Choose your time of day and stick to it. I would highly recommend beginning with when you wake up, and before going to bed. It’s a great way to open and close a day. \n\n2. Nod to your altar as an acknowledgment of the process. You can choose Rei, which you might know as a karate bow’, Añjali Mudrā (hands in prayer pose, leaning forward, a slight bow), or something else. \n\n3. **Set the Acceptance-Space/begin the ritual**. I begin with deep breathing and gentle stretching, an act of love to myself. \n\nI take 3 deep breaths, inhale through the nose, exhale via the mouth. The first breath is my first intentional breath, waking my lungs up. \n\nsecond breath is to let *out* anything I’m mentally, emotionally or physically holding in. Morning- anxiety about the day. evening- upset about days events. \n\n third breath is letting all the good *in*. It’s a breath of gratitude for the opportunity to try again. We can always try again so long as we’re here and breathing. \n\n4. Set the space. Light the candle, Sound whatever you have- mixing the beads. \n\nsit yourself down. Get comfortable. Stretch and move your shoulders, mouth, jaw, face, neck. \n\n5. Feel the different textures. Maybe play an instrumental playlist- I recommend instrumental only, lyrics can put words into our minds. Choose a peaceful playlist.\n\nSwitch on the star projector if you’re using one. Look at the different visuals , smell a soap or lavender etc. \n\nThis is all to help ground you into the current moment while feeling safe. \n\n6. The first time you do this, get a large piece of paper. Write in large lettering at the top ‘I accept...’ Underneath split it into 2 columns. The right wider than the left.\n\nIn your left column write your main Acceptance Points, ie ‘I am a virgin. I accept feelings of shame, anger...’.. In the right, ‘I accept heat in my cheeks, a knot in my stomach, clenched fists...’. \n\nOr for the 2nd column you could draw a simple body silhouette. Write each point in the L column in a different colour. Then in the R column you could draw and label your body in the corresponding colours, colour red fists, a scribble of red in the stomach, red cheeks, and then a simple label for each. \n\nThen, keep it with your altar. If it isn’t safe for you to stick up on the wall behind, just get it out each time you practice then put it away again. \n\n7. After the original big download of everything on paper, the process will be the same up until writing it down. Instead you will say ‘I accept myself, as I am, in this moment’. Then pick one thing to accept for that practice, and two feelings and corresponding body manifestations for it. \n\nExample after you’ve finished grounding yourself. \n\n“I accept myself. As I am. In this moment. \n\nI accept I am a virgin. \n\nI accept I feel shame. I feel this shame as hot cheeks, and tightness all over my body. I accept I feel *angry*. I feel this anger in clenched fists and clenched jaw. \n\nI accept myself, as I am, in this moment”. \n\nWhen you repeat the process in the evening let your instinct guide you. Some evenings you will want to repeat the morning acceptance, others you will say something different based on your day. Don’t overthink it. \n\n8. Take some time here. sit for a few minutes. Use the grounding tools again. sit with your feelings. We’re accepting them, no matter how uncomfortable. When you’re ready stand up, gentle stretching. Take another couple deep breaths. Then nod towards the altar like when you began. \n\nThis is your acknowledgment that you’ve brought the process to a close. \n\n**Some extra things** \n\n* I hope you can access a psychologist. It can take a few to find the right one. Finding a therapist is like friendships. Find someone who works with OCD and other issues of concern to you. \n\n* The way you talk about yourself matter. Your first line was *I’m not a good person*. That breaks my heart to hear.\n\n* Stop hanging around incel communities. If I was a betting person, I would bet that is what you’re doing. Those people remain virgins because they are toxic, misogynistic, nasty, small-minded individuals. Get out of that shit. Misery loves company. They are misery, don’t be their company. \n\n* You need to work out what being a virgin means to you with a therapist. It seems to carry enormous weight for you. Why? You’re thinking about it constantly. \nWhen you do have sex you’re going to be bitterly disappointed.\nIs it sex that you want? Or love? Intimacy? Approval? Acceptance? \n\n* start free writing. This is where you write without thinking or fixing anything. Set a timer for 5-10 minutes and just go. See what comes up. Or free write about virginity and what that means to you.\n\n* How much porn are you watching? Porn is like chocolate on the food pyramid, but for masturbation and individual sexuality. It shouldn’t be your meat and vegetables. \n\n* Download the free headspace app and start practicing mindfulness. \n\n* try out a free trial of the Fabulous app, a habit forming app. \n\n* get your sleep and wake cycle in a good routine. Get productive. You don’t need to know what you want to do with the rest of your life, just something right now. Take a short course. Get a fast food job. It will give you a reason to get up, get dressed, help you meet people, improve your social skills. \n\n* We’re here for you. We accept you, as you are, in this moment*", "permalink": "/r/DecidingToBeBetter/comments/nirfzs/im_not_a_good_person_im_a_27_yo_college_grad/gz4ub45/"}