{"id": "t5_2tand_t3_nirfzs_t1_gz4f744", "creation": 1621737829, "origin": "t5_2tand_t3_nirfzs", "height": 1, "replied_to": "t5_2tand_t3_nirfzs", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PunkLibrarian032102", "text": "Do you have a clinical diagnosis for OCD or depression?  Have you seen/are you seeing a mental health professional?   Well-meaning strangers on the internet can't  do much for you if you are suffering from serious mental health problems, and it seems that you might be.  I'm very sorry about that.  Your description of your life is sad, and I hope you get help.\n\nI am going to be honest here, as you said you wanted that.  If I'm reading things into your post, my apologies, but all I have to go on is your description of yourself.\n\nWhen I read your post, I didn't see anything in it that would make me think, wow, a sexy interlude with this guy would be hella fun.  The issue is not your virginity.  Quite honestly, you come across as lazy and self-absorbed.  This may be a result of depression or OCD, I don't know, but laziness and self-absorption, whatever the cause, are not hallmarks of a good sexual partner, whether it's a one-time hookup or something more serious.  \n\nYou say loud and clear numerous times that you want everything in your life to be easy.  Aside from the fact that a lifetime of ease is sheer fantasy, it implies rather strongly that you wouldn't lift a finger to ensure that your partner would be well taken care of sexually, because you would actually have to put effort into finding out what she likes and pleasing her.   I got a very strong impression from your post that for you, getting laid is all about your wants and needs.  What a prospective partner wants and needs doesn't seem important.  At least, I don't see any evidence of that in your post.  I find that telling.\n\nSo if that's the case--it's all about you--why should a prospective partner want to have sex with you? What's in it for her?  Selfish sex is lousy sex, I can tell you that for a fact.  The worst sex in my life has been with selfish partners.  And some of the sweetest sex has been with guys who didn't have much (or any) experience, but they had a LOT of desire to find out what would make me a happy camper.  Which of course made me want to make them happy campers too.  I remember those guys very fondly.   A sincere desire to please a partner is way more important than sheer technique. \n\nI'll probably get downvoted for this comment, but I'm just telling you honestly what impressions I got from your post.  \n\nI wish you well, and hope that you can get whatever help you need to make positive changes in your life.   Take care.", "permalink": "/r/DecidingToBeBetter/comments/nirfzs/im_not_a_good_person_im_a_27_yo_college_grad/gz4f744/"}