{"id": "t5_2tand_t3_pft33v_t1_hb7ac34", "creation": 1630512403, "origin": "t5_2tand_t3_pft33v", "height": 1, "replied_to": "t5_2tand_t3_pft33v", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "The_Dude_of_Pala", "text": "I spent about 40 years feeling the same way. Here's a few key things that really helped me grow and be a much healthier and happier person spirituality, mentally and physically.\n\n- Disclaimer: these are my own experiences and opinions, by no means do I recommend them as a prescription for anyone else's \"problems.\"\n\n1. I read Don Miguel Ruiz's book \"The Four Agreements.\" I learned to be kind with my words and thoughts. And not to take ANYTHING personal. \n\n2. I read (and worked through) Dr. David Hawkins book, \"Letting Go.\" I came to terms with my poor \"programming\" and how to Let Go of all the hate, resentment, guilt, shame, anger, etc... I had in my life. I spent at least a year working through this book...\n\n3. I stumbled across Taoism, realized it's a philosophy not a religion and fits into just about anyone's beliefs. I also became a \"Dudeist\" so that'll tell you how much this type-A overachiever wanted to be a laid-back goldbricker...\n\n4. Started meditating. Doesn't matter what type or how long you do it. As long as you understand that meditation isn't a cure for anything... it's just a way to learn to sit with yourself and be comfortable with yourself. \n\n5. After years of Taoism I had more introspective esoteric questions and with practically no Taoist community near me I explored Zen Buddhism. These days you could say I'm a Soto/Zen Buddhist with Taoist roots...\n\n\nThese five things have greatly contributed to me making sweeping and lasting positive changes in myself. Through my own progress, especially when learning to love Myself UNCONDITIONALLY and letting go of the past and shame. The re-framing or re-thinking of good and bad, right and wrong was crucial. It sounds cheesy, but in my humble opinion, dualistic thinking is extremely unhealthy. There is a time and place for dualistic thinking, but I don't think it should be applied to every minuet aspect of life. Sometimes things are what they are without labels.", "permalink": "/r/DecidingToBeBetter/comments/pft33v/no_such_thing_as_good_nor_bad/hb7ac34/"}