{"id": "t5_2tand_t3_p44fu0_t1_h8y1n2g", "creation": 1628969346, "origin": "t5_2tand_t3_p44fu0", "height": 1, "replied_to": "t5_2tand_t3_p44fu0", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Shmitty594", "text": "This. This right here. I'm in the same boat and just beginning to improve. I would get so upsettingly angry at things that I would inadvertently hurt myself trying to process those feelings. I used to be ashamed of some of the thoughts I had. They would sometimes be shockingly violent, sometimes just thinking of what would happen if I said something unnessecerilly offensive to a loved one, sometimes fantasizing about hurting someone who cut me off in rush hour. \n\nThe fact that you have them and they upset you means you are still in a good space. You know these are thoughts that should not be acted upon. It sucks they're still there, but that doesn't make you a bad person at all! It makes you an incredibly STRONG person!! What I have been doing lately is just let the thoughts take their course and think about what would happen if you were to follow through. There would be repercussions, legal or emotional. It might affect relationships you have, your job, friends or family. Then, be glad that you haven't followed through with these thoughts!! You haven't done whatever it is, so you haven't hurt someone or broken the law or anything and that's great! Talking to someone certainly helps leaps and bounds as well. I read on another thread this could be a form of OCD. And I did some reading about it and it's helped me to understand better what's happening, why and how to live with it.\n\nLastly, there's of course nothing wrong with you, some people just have some extra to live with and that's OK. Everyone has struggles, whether external or internal, we just need to understand how to live with it and stay healthy ourselves.\n\nIf you ever want to talk to a fucked up redditor who is doing their best to cope, my DMs are open. Just keep trudging forward and always try to stay on the path to improvement. You won't always move forward every day but just stay pointed in the right direction.", "permalink": "/r/DecidingToBeBetter/comments/p44fu0/i_am_having_very_violent_angry_random_thoughts/h8y1n2g/"}