{"id": "t5_2tand_t3_p44fu0_t1_h8yc2x8", "creation": 1628974120, "origin": "t5_2tand_t3_p44fu0", "height": 1, "replied_to": "t5_2tand_t3_p44fu0", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Nutterscm", "text": "Heyo, sorry to hear that you're going through a tough time. I know it can be really scary and frustrating to have so many angry thoughts at once, and it really sucks to have to wait any amount of time for therapy, especially because the amount of effort it takes to open up and admit that you don't know how to deal with something.\n\nIm just your regular Joe, and I don't know if we have the same experience with getting to levels of anger, but here are my thoughts:\n\nI think that anger is usually the first reaction to a lot of stimuli, and is totally understandable, but it downplays your position. A good counter to anger is identifying your agency, and what you can do in the situation. Doing this step has really helped me, because it allows me to process an issue past purely reacting to it.\n\nSmall example: I would rage because my key would get stuck in the lock of my front door and it would be with me for my next few hours. It took me 7 years to Google the problem and see that there was an easy solution to address it. \n\nHeavier example: I would always feel like my brother didn't care about me because he wouldn't answer texts or calls, and so I would rage over that he wouldn't talk to me when it mattered and started to make it personal. (With the help of therapy) I was able to identify what he was doing and how that made me feel, and then approach him and talk to him about it.\n\nOther cases: Sometimes we're just overwhelmed by too many things at once, and it feels like all we can do is lash out. In those times, try identifying your stressors in order. Maybe it's chronologically, maybe it's by weight. But then focus on which are either the most important, or take the least amount of effort (relatively) to deal with.\n\nThis is just my ramblings, but I hope they help at least a little.", "permalink": "/r/DecidingToBeBetter/comments/p44fu0/i_am_having_very_violent_angry_random_thoughts/h8yc2x8/"}