{"id": "t5_2tand_t3_p44fu0_t1_h8yd4tg", "creation": 1628974584, "origin": "t5_2tand_t3_p44fu0", "height": 1, "replied_to": "t5_2tand_t3_p44fu0", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "_sorrowheart", "text": "First things first, anger is a completely valid emotion and it is not wrong to feel it. If it was wrong, then this universe/god would of never created anger in the first place. It is okay to be angry, it is okay to feel rage (so long you don’t harm yourself or others). I know people in this thread will tell you to do things to avoid the feeling, but I am completely against this notion. I get it, people want to help, but if you are having intrusive thoughts than that means it should be dealt with now. \n\nNow I know you said you booked a therapist appointment for September (sucks when this happens, we are in pain right now!), so until then we will have to deal with this in other ways. I suggest you get someone who can talk to you, without telling/asking you to avoid your anger. If you can’t find someone, that’s okay. Anger can be scary to non-angry people, so if you have to do it alone, okay (I had to go thru my anger alone). \n\nFirst off, anger is one step above depression. It’s a rather empowering emotion, compared to sadness/depression, so be thankful for that at least (hard to understand, I’m sure). Anger in of itself is more like… confusion. Frustrated confusion. This is okay! Many people walking the planet feel this way. The world we live in is rather confusing, I’m sure we can all agree on that. \n\nUntil your therapist appointment, whenever you get an intrusive angry thought, please please please sit with it. Consider your anger like a child desperately trying to get your attention. Would you turn your back on a child in need? Why would you do that with yourself? Anyway, sit with your emotions. Don’t look at your phone/computer/tv, don’t go for a jog, don’t go clubbing with your buds, just don’t abandon yourself! Every time you turn away from a negative emotion you are turning away from yourself. \n\nOnce you are not distracted, and you are sitting with these thoughts, begin to dig deep. Ask yourself out loud or in your head, “what is my anger trying to tell me?” You’d be surprised once your start listening to your inner dialogue! Thought from your subconscious will begin to appear, and your subconscious wants/NEEDS healing. \n\nBegin to ask questions, “is this anger related to this certain person/event?” “Am I lonely?” “What do I really want in life?” Do you hear other people’s voices in your head? (I still hear my abuser to this day, but those thoughts only last a moment or two because I’ve developed self-love and now I can easily forget what he said/done to me.) Are those voices telling “you aren’t enough?” Or maybe a parent forbid you to live the life you want? Did your GF/BF cheat on you? Keep asking questions, keep digging deeper. \n\nAt this point, if you want to beat the shit out of a pillow, do it. Journal down your thoughts? Do it. Scream into a pillow, scream profanities (if your alone, of course). If you have the urge to cry, please do. Crying his a welcoming release, and it doesn’t last forever. All in all, you are in a great deal of pain, I can tell because your brain is desperately trying to get resolve for something. Btw, think of trauma like this: trauma is stress without resolution. Once you resolve the issue, you’d be one step closer to having a joyous life. \n\nInstead of running away from the storm, we have to stop, turn around and go through it. It won’t kill you, you will always survive. I hope this helped just a little bit.", "permalink": "/r/DecidingToBeBetter/comments/p44fu0/i_am_having_very_violent_angry_random_thoughts/h8yd4tg/"}