{"id": "t5_2tand_t3_p44fu0_t1_h8xoajc", "creation": 1628963363, "origin": "t5_2tand_t3_p44fu0", "height": 1, "replied_to": "t5_2tand_t3_p44fu0", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "unknown_poo", "text": "Your heart is not at peace. There is, perhaps a trauma that requires restitution. Until restitution is obtained, the mind will continue to try to piece something together in order to resolve a problem. The fact that there is compulsiveness to it, which is the basis of addiction, means that it has to do with pain. That is, the pain of shame. At bottom, is there something that happened that triggered that primordial sense of abandonment and rejection? Is there something that you are beating yourself up for?\n\n\nWhen you meditate, and you let your mind become silent, when the pain arises, what is it telling you? Are there thoughts that automatically arise? If you can allow the thoughts to arise without effort, without projection, they can lead you inwardly and show you what they are pointing at. Perhaps you haven't accomplished in life what you feel you must. Perhaps you are comparing yourself with others, and resent the outcomes of events. Very often, we may internalize a pattern of thought that revolves around fear, and later on in life, we may realize how we've been sabotaging ourselves our entire lives.\n\n\nBut, it is important to internalize the right beliefs about the nature of reality. These opens doors to deeper realizations, which in turn bring restitution to our shame. Humans emerged from nature, there are natural beliefs about existence. These beliefs have to do with the transcendent nature of consciousness, and of the very nature of reality itself of which the mind is inherently a manifestation of. The capacity of perspective is incredibly wide, perhaps even infinite. At our lowest, we can see what feels like from the perspective of something very lowly, the animal self, fixated on chaotic survival impulses. At our highest, it can feel as if we are the universe witnessing itself. It's important to not become entangled in the dynamics of the animal world, even though society is largely oriented around this way of being. \n\n\nAnother primordial belief is Divine Destiny. We understand that events occur by Divine Design, and for each person, there is a purpose. It is made manifest in the opportunity it presents to you, which is in the lesson that you can derive from it. Past disappointments that we cannot get passes are opportunities to arrive at a way of perceiving and understanding that, when restitution is brought to them, then we have gained a new skill, a new way of being and experiencing that replaces our old destructive patterns. \n\n\nWim Hof and other breathing meditations are important for connecting to the body in which is stored trauma. It allows, momentarily, for repressed traumas to be brought to the forefront of consciousness. I've been doing this for years, and every time I bring to the surface fundamental traumas, I can feel the painful sensations rise through my body. Every single time I confront it, which is represented in a destructive belief, with an oppositional belief, one that heightened consciousness can entertain long enough to contradict one's sense of reality, I throw up big time. It's like the body is rejecting and excreting trauma, which has taken a physically symbolic form. There is an interesting idea in that area of study that expressions like \"you make me sick to my stomach\", which is reserved for the worst of impactful emotional experiences, is based on the connection between the physical body and psychological pain and trauma. So there is this holistic approach towards healing, from spirt to mind to body. \n\n\nI understand how you feel, to some degree of course. For a while, my mind would fixate on anger as well. I could see it taking over, how the automatic process of thought would engage in anger. Another meditation and practice that helped me was cultivating the capacity to forgive. The heart holds on and lets go based on desire. If you can convince it that it is better to forgive and to let go than it is to hold on to the resentment, then it will let go. But it takes continual cultivation and practice. For me, I understand that forgiveness is the gate to the Divine Presence, and at the end of the day you must present to the heart, do you prefer to pass through it or to remain in hell?", "permalink": "/r/DecidingToBeBetter/comments/p44fu0/i_am_having_very_violent_angry_random_thoughts/h8xoajc/"}