{"id": "t5_2tand_t3_pel0im_t1_hbai2z2", "creation": 1630569825, "origin": "t5_2tand_t3_pel0im", "height": 1, "replied_to": "t5_2tand_t3_pel0im", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "minetruly", "text": "Lifelong nailbiter here, though I never did it so much that I bit off the quick after the white part was gone. I didn't know that was possible, Jesus.\n\nNow that your nails extend past the nailbed, you can try the technique that worked for me for a few months. \n\nGet a nail file and one of those four-sided Emery board blocks. Actually, get a few, so you can keep a set wherever you go. When you're feeling anxious, instead of biting, file and polish your nails. The smoothing and high shine portions of the emery block will make the edge of your nails smooth and slick, so they'll have less accidental breakage and rough edges for you to catch your teeth on. I was able to quit biting this way for a few months, but then I backslid. I don't know how to get it to stick, but obv it worked better for me than nothing. If you're a guy and someone teases you for filing your nails, show them how shiny your middle finger looks.\n\nIf this is your first time with normal length nails, you should learn about nail care. They'll probably begin to break on their own from everyday use, especially if you're not used to protecting them and they're partly detached from the nailbed. You can combat this by keeping your nails filed short and smooth. The smoother the edges are, the less likely they'll catch on things or break away into rough flakes. I'd also suggest putting Hard as Hooves on them daily. This will strengthen them and can give you that extra protection you need while you act rough on them untying shoelaces and such. It's made for hardening horse hooves, but it's also the best product on the market for strengthening human nails. You can find it at most stores that sell beauty products or horse supplies.", "permalink": "/r/DecidingToBeBetter/comments/pel0im/one_month_with_no_fingernail_biting/hbai2z2/"}